перем эл1, эл2;

Процедура ПриОткрытии()
	Настройки = КомпоновщикНастроек.Настройки;
    ЭД1 = Настройки.ПараметрыДанных.Элементы.Найти(эл1);
    ДатаНач = ЭД1.Значение.Дата;
    ЭД2 = Настройки.ПараметрыДанных.Элементы.Найти(эл2);
    ДатаКон = ЭД2.Значение.Дата-1;
	
	СписокИсключений = новый СписокЗначений; //+++ 07.03.2019
	СписокИсключений.Добавить(справочники.Контрагенты.НайтиПоКоду("93980") );   //Формула 2015
	СписокИсключений.Добавить(справочники.Контрагенты.НайтиПоКоду("П017979") ); //Скрипченко К.В.
	для каждого эл1 из Настройки.Отбор.Элементы цикл
		Если строка(эл1.ЛевоеЗначение) = "Контрагент" тогда
			эл1.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
			эл1.ПравоеЗначение = СписокИсключений;
			эл1.Использование  = истина; // на всякий случай включаем!
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры


Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(ДатаНач, ?(ДатаКон='0001-01-01', ДатаКон, КонецДня(ДатаКон)));
	Если НастройкаПериода.Редактировать() Тогда
		ДатаНач = НастройкаПериода.ПолучитьДатуНачала();
		ДатаКон = НастройкаПериода.ПолучитьДатуОкончания();
	Настройки = КомпоновщикНастроек.Настройки;
    ЭД1 = Настройки.ПараметрыДанных.Элементы.Найти(эл1);
    ЭД1.Значение.Дата = ДатаНач;
    ЭД2 = Настройки.ПараметрыДанных.Элементы.Найти(эл2);
    ЭД2.Значение.Дата = КонецДня(ДатаКон)+1;
	КонецЕсли;
КонецПроцедуры

Процедура ДатаНачПриИзменении(Элемент)
	Настройки = КомпоновщикНастроек.Настройки;
    ЭД1 = Настройки.ПараметрыДанных.Элементы.Найти(эл1);
    ЭД1.Значение.Дата = ДатаНач;
КонецПроцедуры

Процедура ДатаКонПриИзменении(Элемент)
	Настройки = КомпоновщикНастроек.Настройки;
    ЭД2 = Настройки.ПараметрыДанных.Элементы.Найти(эл2);
    ЭД2.Значение.Дата = КонецДня(ДатаКон)+1;
КонецПроцедуры

Процедура ДатаНачРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ДатаНачПриИзменении(Элемент);
КонецПроцедуры


Процедура ДатаКонРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ДатаКонПриИзменении(Элемент);
КонецПроцедуры

эл1 = "ДатаНач";
эл2 = "ДатаКон";