Процедура ОтправитьЗаказы(ДатаН, ДатаК) экспорт
	//ДПД
	РаботаСDPD.ОбновитьСтатусыЗаказов(ДатаН,ДатаК);
	//
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗаказПокупателя.Ссылка
	             |ПОМЕСТИТЬ втЗаказы
	             |ИЗ
	             |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	             |ГДЕ
	             |	ЗаказПокупателя.ТранспортнаяКомпания = &ТранспортнаяКомпанияДПД
	             |	И ЗаказПокупателя.НомерЗаказаТК <> """"
	             |	И ЗаказПокупателя.Дата МЕЖДУ &ДатаН И &ДатаК
	             |	И ЗаказПокупателя.НомерВходящегоДокумента ПОДОБНО ""ИМ%""
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ЗаказПокупателяРеквизитыЗаказаТК.Ссылка КАК ЗаказСШК
	             |ПОМЕСТИТЬ втЗаказСШК
	             |ИЗ
	             |	Документ.ЗаказПокупателя.РеквизитыЗаказаТК КАК ЗаказПокупателяРеквизитыЗаказаТК
	             |ГДЕ
	             |	ЗаказПокупателяРеквизитыЗаказаТК.Поле = ""ШК""
	             |	И ЗаказПокупателяРеквизитыЗаказаТК.Ссылка.ТранспортнаяКомпания = &ТранспортнаяКомпанияДПД
	             |	И ЗаказПокупателяРеквизитыЗаказаТК.Ссылка.НомерЗаказаТК <> """"
	             |	И ЗаказПокупателяРеквизитыЗаказаТК.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК
	             |	И ЗаказПокупателяРеквизитыЗаказаТК.Ссылка.НомерВходящегоДокумента ПОДОБНО ""ИМ%""
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	Заказы.ЗаказПокупателя КАК ЗаказПокупателя
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		втЗаказы.Ссылка КАК ЗаказПокупателя
	             |	ИЗ
	             |		втЗаказы КАК втЗаказы
	             |	ГДЕ
	             |		НЕ втЗаказы.Ссылка В
	             |					(ВЫБРАТЬ
	             |						втЗаказСШК.ЗаказСШК
	             |					ИЗ
	             |						втЗаказСШК)
	             |	
	             |	ОБЪЕДИНИТЬ
	             |	
	             |	ВЫБРАТЬ
	             |		ЗаказПокупателя.Ссылка
	             |	ИЗ
	             |		Документ.ЗаказПокупателя КАК ЗаказПокупателя
	             |	ГДЕ
	             |		ЗаказПокупателя.Проведен
	             |		И ЗаказПокупателя.ИМСклиентомСогласовано
	             |		И ЗаказПокупателя.НомерЗаказаТК = """"
	             |		И ЗаказПокупателя.ТранспортнаяКомпания = &ТранспортнаяКомпанияДПД
	             |		И (ЗаказПокупателя.СтатусПеревозчика = """"
	             |				ИЛИ ЗаказПокупателя.СтатусПеревозчика = ""OrderError"")
	             |		И ЗаказПокупателя.Дата МЕЖДУ &ДатаН И &ДатаК) КАК Заказы
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ЗаказПокупателя
	             |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ДатаН",ДатаН);
	Запрос.УстановитьПараметр("ДатаК",ДатаК);
	Запрос.УстановитьПараметр("ТранспортнаяКомпанияДПД",Справочники.Контрагенты.НайтиПоКоду("94121")); //Армадилло Бизнес Посылка
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		#Если клиент тогда
			Сообщить("Отправка "+Рез.ЗаказПокупателя);
		#КонецЕсли
		РаботаСDPD.ОформитьЗаявкуВDPD(Рез.ЗаказПокупателя);
	КонецЦикла;
	
	//Подорожник
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗаказПокупателя.Ссылка КАК ЗаказПокупателя
	             |ИЗ
	             |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	             |ГДЕ
	             |	ЗаказПокупателя.Проведен
	             |	И ЗаказПокупателя.ИМСклиентомСогласовано
	             |	И ЗаказПокупателя.НомерЗаказаТК = """"
	             |	И ЗаказПокупателя.ТранспортнаяКомпания = &ТранспортнаяКомпанияПодорожник
	             |	И ЗаказПокупателя.Дата МЕЖДУ &ДатаН И &ДатаК
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ЗаказПокупателя.Ссылка
	             |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ДатаН",ДатаН);
	Запрос.УстановитьПараметр("ДатаК",ДатаК);
	Запрос.УстановитьПараметр("ТранспортнаяКомпанияПодорожник",Справочники.Контрагенты.НайтиПоКоду("94346")); //Подорожник Транспортное Агентство
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		#Если клиент тогда
			Сообщить("Отправка "+Рез.ЗаказПокупателя);
		#КонецЕсли
		РаботаСDPD.ОформитьЗаявкуВПодорожник(Рез.ЗаказПокупателя);
	КонецЦикла;
	//Питстоп
	
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗаказПокупателя.Ссылка КАК ЗаказПокупателя
	             |ИЗ
	             |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	             |ГДЕ
	             |	ЗаказПокупателя.Проведен
	             |	И ЗаказПокупателя.ИМСклиентомСогласовано
	             |	И ЗаказПокупателя.НомерЗаказаТК = """"
	             |	И ЗаказПокупателя.ТранспортнаяКомпания = &ТранспортнаяКомпанияПитстоп
	             |	И ЗаказПокупателя.Дата МЕЖДУ &ДатаН И &ДатаК
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ЗаказПокупателя.Ссылка
	             |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ДатаН",ДатаН);
	Запрос.УстановитьПараметр("ДатаК",ДатаК);
	Запрос.УстановитьПараметр("ТранспортнаяКомпанияПитстоп",Справочники.Контрагенты.НайтиПоКоду("П019371")); //ПИТСТОП.
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		#Если клиент тогда
			Сообщить("Отправка "+Рез.ЗаказПокупателя);
		#КонецЕсли
		РаботаСDPD.СогласоватьЗаказСПИТСТОП(Рез.ЗаказПокупателя);
	КонецЦикла;
	
КонецПроцедуры
