//26.04.2017
процедура ОбрезатьНомер(тел2) экспорт
	тел2 = стрЗаменить(тел2,"-","");
	тел2 = стрЗаменить(тел2,"(","");
	тел2 = стрЗаменить(тел2,")","");
	тел2 = стрЗаменить(тел2," ","");
	тел2 = прав(тел2, 6); // 6 последних цифр!
КонецПроцедуры



//20.04.2017
функция получитьВнутреннийТелефон281(Объект1, КодВида="38840") экспорт
	пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &Вид";
	Запрос.УстановитьПараметр("Объект", Объект1 );
	Запрос.УстановитьПараметр("Тип", перечисления.ТипыКонтактнойИнформации.Телефон );
	Запрос.УстановитьПараметр("Вид", справочники.ВидыКонтактнойИнформации.НайтиПоКоду(КодВида) ); // Внутренний телефон
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() тогда
		рез = СокрЛП(выборка.Представление);
	иначе рез = "";
	КонецЕсли;

	возврат рез;
КонецФункции	


