
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
список = Новый списокЗначений;
Если литые тогда
Список.Добавить(Справочники.НоменклатурныеГруппы.НайтиПоКоду("00026"));//литые
конецЕсли;

Если штампованные тогда
Список.Добавить(Справочники.НоменклатурныеГруппы.НайтиПоКоду("00049"));//штампованные
конецЕсли;

ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокГрупп"));
ПараметрСКД.Использование = Истина;
ПараметрСКД.Значение  =список;

ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
ПараметрСКД.Использование = истина ;
ПараметрСКД.Значение  = начПериода;

ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
ПараметрСКД.Использование = истина ;
ПараметрСКД.Значение  = КонецДня(КонПериода);

ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Нач"));
ПараметрСКД.Использование = истина ;
ПараметрСКД.Значение  = ДобавитьМесяц(начПериода,-12);

ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Кон"));
ПараметрСКД.Использование = истина ;
ПараметрСКД.Значение  = ДобавитьМесяц(КонецДня(КонПериода),-12);



КонецПроцедуры
