Функция  ОткрытьКарточку(парОбъектДД, парОрганизация,  парКонтрагент, парДоговор, парПодразделениеКонтрагента, парDepartmentID)  Экспорт 
	НаименованиеСправочникаДоговоров = ПолучитьПрофильКонфигурации().НаименованиеСправочникаДоговоров;
	ОбъектДД = парОбъектДД;
    Контрагент = парКонтрагент;
	Организация = парОрганизация;
	Договор = ?(ЗначениеЗаполнено(парДоговор), парДоговор, Справочники[НаименованиеСправочникаДоговоров].ПустаяСсылка());
	ПодразделениеКонтрагента =парПодразделениеКонтрагента;	
	DepartmentID = парDepartmentID;
	Возврат ОткрытьМодально();
КонецФункции
	
	
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(контрагент) = Ложь Тогда
		предупреждение("Не указан контрагент!",,НаименованиеСистемы);
	Иначе 
		Закрыть(Новый Структура("Контрагент, Договор, ПодразделениеКонтрагента, DepartmentID",Контрагент, Договор, ПодразделениеКонтрагента, DepartmentID))
	КонецЕсли;	
КонецПроцедуры

Процедура КонтрагентНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбКонтрагент = ПолучитьФорму("ФормаВыбораКонтрагента").ВыбратьКонтрагента(ОбъектДД.Organization, ОбъектДД.INN);
	Если ЗначениеЗаполнено(выбКонтрагент) Тогда 
		контрагент = выбКонтрагент
	КонецЕсли;	
КонецПроцедуры

Процедура ПодразделениеКонтрагентаНачалоВыбора(Элемент, СтандартнаяОбработка)
	 Отказ = Истина;
	
	 стОрганизация = ПолучитьФорму("ФормаВыбораОрганизацииПодразделения").ВыбратьПодразделениеКонтрагентаДиадок(ОбъектДД.Organization.id,ОбъектДД.id ,  DepartmentID);
	 Если стОрганизация <>Неопределено Тогда
		 ПодразделениеКонтрагента = стОрганизация.ПредставлениеПодразделения;
		 DepartmentID =  стОрганизация.DepartmentID;
 	 КонецЕсли;	
КонецПроцедуры

Процедура ПодразделениеКонтрагентаОчистка(Элемент, СтандартнаяОбработка)
	ПодразделениеКонтрагента = "";
	DepartmentID = "";
КонецПроцедуры

Процедура ДоговорОчистка(Элемент, СтандартнаяОбработка)
     СтандартнаяОбработка = Ложь;
	 НаименованиеСправочникаДоговоров = ПолучитьПрофильКонфигурации().НаименованиеСправочникаДоговоров;

	 Договор = справочники[НаименованиеСправочникаДоговоров].ПустаяСсылка();
КонецПроцедуры


Процедура ДоговорНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	НаименованиеСправочникаДоговоров = ПолучитьПрофильКонфигурации().НаименованиеСправочникаДоговоров;
  	ФормаВыбора = справочники[НаименованиеСправочникаДоговоров].ПолучитьФормуВыбора();
	ФормаВыбора.СправочникСписок.отбор.Владелец.установить(Контрагент);
	ФормаВыбора.СправочникСписок.отбор.Организация.установить(Организация);
	
	НастройкиОтбора = ?(ФормаВыбора.Элементыформы.найти("СправочникСписок")<>Неопределено, ФормаВыбора.Элементыформы.СправочникСписок.НастройкаОтбора, ФормаВыбора.Элементыформы.Список.НастройкаОтбора);
	НастройкиОтбора.Владелец.Доступность = Ложь;
	НастройкиОтбора.Организация.Доступность = Ложь;
	
	результат = ФормаВыбора.открытьМодально();
	
	Если результат <> Неопределено Тогда 
		Договор = результат;
	КонецЕсли;	
КонецПроцедуры

Процедура ПриОткрытии()
	
	КартинкаЗаголовка= ЭДО_БиблиотекаКартинок().КартинкаЗаголовка;
	
КонецПроцедуры

Процедура НастройкаДоступностьПодразделения()
	
	DepartmentID = "";
	ЭлементыФормы.ПодразделениеКонтрагента.Доступность = истина;
	
КонецПроцедуры
