
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Для каждого стр из КрышкиС0Ценой цикл
		Цена=КрышкиБезЦены.Найти(стр.Крышка,"Крышка");
		стр.Цена=Цена.цена;
	КонецЦикла;
	ОбновитьДопРасходы(КрышкиС0Ценой);
	//Попробуем обновить Заказ по крышкам
	Попытка
		ЗаказОб=ЗаказПоКрышкам.ПолучитьОбъект();
		Товары=ЗаказОб.Товары;
		Для каждого стр из КрышкиБезЦены цикл
			Если стр.Цена>0 тогда
				нстр=	Товары.Добавить();
				нстр.Номенклатура=стр.Крышка;
				нстр.Количество=1;
				нстр.Цена=стр.Цена;
				нстр.ЕдиницаИзмерения=стр.Крышка.ЕдиницаХраненияОстатков;
				
				ПриИзмененииНоменклатурыТабЧасти(нстр, ЗаказОб);
				ЗаполнитьСтавкуНДСТабЧасти(нстр, ЗаказОб);
				РассчитатьСуммуТабЧасти(нстр, ЗаказОб);
				РассчитатьСуммуНДСТабЧасти(нстр, ЗаказОб);
			КонецЕсли;
		КонецЦикла;
		ЗаказОб.Записать(РежимЗаписиДокумента.Проведение);
		//ЗаказОб.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Сообщить("Обновление заказа поставщику по крышкам: "+ОписаниеОшибки());
	КонецПопытки;
	Закрыть();
КонецПроцедуры

Процедура ПриОткрытии()
	тз2=КрышкиС0Ценой.Скопировать();
	тз2.Свернуть("Крышка","Цена");
	КрышкиБезЦены=тз2;
	ЭлементыФормы.КрышкиБезЦены.СоздатьКолонки();

КонецПроцедуры

Процедура ОбновитьДопРасходы(КрышкиС0Ценой)
  Коэфф=1.1;//крышки заказываем с 10% запасом, стоимость диска увеличиваем на стоимость крышки +10%
  Запрос= Новый Запрос;
  Запрос.Текст="ВЫБРАТЬ
               |	Доки.ПоступлениеДопРасходов,
               |	Доки.Диск,
               |	Доки.Цена
               |ПОМЕСТИТЬ втДоки
               |ИЗ
               |	&Доки КАК Доки
               |;
               |
               |////////////////////////////////////////////////////////////////////////////////
               |ВЫБРАТЬ
               |	втДоки.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов,
               |	втДоки.Диск,
               |	втДоки.Цена
               |ИЗ
               |	втДоки КАК втДоки
               |ИТОГИ ПО
               |	ПоступлениеДопРасходов";
			   Запрос.УстановитьПараметр("Доки",КрышкиС0Ценой);
			   РезДок=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			   Пока  РезДок.Следующий() Цикл
				   ДокОб=РезДок.ПоступлениеДопРасходов.ПолучитьОбъект();
				   Товары=ДокОб.Товары;
				   Детали=РезДок.Выбрать();
				   Пока Детали.Следующий() Цикл
					   Если Детали.Цена>0 тогда
						   стрНом=Товары.НайтиСтроки(Новый Структура("Номенклатура",Детали.Диск));
						   Для каждого элемент из стрНом цикл
							   элемент.Сумма=элемент.Количество*Детали.Цена*Коэфф;
						   КонецЦикла;
					   КонецЕсли;
				   КонецЦикла;
				   ДокОб.Записать();
			   КонецЦикла;
КонецПроцедуры
