Функция Печать() Экспорт
	
	Если Не Метаданные.Имя = "УправлениеТорговлей" Тогда
	КонецЕсли;
	
	//Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.Спецификация") Тогда
	//	Возврат ПечатьДокумента(СсылкаНаОбъект);
	//КонецЕсли;
	
	//ОЛ 04.03.2015 вместо заремленного выше, т.к. для экспорта нужна другая форма спецификации
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.Спецификация") Тогда
		Если СсылкаНаОбъект.ДокументОснование.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.ШинтрейдЯрославль Тогда
			ОбработкаПечатиЭкспорт = Справочники.ДополнительныеПечатныеФормы.НайтиПоНаименованию("Экспорт Печать спецификации");
			Если ОбработкаПечатиЭкспорт.Пустая() Тогда
				сообщить("Не найдена внешняя печатная форма Экспорт Печать спецификации");
				возврат Неопределено;
			Иначе
				ИмяФайла = КаталогВременныхФайлов()+"PrnFormExport.tmp";
				ОбъектВнешнейФормы = ОбработкаПечатиЭкспорт.ПолучитьОбъект();
				ДвоичныеДанные = ОбъектВнешнейФормы.ХранилищеВнешнейОбработки.Получить();
				ДвоичныеДанные.Записать(ИмяФайла);
				ОбработкаЭкспорт = ВнешниеОбработки.Создать(ИмяФайла);
				ОбработкаЭкспорт.СсылкаНаОбъект = СсылкаНаОбъект;
				ОбработкаЭкспорт.Русскоязычный  = Истина;
				возврат ОбработкаЭкспорт.Печать();
			КонецЕсли;	
		Иначе	
			Возврат ПечатьДокумента(СсылкаНаОбъект);
		КонецЕсли;
	КонецЕсли;
	//конец ОЛ
	
КонецФункции // Печать

Функция ПечатьДокумента(СсылкаНаОбъект)
		//ТабДокумент = Новый ТабличныйДокумент;
		
	Запрос = Новый Запрос; // находим счет-фактуру для документа реализации
	
	Запрос.Текст="ВЫБРАТЬ
	 |	Номер ИЗ
	 |	Документ.СчетФактураВыданный
	 |ГДЕ ДокументОснование = &ДокументОснование И Проведен" ;
	 
	 Запрос.УстановитьПараметр("ДокументОснование",СсылкаНаОбъект.ДокументОснование);
	 Выборка=Запрос.Выполнить().Выбрать();
	 Если Выборка.Следующий() Тогда
		 НомерСчетаФактуры=Выборка.Номер;
	 Иначе
		 НомерСчетаФактуры="";
	 КонецЕсли;	 
	 
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ДатаДокумента", СсылкаНаОбъект.ДокументОснование.Дата);
	Запрос.УстановитьПараметр("ВидОтветственногоЛица", Перечисления.ОтветственныеЛицаОрганизации.Руководитель);
	Запрос.УстановитьПараметр("РольКонтактногоЛица2", Справочники.РолиКонтактныхЛиц.Директор);
	Запрос.УстановитьПараметр("ПустаяРольКонтактногоЛица", Справочники.РолиКонтактныхЛиц.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяДолжность", Справочники.ДолжностиОрганизаций.ПустаяСсылка());
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документ.ДоговорКонтрагента.Дата ДатаДоговора,
	|	Документ.ДоговорКонтрагента.Номер НомерДоговора,
	|	Документ.СпособОтгрузки,
	|	Документ.НомерДляПечати КАК НомерСпецификации,
	|	Документ.Пени,
	|	Документ.ДокументОснование.Дата КАК ДатаПоставки,
	|	Документ.Номер КАК Номер,
	|	Документ.Организация.НаименованиеПолное КАК Компания,
	|	Документ.Контрагент.НаименованиеПолное КАК Контрагент,
	|	Документ.СпособОплаты КАК СпособОплаты,
	|	ВЫБОР
	|		КОГДА Документ.ДокументОснование.Сделка ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА Документ.ДокументОснование.Сделка.ДатаОплаты
	|		ИНАЧЕ Документ.ДокументОснование.Дата
	|	КОНЕЦ КАК ДатаОплаты,
	|   ВЫБОР КОГДА ОтветственныеЛицаОрганизацииСрезПоследних.Должность <> &ПустаяДолжность ТОГДА
	|		ОтветственныеЛицаОрганизацииСрезПоследних.Должность
	|   ИНАЧЕ ВЫБОР КОГДА ЕСТЬNULL(ОтветственныеЛицаОрганизацииСрезПоследних.ОтветственноеЛицо, """") = """" ТОГДА
	|		    	""Руководитель""
	|		  ИНАЧЕ
	|				ОтветственныеЛицаОрганизацииСрезПоследних.ОтветственноеЛицо
	|		  КОНЕЦ
	|	КОНЕЦ КАК РольРуководителяКомпании,
	|	ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо КАК РуководительКомпании,
	|	ЕСТЬNULL(КонтактныеЛица.Роль,"""") КАК РольРуководителяКонтрагента,
	|	ВЫБОР
	|		КОГДА КонтактныеЛица.Ссылка ССЫЛКА Справочник.КонтактныеЛица
	|			  И КонтактныеЛица.Роль = &РольКонтактногоЛица2
	|			  И КонтактныеЛица.Роль <> &ПустаяРольКонтактногоЛица
	|			ТОГДА КонтактныеЛица.Представление
	|		ИНАЧЕ ""/_______________/""
	|	КОНЕЦ КАК РуководительКонтрагента
	|ИЗ
	|	Документ.Спецификация КАК Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(&ДатаДокумента, ОтветственноеЛицо = &ВидОтветственногоЛица) КАК ОтветственныеЛицаОрганизацииСрезПоследних
	|		ПО Документ.Организация = ОтветственныеЛицаОрганизацииСрезПоследних.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица КАК КонтактныеЛица
	|		ПО Документ.Контрагент = КонтактныеЛица.ОбъектВладелец
	|			И КонтактныеЛица.Роль = &РольКонтактногоЛица2
	|ГДЕ
	|	Документ.Ссылка = &ТекущийДокумент";
		
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	
	ТабДокумент  = Новый ТабличныйДокумент;
	
	//ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Спецификация_Новая"; //+++ 04.06.2014

	Макет = ПолучитьМакет("Спецификация");	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект.ДокументОснование);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Документ.Номенклатура.Код КАК Код,
	               |	Документ.Номенклатура,
	               |	Документ.ЕдиницаИзмерения,
	               |	СУММА(Документ.Количество) КАК Количество,
	               |	Документ.Цена,
	               |	СУММА(Документ.Сумма) КАК Сумма,
	               |	СУММА(Документ.СуммаНДС) КАК СуммаНДС,
	               |	Документ.СтавкаНДС КАК СтавкаНДС,
				   //20.06.2016 измененние для Радуга-Питер
	               |	Документ.ХарактеристикаНоменклатуры КАК Характеристика,
	               |	Документ.СерияНоменклатуры КАК Серия
				   //20.06.2016
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК Документ
	               |ГДЕ
	               |	Документ.Ссылка = &ТекущийДокумент
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Документ.Номенклатура,
	               |	Документ.ЕдиницаИзмерения,
	               |	Документ.Цена,
	               |	Документ.Номенклатура.Код,
	               |	Документ.СтавкаНДС,
	               |	Документ.ХарактеристикаНоменклатуры,
	               |	Документ.СерияНоменклатуры
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПОДСТРОКА(Документ.Номенклатура.НаименованиеПолное, 1, 50)
	               |ИТОГИ
	               |	СУММА(Количество),
	               |	СУММА(Сумма),
	               |	СУММА(СуммаНДС)
	               |ПО
	               |	ОБЩИЕ";
	
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьШапка.Параметры.Заполнить(Шапка);
	ОбШтрихКод=ОбластьШапка.Рисунки.Штрихкод.Объект;
	ОбШтрихКод.ТипКода = 4; 
	ОбШтрихКод.Сообщение = СформироватьШКРеализации(СсылкаНаОбъект.ДокументОснование,"3");//XMLСтрока(ЭтотОбъект.Ссылка.УникальныйИдентификатор()); 
	ОбШтрихКод.ОтображатьТекст = Ложь;

	
	ОбластьШапка.Параметры.ШапкаДата  	 = Формат(Шапка.ДатаПоставки, "ДФ=""дд ММММ гггг 'г.'""");
	//ОбластьШапка.Параметры.ДатаДоговора  = Формат(Шапка.ДатаДоговора, "ДФ=""дд ММММ гггг 'г.'""");
	ОбластьШапка.Параметры.Договор = "к договору поставки № " + Шапка.НомерДоговора + " от " + Формат(Шапка.ДатаДоговора, "ДФ=""дд ММММ гггг 'г.'""");
	ОбластьШапка.Параметры.Пункт1 = "1. В соответствии с настоящей спецификацией и во исполнение договора поставки № " + Шапка.НомерДоговора + " от " + Формат(Шапка.ДатаДоговора, "ДФ=""дд ММММ гггг 'г.'""") + ", ";
	Если НЕ СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.ФормулаАвтоПлюс Тогда
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	Иначе
		ОбластьПодвал = Макет.ПолучитьОбласть("ПдвлФАП");
	КонецЕсли;
	ОбластьПодвал.Параметры.Заполнить(Шапка);
	ОбластьПодвал.Параметры.СпособОплаты=?(Шапка.СпособОплаты = Перечисления.ВидыДенежныхСредств.Наличные,"наличный в кассу Поставщика.","безналичный.");
	
	//+++ 17.02.2014 грузоотправитель и грузополучатель
	Грузоотправитель = ?(ЗначениеЗаполнено(СсылкаНаОбъект.ДокументОснование.Грузоотправитель), СсылкаНаОбъект.ДокументОснование.Грузоотправитель, СсылкаНаОбъект.ДокументОснование.Организация);
	Грузополучатель  = ?(ЗначениеЗаполнено(СсылкаНаОбъект.ДокументОснование.Грузополучатель), СсылкаНаОбъект.ДокументОснование.Грузополучатель,   СсылкаНаОбъект.ДокументОснование.Контрагент);
	Если СсылкаНаОбъект.ДокументОснование.Контрагент <> СсылкаНаОбъект.Контрагент тогда // когда задним числом меняют...
		Сообщить("В документе: "+строка(СсылкаНаОбъект)+" Контрагент не совпадает с Контрагентом из Реализации!", СтатусСообщения.Внимание);
	КонецЕсли;	
	СведенияОбОрганизации   = СведенияОЮрФизЛице(Грузоотправитель,      Шапка.ДатаПоставки);	
	СведенияОПокупателе     = СведенияОЮрФизЛице(Грузополучатель,       Шапка.ДатаПоставки);
	
	ФактАдресГО = ОписаниеОрганизации(СведенияОбОрганизации, "ФактическийАдрес,");
	ФактАдресГО = ?(СокрЛП(ФактАдресГО)="", ОписаниеОрганизации(СведенияОбОрганизации, "ЮридическийАдрес,"), СокрЛП(ФактАдресГО));
	
	//+++( 30.06.2018 - по срочной Задаче № 50125 - новый и старый адреса Москвы
	Если СсылкаНаОбъект.Подразделение = Справочники.Подразделения.НайтиПоКоду("00133") тогда
	
		адрМоскваСтарый = "Обособленное подразделение ЗАО ТК ""Яршинторг"" г. Москва, Дмитровское шоссе, дом № 100, строение 2";
		адрМоскваНовый  = "Обособленное подразделение ЗАО ТК ""Яршинторг"" г. Москва, Южнопортовая ул, дом № 7, корпус 1, офис 338"; 
		
		Если СсылкаНаОбъект.ДокументОснование.Дата < '20180629' тогда //старый адрес в "Адрес доставки 02"
			ФактАдресГО = адрМоскваСтарый;
		Иначе	//обычный факт адрес 
    		ФактАдресГО = адрМоскваНовый;
		КонецЕсли;
		
     КонецЕсли;
	 //+++)
	 
	ФактАдресГП = ОписаниеОрганизации(СведенияОПокупателе, "ФактическийАдрес,");
	ФактАдресГП = ?(СокрЛП(ФактАдресГП)="", ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес,"), СокрЛП(ФактАдресГП));
	
	ОбластьПодвал.Параметры.РеквизитыОрганизации = строка(Грузоотправитель.НаименованиеПолное)+" "+ФактАдресГО; //+++
	ОбластьПодвал.Параметры.РеквизитыПокупателя= строка(Грузополучатель.НаименованиеПолное)+" "+ФактАдресГП;      //+++
	
	 АдресДоставки = ССылкаНаОбъект.ДокументОснование.Сделка.АдресДляТТН;
	 Если Адресдоставки = "" Тогда
		 АдресДоставки = ФактАдресГП;
	конецЕсли;	 
	
	ОбластьПодвал.Параметры.АдресДоставки = АдресДоставки;
	//+++)
	
	//ОбластьПодвал.Параметры.Пени = ?(Пени = 0, ", согласно Договору, ", " в размере " + Строка(Пени) + "% в день");
	РукПр = ?(ЗначениеНеЗаполнено(Шапка.РуководительКомпании), "", СокрЛП(Шапка.РуководительКомпании.Наименование));
	Массив = Новый Массив;
	Инд = 0;
	Массив.Добавить();
	Массив[Инд] = "";
	Для Сч = 1 По СтрДлина(РукПр) Цикл
	
		Если Сред(РукПр, Сч, 1) = " " Тогда
		
			Инд = Инд + 1;
			Массив.Добавить();
			Массив[Инд] = "";
			
		Иначе
			
			Массив[Инд] = Массив[Инд] + Сред(РукПр, Сч, 1);
		
		КонецЕсли; 
	
	КонецЦикла; 
		
	ПредставлениеРуководителя = Массив[0];
	
	Если Массив.Количество() = 2 Тогда
	
		ПредставлениеРуководителя = ПредставлениеРуководителя + " " + Сред(Массив[1],1,1) + "."; 
		
	ИначеЕсли Массив.Количество() >= 3 Тогда
		
		ПредставлениеРуководителя = ПредставлениеРуководителя + " " + Сред(Массив[1],1,1) + "." + Сред(Массив[2],1,1) + ".";
	
	КонецЕсли; 
	
	ОбластьПодвал.Параметры.ДатаПоставки=Формат(Шапка.ДатаПоставки, "ДФ=""дд ММММ гггг 'г.'""");
	ОбластьПодвал.Параметры.РуководительКомпании = "Малышев И.И.";//ПредставлениеРуководителя;

	Если НЕ СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.ФормулаАвтоПлюс Тогда
		ОбластьПодвал.Параметры.РольРуководителяКомпании="Генеральный директор";
	Иначе
		ОбластьПодвал.Параметры.РольРуководителяКомпании="";
	КонецЕсли;
	ОбластьПодвал.Параметры.ДатаОплаты = Формат(Шапка.ДатаОплаты, "ДФ=dd.MM.yyyy"); 
	ОбластьИтоги = Макет.ПолучитьОбласть("СтрокаИтоги");
	ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаТаблицы");
	
	
	Если ТипЗнч(ССылкаНаОбъект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
				ОбластьШапка.Параметры.НомерСпецификации = ССылкаНаОбъект.ДокументОснование.Номер;
    конецЕсли;
	
	
	//2013.11.14
	Если СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.НайтиПоКоду("Я0004") Тогда //ФормулаАвто
		Если СсылкаНаОбъект.ДокументОснование.НомерФормулаАвто = 0 Тогда
			НомерДокумента = ЭтотОбъект.ПолучитьФорму("ВводНомераФормулаАвто").ОткрытьМодально();
		Иначе
			НомерДокумента = СсылкаНаОбъект.ДокументОснование.НомерФормулаАвто;
			сообщить("Отгрузка по организации Формула Авто, номер документа берется из реквизита документа ""Номер ФормулаАвто"" в закладке ""Дополнительно""");
		КонецЕсли;
		ОбластьШапка.Параметры.НомерСпецификации = НомерДокумента;
		ОбластьШапка.Параметры.Договор = "к договору поставки (с покупателем),";
		ОбластьШапка.Параметры.Пункт1 = "1. В соответствии с настоящей спецификацией и во исполнение договора поставки, ";
		ОбластьШапка.Параметры.Компания = "ООО ""Формула Авто""";
		ОбластьПодвал.Параметры.РеквизитыОрганизации = "ООО ""Формула Авто"", ИНН 7602088238,150014, Ярославская обл, Ярославль г,  Салтыкова-Щедрина ул, дом №21, офис 414";
		ОбластьПодвал.Параметры.Компания = "ООО ""Формула Авто""";
		ОбластьПодвал.Параметры.РуководительКомпании = "Зайцева Н.С.";
	ИначеЕсли СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.ФормулаАвтоПлюс Тогда //ФормулаАвто
		Если СсылкаНаОбъект.ДокументОснование.НомерФормулаАвто = 0 Тогда
			НомерДокумента = ЭтотОбъект.ПолучитьФорму("ВводНомераФормулаАвтоПлюс").ОткрытьМодально();
		Иначе
			НомерДокумента = СсылкаНаОбъект.ДокументОснование.НомерФормулаАвто;
			сообщить("Отгрузка по организации Формула Авто Плюс, номер документа берется из реквизита документа ""Номер Формула Авто Плюс"" в закладке ""Дополнительно""");
		КонецЕсли;
		ОбластьШапка.Параметры.НомерСпецификации = НомерДокумента;
		ОбластьШапка.Параметры.Договор = "к договору поставки (с покупателем),";
		ОбластьШапка.Параметры.Пункт1 = "1. В соответствии с настоящей спецификацией и во исполнение договора поставки, ";
		ОбластьШапка.Параметры.Компания = "ООО ""Формула Авто Плюс""";
		ОбластьПодвал.Параметры.РеквизитыОрганизации =  "ООО ""Формула Авто Плюс"", ИНН 7602088206, 150003, Ярославская обл, Ярославль г,  Полушкина Роща ул, дом №9";
		ОбластьПодвал.Параметры.Компания = "ООО ""Формула Авто Плюс""";
		//ОбластьПодвал.Параметры.РуководительКомпании = "Курапова Е.А.";
		ОбластьПодвал.Параметры.РуководительКомпании = СсылкаНаОбъект.ДокументОснование.Ответственный;
	
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьШапка);
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ОбщийИтог = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ОбщийИтог.Следующий() Тогда
	
		ОбластьИтоги.Параметры.Заполнить(ОбщийИтог);		
	
	КонецЕсли; 
	
	ТабЧасть = ОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НомерПП=0;
	Пока ТабЧасть.Следующий() Цикл
		НомерПП=НомерПП+1;
		ОбластьСтроки.Параметры.Заполнить(ТабЧасть);
		ОбластьСтроки.Параметры.Номенклатура = ТабЧасть.Номенклатура.НаименованиеПолное;
		//++Смирнов для Лагерной и Радуга Питер убираем LegeArtis
		//Если Грузополучатель.Код="93136  " или  Грузополучатель.Код="91777  " тогда
		Если Грузополучатель.Код="93136  " тогда
			ОбластьСтроки.Параметры.Номенклатура = СтрЗаменить(ТабЧасть.Номенклатура.НаименованиеПолное,"LegeArtis","");
			
			//20.06.2016 сделана замена наименования "LegeArtis" также как в ТОРГ-12 
		ИначеЕсли СокрЛП(Грузополучатель.Код) = "91777" Тогда // Радуга Питер
			//При печати LegeArtis нужно выводить аналог TopDriver
			Если ТабЧасть.Номенклатура.Производитель = Справочники.Производители.НайтиПоКоду("3333") Тогда //REPLICA TD
				ОбластьСтроки.Параметры.Номенклатура = СокрЛП(ТабЧасть.Номенклатура.НаименованиеПолное)
				+ ПредставлениеСерий(ТабЧасть)
				//?(ВыборкаСтрок.Метка = 2, " (возвратная тара)", "") 
				+ " (Top Driver)";
			ИначеЕсли ТабЧасть.Номенклатура.Производитель = Справочники.Производители.НайтиПоКоду("65") Тогда //REPLICA
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("ДискLA", ТабЧасть.Номенклатура);
				Запрос.Текст = "ВЫБРАТЬ
				|	СоответствиеLegeArtisTopDriver.ДискTD
				|ИЗ
				|	РегистрСведений.СоответствиеLegeArtisTopDriver КАК СоответствиеLegeArtisTopDriver
				|ГДЕ
				|	СоответствиеLegeArtisTopDriver.ДискLA = &ДискLA";
				ВыборкаTD = Запрос.Выполнить().Выбрать();
				Если ВыборкаTD.Следующий() Тогда
					ОбластьСтроки.Параметры.Номенклатура = СокрЛП(СтрЗаменить(ТабЧасть.Номенклатура.НаименованиеПолное,"LegeArtis",""))
					+ ПредставлениеСерий(ТабЧасть)
					//+ ?(ВыборкаСтрок.Метка = 2, " (возвратная тара)", "")
					+ " (ан. Top Driver " + ВыборкаTD.ДискTD.Код + ")";
					
				КонецЕсли;
			КонецЕсли;		
			//20.06.2016  		
		иначе
			ОбластьСтроки.Параметры.Номенклатура = ТабЧасть.Номенклатура.НаименованиеПолное;
		КонецЕсли;
		ОбластьСтроки.Параметры.НомерПП=НомерПП;
		ОбластьСтроки.Параметры.НомерСчетаФактуры=НомерСчетаФактуры;
		ТабДокумент.Вывести(ОбластьСтроки);
		
	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьИтоги);
	
	//+++
	СуммаКПрописи = ОбластьИтоги.Параметры.Сумма; // + ОбластьИтоги.СуммаНДС;
	СуммаНДС      = ОбластьИтоги.Параметры.СуммаНДС;
	ОбластьПодвал.Параметры.СуммаПрописью ="Всего наименований " + ТабЧасть.Количество()
	+ ", на сумму " + ФорматСумм(СуммаКПрописи, справочники.Валюты.НайтиПоКоду(643))+
	" "+СформироватьСуммуПрописью(СуммаКПрописи,  справочники.Валюты.НайтиПоКоду(643))+
	" (в т.ч. НДС "+ ФорматСумм(СуммаНДС, справочники.Валюты.НайтиПоКоду(643))+
	" "+СформироватьСуммуПрописью(СуммаНДС,  справочники.Валюты.НайтиПоКоду(643))+")";
	
	//25.08.14 Смирнов
	//27.08.14 Смирнов, решили вернуть все в обратный зад.
	//Если СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.НайтиПоКоду("Я0004") Тогда //ФормулаАвто
	//	СтрокаДоговора=".";
	//Иначе
		СтрокаДоговора="№ "+Шапка.НомерДоговора+" от "+Формат(Шапка.ДатаДоговора, "ДФ=""дд ММММ гггг 'г.'""");
	//КонецЕсли;
	ОбластьПодвал.Параметры.СтрокаДоговора=СтрокаДоговора;
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
	
//---------------04.06.2014----------------------------
ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
ТабДокумент.АвтоМасштаб = Истина; // по ширине Страницы
	
	//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	
	Возврат ТабДокумент;

	
	//Возврат ТабДокумент;

КонецФункции 	