перем Данные Экспорт;

Процедура ПриОткрытии()
	НомерПП=0;
	ТабДок = ЭлементыФормы.ПолеТабличногоДокумента1;
	ТабДок.Очистить();
	Макет = ПолучитьМакет("Макет");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	ОбластьЗаголовок.Параметры.Период = ПредставлениеПериода(НачалоДня(НачДата),КонецДня(КонДата),"ФП=Истина");
	ТабДок.Вывести(ОбластьЗаголовок);

    
    ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
	
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	Для каждого строка ИЗ Данные Цикл
		
		//Если не ТребуетсяОтображатьДокумент(строка.Документ) Тогда
		//		Продолжить;
		//КонецЕсли;	
		
	НомерПП=НомерПП+1;
	ОбластьСтрокаДокумент = Макет.ПолучитьОбласть("СтрокаДокумента");
	ОбластьСтрокаДокумент.Параметры.Заполнить(строка);
	ОбластьСтрокаДокумент.Параметры.НомерПП=НомерПП;
	Если ЕстьРеквизитДокумента("СуммаДокумента",строка.Документ.Метаданные()) Тогда
		ОбластьСтрокаДокумент.Параметры.СуммаДокумента=строка.Документ.СуммаДокумента;
	КонецЕсли;	
	
	Если ЕстьРеквизитДокумента("Контрагент",строка.Документ.Метаданные()) Тогда
		ОбластьСтрокаДокумент.Параметры.Контрагент=строка.Документ.Контрагент;
	КонецЕсли;
	
	Если ЕстьРеквизитДокумента("Контрагентдебитор",строка.Документ.Метаданные()) Тогда
		ОбластьСтрокаДокумент.Параметры.Контрагент=строка.Документ.Контрагентдебитор;
	КонецЕсли;
	
	Если ТипЗнч(строка.Документ) =Тип("ДокументСсылка.СчетФактураВыданный") ИЛИ
		 ТипЗнч(строка.Документ) =Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		 Если не ЗначениеНеЗаполнено(строка.Документ.ДокументОснование) И ЕстьРеквизитДокумента("СуммаДокумента",строка.Документ.ДокументОснование.Метаданные()) Тогда
			 ОбластьСтрокаДокумент.Параметры.СуммаДокумента=строка.Документ.ДокументОснование.СуммаДокумента;
		 КонецЕсли; 	 
		 Если не ЗначениеНеЗаполнено(строка.Документ.ДокументОснование) И ЕстьРеквизитДокумента("Контрагент",строка.Документ.ДокументОснование.Метаданные()) Тогда
			 ОбластьСтрокаДокумент.Параметры.Контрагент=строка.Документ.ДокументОснование.Контрагент;
		 КонецЕсли;
	КОнецЕсли;	 
	ОбластьСтрокаДокумент.Параметры.Примечание = строка.Примечание; //+++
		
		
	
	ОбластьОформления = ТабДок.Вывести(ОбластьСтрокаДокумент);
	Если ОбластьСтрокаДокумент.Параметры.СуммаДокумента <>  ОбластьСтрокаДокумент.Параметры.СуммаБУ Тогда
			//или стр.УТ_Приход <> стр.БП_Приход
			//или стр.УТ_Расход <> стр.БП_Расход
			ТабДок.Область(ОбластьОформления.Верх, 1, ОбластьОформления.Низ, 8).ЦветФона = WebЦвета.Розовый;		
	КонецЕсли;
	КонецЦикла;	
    //ТабДок.ТолькоПросмотр=Истина;
    ЭлементыФормы.ПолеТабличногоДокумента1.ТолькоПросмотр=Истина;
КонецПроцедуры

