
Функция Печать() Экспорт
	
	ЕдиницаИзмеренияВеса = Константы.ЕдиницаИзмеренияВеса.Получить();
	
	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ТоварКод = "Артикул";
	Иначе
		ТоварКод = "Код";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза",          СсылкаНаОбъект.Дата);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СсылкаНаОбъект.СкладОрдер);
	Запрос.УстановитьПараметр("ТекущийДокумент",    СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ПустойКонтрагент",   Справочники.Контрагенты.ПустаяСсылка());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	Дата КАК ДатаДокумента,
	|	Организация,
	|	Организация КАК ЮрФизЛицо,
	|	Организация КАК Поставщик,
	|	Организация КАК Контрагент,
	|	Организация КАК Руководители,
	|	Контрагент
	|		  КАК Покупатель,
	|	
	|		  Контрагент
	|		  КАК Плательщик,
	|	ДоговорКонтрагента.Представление  КАК Основание,
	|	ДоговорКонтрагента.ВедениеВзаиморасчетов КАК ВедениеВзаиморасчетов,
	|	ОтветственныеЛица.ФизическоеЛицо КАК ОтветственноеЛицо,
	|	Подразделение,
	|	ВалютаДокумента,
	|	КурсВзаиморасчетов      КАК Курс,
	|	КратностьВзаиморасчетов КАК Кратность,
	|	УчитыватьНДС,
	|	СуммаВключаетНДС
	|ИЗ
	|	Документ.Возвраттоваровотпокупателя КАК РеализацияТоваровУслуг,
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ОтветственныеЛица.СрезПоследних(&ДатаСреза, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ОтветственныеЛица
	|ПО
	|	ОтветственныеЛица.СтруктурнаяЕдиница = РеализацияТоваровУслуг.СкладОрдер
	|
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент
	|";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	
	Если СсылкаНаОбъект.ВалютаДокумента = СсылкаНаОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов Тогда
		// Документ оформлен в валюте взаиморасчетов
		Запрос.УстановитьПараметр("Курс", СсылкаНаОбъект.КурсВзаиморасчетов);
		Запрос.УстановитьПараметр("Кратность", СсылкаНаОбъект.КратностьВзаиморасчетов);
	Иначе
		// Документ оформлен в валюте регламентированного учета
		Запрос.УстановитьПараметр("Курс", 1);
		Запрос.УстановитьПараметр("Кратность", 1);
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура                                  КАК Номенклатура,
	|	ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК Строка(1000)) КАК ТоварНаименование,
	|	ВложенныйЗапрос.Номенклатура." + ТоварКод + "                КАК ТоварКод,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Представление                КАК БазоваяЕдиницаНаименование,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код  КАК БазоваяЕдиницаКодПоОКЕИ,
	|	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
|"+	?(СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = справочники.ТипыДоговоров.ШинтрейдЯрославль, "
//+++ 04.03.2015 ---- Количество мест!
//	|	ВложенныйЗапрос.ЕдиницаИзмеренияМест.Представление            КАК ВидУпаковки,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.КоличествоМест > 0 ТОГДА ""уп"" 
	|			Иначе ВложенныйЗапрос.ЕдиницаИзмерения.Представление конец как ВидУпаковки,
	
//	|	ВложенныйЗапрос.КоэффициентМест / ВложенныйЗапрос.Коэффициент КАК КоличествоВОдномМесте,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.КоличествоМест > 0 ТОГДА выразить(ВложенныйЗапрос.Количество/ВложенныйЗапрос.КоличествоМест  как число(15,1))
	|			Иначе 1 конец как КоличествоВОдномМесте,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.КоличествоМест > 0 ТОГДА 	ВложенныйЗапрос.КоличествоМест 
	|			Иначе ВложенныйЗапрос.Количество Конец  КАК КоличествоМест,",
	
" 	 ВложенныйЗапрос.ЕдиницаИзмеренияМест.Представление            КАК ВидУпаковки,
	|	ВложенныйЗапрос.КоэффициентМест / ВложенныйЗапрос.Коэффициент КАК КоличествоВОдномМесте,
  |	0 как КоличествоМест,")+"	
	//|	ВЫБОР
	//|		КОГДА ВложенныйЗапрос.КоличествоМест > 0 ТОГДА ВложенныйЗапрос.КоличествоМест * ВложенныйЗапрос.ЕдиницаИзмеренияМест.Вес
	//|		ИНАЧЕ ВложенныйЗапрос.Количество * ВложенныйЗапрос.ЕдиницаИзмерения.Вес
	//|	КОНЕЦ КАК Вес,
	|	ВложенныйЗапрос.Количество * ВложенныйЗапрос.ЕдиницаИзмерения.Вес КАК Вес,
//+++)	

	|	ВложенныйЗапрос.Характеристика       КАК Характеристика,
	|	ВложенныйЗапрос.Серия                КАК Серия,
	|	ВложенныйЗапрос.СтавкаНДС            КАК СтавкаНДС,
	|	ВложенныйЗапрос.Цена                 КАК Цена,
	|	ВложенныйЗапрос.Количество           КАК Количество,
	|	ВложенныйЗапрос.Сумма                КАК Сумма,
	|	ВложенныйЗапрос.СуммаНДС             КАК СуммаНДС,
	|	ВложенныйЗапрос.НомерСтроки          КАК НомерСтроки,
	|	ВложенныйЗапрос.Метка                КАК Метка
	|ИЗ
	|
	|	(
	|	ВЫБРАТЬ
	|		РеализацияТоваровУслуг.Номенклатура,
	|		РеализацияТоваровУслуг.Коэффициент,
	|		РеализацияТоваровУслуг.ЕдиницаИзмерения,
	|		РеализацияТоваровУслуг.ЕдиницаИзмеренияМест,
	|		РеализацияТоваровУслуг.ЕдиницаИзмеренияМест.Коэффициент     КАК КоэффициентМест,
	|		РеализацияТоваровУслуг.ХарактеристикаНоменклатуры           КАК Характеристика,
	|		РеализацияТоваровУслуг.СерияНоменклатуры                    КАК Серия,
	|		РеализацияТоваровУслуг.СтавкаНДС,
	|		РеализацияТоваровУслуг.Цена * &Курс / &Кратность            КАК Цена,
	|		СУММА(РеализацияТоваровУслуг.Количество)                    КАК Количество,
	|		СУММА(РеализацияТоваровУслуг.КоличествоМест)                КАК КоличествоМест,
	|		СУММА(РеализацияТоваровУслуг.Сумма    * &Курс / &Кратность) КАК Сумма,
	|		СУММА(РеализацияТоваровУслуг.СуммаНДС * &Курс / &Кратность) КАК СуммаНДС,
	|		МИНИМУМ(РеализацияТоваровУслуг.НомерСтроки)                 КАК НомерСтроки,
	|		0                                                           КАК Метка
	|	ИЗ
	|		Документ.Возвраттоваровотпокупателя.Товары КАК РеализацияТоваровУслуг
	|	ГДЕ
	|		РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|		РеализацияТоваровУслуг.Номенклатура,
	|		РеализацияТоваровУслуг.Коэффициент,
	|		РеализацияТоваровУслуг.ЕдиницаИзмерения,
	|		РеализацияТоваровУслуг.ЕдиницаИзмеренияМест,
	|		РеализацияТоваровУслуг.ХарактеристикаНоменклатуры,
	|		РеализацияТоваровУслуг.СерияНоменклатуры,
	|		РеализацияТоваровУслуг.СтавкаНДС,
	|		РеализацияТоваровУслуг.Цена
	|
	|	) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО Метка ВОЗР, НомерСтроки ВОЗР
	|
	|";
	ЗапросТовары = Запрос.Выполнить().Выгрузить();
	ТабДокумент  = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_ТОРГ12";
	//Орлов ++
	Если СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00107")
			Или СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00107")
		Или СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00106") //рнд
			Или СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00106") 
		Или СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00112")
			Или СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00112") 
		Или СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00122")
			Или СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00122") 
		Или СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00138")
			Или СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00138") 
		Или СсылкаНаОбъект.Дата < Дата("20130401000000") Тогда
		Макет = ПолучитьМакет("ТОРГ12");
	Иначе
		Макет = ПолучитьМакет("ТОРГ12_ЯШТ");
	КонецЕсли;
	//Орлов --
	// Выводим общие реквизиты шапки
	
	СведенияОПоставщике       = СведенияОЮрФизЛице(Шапка.ЮрФизЛицо,        Шапка.ДатаДокумента);		
	СведенияОПокупателе       = СведенияОЮрФизЛице(Шапка.Покупатель,       Шапка.ДатаДокумента);
	
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.НомерДокумента = ПолучитьНомерНаПечать(Шапка);
	ОбластьМакета.Параметры.ДатаДокумента  = Шапка.ДатаДокумента;
	
	ОбШтрихКод=ОбластьМакета.Рисунки.Штрихкод.Объект;
	ОбШтрихКод.ТипКода = 4; 
	ОбШтрихКод.Сообщение = СформироватьШКРеализации(СсылкаНаОбъект,"1");//XMLСтрока(ЭтотОбъект.Ссылка.УникальныйИдентификатор()); 
	ОбШтрихКод.ОтображатьТекст = Ложь;
	
	//+++ 13.08.2012
	флОрг=истина;
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект.Подразделение) тогда
		Если СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00106")  тогда //рнд
			ОбластьМакета.Параметры.ПредставлениеОрганизации = "Филиал ЗАО ТК ""Яршинторг"", ИНН 7604069216, ОГРН 1047600418777, 344090, Ростовская обл., г. Ростов-на-Дону, ул. Доватора, д.154/5, тел.:(863)220-92-42";
			Если СсылкаНаОбъект.Дата>='20121001' тогда //+++ 26.10.2012
				ОбластьМакета.Параметры.ПредставлениеОрганизации = ОбластьМакета.Параметры.ПредставлениеОрганизации 
				+"р/с 40702810800300004730 в банке ФИЛИАЛ ОАО БАНК ВТБ В Г.РОСТОВЕ-НА-ДОНУ БИК 046015999" ;
			иначе
				ОбластьМакета.Параметры.ПредставлениеОрганизации = ОбластьМакета.Параметры.ПредставлениеОрганизации 
				+"р/с 40702810377030102956 в банке СЕВЕРНЫЙ БАНК СБЕРБАНКА РОССИИ БИК 047888670" ;
			КонецЕсли;
			флОрг = ЗначениеЗаполнено(СсылкаНаОбъект.Грузоотправитель); //+++ 02/07/2013 - живой грузоотправитель
		КонецЕсли;
	иначеЕсли ЗначениеЗаполнено(СсылкаНаОбъект.Сделка.Подразделение) тогда
		Если  СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00106") тогда 
			ОбластьМакета.Параметры.ПредставлениеОрганизации = "Филиал ЗАО ТК ""Яршинторг"", ИНН 7604069216, ОГРН 1047600418777, 344090, Ростовская обл., г. Ростов-на-Дону, ул. Доватора, д.154/5, тел.:(863)220-92-42";
			Если СсылкаНаОбъект.Дата>='20121001' тогда //+++ 26.10.2012
				ОбластьМакета.Параметры.ПредставлениеОрганизации = ОбластьМакета.Параметры.ПредставлениеОрганизации 
				+"р/с 40702810800300004730 в банке ФИЛИАЛ ОАО БАНК ВТБ В Г.РОСТОВЕ-НА-ДОНУ БИК 046015999" ;
			иначе
				ОбластьМакета.Параметры.ПредставлениеОрганизации = ОбластьМакета.Параметры.ПредставлениеОрганизации 
				+"р/с 40702810377030102956 в банке СЕВЕРНЫЙ БАНК СБЕРБАНКА РОССИИ БИК 047888670" ;
			КонецЕсли;
			флОрг = ЗначениеЗаполнено(СсылкаНаОбъект.Грузоотправитель); //+++ 02/07/2013 - живой грузоотправитель
		КонецЕсли;
	КонецЕсли;
	
	
	//Если флОрг тогда
	//	Если Шапка.ЮрФизЛицо = Шапка.Грузоотправитель Тогда
			ОбластьМакета.Параметры.ПредставлениеОрганизации = ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,ИНН,КПП,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет,"); // все реквизиты чтобы были
	//	Иначе
			//ОбластьМакета.Параметры.ПредставлениеОрганизации = ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование,ИНН,КПП,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет,");
	//	КонецЕсли;
	//КонецЕсли;
	
	//+++( 30.03.2012
	//ОбластьМакета.Параметры.ПредставлениеПодразделения = Шапка.Подразделение;
	Если ЗначениеЗаполнено(СсылкаНаОбъект.Подразделение) тогда
		//+++ 13.08.2012
		Если СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00106") тогда //рнд
			ОбластьМакета.Параметры.ПредставлениеПодразделения = "Филиал ЗАО ТК ""Яршинторг"" по адресу: 344090, Ростовская обл., г. Ростов-на-Дону, ул. Доватора, д.154/5";
		иначе
			ОбластьМакета.Параметры.ПредставлениеПодразделения = строка(СсылкаНаОбъект.Подразделение);
		КонецЕсли;
		
	иначеЕсли ЗначениеЗаполнено(СсылкаНаОбъект.Сделка.Подразделение) тогда
		//+++ 13.08.2012
		Если СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00106") тогда 
			ОбластьМакета.Параметры.ПредставлениеПодразделения = "Филиал ЗАО ТК ""Яршинторг"" по адресу: 344090, Ростовская обл., г. Ростов-на-Дону, ул. Доватора, д.154/5";
		иначе
			ОбластьМакета.Параметры.ПредставлениеПодразделения = строка(СсылкаНаОбъект.Сделка.Подразделение);
		КонецЕсли;
		
	иначе
		ОбластьМакета.Параметры.ПредставлениеПодразделения = "";
	КонецЕсли;
	//+++)
	
	//Если СокрЛП(Шапка.АдресДоставки) <> "" Тогда
	//	ПредставлениеГрузополучателяДоАдреса    = ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ИНН,КПП,");
	//	ПредставлениеГрузополучателяПослеАдреса = ОписаниеОрганизации(СведенияОГрузополучателе, "Телефоны,НомерСчета,Банк,БИК,КоррСчет,");
	//	ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ?(СокрЛП(ПредставлениеГрузополучателяДоАдреса) = "", "", ПредставлениеГрузополучателяДоАдреса+", ") + Шапка.АдресДоставки+?(СокрЛП(ПредставлениеГрузополучателяПослеАдреса)="", "", ", "+ПредставлениеГрузополучателяПослеАдреса);
	//Иначе
		//ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ИНН,КПП,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет,");
	//КонецЕсли;
	
	ОбластьМакета.Параметры.ПредставлениеПоставщика  = ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,ИНН,КПП,ОГРН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет,");//+++ 05.12.2012 КоррСчет
	ОбластьМакета.Параметры.ПредставлениеПлательщика = ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,ИНН,КПП,ОГРН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет,");
	
		
	//Если Шапка.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
	//   И Шапка.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
	//	ОбластьМакета.Параметры.Основание = "Основной договор";//Шапка.Основание;
	//Иначе
	//	ЗапросЗаказ = Новый Запрос;
	//	ЗапросЗаказ.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	//	ЗапросЗаказ.Текст =
	//	"ВЫБРАТЬ
	//	|	Сделка.Номер       КАК Номер,
	//	|	Сделка.Дата        КАК Дата,
	//	|	Сделка.ВидОперации КАК ВидОперации,
	//	|	Сделка.Организация КАК Организация
	//	|ИЗ
	//	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//	|ГДЕ
	//	|	РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент";
	//	ШапкаЗаказ = ЗапросЗаказ.Выполнить().Выбрать();
	//	ШапкаЗаказ.Следующий();
	
	//	//ОбластьМакета.Параметры.Основание = СформироватьЗаголовокДокумента(ШапкаЗаказ, Строка(ШапкаЗаказ.ВидОперации));
	//	ОбластьМакета.Параметры.Основание = "Основной договор";
	//КонецЕсли;
	
	//+++ 24.11.2014 - название договора - комиссии, поставки или для прочего - название...!
	назвДог = ?(СсылкаНаОбъект.ДоговорКонтрагента.ВидДоговора = перечисления.ВидыДоговоровКонтрагентов.СКомиссионером,"Договор комиссии",
				?(СсылкаНаОбъект.ДоговорКонтрагента.ВидДоговора = перечисления.ВидыДоговоровКонтрагентов.Прочее, 
				     СсылкаНаОбъект.ДоговорКонтрагента.Наименование, "Договор поставки"));
					 
	Если ЗначениеЗаполнено(СсылкаНаОбъект.ДоговорКонтрагента) И ЗначениеЗаполнено(СсылкаНаОбъект.ДоговорКонтрагента.Номер) И  ЗначениеЗаполнено(СсылкаНаОбъект.ДоговорКонтрагента.Дата) Тогда
		ОбластьМакета.Параметры.Основание = назвДог+" №"+СсылкаНаОбъект.ДоговорКонтрагента.Номер+" от "+Формат(СсылкаНаОбъект.ДоговорКонтрагента.Дата,"ДФ=dd.MM.yyyy");
		ОбластьМакета.Параметры.ОснованиеНомер        = СсылкаНаОбъект.ДоговорКонтрагента.Номер;
		ОбластьМакета.Параметры.ОснованиеДата         = Формат(СсылкаНаОбъект.ДоговорКонтрагента.Дата,"ДФ=dd.MM.yyyy");
	Иначе
		ОбластьМакета.Параметры.Основание = назвДог;
		ОбластьМакета.Параметры.ОснованиеНомер        = "";
		ОбластьМакета.Параметры.ОснованиеДата         = "";
	КонецЕсли;	
	попытка 
		ОбластьМакета.Параметры.Основание =ОбластьМакета.Параметры.Основание + ". Дата оплаты: "+ Формат(ССылкаНаОбъект.Сделка.ДатаОплаты,"ДФ=dd.MM.yyyy");
	Исключение
	конецпопытки;	
	
	// Выводим всевозможные коды
	ОбластьМакета.Параметры.ОрганизацияПоОКПО     = СведенияОПоставщике.КодПоОКПО;
	ОбластьМакета.Параметры.ВидДеятельностиПоОКДП = "";
	//ОбластьМакета.Параметры.ГрузополучательПоОКПО = СведенияОГрузополучателе.КодПоОКПО;
	ОбластьМакета.Параметры.ПоставщикПоОКПО       = СведенияОПоставщике.КодПоОКПО;
	ОбластьМакета.Параметры.ПлательщикПоОКПО      = СведенияОПокупателе.КодПоОКПО;
	Если СсылкаНаОбъект.Подразделение = Справочники.Подразделения.НайтиПоКоду("00106") Тогда//рнд
		ОбластьМакета.Параметры.ТранспортнаяНакладнаяНомер = Шапка.Номер;
		ОбластьМакета.Параметры.ТранспортнаяНакладнаяДата  = Формат(Шапка.ДатаДокумента, "ДФ=dd.MM.yyyy");
	Иначе
		ОбластьМакета.Параметры.ТранспортнаяНакладнаяНомер = "";
		ОбластьМакета.Параметры.ТранспортнаяНакладнаяДата  = "";
	КонецЕсли;
	
	//2013.11.14
	Если СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.НайтиПоКоду("Я0004") Тогда //ФормулаАвто
		Областьмакета.Параметры.ПредставлениеОрганизации = "ООО ""Формула Авто"", ИНН 7602088238,  150014, Ярославская обл, Ярославль г, Салтыкова-Щедрина ул, дом №21, офис 414, р/с 40702810877030004619, в банке СЕВЕРНЫЙ БАНК СБЕРБАНКА РОССИИ, БИК 047888670, к/с 30101810500000000670";
		Областьмакета.Параметры.ПредставлениеПоставщика = "ООО ""Формула Авто"", ИНН 7602088238,  150014, Ярославская обл, Ярославль г, Салтыкова-Щедрина ул, дом №21, офис 414, р/с 40702810877030004619, в банке СЕВЕРНЫЙ БАНК СБЕРБАНКА РОССИИ, БИК 047888670, к/с 30101810500000000670";

		//25.09.14 Смирнов для ФА договор с датой и номером (Артемьева)
		ОбластьМакета.Параметры.Основание = "Договор (с покупателем) №"+СсылкаНаОбъект.ДоговорКонтрагента.Номер+" от "+Формат(СсылкаНаОбъект.ДоговорКонтрагента.Дата,"ДФ=dd.MM.yyyy");
		//ОбластьМакета.Параметры.Основание = "Договор (с покупателем)";
		ОбластьМакета.Параметры.ОрганизацияПоОКПО = "30968584";
		ОбластьМакета.Параметры.ПоставщикПоОКПО   = "30968584";
		ОбластьМакета.Параметры.ТранспортнаяНакладнаяНомер = "";
		ОбластьМакета.Параметры.ТранспортнаяНакладнаяДата  = "";
		ОбластьМакета.Параметры.ОснованиеНомер = "";
		ОбластьМакета.Параметры.ОснованиеДата = "";
		Если СсылкаНаОбъект.НомерФормулаАвто = 0 Тогда
			НомерДокумента = ЭтотОбъект.ПолучитьФорму("ВводНомераФормулаАвто").ОткрытьМодально();
		Иначе
			НомерДокумента = СсылкаНаОбъект.НомерФормулаАвто;
			сообщить("Отгрузка по организации Формула Авто, номер документа берется из реквизита документа ""Номер Формула Авто"" в закладке ""Дополнительно""");
		КонецЕсли;
		ОбластьМакета.Параметры.НомерДокумента  = СтрЗаменить(Строка(НомерДокумента), Символы.НПП,"");
	//13.08.15	Алексеева А
	ИначеЕсли СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.ФормулаАвтоПлюс Тогда //ФормулаАвто
		Областьмакета.Параметры.ПредставлениеОрганизации = "ООО ""Формула Авто Плюс"", ИНН 7602088206, 150003, Ярославская обл, Ярославль г, Полушкина Роща ул, дом №9, р/с 40702810277030004620, в банке СЕВЕРНЫЙ БАНК СБЕРБАНКА РОССИИ, БИК 047888670, к/с 30101810500000000670";
		Областьмакета.Параметры.ПредставлениеПоставщика = "ООО ""Формула Авто Плюс"", ИНН 7602088206, 150003, Ярославская обл, Ярославль г, Полушкина Роща ул, дом №9,  р/с 40702810277030004620, в банке СЕВЕРНЫЙ БАНК СБЕРБАНКА РОССИИ, БИК 047888670, к/с 30101810500000000670";
		ОбластьМакета.Параметры.Основание =СсылкаНаОбъект.ДоговорКонтрагента.Комментарий;
		ОбластьМакета.Параметры.ОрганизацияПоОКПО = "30968561";
		ОбластьМакета.Параметры.ПоставщикПоОКПО   = "30968561";
		ОбластьМакета.Параметры.ТранспортнаяНакладнаяНомер = "";
		ОбластьМакета.Параметры.ТранспортнаяНакладнаяДата  = "";
		ОбластьМакета.Параметры.ОснованиеНомер = "";
		ОбластьМакета.Параметры.ОснованиеДата = "";
		Если СсылкаНаОбъект.НомерФормулаАвто = 0 Тогда
			НомерДокумента = ЭтотОбъект.ПолучитьФорму("ВводНомераФормулаАвтоПлюс").ОткрытьМодально();
		Иначе
			НомерДокумента = СсылкаНаОбъект.НомерФормулаАвто;
			сообщить("Отгрузка по организации Формула Авто Плюс, номер документа берется из реквизита документа ""Номер Формула Авто Плюс"" в закладке ""Дополнительно""");
		КонецЕсли;
		ОбластьМакета.Параметры.НомерДокумента  = СтрЗаменить(Строка(НомерДокумента), Символы.НПП,"");
	
		//ОЛ 29.01.2015 для экспорта
	ИначеЕсли СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.ШинтрейдЯрославль Тогда //Шинтрейд Ярославль
		Если СсылкаНаОбъект.Дата < '20150402000000' Тогда
			Областьмакета.Параметры.ПредставлениеПоставщика = "Общество с ограниченной ответственностью ""ШинТрейд Ярославль"", ИНН 7604090169, 150049, Ярославская обл, Ярославль г, Лисицына ул, дом № 7, р/с 40702810477030004491, в банке СЕВЕРНЫЙ БАНК СБЕРБАНКА РОССИИ, БИК 047888670, к/с 30101810500000000670";
		Иначе
		//со  2 апреля 2015 г. изменился адрес
			Областьмакета.Параметры.ПредставлениеПоставщика = "Общество с ограниченной ответственностью ""ШинТрейд Ярославль"", ИНН 7604090169, 150014, Ярославская обл, Ярославль г, Салтыкова-Щедрина ул, дом № 21, офис 507, р/с 40702810477030004491, в банке СЕВЕРНЫЙ БАНК СБЕРБАНКА РОССИИ, БИК 047888670, к/с 30101810500000000670";
		КонецЕсли;
		ОбластьМакета.Параметры.Основание = "Контракт №"+СсылкаНаОбъект.ДоговорКонтрагента.Номер+" от "+Формат(СсылкаНаОбъект.ДоговорКонтрагента.Дата,"ДФ=dd.MM.yyyy");
		ОбластьМакета.Параметры.ПоставщикПоОКПО   = "0095770226";
		ОбластьМакета.Параметры.ТранспортнаяНакладнаяНомер = "";
		ОбластьМакета.Параметры.ТранспортнаяНакладнаяДата  = "";
		ОбластьМакета.Параметры.ОснованиеНомер = "";
		ОбластьМакета.Параметры.ОснованиеДата = "";
		РегАдреса = РегистрыСведений.КонтактнаяИнформация.Получить(Новый Структура("Объект,Тип,Вид",Шапка.Покупатель,Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента));
		//Если СокрЛП(Шапка.Грузополучатель.НаименованиеИННэкспорт)<>"" Тогда
		//	//В Белоруссии не ИНН, а УНП, в Казахстане - БИН
		//	ОбластьМакета.Параметры.ПредставлениеГрузополучателя = СтрЗаменить(ОбластьМакета.Параметры.ПредставлениеГрузополучателя," ИНН "," "+СокрЛП(Шапка.Грузополучатель.НаименованиеИННэкспорт)+" ");
		//Иначе
		//	сообщить("Не заполнено наименование налогового признака в грузополучателе. В сведениях о грузополучателе вместо ИНН должно печататься БИН, УНП иили др.");
		//КонецЕсли;
		Если СокрЛП(Шапка.Покупатель.НаименованиеИННэкспорт)<>"" Тогда
			ОбластьМакета.Параметры.ПредставлениеПлательщика = СтрЗаменить(ОбластьМакета.Параметры.ПредставлениеПлательщика," ИНН "," "+СокрЛП(Шапка.Покупатель.НаименованиеИННэкспорт)+" ");
		Иначе
			сообщить("Не заполнено наименование налогового признака в покупателе. В сведениях о покупателе вместо ИНН должно печататься БИН, УНП иили др.");
		КонецЕсли;
		
		Если СсылкаНаОбъект.НомерФормулаАвто = 0 Тогда
			НомерДокумента = ЭтотОбъект.ПолучитьФорму("ВводНомераШинтрейд").ОткрытьМодально();
		Иначе
			НомерДокумента = СсылкаНаОбъект.НомерФормулаАвто;
			сообщить("Отгрузка по организации Шинтрейд Ярославль, номер документа берется из реквизита документа ""Номер Шинтрейд Яр."" в закладке ""Дополнительно""");
		КонецЕсли;
		
		ОбластьМакета.Параметры.НомерДокумента  = СтрЗаменить(Строка(НомерДокумента), Символы.НПП,"");
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	СтрокНаСтранице = 20;
	СтрокШапки      = 10;
	СтрокПодвала    = 9;
	НомерСтраницы   = 1;
	
	// Выводим заголовок таблицы
	ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаб");
	ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
	ТабДокумент.Вывести(ЗаголовокТаблицы);
	
	КоличествоСтрок = ЗапросТовары.Количество();
	
	Если КоличествоСтрок <= 2 Тогда
		ПереноситьПоследнююСтроку = 0;
	Иначе
		ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
		ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
		ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
	КонецЕсли;
	
	// инициализация итогов по странице
	ИтогоМассаБруттоНаСтранице = 0;
	ИтогоМестНаСтранице        = 0;
	ИтогоКоличествоНаСтранице  = 0;
	ИтогоСуммаНаСтранице       = 0;
	ИтогоНДСНаСтранице         = 0;
	ИтогоСуммаСНДСНаСтранице   = 0;
	
	// инициализация итогов по документу
	ИтогоМассаБрутто = 0;
	ИтогоМест        = 0;
	ИтогоКоличество  = 0;
	ИтогоСуммаСНДС   = 0;
	ИтогоСумма       = 0;
	ИтогоНДС         = 0;
	Ном              = 0;
	
	массивСлов=Новый Массив();
	СтрокаДляДисковБезЛоготипов="";
	
	
	// Выводим многострочную часть докмента
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	Для Каждого ВыборкаСтрок Из ЗапросТовары Цикл
		
		Если ЗначениеНеЗаполнено(ВыборкаСтрок.Номенклатура) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
		
		Ном           = Ном + 1;
		ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
		
		Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
			или ((ПереноситьПоследнююСтроку = 1) и (Ном = КоличествоСтрок)) Тогда
			
			ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
			
			ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице = ИтогоМассаБруттоНаСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогМестПоСтранице        = ИтогоМестНаСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоПоСтранице  = ИтогоКоличествоНаСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице       = ИтогоСуммаНаСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогНДСПоСтранице         = ИтогоНДСНаСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогСуммыСНДСПоСтранице   = ИтогоСуммаСНДСНаСтранице;
			
			ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
			
			// очистим итоги по странице
			ИтогоМассаБруттоНаСтранице = 0;
			ИтогоМестНаСтранице        = 0;
			ИтогоКоличествоНаСтранице  = 0;
			ИтогоСуммаНаСтранице       = 0;
			ИтогоНДСНаСтранице         = 0;
			ИтогоСуммаСНДСНаСтранице   = 0;
			
			НомерСтраницы = НомерСтраницы + 1;
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
			ТабДокумент.Вывести(ЗаголовокТаблицы);
			
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрок);
		ОбластьМакета.Параметры.Номер             = ЗапросТовары.Индекс(ВыборкаСтрок) + 1;
		//++Смирнов для Лагерной и Радуга Питер убираем LegeArtis
		Если Шапка.Покупатель.Код="93136  " или  Шапка.Покупатель.Код="91777  " тогда
			ОбластьМакета.Параметры.ТоварНаименование = СокрЛП(СтрЗаменить(ВыборкаСтрок.ТоварНаименование,"LegeArtis",""))
			+ ПредставлениеСерий(ВыборкаСтрок)
			+ ?(ВыборкаСтрок.Метка = 2, " (возвратная тара)", "");
		иначе
			ОбластьМакета.Параметры.ТоварНаименование = СокрЛП(ВыборкаСтрок.ТоварНаименование)
			+ ПредставлениеСерий(ВыборкаСтрок)
			+ ?(ВыборкаСтрок.Метка = 2, " (возвратная тара)", "");
		КонецЕсли;
		
		Если ЗначениеНеЗаполнено(ЕдиницаИзмеренияВеса) Тогда
			МассаБрутто = 0;
		Иначе
			МассаБрутто = ВыборкаСтрок.Вес;
			МассаБрутто = ?(МассаБрутто <> Неопределено И МассаБрутто <> NULL, МассаБрутто, 0);
		КонецЕсли;
		
		Мест        = ВыборкаСтрок.КоличествоМест;
		Мест        = ?(Мест <> Неопределено И Мест <> NULL, Мест, 0);
		
		Количество  = ВыборкаСтрок.Количество;
		СуммаСНДС   = (ВыборкаСтрок.Сумма + ?(Шапка.СуммаВключаетНДС, 0, ВыборкаСтрок.СуммаНДС));
		СуммаНДС    = ВыборкаСтрок.СуммаНДС;
		СуммаБезНДС = СуммаСНДС  - СуммаНДС;
		
		ОбластьМакета.Параметры.МассаБрутто = МассаБрутто;
		ОбластьМакета.Параметры.СуммаСНДС   = СуммаСНДС;
		ОбластьМакета.Параметры.СуммаНДС    = СуммаНДС;
		ОбластьМакета.Параметры.СтавкаНДС   = ВыборкаСтрок.СтавкаНДС;
		ОбластьМакета.Параметры.СуммаБезНДС = СуммаБезНДС;
		ОбластьМакета.Параметры.Цена        = СуммаБезНДС / ?(Количество = 0, 1, Количество);
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// увеличим итоги по странице
		ИтогоМассаБруттоНаСтранице = ИтогоМассаБруттоНаСтранице + МассаБрутто;
		ИтогоМестНаСтранице        = ИтогоМестНаСтранице        + Мест;
		ИтогоКоличествоНаСтранице  = ИтогоКоличествоНаСтранице  + Количество;
		ИтогоСуммаНаСтранице       = ИтогоСуммаНаСтранице       + СуммаБезНДС;
		ИтогоНДСНаСтранице         = ИтогоНДСНаСтранице         + СуммаНДС;
		ИтогоСуммаСНДСНаСтранице   = ИтогоСуммаСНДСНаСтранице   + СуммаСНДС;
		
		// увеличим итоги по дукументу
		ИтогоМассаБрутто = ИтогоМассаБрутто + МассаБрутто;
		ИтогоМест        = ИтогоМест        + Мест;
		ИтогоКоличество  = ИтогоКоличество  + Количество;
		ИтогоСумма       = ИтогоСумма       + СуммаБезНДС;
		ИтогоНДС         = ИтогоНДС         + СуммаНДС;
		ИтогоСуммаСНДС   = ИтогоСуммаСНДС   + СуммаСНДС;
		
		массивСлов.Очистить();
		ПолучитьМассивСлов(ВыборкаСтрок.Номенклатура.Наименование,массивСлов);
		Если массивСлов.Количество()>=3 и массивСлов[0]="YST" и  массивСлов[1]="Replika" Тогда
			// смотрим, чтобы в строке НЕ БЫЛО уже указано таких моделей
			Если Найти(СтрокаДляДисковБезЛоготипов,массивСлов[2])=0 Тогда
				Если СтрДлина(СтрокаДляДисковБезЛоготипов)=0 Тогда
					СтрокаДляДисковБезЛоготипов=массивСлов[2];
				Иначе
					СтрокаДляДисковБезЛоготипов=СтрокаДляДисковБезЛоготипов+", "+массивСлов[2];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;
	
	// Выводим итоги по последней странице
	ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице = ИтогоМассаБруттоНаСтранице;
	ОбластьИтоговПоСтранице.Параметры.ИтогМестПоСтранице        = ИтогоМестНаСтранице;
	ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоПоСтранице  = ИтогоКоличествоНаСтранице;
	ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице       = ИтогоСуммаНаСтранице;
	ОбластьИтоговПоСтранице.Параметры.ИтогНДСПоСтранице         = ИтогоНДСНаСтранице;
	ОбластьИтоговПоСтранице.Параметры.ИтогСуммыСНДСПоСтранице   = ИтогоСуммаСНДСНаСтранице;
	
	ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
	
	// Выводим итоги по документу в целом
	ОбластьМакета = Макет.ПолучитьОбласть("Всего");
	ОбластьМакета.Параметры.ИтогМассаБрутто = ИтогоМассаБрутто;
	ОбластьМакета.Параметры.ИтогМест        = ИтогоМест;
	ОбластьМакета.Параметры.ИтогКоличество  = ИтогоКоличество;
	ОбластьМакета.Параметры.ИтогСуммы       = ИтогоСумма;
	ОбластьМакета.Параметры.ИтогНДС         = ИтогоНДС;
	ОбластьМакета.Параметры.ИтогСуммыСНДС   = ИтогоСуммаСНДС;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Выводим подвал документа
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	Если СтрДлина(СтрокаДляДисковБезЛоготипов)>0 Тогда
		ОбластьМакета.Параметры.НадписьДискиБезЛоготипов="Диски "+СтрокаДляДисковБезЛоготипов+ " поставляются без логотипов.";
	Иначе
		ОбластьМакета.Параметры.НадписьДискиБезЛоготипов="";
	КонецЕсли;
	
	//Доверенность
	Руководители = ОтветственныеЛицаОрганизации(Шапка.Руководители, Шапка.ДатаДокумента,);
	Руководитель = Руководители.Руководитель;
	Бухгалтер    = Руководители.ГлавныйБухгалтер;
	
	
	//	ОбластьМакета.Параметры.ФИОРуководителя       = Руководитель;
	//	ОбластьМакета.Параметры.ФИОГлавБухгалтера     = Бухгалтер;
	
	ОбластьМакета.Параметры.ДатаДокумента=Формат(Шапка.ДатаДокумента,"ДЛФ=DD");
	
	ОбластьМакета.Параметры.ДолжностьРуководителя = Руководители.РуководительДолжность;	
	
	
	ФамилияИмяОтчествоФизЛица                     = ФамилияИмяОтчество(Шапка.ОтветственноеЛицо, Шапка.ДатаДокумента);
	//	ФамилияИмяОтчествоКладовщика                  = ФамилияИмяОтчествоФизЛица.Фамилия + " " + ФамилияИмяОтчествоФизЛица.Имя + " " + ФамилияИмяОтчествоФизЛица.Отчество;
	//	ОбластьМакета.Параметры.ФИОКладовщика         = ФамилияИнициалыФизЛица(ФамилияИмяОтчествоКладовщика);
	
	//+++ 30.03.2012
	
	Если ( СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00107") )
		или ( СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00107") ) тогда
		//ПредставлениеПодразделения
		ОбластьМакета.Параметры.ФИОразрешил = "Войновская Н.Р.";
		ОбластьМакета.Параметры.ФИОглБух	= "Войновская Н.Р.";
		ОбластьМакета.Параметры.ФИОпроизвел = "Войновская Н.Р.";
		ОбластьМакета.Параметры.Доверенность1 = "Руководитель обособленного подразделения г.Москва Войновская Н.Р. на основании приказа по ЗАО ТК ""Яршинторг"" №______ от ___.____._____г.";
		ОбластьМакета.Параметры.Доверенность2 = "";
		ОбластьМакета.Параметры.Доверенность3 = "";
	иначеЕсли ( СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00106") ) //рнд
		или ( СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00106") ) тогда   //+++ 13.08.2012
		//ПредставлениеПодразделения
		Отбор1 = новый Структура;
		Отбор1.Вставить("Подразделение",справочники.Подразделения.НайтиПоКоду("00106"));
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Руководитель);
		регСведРук = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
		регСведГлБух = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		ОбластьМакета.Параметры.ФИОразрешил = регСведГлБух.ФизическоеЛицо; //Жилин А.В.";      
		ОбластьМакета.Параметры.ДолжностьРуководителя = регСведГлБух.Должность;//"Глав.бух.ф-ла г. Ростов-на-Дону";
		
		ОбластьМакета.Параметры.ФИОглБух	= регСведГлБух.ФизическоеЛицо; //Иноземцева Н.И.";
		ОбластьМакета.Параметры.ФИОпроизвел = регСведГлБух.ФизическоеЛицо; //Жилин А.В.";
		ОбластьМакета.Параметры.Доверенность1 = регСведРук.Должность+" "+строка(регСведРук.ФизическоеЛицо)+", действующий  на основании "+регСведРук.Доверенность; // 186 от 10 августа 2012
		ОбластьМакета.Параметры.Доверенность2 = регСведГлБух.Должность+" "+строка(регСведГлБух.ФизическоеЛицо)+", действующий  на основании "+регСведГлБух.Доверенность;
		ОбластьМакета.Параметры.ДолжностьКладовщика = регСведГлБух.Должность;
		
	//+++( 26.11.2013 - по ответственному 
		//Если СсылкаНаОбъект.Дата>='20131031' и СсылкаНаОбъект.Ответственный = Справочники.Пользователи.НайтиПоКоду("Михалева Е. А.") Тогда
		//ОбластьМакета.Параметры.Доверенность3 = "Оператор ПК-менеджер филиала в г. Ростов-На-Дону Михалева Е.А., действующий на основании Доверенности №253 от 31 октября 2013г.";
		//	ОбластьМакета.Параметры.ФИОразрешил = "Михалева Е.А.";
		//	ОбластьМакета.Параметры.ФИОглБух    = "Михалева Е.А.";
		//	ОбластьМакета.Параметры.ФИОпроизвел = "Михалева Е.А.";
		//	ОбластьМакета.Параметры.ДолжностьРуководителя = "Оператор ПК-менеджер";
		//	ОбластьМакета.Параметры.ДолжностьКладовщика   = "Оператор ПК-менеджер";
		//КонецЕсли;
		Если СсылкаНаОбъект.Дата>='20131031' Тогда // ТРОЕ - каждый - за всех!
			
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Кассир);
		регСведКассир = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
	
//			"Оператор ПК-менеджер филиала в г. Ростов-На-Дону Михалева Е.А., действующий на основании Доверенности №253 от 31 октября 2013г.";
			ОбластьМакета.Параметры.Доверенность3 = регСведКассир.Должность+" "+строка(регСведКассир.ФизическоеЛицо)+", действующий  на основании "+регСведКассир.Доверенность;
			
			Если регСведРук.ФизическоеЛицо = СсылкаНаОбъект.Ответственный.ФизЛицо тогда
				регСведРнД = регСведРук;
			ИначеЕсли регСведГлБух.ФизическоеЛицо = СсылкаНаОбъект.Ответственный.ФизЛицо тогда
				регСведРнД = регСведГлБух;
			ИначеЕсли регСведКассир.ФизическоеЛицо = СсылкаНаОбъект.Ответственный.ФизЛицо тогда
				регСведРнД = регСведКассир;
			Иначе
				регСведРнД = новый Структура("ФизическоеЛицо, Должность, Доверенность","","",""); 
			КонецЕсли;
			  // 1 за всех 
		ОбластьМакета.Параметры.ФИОразрешил = регСведРнД.ФизическоеЛицо.Наименование;
		ОбластьМакета.Параметры.ФИОглБух    = регСведРнД.ФизическоеЛицо.Наименование;
		ОбластьМакета.Параметры.ФИОпроизвел = регСведРнД.ФизическоеЛицо.Наименование;
		ОбластьМакета.Параметры.ДолжностьРуководителя = регСведРнД.Должность;
		ОбластьМакета.Параметры.ДолжностьКладовщика   = регСведРнД.Должность;
		КонецЕсли;
//+++)

	иначеЕсли  СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00112") 
		или  СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00112") тогда   //+++ 30.07.2013
		//ПредставлениеПодразделения
		Отбор1 = новый Структура;
		Отбор1.Вставить("Подразделение",справочники.Подразделения.НайтиПоКоду("00112"));
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Руководитель);
		регСведРук = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Кассир);
		регСведГлБух = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		ОбластьМакета.Параметры.ФИОразрешил = регСведРук.ФизическоеЛицо; //Жилин А.В.";      
		ОбластьМакета.Параметры.ДолжностьРуководителя = регСведРук.Должность;
		
		ОбластьМакета.Параметры.ФИОглБух	= регСведРук.ФизическоеЛицо; 
		
		//Кладовщик = ПолучитьКладовщика(); //+++ 01.08.2013
		ОбластьМакета.Параметры.ФИОпроизвел = строка(регСведГлБух.ФизическоеЛицо);
		ОбластьМакета.Параметры.ДолжностьКладовщика = регСведГлБух.Должность;
		
		ОбластьМакета.Параметры.Доверенность1 = регСведРук.Должность+" "+строка(регСведРук.ФизическоеЛицо)+", действующий  на основании "+регСведРук.Доверенность;
		ОбластьМакета.Параметры.Доверенность2 = регСведГлБух.Должность+" "+строка(регСведГлБух.ФизическоеЛицо)+", действующий  на основании "+регСведГлБух.Доверенность;
		ОбластьМакета.Параметры.Доверенность3 = "";
		
ИначеЕсли  СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00122")
			Или СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00122") тогда // 23.07.2014
			
		//ПредставлениеПодразделения
		Отбор1 = новый Структура;
		Отбор1.Вставить("Подразделение",справочники.Подразделения.НайтиПоКоду("00122"));
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Руководитель);
		регСведРук = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
		регСведГлБух = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Кассир);
		регСведКладовщик = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
	
		ОбластьМакета.Параметры.ФИОразрешил = регСведРук.ФизическоеЛицо; //Жилин А.В.";      
		ОбластьМакета.Параметры.ДолжностьРуководителя = регСведРук.Должность;//"Глав.бух.ф-ла г. Ростов-на-Дону";
		
		ОбластьМакета.Параметры.ФИОглБух	= регСведГлБух.ФизическоеЛицо; 
		
		ОбластьМакета.Параметры.ДолжностьКладовщика = регСведКладовщик.Должность;
		ОбластьМакета.Параметры.ФИОпроизвел = регСведКладовщик.ФизическоеЛицо; 
		
		ОбластьМакета.Параметры.Доверенность1 = ""; // бух = рук
	//	ОбластьМакета.Параметры.Доверенность1 = регСведРук.Должность+" "+строка(регСведРук.ФизическоеЛицо)+", действующий  на основании "+регСведРук.Доверенность; 
		ОбластьМакета.Параметры.Доверенность2 = регСведГлБух.Должность+" "+строка(регСведГлБух.ФизическоеЛицо)+", действующий  на основании "+регСведГлБух.Доверенность;
		ОбластьМакета.Параметры.Доверенность3 = регСведКладовщик.Должность+" "+строка(регСведКладовщик.ФизическоеЛицо)+", действующий  на основании "+регСведКладовщик.Доверенность;
		
//01.06.15	
ИначеЕсли  СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00138")
			Или СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00138") тогда // 23.07.2014
			
		//ПредставлениеПодразделения
		Отбор1 = новый Структура;
		Отбор1.Вставить("Подразделение",справочники.Подразделения.НайтиПоКоду("00138"));
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Руководитель);
		регСведРук = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
		регСведГлБух = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Кассир);
		регСведКладовщик = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
	
		ОбластьМакета.Параметры.ФИОразрешил = регСведРук.ФизическоеЛицо; //Жилин А.В.";      
		ОбластьМакета.Параметры.ДолжностьРуководителя = регСведРук.Должность;//"Глав.бух.ф-ла г. Ростов-на-Дону";
		
		ОбластьМакета.Параметры.ФИОглБух	= регСведГлБух.ФизическоеЛицо; 
		
		ОбластьМакета.Параметры.ДолжностьКладовщика = регСведКладовщик.Должность;
		ОбластьМакета.Параметры.ФИОпроизвел = регСведКладовщик.ФизическоеЛицо; 
		
		ОбластьМакета.Параметры.Доверенность1 = ""; // бух = рук
	//	ОбластьМакета.Параметры.Доверенность1 = регСведРук.Должность+" "+строка(регСведРук.ФизическоеЛицо)+", действующий  на основании "+регСведРук.Доверенность; 
		ОбластьМакета.Параметры.Доверенность2 = регСведГлБух.Должность+" "+строка(регСведГлБух.ФизическоеЛицо)+", действующий  на основании "+регСведГлБух.Доверенность;
		ОбластьМакета.Параметры.Доверенность3 = регСведКладовщик.Должность+" "+строка(регСведКладовщик.ФизическоеЛицо)+", действующий  на основании "+регСведКладовщик.Доверенность;
		
		
//05.11.14	Смирнов
ИначеЕсли  СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00133")
			Или СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00133") тогда 
			
		//ПредставлениеПодразделения
		Отбор1 = новый Структура;
		Отбор1.Вставить("Подразделение",справочники.Подразделения.НайтиПоКоду("00133"));
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Руководитель);
		регСведРук = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
		регСведГлБух = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Кассир);
		регСведКладовщик = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
	
		ОбластьМакета.Параметры.ФИОразрешил = регСведРук.ФизическоеЛицо; ;      
		ОбластьМакета.Параметры.ДолжностьРуководителя = регСведРук.Должность;
		
		ОбластьМакета.Параметры.ФИОглБух	= регСведГлБух.ФизическоеЛицо; 
		
		ОбластьМакета.Параметры.ДолжностьКладовщика = регСведКладовщик.Должность;
		ОбластьМакета.Параметры.ФИОпроизвел = регСведКладовщик.ФизическоеЛицо; 
		
		ОбластьМакета.Параметры.Доверенность1 = ""; // бух = рук
	//	ОбластьМакета.Параметры.Доверенность1 = регСведРук.Должность+" "+строка(регСведРук.ФизическоеЛицо)+", действующий  на основании "+регСведРук.Доверенность; 
		ОбластьМакета.Параметры.Доверенность2 = регСведГлБух.Должность+" "+строка(регСведГлБух.ФизическоеЛицо)+", действующий  на основании "+регСведГлБух.Доверенность;
		ОбластьМакета.Параметры.Доверенность3 = регСведКладовщик.Должность+" "+строка(регСведКладовщик.ФизическоеЛицо)+", действующий  на основании "+регСведКладовщик.Доверенность;	

	иначе //Яршинторг	
		ОбластьМакета.Параметры.ФИОразрешил = "Фролов А.И.";
		//ОбластьМакета.Параметры.Доверенность1 = "Зав.складом Фролов А.И. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/21 от 01.07.2009 г.";
		ОбластьМакета.Параметры.Доверенность1 = "Зав.складом Фролов А.И. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/20/2 от 26.07.2011 г.";
		
		ОбластьМакета.Параметры.ФИОглБух	= "Короткова Е.Ю.";
		//ОбластьМакета.Параметры.Доверенность2 = "Бухгалтер Короткова Е.Ю. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/09 от 29.03.2010 г.";
		ОбластьМакета.Параметры.Доверенность2 = "Бухгалтер Короткова Е.Ю. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/20/2 от 26.07.2011 г.";
		
		Если СсылкаНаОбъект.Дата >= '20150902' Тогда  //+++ 07.09.2015 - без Коротковой со 02.09.2015г.
			ОбластьМакета.Параметры.ФИОглБух	= ""; 
			ОбластьМакета.Параметры.Доверенность2 = "";
		КонецЕсли;	
			
		//Орлов ++
		Если СсылкаНаОбъект.Дата < Дата("20130401000000") Тогда
			//ОбластьМакета.Параметры.Доверенность3 = "Старший кладовщик Гаричев Д.Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/37 от 01.12.2010 г.";	
			ОбластьМакета.Параметры.Доверенность3 = "Старший кладовщик Гаричев Д.Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/20/2 от 26.07.2011 г.";
		Иначе
			ОбластьМакета.Параметры.ФИОглБух1	= "Невежина И. Н.";
			ОбластьМакета.Параметры.Доверенность3 = "Бухгалтер Невежина И. Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/19 от 01.04.2013 г.";
			ОбластьМакета.Параметры.Доверенность4 = "Старший кладовщик Гаричев Д.Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/20/2 от 26.07.2011 г.";
			ОбластьМакета.Параметры.ФИОглБух2   = "Князева И. И.";
			ОбластьМакета.Параметры.Доверенность5 = "Старший кладовщик Цверава В.У. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/25/1 от 31.05.2013 г.";
			ОбластьМакета.Параметры.Доверенность6 = "Бухгалтер Князева И. И. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/62 от 13.12.2013 г.";
		КонецЕсли;
		ОбластьМакета.Параметры.ФИОпроизвел = "Фролов А.И.";
	КонецЕсли;
	
	//2013.11.14
	Если СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.НайтиПоКоду("Я0004") Тогда //ФормулаАвто
		ОбластьМакета.Параметры.ДолжностьРуководителя = "Генеральный директор";
		ОбластьМакета.Параметры.ФИОразрешил = "Зайцева Н.С.";  
		ОбластьМакета.Параметры.ФИОглБух = "Зайцева Н.С.";
		ОбластьМакета.Параметры.ФИОглБух1 = "";
		ОбластьМакета.Параметры.ФИОглБух2 = "";
		ОбластьМакета.Параметры.ФИОпроизвел = "";
		ОбластьМакета.Параметры.Доверенность1 = "";
		ОбластьМакета.Параметры.Доверенность2 = "";
		ОбластьМакета.Параметры.Доверенность3 = "";
		ОбластьМакета.Параметры.Доверенность4 = "";
		ОбластьМакета.Параметры.Доверенность5 = "";
		ОбластьМакета.Параметры.Доверенность6 = "";
	//А.А.	
	ИначеЕсли СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.ФормулаАвтоПлюс Тогда //ФормулаАвтоПлюс
		ОбластьМакета.Параметры.ДолжностьРуководителя = "Генеральный директор";
		ОбластьМакета.Параметры.ФИОразрешил = "Курапова Е.А.";  
		ОбластьМакета.Параметры.ФИОглБух = "Курапова Е.А.";
		ОбластьМакета.Параметры.ФИОглБух1 = "";
		ОбластьМакета.Параметры.ФИОглБух2 = "";
		ОбластьМакета.Параметры.ФИОпроизвел = "";
		ОбластьМакета.Параметры.Доверенность1 = "";
		ОбластьМакета.Параметры.Доверенность2 = "";
		ОбластьМакета.Параметры.Доверенность3 = "";
		ОбластьМакета.Параметры.Доверенность4 = "";
		ОбластьМакета.Параметры.Доверенность5 = "";
		ОбластьМакета.Параметры.Доверенность6 = "";
	//ОЛ 29.01.2015 для экспорта
	ИначеЕсли СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.ШинтрейдЯрославль Тогда //ФормулаАвто
		ОбластьМакета.Параметры.ДолжностьРуководителя = "Директор";
		ОбластьМакета.Параметры.ФИОразрешил = "Захаров В.В.";  
		ОбластьМакета.Параметры.ФИОглБух = "Захаров В.В.";
		ОбластьМакета.Параметры.ФИОглБух1 = "";
		ОбластьМакета.Параметры.ФИОглБух2 = "";
		ОбластьМакета.Параметры.ФИОпроизвел = "";
		ОбластьМакета.Параметры.Доверенность1 = "";
		ОбластьМакета.Параметры.Доверенность2 = "";
		ОбластьМакета.Параметры.Доверенность3 = "";
		ОбластьМакета.Параметры.Доверенность4 = "";
		ОбластьМакета.Параметры.Доверенность5 = "";
		ОбластьМакета.Параметры.Доверенность6 = "";
	КонецЕсли;
	
	Если НЕ ЗначениеНеЗаполнено(ЕдиницаИзмеренияВеса) И ИтогоМассаБрутто > 0 Тогда
		ОбластьМакета.Параметры.МассаГрузаПрописью = ЧислоПрописью(ИтогоМассаБрутто, ,",,,,,,,,0")+ " " +ЕдиницаИзмеренияВеса.Наименование + ".";
	КонецЕсли;
	
	Если ИтогоМест > 0 Тогда
		ОбластьМакета.Параметры.ВсегоМестПрописью = ЧислоПрописью(ИтогоМест, ,",,,,,,,,0");
	КонецЕсли;
	
	ОбластьМакета.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоСтрок, ,",,,,,,,,0");
	мВалютаРегламентированногоУчета   = Константы.ВалютаРегламентированногоУчета.Получить();
	ОбластьМакета.Параметры.СуммаПрописью = СформироватьСуммуПрописью(ИтогоСуммаСНДС, мВалютаРегламентированногоУчета);
	
	//+++
	//ОбластьМакета.Параметры.АвтомобильТелефон = ?(СокрЛП(ссылкаНаОбъект.МаркаАвтомобиля)="" и СокрЛП(ссылкаНаОбъект.ГосНомерАвтомобиля)="", "",
	//СокрЛП(ссылкаНаОбъект.МаркаАвтомобиля)+" "+СокрЛП(ссылкаНаОбъект.ГосНомерАвтомобиля)+",")
	//+?(СокрЛП(Шапка.ФизЛицоДоверенности)="","", " Водитель: "+СокрЛП(Шапка.ФизЛицоДоверенности)+",")
	//+?(сокрЛП(ссылкаНаОбъект.ВидПеревозки)="", "", " тел.:"+СокрЛП(ссылкаНаОбъект.ВидПеревозки));
	//ТабДокумент.Вывести(ОбластьМакета);
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху              = 0;
	ТабДокумент.ПолеСлева               = 0;
	ТабДокумент.ПолеСнизу               = 0;
	ТабДокумент.ПолеСправа              = 0;
	ТабДокумент.РазмерКолонтитулаСверху = 0;
	ТабДокумент.РазмерКолонтитулаСнизу  = 0;
	ТабДокумент.АвтоМасштаб             = Истина;
	ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;
	
	Возврат ТабДокумент;
	
КонецФункции // Печать


функция ПолучитьКладовщика() Экспорт
	
	Отбор = Новый Структура("СтруктурнаяЕдиница", ЭтотОбъект.СсылкаНаОбъект.СкладОрдер);
	СрезПоследних   = РегистрыСведений.ОтветственныеЛица.СрезПоследних(ЭтотОбъект.СсылкаНаОбъект.Дата, Отбор);
	 Если СрезПоследних <> неопределено и СрезПоследних.Количество()>0 Тогда
		Кладовщик = СрезПоследних[0].ФизическоеЛицо.Наименование;
	 Иначе
	 	Кладовщик = "";
	 КонецЕсли;	
	 
	 возврат Кладовщик;
КонецФункции 


 
Процедура ПолучитьМассивСлов(Слово,массивСлов)
	Если СтрДлина(СокрЛП(Слово))=0 Тогда
		Возврат;
	КонецЕсли;	
	позицияП=Найти(Слово, " ");
	Если позицияП>0 Тогда
		массивСлов.Добавить(СокрЛП(Сред(Слово,1,позицияП-1)));
		СловоДляАнализа=СокрЛП(Прав (Слово,СтрДлина(Слово)-позицияП));
		ПолучитьМассивСлов(СловоДляАнализа,массивСлов);
	Иначе
		массивСлов.Добавить(СокрЛП(Слово));
	КонецЕсли;	
КонецПроцедуры

