Перем Диалог;

Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ВыполнитьЗагрузку(Кнопка)
	// Вставить содержимое обработчика.
	
	Если (ЗагружатьСклад) Тогда 		
		ЗагрузитьСклад();		
	КонецЕсли;
	
	Если (ЗагружатьПоступления) Тогда 		
		ЗагрузитьПоступления();		
	КонецЕсли;
	
	Если (ЗагружатьПродажи) Тогда 		
		ЗагрузитьПродажи();		
	КонецЕсли;
	
	Если (ЗагружатьДДС) Тогда 		
		ЗагрузитьДДС();		
	КонецЕсли;
	
	Если (ЗагружатьПриходДенег) Тогда 		
		ЗагрузитьПриходДенег();		
	КонецЕсли;
	
	Если (ЗагружатьОплатыПоставщикам) Тогда 		
		ЗагрузитьОплатыПоставщикам();		
	КонецЕсли;
	
	Если (ЗагружитьКредиты) Тогда 		
		ЗагрузитьКредиты();		
	КонецЕсли;
	
	Если (ЗагрузитьБалансПрибыль) Тогда 		
		ЗагрузитьБАлансПрибыль();		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗагрузитьСклад()
	
	Объект = СсылкаНаОбъект.ПолучитьОбъект();
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		Сообщить("Файл не существует!");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист 	= Excel.Sheets(НомерЛистаШтСклад);
	Исключение
		Сообщить("Ошибка. Возможно неверно указан номер листа книги Excel.");
		Возврат ложь;
	КонецПопытки;
	
	КолонкаМенеджер = ПерваяКолонкаСкладШт;
	
	Объект.Склад.Очистить();
	
	Для сч=ПерваяСтрокаСкладШт по ПоследняяСтрокаСкладШт Цикл
		ОбработкаПрерыванияПользователя();
		Менеджер = СсылкаНаОбъект.Ответственный;
		
		// Смотрим
		НГ 				= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+1).Value);
		Программа 		= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+2).Value);
		СкладНаНачало 	= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+3).Value);
		Себестоимость 	= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+4).Value);
		СебестоимостьЕд	= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+5).Value);
		Месяц1			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+6).Value);
		Месяц2			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+7).Value);
		Месяц3			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+8).Value);
		Месяц4			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+9).Value);
		Месяц5			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+10).Value);
		Месяц6			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+11).Value);
		
		НГСпр = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(НГ);
		ПрСпр = Справочники.Производители.НайтиПоНаименованию(Программа);
		
		СтрУ = Объект.Склад.Добавить();
		СтрУ.Менеджер = Менеджер;
		СтрУ.Разрез1 = НГСпр;
		СтрУ.Разрез2 = ПрСпр;
		СтрУ.ИтогоНачалоПериода = СкладНаНачало;
		СтрУ.СебестоимостьНаНачалоПериода = Себестоимость;
		СтрУ.СредняяЦена = СебестоимостьЕд;
		СтрУ.Месяц1Количество = Месяц1;
		СтрУ.Месяц2Количество = Месяц2;
		СтрУ.Месяц3Количество = Месяц3;
		СтрУ.Месяц4Количество = Месяц4;
		СтрУ.Месяц5Количество = Месяц5;
		СтрУ.Месяц6Количество = Месяц6;
		
	КонецЦикла;
	
	//////////////////////////////////////////////////////////////////////////////////////////////////	
	//////////////////////////////////////////////////////////////////////////////////////////////////	
	//////////////////////////////////////////////////////////////////////////////////////////////////	
	
	Попытка
		ExcelЛист = Excel.Sheets(НомерЛистаРубСклад);
	Исключение
		Сообщить("Ошибка. Возможно неверно указан номер листа книги Excel.");
		Возврат ложь;
	КонецПопытки;
	
	
	КолонкаМенеджер = ПерваяКолонкаСкладРуб;
	
	Для сч=ПерваяСтрокаСкладРуб по ПоследняяСтрокаСкладРуб Цикл
		ОбработкаПрерыванияПользователя();
		Менеджер = СсылкаНаОбъект.Ответственный;
		
		// Смотрим
		НГ 				= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+1).Value);
		Программа 		= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+2).Value);
		СкладНаНачало 	= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+3).Value);
		Себестоимость 	= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+4).Value);
		СебестоимостьЕд	= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+5).Value);
		Месяц1			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+6).Value);
		Месяц2			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+7).Value);
		Месяц3			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+8).Value);
		Месяц4			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+9).Value);
		Месяц5			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+10).Value);
		Месяц6			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+11).Value);
		
		НГСпр = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(НГ);
		ПрСпр = Справочники.Производители.НайтиПоНаименованию(Программа);
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("Менеджер",Менеджер);
		Отбор.Вставить("Разрез1",НГспр);
		Отбор.Вставить("Разрез2",ПрСпр);
		
		МассивСтр = Объект.Склад.НайтиСтроки(Отбор);
		
		Если МассивСтр.Количество()=0 Тогда 
			СтрУ = Объект.Склад.Добавить();
		Иначе 
			СтрУ = МассивСтр[0];
		КонецЕсли;
		
		СтрУ.Менеджер = Менеджер;
		СтрУ.Разрез1 = НГСпр;
		СтрУ.Разрез2 = ПрСпр;
		СтрУ.ИтогоНачалоПериода = СкладНаНачало;
		СтрУ.СебестоимостьНаНачалоПериода = Себестоимость;
		СтрУ.СредняяЦена = СебестоимостьЕд;
		СтрУ.Месяц1Сумма = Месяц1;
		СтрУ.Месяц2Сумма = Месяц2;
		СтрУ.Месяц3Сумма = Месяц3;
		СтрУ.Месяц4Сумма = Месяц4;
		СтрУ.Месяц5Сумма = Месяц5;
		СтрУ.Месяц6Сумма = Месяц6;
		
   	КонецЦикла;
	
	Объект.Записать();
	Оповестить("ОбновлениеИзОбработкиЗаполнения",,Этаформа);
	
КонецФункции

Функция ЗагрузитьПоступления()
	
	Объект = СсылкаНаОбъект.ПолучитьОбъект();
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		Сообщить("Файл не существует!");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист 	= Excel.Sheets(НомерЛистаШтПоступления);
	Исключение
		Сообщить("Ошибка. Возможно неверно указан номер листа книги Excel.");
		Возврат ложь;
	КонецПопытки;
	
	КолонкаМенеджер = ПерваяКолонкаПоступленияШт;
	
	Объект.Поступления.Очистить();
	
	Для сч=ПерваяСтрокаПоступленияШт по ПоследняястрокаПоступленияШт Цикл
		ОбработкаПрерыванияПользователя();
		Менеджер = СсылкаНаОбъект.Ответственный;
		
		// Смотрим
		НГ 				= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+1).Value);
		Программа 		= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+2).Value);
		ВхЦена 			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+3).Value);
		Месяц1			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+4).Value);
		Месяц2			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+5).Value);
		Месяц3			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+6).Value);
		Месяц4			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+7).Value);
		Месяц5			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+8).Value);
		Месяц6			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+9).Value);
		
		НГСпр = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(НГ);
		ПрСпр = Справочники.Производители.НайтиПоНаименованию(Программа);
		
		СтрУ = Объект.Поступления.Добавить();
		СтрУ.Менеджер = Менеджер;
		СтрУ.Разрез1 = НГСпр;
		СтрУ.Разрез2 = ПрСпр;
		СтрУ.ВходнаяЦена = ВхЦена;
		СтрУ.Месяц1Количество = Месяц1;
		СтрУ.Месяц2Количество = Месяц2;
		СтрУ.Месяц3Количество = Месяц3;
		СтрУ.Месяц4Количество = Месяц4;
		СтрУ.Месяц5Количество = Месяц5;
		СтрУ.Месяц6Количество = Месяц6;
		
	КонецЦикла;
	
	//////////////////////////////////////////////////////////////////////////////////////////////////	
	//////////////////////////////////////////////////////////////////////////////////////////////////	
	//////////////////////////////////////////////////////////////////////////////////////////////////	
	
	Попытка
		ExcelЛист = Excel.Sheets(НомерЛистаРубПоступления);
	Исключение
		Сообщить("Ошибка. Возможно неверно указан номер листа книги Excel.");
		Возврат ложь;
	КонецПопытки;
	
	
	КолонкаМенеджер = ПерваяКолонкаПоступленияРуб;
	
	Для сч=ПерваяСтрокаПоступленияРуб по ПоследняястрокаПоступленияРуб Цикл
		ОбработкаПрерыванияПользователя();
		Менеджер = СсылкаНаОбъект.Ответственный;
		
		// Смотрим
		НГ 				= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+1).Value);
		Программа 		= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+2).Value);
		Месяц1			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+3).Value);
		Месяц2			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+4).Value);
		Месяц3			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+5).Value);
		Месяц4			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+6).Value);
		Месяц5			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+7).Value);
		Месяц6			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+8).Value);
		
		НГСпр = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(НГ);
		ПрСпр = Справочники.Производители.НайтиПоНаименованию(Программа);
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("Менеджер",Менеджер);
		Отбор.Вставить("Разрез1",НГспр);
		Отбор.Вставить("Разрез2",ПрСпр);
		
		МассивСтр = Объект.Поступления.НайтиСтроки(Отбор);
		
		Если МассивСтр.Количество()=0 Тогда 
			СтрУ = Объект.Поступления.Добавить();
		Иначе 
			СтрУ = МассивСтр[0];
		КонецЕсли;
		
		СтрУ.Менеджер = Менеджер;
		СтрУ.Разрез1 = НГСпр;
		СтрУ.Разрез2 = ПрСпр;
		СтрУ.Месяц1Сумма = Месяц1;
		СтрУ.Месяц2Сумма = Месяц2;
		СтрУ.Месяц3Сумма = Месяц3;
		СтрУ.Месяц4Сумма = Месяц4;
		СтрУ.Месяц5Сумма = Месяц5;
		СтрУ.Месяц6Сумма = Месяц6;
		
   	КонецЦикла;
	
	Объект.Записать();
	Оповестить("ОбновлениеИзОбработкиЗаполнения",,Этаформа);
	
КонецФункции

Функция ЗагрузитьПродажи()
	
	Объект = СсылкаНаОбъект.ПолучитьОбъект();
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		Сообщить("Файл не существует!");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист 	= Excel.Sheets(НомерЛистаШтПродажи);
	Исключение
		Сообщить("Ошибка. Возможно неверно указан номер листа книги Excel.");
		Возврат ложь;
	КонецПопытки;
	
	КолонкаМенеджер = ПерваяКолонкаШтПродажи;
	
	Объект.ПланПродаж.Очистить();
	
	Для сч=ПерваяСтрокаШтПродажи по Последняястрокаштпродажи Цикл
		ОбработкаПрерыванияПользователя();
		Менеджер = СсылкаНаОбъект.Ответственный;
		
		// Смотрим
		НГ 				= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+1).Value);
		Программа 		= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+2).Value);
		Наценка			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+3).Value);
		Месяц1			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+4).Value);
		Месяц2			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+5).Value);
		Месяц3			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+6).Value);
		Месяц4			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+7).Value);
		Месяц5			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+8).Value);
		Месяц6			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+9).Value);
		
		НГСпр = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(НГ);
		ПрСпр = Справочники.Производители.НайтиПоНаименованию(Программа);
		
		СтрУ = Объект.ПланПродаж.Добавить();
		СтрУ.Менеджер = Менеджер;
		СтрУ.Разрез1 = НГСпр;
		СтрУ.Разрез2 = ПрСпр;
		СтрУ.Наценка = Наценка;
		СтрУ.Месяц1Количество = Месяц1;
		СтрУ.Месяц2Количество = Месяц2;
		СтрУ.Месяц3Количество = Месяц3;
		СтрУ.Месяц4Количество = Месяц4;
		СтрУ.Месяц5Количество = Месяц5;
		СтрУ.Месяц6Количество = Месяц6;
		
	КонецЦикла;
	
	//////////////////////////////////////////////////////////////////////////////////////////////////	
	//////////////////////////////////////////////////////////////////////////////////////////////////	
	//////////////////////////////////////////////////////////////////////////////////////////////////	
	
	Попытка
		ExcelЛист = Excel.Sheets(НомерЛистаРубПродажи);
	Исключение
		Сообщить("Ошибка. Возможно неверно указан номер листа книги Excel.");
		Возврат ложь;
	КонецПопытки;
	
	
	КолонкаМенеджер = ПерваяКолонкаРубПродажи;
	
	Для сч=ПерваяСтрокаРубПродажи по Последняястрокарубпродажи Цикл
		ОбработкаПрерыванияПользователя();
		Менеджер = СсылкаНаОбъект.Ответственный;
		
		// Смотрим
		НГ 				= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+1).Value);
		Программа 		= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+2).Value);
		Месяц1			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+4).Value);
		Месяц2			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+5).Value);
		Месяц3			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+6).Value);
		Месяц4			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+7).Value);
		Месяц5			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+8).Value);
		Месяц6			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+9).Value);
		
		НГСпр = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(НГ);
		ПрСпр = Справочники.Производители.НайтиПоНаименованию(Программа);
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("Менеджер",Менеджер);
		Отбор.Вставить("Разрез1",НГспр);
		Отбор.Вставить("Разрез2",ПрСпр);
		
		МассивСтр = Объект.ПланПродаж.НайтиСтроки(Отбор);
		
		Если МассивСтр.Количество()=0 Тогда 
			СтрУ = Объект.ПланПродаж.Добавить();
		Иначе 
			СтрУ = МассивСтр[0];
		КонецЕсли;
		
		СтрУ.Менеджер = Менеджер;
		СтрУ.Разрез1 = НГСпр;
		СтрУ.Разрез2 = ПрСпр;
		СтрУ.Месяц1Сумма = Месяц1;
		СтрУ.Месяц2Сумма = Месяц2;
		СтрУ.Месяц3Сумма = Месяц3;
		СтрУ.Месяц4Сумма = Месяц4;
		СтрУ.Месяц5Сумма = Месяц5;
		СтрУ.Месяц6Сумма = Месяц6;
		
   	КонецЦикла;
	
	Объект.Записать();
	Оповестить("ОбновлениеИзОбработкиЗаполнения",,Этаформа);
	
КонецФункции

Функция ЗагрузитьДДС()
	Объект = СсылкаНаОбъект.ПолучитьОбъект();
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		Сообщить("Файл не существует!");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист 	= Excel.Sheets(НомерЛистаДДС);
	Исключение
		Сообщить("Ошибка. Возможно неверно указан номер листа книги Excel.");
		Возврат ложь;
	КонецПопытки;
	
	КолонкаМенеджер = ПерваяКолонкаДДС;
	
	Объект.ДДС.Очистить();
	
	Для сч=ПерваяСтрокаДДС по ПоследняяСтрокаДДС Цикл
		ОбработкаПрерыванияПользователя();
		Менеджер = СсылкаНаОбъект.Ответственный;
		
		// Смотрим
		Статья 			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер).Value);
		Месяц1			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+1).Value);
		Месяц2			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+2).Value);
		Месяц3			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+3).Value);
		Месяц4			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+4).Value);
		Месяц5			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+5).Value);
		Месяц6			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+6).Value);
		
		СтрУ = Объект.ДДС.Добавить();
		СтрУ.Статья = Статья;
		СтрУ.Месяц1Сумма = Месяц1;
		СтрУ.Месяц2Сумма = Месяц2;
		СтрУ.Месяц3Сумма = Месяц3;
		СтрУ.Месяц4Сумма = Месяц4;
		СтрУ.Месяц5Сумма = Месяц5;
		СтрУ.Месяц6Сумма = Месяц6;
		
	КонецЦикла;
	
	Объект.Записать();
	Оповестить("ОбновлениеИзОбработкиЗаполнения",,Этаформа);
	
КонецФункции

Функция ЗагрузитьПриходДенег()
	Объект = СсылкаНаОбъект.ПолучитьОбъект();
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		Сообщить("Файл не существует!");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист 	= Excel.Sheets(НомерЛистаПриходДенег);
	Исключение
		Сообщить("Ошибка. Возможно неверно указан номер листа книги Excel.");
		Возврат ложь;
	КонецПопытки;
	
	КолонкаМенеджер = ПерваяКолонкаПриходДенег;
	
	Объект.ПриходДенег.Очистить();
	
	Для сч=ПерваяСтрокаПриходДенег по ПоследняяСтрокаПриходДенег Цикл
		ОбработкаПрерыванияПользователя();
		Менеджер = СсылкаНаОбъект.Ответственный;
		
		// Смотрим
		НГ 				= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+1).Value);
		Программа 		= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+2).Value);
		Месяц1			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+3).Value);
		Месяц2			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+4).Value);
		Месяц3			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+5).Value);
		Месяц4			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+6).Value);
		Месяц5			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+7).Value);
		Месяц6			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+8).Value);
		
		НГСпр = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(НГ);
		ПрСпр = Справочники.Производители.НайтиПоНаименованию(Программа);
		
		СтрУ = Объект.ПриходДенег.Добавить();
		СтрУ.Менеджер = Менеджер;
		СтрУ.Разрез1 = НГСпр;
		СтрУ.Разрез2 = ПрСпр;
		СтрУ.Месяц1Сумма = Месяц1;
		СтрУ.Месяц2Сумма = Месяц2;
		СтрУ.Месяц3Сумма = Месяц3;
		СтрУ.Месяц4Сумма = Месяц4;
		СтрУ.Месяц5Сумма = Месяц5;
		СтрУ.Месяц6Сумма = Месяц6;
		
	КонецЦикла;
	
	Объект.Записать();
	Оповестить("ОбновлениеИзОбработкиЗаполнения",,Этаформа);
	
КонецФункции

Функция ЗагрузитьОплатыПоставщикам()
	Объект = СсылкаНаОбъект.ПолучитьОбъект();
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		Сообщить("Файл не существует!");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист 	= Excel.Sheets(НомерЛистаОплатыПоставщикам);
	Исключение
		Сообщить("Ошибка. Возможно неверно указан номер листа книги Excel.");
		Возврат ложь;
	КонецПопытки;
	
	КолонкаМенеджер = ПерваяКолонкаОплатаПоставщикам;
	
	Объект.ОплатаПоставщикам.Очистить();
	
	Для сч=ПерваяСтрокаОплатаПостиавщикам по ПоследняяСтрокаОплатаПоставщикам Цикл
		ОбработкаПрерыванияПользователя();
		Менеджер = СсылкаНаОбъект.Ответственный;
		
		// Смотрим
		НГ 				= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+1).Value);
		Программа 		= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+2).Value);
		Месяц1			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+3).Value);
		Месяц2			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+4).Value);
		Месяц3			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+5).Value);
		Месяц4			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+6).Value);
		Месяц5			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+7).Value);
		Месяц6			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+8).Value);
		
		НГСпр = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(НГ);
		ПрСпр = Справочники.Производители.НайтиПоНаименованию(Программа);
		
		СтрУ = Объект.ОплатаПоставщикам.Добавить();
		СтрУ.Менеджер = Менеджер;
		СтрУ.Разрез1 = НГСпр;
		СтрУ.Разрез2 = ПрСпр;
		СтрУ.Месяц1Сумма = Месяц1;
		СтрУ.Месяц2Сумма = Месяц2;
		СтрУ.Месяц3Сумма = Месяц3;
		СтрУ.Месяц4Сумма = Месяц4;
		СтрУ.Месяц5Сумма = Месяц5;
		СтрУ.Месяц6Сумма = Месяц6;
		
	КонецЦикла;
	
	Объект.Записать();
	Оповестить("ОбновлениеИзОбработкиЗаполнения",,Этаформа);
		
КонецФункции

Функция ЗагрузитьКредиты()
	Объект = СсылкаНаОбъект.ПолучитьОбъект();
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		Сообщить("Файл не существует!");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист 	= Excel.Sheets(НомерЛистаКредиты);
	Исключение
		Сообщить("Ошибка. Возможно неверно указан номер листа книги Excel.");
		Возврат ложь;
	КонецПопытки;
	
	КолонкаМенеджер = ПерваяКолонкаКредиты;
	
	Объект.Кредиты.Очистить();
	
	БанкХ="";
	НомерДоговораХ = "";
	ЛимитПоДоговоруХ = "";
	
	Для сч=ПерваяСтрокаКредиты по ПоследняяСтрокаКредиты Цикл
		ОбработкаПрерыванияПользователя();
		Менеджер = СсылкаНаОбъект.Ответственный;
		
		// Смотрим
		Банк 			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер).Value);
		НомерДоговора 	= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+1).Value);
		ЛимитПоДоговору	= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+2).Value);
		Дата			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+3).Value);
		Месяц1			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+4).Value);
		Месяц2			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+6).Value);
		Месяц3			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+8).Value);
		Месяц4			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+10).Value);
		Месяц5			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+12).Value);
		Месяц6			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+14).Value);
		Месяц7			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+16).Value);
		Месяц8			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+18).Value);
		Месяц9			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+20).Value);
		Месяц10			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+22).Value);
		Месяц11			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+24).Value);
		Месяц12			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+26).Value);
		
		Если Банк<>БанкХ Тогда 
			БанкХ = Банк;
		КонецЕсли;
		
		Если НомерДоговора<>НомерДоговораХ Тогда 
			НомерДоговораХ = НомерДоговора;
		КонецЕсли;
		
		Если ЛимитПоДоговору<>ЛимитПоДоговоруХ Тогда 
			ЛимитПоДоговоруХ = ЛимитПоДоговору;
		КонецЕсли;
		
		СтрУ 			= Объект.Кредиты.Добавить();
		СтрУ.Банк 		= БанкХ;
		СтрУ.НомерДоговора = НомерДоговораХ;
		СтрУ.ЛимитПоДоговору = ЛимитПоДоговоруХ;
		СтрУ.Дата = Дата;
		
		СтрУ.ЯнварьСуммаРуб = Месяц1;
		СтрУ.ФевральСуммаРуб = Месяц2;
		СтрУ.МартСуммаРуб = Месяц3;
		СтрУ.АпрельСуммаРуб = Месяц4;
		СтрУ.МайСуммаРуб = Месяц5;
		СтрУ.ИюньСуммаРуб = Месяц6;
		СтрУ.ИюльСуммаРуб = Месяц7;
		СтрУ.АвгустСуммаРуб = Месяц8;
		СтрУ.СентябрьСуммаРуб = Месяц9;
		СтрУ.ОктябрьСуммаРуб = Месяц10;
		СтрУ.НоябрьСуммаРуб = Месяц11;
		СтрУ.ДекабрьСуммаРуб = Месяц12;
		
		
		
	КонецЦикла;
	
	Объект.Записать();
	Оповестить("ОбновлениеИзОбработкиЗаполнения",,Этаформа);
	
КонецФункции

Функция ЗагрузитьБалансПрибыль()
	Объект = СсылкаНаОбъект.ПолучитьОбъект();
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		Сообщить("Файл не существует!");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист 	= Excel.Sheets(НомерЛистаБалансПрибыль);
	Исключение
		Сообщить("Ошибка. Возможно неверно указан номер листа книги Excel.");
		Возврат ложь;
	КонецПопытки;
	
	КолонкаМенеджер = ПерваяКолонкаБалансПрибыль;
	
	Объект.ДДС.Очистить();
	
	Для сч=ПерваяСтрокаБалансПрибыль по ПоследняяСтрокаБалансПрибыль Цикл
		ОбработкаПрерыванияПользователя();
		Менеджер = СсылкаНаОбъект.Ответственный;
		
		// Смотрим
		Статья 			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер).Value);
		Месяц1			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+1).Value);
		Месяц2			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+2).Value);
		Месяц3			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+3).Value);
		Месяц4			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+4).Value);
		Месяц5			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+5).Value);
		Месяц6			= СокрЛП(ExcelЛист.Cells(сч,КолонкаМенеджер+6).Value);
		
		СтрУ = Объект.БалансПрибыль.Добавить();
		СтрУ.Статья = Статья;
		СтрУ.Месяц1Сумма = Месяц1;
		СтрУ.Месяц2Сумма = Месяц2;
		СтрУ.Месяц3Сумма = Месяц3;
		СтрУ.Месяц4Сумма = Месяц4;
		СтрУ.Месяц5Сумма = Месяц5;
		СтрУ.Месяц6Сумма = Месяц6;
		
	КонецЦикла;
	
	Объект.Записать();
	Оповестить("ОбновлениеИзОбработкиЗаполнения",,Этаформа);
	
КонецФункции

Процедура ИмяФайлаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Выбран = Диалог.Выбрать();
	
	Если (Выбран) Тогда 
		ИмяФайла = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
	Каталог = Диалог.Каталог;
	//НоваяКартинка = Новый Картинка(ПутьКФайлу);
	//ЭлементыФормы.Картинка.Картинка = НоваяКартинка;
	
КонецПроцедуры

Процедура ПриОткрытии()
	// Вставить содержимое обработчика.
	УстановитьФильтр();
КонецПроцедуры

Процедура УстановитьФильтр()
	//Если Не РольДоступна("яштФинДиректор") Тогда 
	//	
	//	ЭлементыФормы.НадписьНаименованиеКнигиШтСклад8.Доступность = ложь;
	//	ЭлементыФормы.НаименованиеКнигиШтСклад8.Доступность = ложь;
	//	ЭлементыФормы.НадписьПерваяКолонка24.Доступность = ложь;
	//	ЭлементыФормы.ПерваяКолонка24.Доступность = ложь;
	//	ЭлементыФормы.НадписьПерваяКолонка25.Доступность = ложь;
	//	ЭлементыФормы.ПерваяКолонка25.Доступность = ложь;
	//	ЭлементыФормы.НадписьПерваяКолонка26.Доступность = ложь;
	//	ЭлементыФормы.ПерваяКолонка26.Доступность = ложь;
	//	ЭлементыФормы.ЗагружатьДДС.Доступность = ложь;
	//	ЭлементыФормы.НадписьНаименованиеКнигиШтСклад9.Доступность = ложь;
	//	ЭлементыФормы.НадписьНаименованиеКнигиШтСклад10.Доступность = ложь;
	//	ЭлементыФормы.НаименованиеКнигиШтСклад9.Доступность = ложь;
	//	ЭлементыФормы.НаименованиеКнигиШтСклад10.Доступность = ложь;
	//	ЭлементыФормы.НадписьПерваяКолонка27.Доступность = ложь;
	//	ЭлементыФормы.НадписьПерваяКолонка30.Доступность = ложь;
	//	ЭлементыФормы.ПерваяКолонка27.Доступность = ложь;
	//	ЭлементыФормы.ПерваяКолонка30.Доступность = ложь;
	//	ЭлементыФормы.НадписьПерваяКолонка28.Доступность = ложь;
	//	ЭлементыФормы.НадписьПерваяКолонка31.Доступность = ложь;
	//	ЭлементыФормы.ПерваяКолонка28.Доступность = ложь;
	//	ЭлементыФормы.ПерваяКолонка31.Доступность = ложь;
	//	ЭлементыФормы.НадписьПерваяКолонка29.Доступность = ложь;
	//	ЭлементыФормы.НадписьПерваяКолонка32.Доступность = ложь;
	//	ЭлементыФормы.ПерваяКолонка29.Доступность = ложь;
	//	ЭлементыФормы.ПерваяКолонка32.Доступность = ложь;
	//	ЭлементыФормы.ЗагружатьДДС1.Доступность = ложь;
	//	ЭлементыФормы.ЗагружатьДДС2.Доступность = ложь;
	//	
	//КонецЕсли;
КонецПроцедуры

Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
Диалог.Заголовок                 = "Выбрать файл доверенности";
Диалог.ПредварительныйПросмотр     = Истина;

