
Функция Печать() Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет  = ЭтотОбъект.ПолучитьМакет("Макет1");
	
	// Шапка
	Обл = Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.КонтрагентНаименование = СсылкаНаОбъект.Контрагент.НаименованиеПолное;
	ТабДок.Вывести(Обл);
	                                   	
	// Тело
	Обл = Макет.ПолучитьОбласть("Тело");
	ПараметрыКонтракта = ПолучитьПараметрыКонтракта();
	Обл.Параметры.НомерКонтракта         = ПараметрыКонтракта.НомерКонтракта;
	Обл.Параметры.ДатаКонтракта          = ПараметрыКонтракта.ДатаКонтракта;
	СуммаКонтрактаЧисло = ПараметрыКонтракта.СуммаОбеспечения;
	Обл.Параметры.СуммаОбеспеченияЧисло    = СуммаКонтрактаЧисло;
	СуммаПрописью = ЧислоПрописью(СуммаКонтрактаЧисло, "L=ru_RU", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"); // есть рубли, есть копейки
	Обл.Параметры.СуммаОбеспеченияПрописью = СуммаПрописью;
	//СуммаПрописьюРуб = ЧислоПрописью(СуммаКонтрактаЧисло, "L=ru_RU; НД = Ложь", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0"); // Есть рубли, нет копеек
	//СтрРуб = Сред(СуммаПрописьюРуб, СтрДлина(СуммаПрописью) + 2);
	//Обл.Параметры.СтрРуб = СтрРуб;
	//СуммаПрописьюРубКоп = ЧислоПрописью(СуммаКонтрактаЧисло, "L=ru_RU", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"); // Есть рубли, есть копейки
	//КопейкиПрописью = Сред(СуммаПрописьюРубКоп, СтрДлина(СуммаПрописьюРуб) + 2);
	//Обл.Параметры.КопейкиПрописью = КопейкиПрописью;
	Обл.Параметры.СтрРуб = "";
	Обл.Параметры.КопейкиПрописью = "";
	
	СрокВозвратаЧисло = 5;
	Обл.Параметры.СрокВозвратаЧисло      = СрокВозвратаЧисло;
	СрокВозвратаПрописьюДней = ЧислоПрописью(СрокВозвратаЧисло, "L=ru_RU; НД=Ложь", "день, дня, дней, м, день, дня, дней, ж, 0");  // Есть дни
	СрокВозвратаПрописью = ЧислоПрописью(СрокВозвратаЧисло, "L=ru_RU; НП=Ложь;НД=Ложь", "день, дня, дней, м, день, дня, дней, ж, 0"); // Нет дней
	Обл.Параметры.СрокВозвратаПрописью   = СрокВозвратаПрописью;
	Обл.Параметры.СтрДней = Сред(СрокВозвратаПрописьюДней, СтрДлина(СрокВозвратаПрописью) + 2);
	ТабДок.Вывести(Обл);

	// Подвал
	Обл = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Вывести(Обл);

	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Возврат ТабДок;
	
КонецФункции // Парам()

Функция ПолучитьПараметрыКонтракта()
	
	Договор = СсылкаНаОбъект.ДоговорКонтрагента;
	НомерДоговораФАП = ПолучитьНомерДоговораФАП(Договор);
	
	//Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90245");
	//ДатаКонтракта = ПолучитьЗначениеПоСвойству(Договор, Свойство);
	//Если ЗначениеЗаполнено(ДатаКонтракта) Тогда
	//	ДатаКонтракта = Формат(ДатаКонтракта, "ДФ=dd.MM.yyyy");
	//Иначе
	//	ДатаКонтракта = '00010101000000';
	//КонецЕсли;
	ДатаКонтракта = Формат(Договор.Дата, "ДФ=dd.MM.yyyy");
	
	Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90246");
	СуммаОбеспеченияЗначение = ПолучитьЗначениеПоСвойству(Договор, Свойство);
	Если НЕ ЗначениеЗаполнено(СуммаОбеспеченияЗначение) Тогда
		СуммаОбеспечения = 0;
	Иначе
		Если ТипЗнч(СуммаОбеспеченияЗначение) = Тип("Число") Тогда
			СуммаОбеспечения = СуммаОбеспеченияЗначение;
		Иначе
			Попытка
				СуммаОбеспечения = Число(СуммаОбеспеченияЗначение);
			Исключение
				#Если Клиент Тогда
					СуммаОбеспечения = 0;
					Сообщить("" + СсылкаНаОбъект + " :: Не удалось определить сумму обеспечения из договора");
				#КонецЕсли
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	СтруктРез = Новый Структура();
	СтруктРез.Вставить("НомерКонтракта"  , НомерДоговораФАП);
	СтруктРез.Вставить("ДатаКонтракта"   , ДатаКонтракта);
	СтруктРез.Вставить("СуммаОбеспечения", СуммаОбеспечения);
	
	Возврат СтруктРез;
	
КонецФункции // ПолучитьПараметрыКонтракта()

Функция ПолучитьЗначениеПоСвойству(Объект, Свойство)
	
	МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект   = Объект;
	МенеджерЗаписи.Свойство = Свойство; 
	МенеджерЗаписи.Прочитать();
	
	Возврат МенеджерЗаписи.Значение;
	
КонецФункции // ПолучитьЗначениеПоСвойству()

Функция ПолучитьНомерДоговораФАП(Договор)
	
	СвойствоНомерДоговораФАП = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90237");
	Если ЗначениеЗаполнено(СвойствоНомерДоговораФАП) Тогда
		МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект   = Договор;
		МенеджерЗаписи.Свойство = СвойствоНомерДоговораФАП; 
		МенеджерЗаписи.Прочитать();
		Если ЗначениеЗаполнено(МенеджерЗаписи.Значение) Тогда
			НомДог = МенеджерЗаписи.Значение;
		Иначе
			НомДог = Договор.Номер;
		КонецЕсли;
	Иначе
		НомДог = Договор.Номер;
	КонецЕсли;
	
	Возврат НомДог;
	
КонецФункции // ПолучитьНомерДоговораФАП()