
Процедура ЗакончитьРедактирование(Кнопка)
	// Вставить содержимое обработчика.
	Закрыть(ЭлементыФормы.Код.ПолучитьТекст());
КонецПроцедуры

Процедура КоманднаяПанель1Параметр(Кнопка)
	// Вставить содержимое обработчика.
	Строка = Параметры.ВыбратьСтроку();
	Если Строка <> Неопределено Тогда
		ЭлементыФормы.Код.ВыделенныйТекст = "Параметры." + Строка.Имя;
	КонецЕсли;
	
КонецПроцедуры

Процедура КоманднаяПанель1ГлобальныйПараметр(Кнопка)
	// Вставить содержимое обработчика.
	Строка = ПараметрыТестов.ВыбратьСтроку();
	Если Строка <> Неопределено Тогда
		ЭлементыФормы.Код.ВыделенныйТекст = "ГлобальныеПараметры." + Строка.Имя;
	КонецЕсли;
КонецПроцедуры

Процедура КоманднаяПанель1НайтиСсылку(Кнопка)
	// Вставить содержимое обработчика.
	ЭлементыФормы.Код.ВыделенныйТекст = "НайтиСсылку(""<пустая ссылка>"",""<параметры поиска>"")";
КонецПроцедуры
