
Перем ТаблицаКрышки Экспорт;
Перем  ТаблицаСводная Экспорт;

Процедура ДействияФормыОтчетСформировать(Кнопка)
	
	ТабДок = ЭлементыФормы.ПолеТабличногоДокумента;
	
	Отчет(ТабДок);
	
КонецПроцедуры

Процедура Отчет(ТабДок) Экспорт
	
	ТабДок.Очистить();
	
	Если Бренд = 1 Тогда
		БрендСтр = "NZ";
	ИначеЕсли Бренд = 2 Тогда
		БрендСтр = "Alcasta";
	ИначеЕсли Бренд = 3 Тогда
		БрендСтр = "LegeArtis";
	ИначеЕсли Бренд = 4 Тогда
		БрендСтр = "YOKATTA";
	ИначеЕсли Бренд = 5 Тогда
		БрендСтр = "CROSS STREET";
	ИначеЕсли Бренд = 6 Тогда
		БрендСтр = "YST";
	ИначеЕсли Бренд = 7 Тогда
		БрендСтр = "X-Race";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
|	ЕСТЬNULL(КрышкиНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоКрышекОстаток,
|	Аналоги.Заменитель КАК Комплектующая,
|	АктуальныеТовары.Номенклатура.Код КАК Код,
|	Аналоги.Заменитель.КодСБИС КАК КомплектующаяКодСБИС,
|	Аналоги.Заменитель.Код КАК КомплектующаяКод,
|	АктуальныеТовары.Номенклатура КАК Номенклатура
|ИЗ
|	РегистрСведений.АктуальныеТовары КАК АктуальныеТовары
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Аналоги КАК Аналоги
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
|					,
|					Номенклатура.ВидТовара <> ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)
|						И НЕ Склад.ЗапретитьИспользование
|						И НЕ Склад.Транзитный) КАК КрышкиНаСкладахОстатки
|			ПО (КрышкиНаСкладахОстатки.Номенклатура = Аналоги.Заменитель)
|		ПО АктуальныеТовары.Номенклатура = Аналоги.Заменяемое
|ГДЕ
|	//Аналоги.Заменяемое.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски) И
|	АктуальныеТовары.Номенклатура.Наименование ПОДОБНО ""%" + БрендСтр + "%""
|АВТОУПОРЯДОЧИВАНИЕ";
				 	
	Запрос.УстановитьПараметр("Крышки",Справочники.Номенклатура.НайтиПоКоду("0080004"));	
	
	Выборка=Запрос.Выполнить().Выбрать();
	
	Макет = ПолучитьМакет("Отчет");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.КонецПериода= Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.Бренд = БрендСтр;
	
	ТабДок.Вывести(ОбластьЗаголовок);	
	Пока Выборка.Следующий() Цикл
		ОбластьДетали = Макет.ПолучитьОбласть("Детали");	
		ОбластьДетали.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьДетали);	
	КонецЦикла;	
	
	
КонецПроцедуры

Процедура ПриОткрытии()
	КонДата=ТекущаяДата();
КонецПроцедуры

Процедура ПолеТабличногоДокумента2ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	ТабДок=Новый ТабличныйДокумент;
	
	Если ТипЗнч(Расшифровка)=Тип("Структура") Тогда
		Если  Расшифровка.Свойство("ПотребностьКрышки") Тогда
			СтандартнаяОбработка=Ложь;
			СтруктураПоиска=Новый Структура("Комплектующая");
			СтруктураПоиска.Комплектующая=Расшифровка.ПотребностьКрышки;
			НайдСтроки=ТаблицаСводная.НайтиСтроки(СтруктураПоиска);
			
			Если НайдСтроки.Количество()>0 Тогда
				Макет=ПолучитьМакет("Макет");
				ОбластьШапка=Макет.ПолучитьОбласть("ШапкаТаблицыРасшифровка");  
				ТабДок.Вывести(ОбластьШапка);
				
				Для каждого НайдСтрока ИЗ НайдСтроки Цикл
					ОбластьДетали=Макет.ПолучитьОбласть("ДеталиРасшифровка");  
					ОбластьДетали.Параметры.Заполнить(НайдСтрока);
					ТабДок.Вывести(ОбластьДетали);
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;
	ТабДок.ТолькоПросмотр=Истина;
	ТабДок.Показать();
КонецПроцедуры

Процедура ДействияФормыВыгрузитьОстатки(Кнопка)
	Для сч=2 по 20 Цикл
		АдресЯчейкиЗначения="R"+Строка(сч)+"C6";
		ЗначениеТекст=ЭлементыФормы.ПолеТабличногоДокумента3.ПолучитьОбласть(АдресЯчейкиЗначения).ТекущаяОбласть.Текст;
		Если ЗначениеТекст<>"" И Число(ЗначениеТекст)>0 Тогда
			АдресЯчейкиКода="R"+Строка(сч)+"C2";
			ЗначениеКод=ЭлементыФормы.ПолеТабличногоДокумента3.ПолучитьОбласть(АдресЯчейкиКода).ТекущаяОбласть.Текст;
			Менеджер=РегистрыСведений.ПлановыеОстаткиТоваров.СоздатьМенеджерЗаписи();
			Менеджер.Номенклатура=Справочники.Номенклатура.НайтиПоКоду(ЗначениеКод);
			Менеджер.Период=ТекущаяДата();
			Менеджер.Количество=Число(ЗначениеТекст);
			Менеджер.Записать();
			
		КонецЕсли;
	КонецЦикла;
	Предупреждение("Остатки по крепежу выгружены. Теперь нужно сформировать отчет 171. Прайс-лист с остатками.");
КонецПроцедуры

Процедура ДействияФормыОтчетОстаткиДисковБезПривязки(Кнопка)
	ТабДок=Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ОстаткиБезПривязки");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура.Код,
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,(НЕ Номенклатура В
	|(ВЫБРАТЬ РАЗЛИЧНЫЕ Комплектующая
	|ИЗ  РегистрСведений.КомплектующиеНоменклатуры
	|ГДЕ Комплектующая.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура  ИЗ  РегистрСведений.КомплектующиеНоменклатуры
	|ГДЕ Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)
	|))
	|И Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)) КАК ТоварыНаСкладахОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура.Наименование";
	
	Результат = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаДетали = Результат.Выбрать();
	
	Пока ВыборкаДетали.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетали.Уровень());
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	ТабДок.ТолькоПросмотр=Истина;
	ТабДок.Показать();
КонецПроцедуры


ТаблицаКрышкиРасшифровка = Новый ТаблицаЗначений;
ТаблицаСводная = Новый ТаблицаЗначений;
