Процедура Отчет(МассивЗаказов)	
	Док = Печать(МассивЗаказов);
	Док.Показать();	
КонецПроцедуры

Процедура КнопкаВыполнитьНажатие(Кнопка)	
	
	ТЗЗаказов = ЗаказыПоставщиков.Выгрузить();
	МассивЗаказов = ТЗЗаказов.ВыгрузитьКолонку("Заказ");
	ТЗЗаказов.Свернуть("Контрагент");
	
	Если ТЗЗаказов.Количество() <> 1 Тогда
		Сообщить("Выбраны заказы с разными контрагентами!");
		Возврат;
	КонецЕсли;
	
	Если МассивЗаказов.Количество() > 0 Тогда
		Отчет(МассивЗаказов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаказыПоставщиковЗаказПриИзменении(Элемент)
	
	СтрокаТЧ = ЭлементыФормы.ЗаказыПоставщиков.ТекущиеДанные;
	СтрокаТЧ.Контрагент = СтрокаТЧ.Заказ.Контрагент;
	СтрокаТЧ.Количество = СтрокаТЧ.Заказ.Товары.Итог("Количество");
	СтрокаТЧ.Сумма      = СтрокаТЧ.Заказ.Товары.Итог("Сумма");
	
	СсылкаНаОбъект = СтрокаТЧ.Заказ;
	
КонецПроцедуры
