  перем ДанныеРасшифровки1;
Процедура ПриОткрытии()
	КомпоновщикМакета1 = Новый КомпоновщикМакетаКомпоновкиДанных;
	ПроцессорКомпоновкиДанных1 = Новый ПроцессорКомпоновкиДанных;
	СхемаКомпоновкиДанных1 = ЭтотОбъект.ПолучитьМакет("РасшифровкаЗатрат");
	ПараметрСКД = СхемаКомпоновкиДанных1.Параметры.НачалоПериода;
	ПараметрСКД.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	ПараметрСКД.Значение  = НачалоМесяца(НачалоПериода);                                
	
	ПараметрСКД = СхемаКомпоновкиДанных1.Параметры.КонецПериода;
	ПараметрСКД.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	ПараметрСКД.Значение  = КонецМесяца(Конецпериода);                                
	
	
	
	
	
	Если ТипЗНч(статьяЗатрат) = тип("СправочникСсылка.СтатьиЗатрат") тогда
		ПараметрСКД = СхемаКомпоновкиДанных1.Параметры.СтатьяЗатрат;
		ПараметрСКД.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		ПараметрСКД.Значение  = СтатьяЗатрат;
	конецЕсли;
	Список = Новый СписокЗначений;
	если ТипЗНч(Подразделение) = тип("СправочникСсылка.Подразделения") тогда
		список.Добавить(Подразделение);
	иначеЕсли Подразделение = "Прибылеобразующие" тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подразделения.Ссылка
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	(Подразделения.Планирование = ИСТИНА
		|				И Подразделения.ИспользоватьВБюджете = Истина
		|			ИЛИ Подразделения.Родитель.Планирование = ИСТИНА   И Подразделения.Родитель.ИспользоватьВБюджете = Истина
		|				И Подразделения.Родитель.ИспользоватьПодчиненные = ИСТИНА)";
		
		Результат = Запрос.Выполнить().Выгрузить();
		список.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Ссылка"));
		
	иначе	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подразделения.Ссылка
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	(Подразделения.Планирование = ИСТИНА
		|				И Подразделения.ИспользоватьВБюджете = ЛОЖЬ
		|			ИЛИ Подразделения.Родитель.Планирование = ИСТИНА
		|				И Подразделения.Родитель.ИспользоватьПодчиненные = ИСТИНА)";
		
		Результат = Запрос.Выполнить().Выгрузить();
		список.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Ссылка"));
		
	конецЕсли;   
	ПараметрСКД = СхемаКомпоновкиДанных1.Параметры.Подразделение;
	ПараметрСКД.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	ПараметрСКД.Значение  = Список;  
	
	ДанныеРасшифровки1 = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета1 = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки1 = КомпоновщикМакета1.Выполнить(СхемаКомпоновкиДанных1, СхемаКомпоновкиДанных1.НастройкиПоУмолчанию, ДанныеРасшифровки1);
	
	ПроцессорКомпоновкиДанных1 = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных1.Инициализировать(МакетКомпоновки1, , ДанныеРасшифровки1,истина);
	ПроцессорВывода1 = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода1.УстановитьДокумент(ЭлементыФормы.Результат);
	ПроцессорВывода1.Вывести(ПроцессорКомпоновкиДанных1);

КонецПроцедуры

Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
			перем  ВыполненноеДействие;

	СтандартнаяОбработка = Ложь;
	СхемаКомпоновкиДанных = ПолучитьМакет("РасшифровкаЗатрат");
   //Создадим и инициализируем обработчик расшифровки                    
    ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки1, Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
                                                                         
    ДоступныеДействия = Новый Массив();
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
    
     Настройки = ОбработкаРасшифровки.Выполнить(Расшифровка, ВыполненноеДействие, ДоступныеДействия,);

КонецПроцедуры
