
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура кнЗагрузитьТекущиеНажатие(Элемент)
	
	Если не ЗначениеЗаполнено(Контрагент) тогда
		Возврат;
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЦеныКлиентаСрезПоследних.Номенклатура.Код,
	             |	ЦеныКлиентаСрезПоследних.Номенклатура,
	             |	ЦеныКлиентаСрезПоследних.Цена
	             |ПОМЕСТИТЬ вт
	             |ИЗ
	             |	РегистрСведений.ЦеныКлиента.СрезПоследних(, Контрагент = &КонтрагентДляРассчетаЦен) КАК ЦеныКлиентаСрезПоследних
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	вт.НоменклатураКод,
	             |	вт.Номенклатура КАК Номенклатура,
	             |	вт.Цена
	             |ИЗ
	             |	вт КАК вт
	             |ГДЕ
	             |	вт.Цена <> 0
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Номенклатура
	             |АВТОУПОРЯДОЧИВАНИЕ";
				 Запрос.УстановитьПараметр("КонтрагентДляРассчетаЦен",Контрагент);//Справочники.Контрагенты.НайтиПоКоду("94291"));   //для ценообразования KOLESATYT
				 //Запрос.УстановитьПараметр("КонтрагентДляРассчетаЦен",Справочники.Контрагенты.НайтиПоКоду("92498"));//шинсервис
				 Рез = Запрос.Выполнить().Выбрать();
				 
				 Макет = ПолучитьМакет("Макет");
				 Область = Макет.ПолучитьОбласть("Стр");
				 
				 Пока Рез.Следующий() Цикл
					 Область.Параметры.Заполнить(рез);
					 ЭлементыФормы.ТабТовары.Вывести(Область);
				 КонецЦикла;
КонецПроцедуры

Процедура кнЗаписатьНажатие(Элемент)
	
	Если не ЗначениеЗаполнено(Контрагент) тогда
		Возврат;
	КонецЕсли;
	
	тзАртикул=Новый ТаблицаЗначений;
	тзАртикул.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка"	, , Новый КвалификаторыСтроки(10)));
	тзАртикул.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	
	Номерстроки = 0;
	Пока Номерстроки<=ЭлементыФормы.ТабТовары.ВысотаТаблицы цикл
		Артикул=СокрЛП(ЭлементыФормы.ТабТовары.Область(Номерстроки,НомерКолонкиАртикул,Номерстроки,НомерКолонкиАртикул).Текст);
		Цена=СокрЛП(ЭлементыФормы.ТабТовары.Область(Номерстроки,НомерКолонкиЦена,Номерстроки,НомерКолонкиЦена).Текст);
		Цена = СтрЗаменить(Цена,"р.","");
		Цена = СтрЗаменить(Цена,",",".");
		Цена = СтрЗаменить(Цена," ","");
		
		Если флУдалить тогда
			Цена = 0;
		КонецЕсли;
		//Цена=Число(Цена);
		//Цена=Окр(Цена);
		Если СокрЛП(Артикул)<>"" тогда
			нстр=тзАртикул.Добавить();
			нстр.Артикул=Артикул;
			нстр.Цена=Цена;
			нстр.Цена=Окр(нстр.Цена);
		КонецЕсли;
		
		Номерстроки=Номерстроки+1;
	КонецЦикла;
    Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ТабЦен.Артикул КАК АртикулКод,
	             |	ТабЦен.Цена
	             |ПОМЕСТИТЬ втАртикулЦена
	             |ИЗ
	             |	&ТабЦен КАК ТабЦен
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	&Контрагент КАК Контрагент,
	             |	Номенклатура.Ссылка КАК Номенклатура,
	             |	МАКСИМУМ(втАртикулЦена.Цена) КАК Цена,
	             |	&Дата КАК Период
	             |ИЗ
	             |	втАртикулЦена КАК втАртикулЦена
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	             |		ПО втАртикулЦена.АртикулКод = Номенклатура.Код
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Номенклатура.Ссылка";
				 Запрос.УстановитьПараметр("ТабЦен",тзАртикул);
				 Запрос.УстановитьПараметр("Контрагент",Контрагент);   //для ценообразования KOLESATYT
				 //Запрос.УстановитьПараметр("Контрагент",Справочники.Контрагенты.НайтиПоКоду("94291"));   //для ценообразования KOLESATYT
                 Запрос.УстановитьПараметр("Дата",(ТекущаяДата()));
				 Рез=Запрос.Выполнить().Выбрать();
				 
				 
				 Пока Рез.Следующий() Цикл
					МенеджерЗаписи = РегистрыСведений.ЦеныКлиента.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Рез);
                    МенеджерЗаписи.Записать();
					
				 КонецЦикла;
КонецПроцедуры

Процедура ПриОткрытии()
	НомерКолонкиАртикул=1;
	НомерКолонкицена=3;
КонецПроцедуры
