
процедура ПроверитьСуммуГотПрод(Отказ)
	delta = ГотоваяПродукция.Итог("Сумма") - ( Материалы.Итог("Сумма") + ДопЗатраты.Итог("Сумма") );
	Если delta тогда
		#Если Клиент тогда
		Сообщить("Сумма готовой продукции: "+строка(ГотоваяПродукция.Итог("Сумма"))
		+"р. отличается от суммы Материалов: "+строка(Материалы.Итог("Сумма"))
		+" и Доп.Затрат: "+строка(ДопЗатраты.Итог("Сумма"))+" на "+строка(delta)+"р.!", СтатусСообщения.Внимание);
		#КонецЕсли	
		Отказ = ИСТИНА;
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	КачествоНовый = справочники.Качество.Новый;
	
	ПроверитьСуммуГотПрод(Отказ);
	
	Если Отказ тогда
		возврат;
	КонецЕсли;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//1) регистр НезавершенноеПроизводство Расход - ВСЕ материалы списываются!
	Движения.НезавершенноеПроизводство.Записывать = Истина;
	Движения.НезавершенноеПроизводство.Очистить();
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл   
		Движение = Движения.НезавершенноеПроизводство.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаМатериалы.Номенклатура;
		Движение.Количество   = ТекСтрокаМатериалы.Количество;
		Движение.Сумма        = ТекСтрокаМатериалы.Сумма;     // сумма вторична!
	КонецЦикла;

	//2) регистр Затраты  - СТОРНИРУЮТСЯ! 
	Движения.Затраты.Записывать = Истина;
	Движения.Затраты.Очистить();
	//+++ все мат.затраты - списываются одной суммой!
		//Движение = Движения.Затраты.Добавить();
		//Движение.Период = Дата;
		//Движение.Подразделение = Подразделение;
		//Движение.СтатьяЗатрат 	 = СтатьяМатЗатрат;
		//Движение.СтатьяЗатратУпр = СтатьяМатЗатратУПР;
		//Движение.НоменклатурнаяГруппа = НомГруппаЗатрат;
		//Движение.Сумма = -Материалы.Итог("Сумма");

	//+++ доп.затраты - СТОРНО! +++	   ВСЕ доп.затраты списываются!
	Для Каждого ТекСтрокаДопЗатрат Из ДопЗатраты Цикл
		Движение = Движения.Затраты.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение;
		Движение.СтатьяЗатрат 	 = ТекСтрокаДопЗатрат.СтатьяЗатрат;
		Движение.СтатьяЗатратУпр = ТекСтрокаДопЗатрат.СтатьяЗатратУПР;
		Движение.НоменклатурнаяГруппа = НомГруппаЗатрат;
		Движение.Сумма = -ТекСтрокаДопЗатрат.Сумма;
	КонецЦикла;	
		
//================================ВЫПУСК ПРОДУКЦИИ ===========================	
	
	//3) регистр ПартииТоваровНаСкладах 	// сумма = сумма мат. + доп. затрат !
	Движения.ПартииТоваровНаСкладах.Записывать = Истина;
	Движения.ПартииТоваровНаСкладах.Очистить();
	
	//--- РАСХОД все материалы - списываются датой выпуска!
	Для Каждого ТекСтрока Из Материалы Цикл
		Движение = Движения.ПартииТоваровНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад  = СкладГотовойПродукции;
		Движение.Качество     = КачествоНовый;
		Движение.Номенклатура = ТекСтрока.Номенклатура;
		Движение.Количество   = ТекСтрока.Количество;
		Движение.Стоимость    = ТекСтрока.Сумма;
	КонецЦикла;
	//+++ Приход - Готовой продукции (сумма больше!)
	Для Каждого ТекСтрокаГотоваяПродукция Из ГотоваяПродукция Цикл
		Движение = Движения.ПартииТоваровНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад  = СкладГотовойПродукции;
		Движение.Качество     = КачествоНовый;
		Движение.Номенклатура = ТекСтрокаГотоваяПродукция.Номенклатура;
		Движение.Количество = ТекСтрокаГотоваяПродукция.Количество;
		Движение.Стоимость = ТекСтрокаГотоваяПродукция.Сумма;
	КонецЦикла;
    	
	//4) регистр ТоварыНаСкладах Приход
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.ТоварыНаСкладах.Очистить();
	//--- Расход материалов
	Для Каждого ТекСтрока Из Материалы Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад  = СкладГотовойПродукции;
		Движение.Качество     = КачествоНовый;
		Движение.Номенклатура = ТекСтрокаГотоваяПродукция.Номенклатура;
		Движение.Количество   = ТекСтрокаГотоваяПродукция.Количество;
	КонецЦикла;
	//+++ Приход - Готовой продукции (сумма больше!)
	Для Каждого ТекСтрокаГотоваяПродукция Из ГотоваяПродукция Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад  = СкладГотовойПродукции;
		Движение.Качество     = КачествоНовый;
		Движение.Номенклатура = ТекСтрокаГотоваяПродукция.Номенклатура;
		Движение.Количество   = ТекСтрокаГотоваяПродукция.Количество;
	КонецЦикла;

	//5) регистр ТоварыОрганизаций
	Движения.ТоварыОрганизаций.Записывать = Истина;
	Движения.ТоварыОрганизаций.Очистить();
	//--- Расход материалов
	Для Каждого ТекСтрока Из Материалы Цикл
		Движение = Движения.ТоварыОрганизаций.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Качество     = КачествоНовый;
		Движение.Номенклатура = ТекСтрока.Номенклатура;
		Движение.Количество   = ТекСтрока.Количество;
	КонецЦикла;
    //+++ Приход готовой продукции
	Для Каждого ТекСтрокаГотоваяПродукция Из ГотоваяПродукция Цикл
		Движение = Движения.ТоварыОрганизаций.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Качество     = КачествоНовый;
		Движение.Номенклатура = ТекСтрокаГотоваяПродукция.Номенклатура;
		Движение.Количество   = ТекСтрокаГотоваяПродукция.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

//при вводе на основании -> ТребованиеНакладная
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТребованиеНакладная") Тогда
		// Заполнение шапки
		Комментарий = "По тр.накладной № "+ДанныеЗаполнения.Номер+" от "+формат(ДанныеЗаполнения.Дата,"ДЛФ=D");
		Организация   = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		
		СкладГотовойПродукции = ДанныеЗаполнения.Склад; //куда всё скинули...
		
		Для Каждого ТекСтрокаПродукция Из ДанныеЗаполнения.Продукция Цикл
			НоваяСтрока = ГотоваяПродукция.Добавить();
			НоваяСтрока.Количество   = ТекСтрокаПродукция.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаПродукция.Номенклатура;
			НоваяСтрока.Сумма        = ТекСтрокаПродукция.ПлановаяСтоимость;
		КонецЦикла;
		
		Запрос = новый Запрос; // сумма незавершёнки только в регистре! 
		запрос.Текст = "ВЫБРАТЬ
		               |	НезавершенноеПроизводствоОбороты.Номенклатура,
		               |	НезавершенноеПроизводствоОбороты.КоличествоОборот как Количество,
		               |	НезавершенноеПроизводствоОбороты.СуммаОборот как Сумма
		               |ИЗ
		               |	РегистрНакопления.НезавершенноеПроизводство.Обороты(&НачДата, &КонДата, Регистратор, ) КАК НезавершенноеПроизводствоОбороты
		               |ГДЕ
		               |	НезавершенноеПроизводствоОбороты.Регистратор = &Регистратор";
		запрос.УстановитьПараметр("Регистратор", ДанныеЗаполнения);
		запрос.УстановитьПараметр("НачДата", ДанныеЗаполнения.Дата);
		запрос.УстановитьПараметр("КонДата", ДанныеЗаполнения.Дата+1);
		результат = запрос.Выполнить();
		Если результат.Пустой() тогда
			Для каждого выборка из ДанныеЗаполнения.Материалы цикл  // прямо из ТЧ.
			НоваяСтрока = Материалы.Добавить();
			НоваяСтрока.Номенклатура = выборка.Номенклатура;
			НоваяСтрока.Количество   = выборка.Количество; 
			//суммы НЕТ!
			КонецЦикла;	
		Иначе	
			выборка = результат.Выбрать(); 
			пока выборка.Следующий() цикл
			НоваяСтрока = Материалы.Добавить();
			НоваяСтрока.Номенклатура = выборка.Номенклатура;
			НоваяСтрока.Количество   = выборка.Количество;
			НоваяСтрока.Сумма        = выборка.Сумма;
			КонецЦикла;
		КонецЕсли;
		
		//по первой строке (все статьи должны быть одинаковые!
		СтатьяМатЗатрат    = ДанныеЗаполнения.Материалы[0].статьяЗатрат;
		СтатьяМатЗатратУПР = ДанныеЗаполнения.Материалы[0].статьяЗатратУПР;
		
	СпособРаспределенияДопЗатрат = перечисления.СпособыРаспределенияДопРасходов.ПоСумме;
		
	КонецЕсли;
	
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура мРасчетСебестоимостиГотовойПродукции() ЭКСПОРТ
	
	//Для контроля количества материалов...
	таблМат = Материалы.Выгрузить();
	
	//1) расчет мат.стоимости
	Для каждого стрГ из ГотоваяПродукция цикл
		суммаГ = 0;
		Для каждого стрК из стрГ.Спецификация.Состав цикл //сборка материалов и проверка их достаточности...
			КолНадо = стрК.Количество * стрГ.Количество;
			стрМ = таблМат.Найти( стрК.Комплектующая, "Номенклатура");
			Если стрМ = Неопределено тогда
				КолЕсть = 0;
			Иначе 
				КолЕсть = ?(стрМ.Количество<0,0, стрМ.Количество); // нехватку не считаем в себестоимость!
			КонецЕсли;	
			
			НеХватает = КолНадо - КолЕсть;
			Если  НеХватает>0 тогда
				#Если Клиент тогда
					Сообщить(строка(стрГ.НомерСтроки)+") Недостаточно "+строка(НеХватает)+" шт. "+строка(стрК.Комплектующая)+" для производства "+строка(стрГ.Количество)+" шт. "+строка(стрГ.Номенклатура), СтатусСообщения.Внимание);
				#КонецЕсли	
			КонецЕсли;
			
			Если стрМ <> Неопределено тогда
				сумма1 = КолНадо * стрМ.Сумма / стрМ.Количество; //сумма по Спецификации
				суммаГ = суммаГ + сумма1;
				стрМ.Количество = ?(НеХватает>0, 0, стрМ.Количество - КолНадо);
				стрМ.Сумма      = ?(НеХватает>0, 0, стрМ.Сумма      - Сумма1 ); 
				Если стрМ.Количество=0 тогда //всё списали
					таблМат.Удалить( стрМ );
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;	
		стрГ.Сумма = суммаГ;
	КонецЦикла;
	
//1.а)=========Остатки "лишних" материалов.... распределяются на всю готовую продукцию - по количеству
таблМат.Свернуть("Номенклатура", "Количество, Сумма"); //без дублей материалов

если таблМат.Итог(распределятьПо)>0 тогда   //Есть остатки материалов

//1) - по спецификациям: КолСпецификация х КолГотПрод --------------
распределятьПо = "Спецификации";
//2) если нет спецификаций - по количеству
распределятьПо = "Количеству";
//3) и так и сяк - только на товары по спецификации!
распределятьПо = "Спецификации";

Для каждого стрМ из таблМат цикл
	Если стрМ.Сумма>0 тогда 
	КонецЕсли;	
КонецЦикла;
КолГотПрод = таблМат.Итог(столбРаспределения);

	Для каждого стрМ из таблМат цикл

КолГотПрод = ГотоваяПродукция.Итог(распределятьПо);

	Для каждого стрМ из таблМат цикл
		Если стрМ.Сумма>0 тогда 
			стрМ.Количество=0;// списываем "излишки" на всю готовую продукцию... 
			
			ДопЦена = стрМ.Сумма/КолГотПрод;  ДопСумма=0; максГ=0;
			Для каждого стрГ из ГотоваяПродукция цикл
				Если распределятьПо="Количеству" тогда
					парамРаспределения = стрГ.Количество;
				Иначе// "Спецификации"
					стрСпец = стрГ.Спецификация.Состав
					КолСпец = 
					парамРаспределения = стрГ.Количество * КолСпец;
				КонецЕсли;
				ДопСумма1 = ОКР(ДопЦена * парамРаспределения, 2);
				стрГ.Сумма = стрГ.Сумма + ДопСумма1;
				
				ДопСумма = ДопСумма + ДопСумма1;
				Если парамРаспределения>=максГ тогда // на последнюю максимальную строку
					максГ = парамРаспределения;
					стрДельта = стрГ;
				КонецЕсли;	
			КонецЦикла;	
			
			//копейки
			delta = стрМ.Сумма - ДопСумма;
			Если delta<>0 тогда
				стрДельта.Сумма = стрДельта.Сумма + delta;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
КонецЕсли; //Есть остатки материалов
	
	//2) распределение всех затрат на готовую продукцию --------------------------------------------
	СуммаДопЗатрат = ДопЗатраты.Итог("Сумма");
	Если СуммаДопЗатрат=0 тогда
		возврат;
	КонецЕсли;
	
	Если СпособРаспределенияДопЗатрат = перечисления.СпособыРаспределенияДопРасходов.ПоСумме тогда
		ВсяГотПродукция =ГотоваяПродукция.Итог("Сумма");
	ИначеЕсли СпособРаспределенияДопЗатрат = перечисления.СпособыРаспределенияДопРасходов.ПоКоличеству тогда
		ВсяГотПродукция =ГотоваяПродукция.Итог("Количество");
	ИначеЕсли СпособРаспределенияДопЗатрат = перечисления.СпособыРаспределенияДопРасходов.ПоВесу тогда
		ВсяГотПродукция = 0;
		Для каждого стрГ из ГотоваяПродукция цикл
			ВсяГотПродукция = ВсяГотПродукция + стрГ.Номенклатура.ЕдиницаХраненияОстатков.Вес * стрГ.Количество;
		КонецЦикла;
	КонецЕсли;
	
//-----------корректирока копеек - на макс.себестоимость----------------------------------	
	макс = 0; стрМакс = неопределено;СуммаДопЗатратГ = 0; // Для исправления округления - остаток на макс. сумму1
	Стоимость1 = СуммаДопЗатрат/ВсяГотПродукция;
	Для каждого стрГ из ГотоваяПродукция цикл
		
		Если СпособРаспределенияДопЗатрат = перечисления.СпособыРаспределенияДопРасходов.ПоСумме тогда
			сумма1 =  стрГ.Сумма * Стоимость1;   	
		ИначеЕсли СпособРаспределенияДопЗатрат = перечисления.СпособыРаспределенияДопРасходов.ПоКоличеству тогда
			сумма1 =  стрГ.Количество * Стоимость1;   	
		ИначеЕсли СпособРаспределенияДопЗатрат = перечисления.СпособыРаспределенияДопРасходов.ПоВесу тогда
			сумма1 =  стрГ.Номенклатура.ЕдиницаХраненияОстатков.Вес * стрГ.Количество * Стоимость1;   	
		КонецЕсли;
		
		Если сумма1>=макс тогда
			макс = сумма1; стрМакс = стрГ;
		КонецЕсли;	
		
		СуммаДопЗатратГ = СуммаДопЗатратГ + Окр(сумма1,2); // Для контроля копеек
		стрГ.Сумма = стрГ.Сумма + Окр(сумма1,2);
	КонецЦикла;
	
	Если СуммаДопЗатратГ<>СуммаДопЗатрат тогда   //исправление ошибок округления
		 стрМакс.Сумма = стрМакс.Сумма + (СуммаДопЗатрат - СуммаДопЗатратГ);
		 #Если Клиент тогда
		 сообщить("Разность "+строка(СуммаДопЗатрат - СуммаДопЗатратГ)+"р. записана в строку № "+строка(стрМакс.НомерСтроки));
		 #КонецЕсли	 
	КонецЕсли;
	
КонецПроцедуры	
