
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Для каждого Стр Из НайденныеОбъекты Цикл
		
		Если (Стр.Применить) И НЕ (Стр.СвойстваУстановлены) Тогда
			
			Если НЕ ЗначениеНеЗаполнено(ЗначениеСвойства) Тогда
				
				Менеджер = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				Менеджер.Объект = Стр.Ссылка;
				Менеджер.Свойство = Свойство;
				Менеджер.Значение = ЗначениеСвойства;
				Менеджер.Прочитать();
				
				Если Менеджер.Выбран() Тогда
					
					Менеджер.Объект = Стр.Ссылка;
					Менеджер.Свойство = Свойство;
					Менеджер.Значение = ЗначениеСвойства;
					Менеджер.Записать(Истина);
					
				Иначе 
					
					НаборЗаписейЗначенияСвойств = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
					Запись = НаборЗаписейЗначенияСвойств.Добавить();
					Запись.Объект   = Стр.Ссылка;
					Запись.Свойство = Свойство;
					Запись.Значение = ЗначениеСвойства;
					
					Попытка
						НаборЗаписейЗначенияСвойств.Записать(Ложь);
					Исключение
						Сообщить("Не удалось записать значения свойств:" + Символы.ПС + ОписаниеОшибки());
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла; 	
	
КонецПроцедуры

Процедура КоманднаяПанель2Заполнить(Кнопка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ (&Иерархия)
	|	И Номенклатура.ЭтоГруппа = ЛОЖЬ ";
	
	Если ПризнакИмпорта Тогда
	
		Запрос.Текст = Запрос.Текст + "И Номенклатура.Импорт = ИСТИНА";	
	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Иерархия", ГруппаНоменклатуры);
	
	ТЗ = Запрос.Выполнить().Выгрузить();	
	ТЗ.Колонки.Добавить("Применить");
	
	ТЗ.ЗаполнитьЗначения(ИСТИНА, "Применить");
	
	НайденныеОбъекты.Загрузить(ТЗ);
	
	ПроверкаСвойств();
	
КонецПроцедуры

Процедура СвойствоНачалоВыбора(Элемент, СтандартнаяОбработка)
		
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	//НазначениеСвойств = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура;
	
КонецПроцедуры

Процедура ПроверкаСвойств()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объекты", НайденныеОбъекты.ВыгрузитьКолонку("Ссылка"));
	Запрос.УстановитьПараметр("Свойство", Свойство);
	Запрос.УстановитьПараметр("Значение", ЗначениеСвойства);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект.Ссылка В (&Объекты)
	|	И ЗначенияСвойствОбъектов.Свойство.Ссылка = &Свойство
	|	И ЗначенияСвойствОбъектов.Значение.Ссылка = &Значение";
	
	Результат = Запрос.Выполнить();
	ТЗап = Результат.Выгрузить();
	
    Для каждого Стр Из НайденныеОбъекты Цикл
	
		Если ТЗап.Найти(Стр.Ссылка, "Объект") <> Неопределено Тогда
		
			Стр.СвойстваУстановлены = Истина;
			
		Иначе
			
			Стр.СвойстваУстановлены = Ложь;
			
		КонецЕсли; 
	
	КонецЦикла; 
	
	
КонецПроцедуры

Процедура НайденныеОбъектыПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если ДанныеСтроки.СвойстваУстановлены Тогда
	
		ОформлениеСтроки.ЦветТекста = WebЦвета.Красный;
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура СвойствоПриИзменении(Элемент)
	
	ЗначениеСвойства = "";
	ПроверкаСвойств();
	
КонецПроцедуры

Процедура ЗначениеСвойстваПриИзменении(Элемент)
	
	ПроверкаСвойств();
	
КонецПроцедуры

Процедура КоманднаяПанель2СнятьСУстановленных(Кнопка)
	
	Для каждого Стр Из НайденныеОбъекты Цикл
	
		Стр.Применить = НЕ Стр.СвойстваУстановлены;	
	
	КонецЦикла; 
	
КонецПроцедуры

Процедура КоманднаяПанель2Инверсия(Кнопка)
	
	Для каждого Стр Из НайденныеОбъекты Цикл
	
		Стр.Применить = НЕ Стр.Применить;	
	
	КонецЦикла; 
	
	
КонецПроцедуры

Процедура КоманднаяПанель2УстановитьВсе(Кнопка)
	
	Для каждого Стр Из НайденныеОбъекты Цикл
	
		Стр.Применить = Истина;	
	
	КонецЦикла; 
	
КонецПроцедуры

Процедура КоманднаяПанель2СнятьВсе(Кнопка)
	
	Для каждого Стр Из НайденныеОбъекты Цикл
		
		Стр.Применить = Ложь;	
		
	КонецЦикла; 
	
КонецПроцедуры
