
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Если не ПроверитьЗаполнение() тогда
		Возврат;
	КонецЕсли;	
	
	//ЗАПИСЬ = РегистрыСведений.СоответствиеМенеджеровРегионам.СоздатьМенеджерЗаписи();
	//ЗАПИСЬ.Пользователь = Менеджер;
	//
	//Если ТипЗнч(Регион) = Тип("СправочникСсылка.Регионы") тогда
	//	ЗАПИСЬ.ВидСотрудника = Перечисления.ВидыСотрудниковОтделаПродаж.Оператор;		
	//иначеЕсли ТипЗнч(Регион) = Тип("СправочникСсылка.Контрагенты") тогда
	//	ЗАПИСЬ.ВидСотрудника = Перечисления.ВидыСотрудниковОтделаПродаж.Помощник;
	//иначе
	//	ЗАПИСЬ.ВидСотрудника = Перечисления.ВидыСотрудниковОтделаПродаж.Помощник;
	//КонецЕсли;
	//	
	//	ЗАПИСЬ.Регион       = Регион;
	//
	//ЗАПИСЬ.Записать();
	//Сообщить("Записано");  
	//
	////обновить надпись
	//МенеджерПриИзменении(Кнопка);
КонецПроцедуры

Процедура МенеджерПриИзменении(Элемент)
	//Если не ПроверитьЗаполнение() тогда
	//	Возврат;
	//КонецЕсли;
	СоответствиеРС.Отбор.Пользователь.Установить(Менеджер);
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ		
	//	|	СоответствиеМенеджеровРегионам.Регион как Регион 
	//	|ИЗ
	//	|	РегистрСведений.СоответствиеМенеджеровРегионам КАК СоответствиеМенеджеровРегионам
	//	|ГДЕ
	//	|	СоответствиеМенеджеровРегионам.Пользователь = &Пользователь";

	//Запрос.УстановитьПараметр("Пользователь", Менеджер);

	//Результат = Запрос.Выполнить();

	//ВыборкаДетальныеЗаписи = Результат.Выбрать();

	//ЭлементыФормы.НадписьРегионыПользователя.Значение ="";
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	ЭлементыФормы.НадписьРегионыПользователя.Значение = ЭлементыФормы.НадписьРегионыПользователя.Значение+ ВыборкаДетальныеЗаписи.Регион+ ", ";
	//КонецЦикла;

		
КонецПроцедуры

Процедура ОсновныеДействияФормыУдалитьПривязку(Кнопка)
	Если не ПроверитьЗаполнение() тогда
		Возврат;
	КонецЕсли;	
	
	
	//НаборЗаписей = РегистрыСведений.СоответствиеМенеджеровРегионам.СоздатьНаборЗаписей();
	//  

	//НаборЗаписей.Отбор.Пользователь.Установить(Менеджер);
	//НаборЗаписей.Отбор.Регион.Установить(Регион);
	//
	//ВидСотрудника = Перечисления.ВидыСотрудниковОтделаПродаж.ПустаяСсылка();
	//
	//Если ТипЗнч(Регион) = Тип("СправочникСсылка.Регионы") тогда
	//	ВидСотрудника = Перечисления.ВидыСотрудниковОтделаПродаж.Оператор;		
	//иначеЕсли ТипЗнч(Регион) = Тип("СправочникСсылка.Контрагенты") тогда
	//	ВидСотрудника = Перечисления.ВидыСотрудниковОтделаПродаж.Помощник;
	//иначе
	//	ВидСотрудника = Перечисления.ВидыСотрудниковОтделаПродаж.Помощник;
	//КонецЕсли;
	//НаборЗаписей.Отбор.ВидСотрудника.Установить(ВидСотрудника);
	//
	//
	//НаборЗаписей.Записать(); 
	//Сообщить("Удалено");  
	
КонецПроцедуры

Процедура ПриОткрытии()
	СоответствиеРС.Отбор.Пользователь.Установить(Справочники.Пользователи.ПустаяСсылка());
	
КонецПроцедуры




Процедура СоответствиеРСРегионПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Элемент.Значение) тогда
		Если ТипЗнч(Элемент.Значение)  = Тип("СправочникСсылка.Контрагенты") тогда
			ТекущийЭлемент.ТекущиеДанные.ВидСотрудника = Перечисления.ВидыСотрудниковОтделаПродаж.Помощник;
		иначе
			ТекущийЭлемент.ТекущиеДанные.ВидСотрудника = Перечисления.ВидыСотрудниковОтделаПродаж.Оператор;
		КонецЕсли;
		
	КонецЕсли;
;	
КонецПроцедуры

