Функция Печать() Экспорт
	
	Если Не Метаданные.Имя = "УправлениеТорговлей" Тогда
		Сообщить("Печатная форма предназначена для использования в конфигурации ""Управление торговлей""", СтатусСообщения.Внимание);
	КонецЕсли;
	
	Возврат ПечатьПоступления(СсылкаНаОбъект);
КонецФункции // Печать


Функция ПечатьПоступления (СсылкаНаОбъект) Экспорт
	ТабДок=Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ОтчетПоступление");
	Запрос = Новый Запрос;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуСезонныйТовары.Ссылка,
	|	ЗаказПоставщикуСезонныйТовары.НомерСтроки,
	|	ЗаказПоставщикуСезонныйТовары.Номенклатура.Код как код,
	|	ЗаказПоставщикуСезонныйТовары.Номенклатура,
	|	ЗаказПоставщикуСезонныйТовары.Количество
	|ИЗ
	|	Документ.ЗаказПоставщикуСезонный.Товары КАК ЗаказПоставщикуСезонныйТовары
	|ГДЕ Ссылка=&ссылка    и 
	|	ЗаказПоставщикуСезонныйТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				Справочник.Номенклатура.Ссылка
	|			ИЗ
	|				Справочник.Номенклатура
	|			ГДЕ
	|				Справочник.Номенклатура.Производитель.Наименование ПОДОБНО &Реплика
	|				И НЕ Справочник.Номенклатура.Ссылка В
	|						(ВЫБРАТЬ
	|							Регистрсведений.КомплектующиеНоменклатуры.Номенклатура
	|						ИЗ
	|							Регистрсведений.КомплектующиеНоменклатуры
	|						ГДЕ
	|							Регистрсведений.КомплектующиеНоменклатуры.Комплектующая В ИЕРАРХИИ (&крышки)))";

	Запрос.УстановитьПараметр("Реплика", "%replica%");
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("Крышки", Справочники.Номенклатура.НайтиПоКоду("0080004"));

	Результат = Запрос.Выполнить();
	
	ОбластьЗаголовок= Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ЗаголовокДокумента="Заказ поставщику №" +  СсылкаНаОбъект.Номер +" от "+Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy") +". Покупатель: "+СсылкаНаОбъект.Контрагент.Наименование;
	ОбластьЗаголовок.Параметры.НомерКонтейнера=СсылкаНаОбъект.Комментарий;
	ОбластьШапка= Макет.ПолучитьОбласть("Шапка");
	
	ТабДок.Очистить();

	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапка);
	
	ВыборкаДетали = Результат.Выбрать();
	
	Пока ВыборкаДетали.Следующий() Цикл
		ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла;
	
	
    Возврат ТабДок;
	КонецФункции