Функция Печать() Экспорт
	
	Если Не Метаданные.Имя = "УправлениеТорговлей" Тогда
		Сообщить("Печатная форма предназначена для использования в конфигурации ""Управление торговлей""", СтатусСообщения.Внимание);
	КонецЕсли;
		
	Возврат ПечатьБрака();
	
КонецФункции // Печать


Функция ПечатьБрака() Экспорт
	
	
ТабДок=Новый ТабличныйДокумент;
ТабДок.АвтоМасштаб = Истина;
ТабДок.Очистить();

Макет = ПолучитьМакет("ОтчетРеализация");
ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
ОбластьЗаголовок.Параметры.ЗаголовокДокумента = "Возврат рекламационного товара по Заданию на отгрузку № " +  СсылкаНаОбъект.Номер + " от " + строка(Формат(СсылкаНаОбъект.Дата,"ДЛФ=DD"));
ТабДок.Вывести(ОбластьЗаголовок);

ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(ОбластьШапка);

Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	ЗаявкаНаВозвратТоваров.Ссылка КАК ЗаявкаНаВозврат,
|	ЗаявкаНаВозвратТоваров.ДокументОснование КАК ЗаявкаНаБрак
|ИЗ
|	Документ.ЗаявкаНаВозвратТоваров КАК ЗаявкаНаВозвратТоваров
|ГДЕ
|	ЗаявкаНаВозвратТоваров.ДокументОснование В(&ЗаявкаНаБрак)";
Запрос.УстановитьПараметр("ЗаявкаНаБрак", СсылкаНаОбъект.ЗаявкиНаБрак.ВыгрузитьКолонку("Заявка"));
ЗаявкиБракВозврат = Запрос.Выполнить().Выгрузить();

Для каждого стр из СсылкаНаОбъект.ЗаявкиНаБрак Цикл
	ОбластьСтрока = Макет.ПолучитьОбласть("Детали");
	
	ОбластьСтрока.Параметры.Код = стр.Номенклатура.Код;
	ОбластьСтрока.Параметры.Контрагент = стр.Контрагент;
	ОбластьСтрока.Параметры.Номенклатура = стр.Номенклатура;
	ОбластьСтрока.Параметры.Количество = стр.Количество;
	ОбластьСтрока.Параметры.КоличествоПеремещено = стр.КоличествоПеремещено; //15.08.2018
	ОбластьСтрока.Параметры.Склад = стр.Склад;
	
	Если ЗаявкиБракВозврат.Найти(стр.Заявка,"ЗаявкаНаБрак")<>неопределено Тогда
		ОбластьСтрока.Параметры.ЗаявкаНаВозврат = ЗаявкиБракВозврат.Найти(стр.Заявка,"ЗаявкаНаБрак").ЗаявкаНаВозврат.Номер
	ИначеЕсли ЗначениеЗаполнено(стр.Заявка.ДокументОснование) Тогда
		ОбластьСтрока.Параметры.ЗаявкаНаВозврат = стр.Заявка.ДокументОснование;
	Иначе
		ОбластьСтрока.Параметры.ЗаявкаНаВозврат = "--";
	КонецЕсли;

	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ЗаданиеНаОтгрузку") Тогда
	    ОбластьСтрока.Параметры.Очередь = стр.НомерОчереди;
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьСтрока);
КонецЦикла;

ОбластьИтого = Макет.ПолучитьОбласть("ПодвалТаблицы");
ОбластьИтого.Параметры.Количество = СсылкаНаОбъект.ЗаявкиНаБрак.Итог("Количество");
ОбластьИтого.Параметры.КоличествоПеремещено = СсылкаНаОбъект.ЗаявкиНаБрак.Итог("КоличествоПеремещено");//15.08.2018

ТабДок.Вывести(ОбластьИтого);
Возврат ТабДок;
КонецФункции