
Процедура ПриЗаписи(Отказ)
	
#Если Клиент Тогда
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст  = "ВЫБРАТЬ
	                |	1
	                |ИЗ
	                |	Справочник.ДополнительныеПечатныеФормы.Принадлежность КАК ЭтаФорма
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДополнительныеПечатныеФормы.Принадлежность КАК ОстальныеФормы
	                |		ПО ЭтаФорма.СсылкаОбъекта = ОстальныеФормы.СсылкаОбъекта
					|		И ЭтаФорма.Ссылка.Наименование = ОстальныеФормы.Ссылка.Наименование 
					|		И ЭтаФорма.Ссылка <> ОстальныеФормы.Ссылка
					|		И НЕ ОстальныеФормы.Ссылка.ПометкаУдаления
	                |ГДЕ
	                |	ЭтаФорма.Ссылка = &Ссылка";
					
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Ответ = Вопрос("Для объектов, которым предназначена данная печатная форма, уже 
						|назначена другая форма с таким же именем. Рекомендуется изменить 
						|имя формы. Записать объект?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
#КонецЕсли
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ Тогда
	
		обЗаписатьПротоколИзменений(ЭтотОбъект);
	
	КонецЕсли; 

КонецПроцедуры

