 
Процедура ОсновныеДействияФормыВыполнить(Кнопка)
	рез = "";
	Если д1>0 и д2>0 тогда
		рез = строка(Д1)+"-"+строка(Д2);
	иначеЕсли д1>0 тогда
		рез = ">="+строка(Д1);
	иначеЕсли д2>0 тогда
		рез = "<="+строка(Д2);
	КонецЕсли;	
	
	ЭтаФорма.Диаметр = рез;
	
	Закрыть(рез);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если ЭтаФорма.Диаметр<>"" тогда
		
		Если найти(ЭтаФорма.Диаметр,"-")>0 тогда
		Д1 = число( лев(ЭтаФорма.Диаметр, найти(ЭтаФорма.Диаметр,"-")-1) );
		Д2 = число( прав(ЭтаФорма.Диаметр, стрДлина(ЭтаФорма.Диаметр) - найти(ЭтаФорма.Диаметр,"-")) );
		иначеЕсли Лев(ЭтаФорма.Диаметр,2)=">=" тогда
			Д1 = число( прав(ЭтаФорма.Диаметр, стрДлина(ЭтаФорма.Диаметр)-2) );
		иначеЕсли Лев(ЭтаФорма.Диаметр,2)="<=" тогда
			Д2 = число( прав(ЭтаФорма.Диаметр, стрДлина(ЭтаФорма.Диаметр)-2) );
		КонецЕсли;
		
	КонецЕсли;
	

КонецПроцедуры
