функция показатьОтчет() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Значение
	|ПОМЕСТИТЬ Проверено
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Проверено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Значение
	|ПОМЕСТИТЬ Загружено
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Загружено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Остаток,
	|	ТоварыНаСкладахОстатки.Номенклатура.Модель КАК Модель,
	|	ТоварыНаСкладахОстатки.Номенклатура.Типоразмер КАК Типоразмер,
	|	ТоварыНаСкладахОстатки.Номенклатура.Типоразмер.Диаметр КАК Диаметр,
	|	ТоварыНаСкладахОстатки.Номенклатура.Производитель КАК Производитель,
	|	Проверено.Значение КАК ПровереноНагрузка,
	|	Загружено.Значение КАК ЗагруженоНагрузка,
	|	ТоварыНаСкладахОстатки.Номенклатура.Код КАК Код
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Проверено КАК Проверено
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = Проверено.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ Загружено КАК Загружено
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = Загружено.Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("Проверено",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90157"));
	Запрос.УстановитьПараметр("Загружено",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90205"));
	
	Результат = Запрос.Выполнить();

	Товары = Результат.Выгрузить();
	
	
	
    ТабДок = Новый ТабличныйДокумент;
	Макет         = ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	табДок.Вывести(ОбластьШапка);
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	Для каждого стр из Товары Цикл
		ОбластьСтрока.Параметры.Заполнить(стр);
	    табДок.Вывести(ОбластьСтрока);
	конецЦикла;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	
	возврат ТабДок;
	
конецФункции