функция АЭ_ВыгрузитьОстаткиТоваров()  Экспорт 
	дНачала = ТекущаяДата();
	ФайлОстатков=ПолучитьИмяВременногоФайла("xml");
	//19.09.16 Смирнов, выгружаем все остатки, а не только те которые на сайте
	//сделано так из-за того, что во время выгрузки товаров на сайт все остатки обнуляются
	//СписокНоменклатуры=ПолучитьСписокНомАЭ();
	
	запрос = новый Запрос;   	   
	
	запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияСвойствОбъектов.Объект КАК Номенклатура
	               |ПОМЕСТИТЬ втТоварыВПалетах
	               |ИЗ
	               |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |ГДЕ
	               |	ЗначенияСвойствОбъектов.Свойство = &СвойствоВидУпаковки
	               |	И ЗначенияСвойствОбъектов.Значение = &ЗначениеПалеты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Номенклатура
	               |ПОМЕСТИТЬ втНоменклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	(Номенклатура.Родитель В ИЕРАРХИИ (&РодительАКБ)
	               |			ИЛИ Номенклатура.Родитель В ИЕРАРХИИ (&РодительАКсы)
	               |			ИЛИ Номенклатура.Родитель В ИЕРАРХИИ (&РодительДиски)
	               |			ИЛИ Номенклатура.Родитель В ИЕРАРХИИ (&РодительШины))
	               |	И НЕ Номенклатура.Ссылка В
	               |				(ВЫБРАТЬ
	               |					втТоварыВПалетах.Номенклатура
	               |				ИЗ
	               |					втТоварыВПалетах)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВЫБОР
	               |			КОГДА Табл1.ПодразделениеКод = ""00005""
	               |				ТОГДА ""000092773""
	               |			КОГДА Табл1.ПодразделениеКод = ""00138""
	               |				ТОГДА ""УТ0000494""
	               |			КОГДА Табл1.ПодразделениеКод = ""00106""
	               |				ТОГДА ""Ф00000010""
	               |			КОГДА Табл1.ПодразделениеКод = ""00112""
	               |				ТОГДА ""П000835""
	               |			КОГДА Табл1.ПодразделениеКод = ""00133""
	               |				ТОГДА ""УТИМ31438""
	               |			КОГДА Табл1.ПодразделениеКод = ""00172""
	               |				ТОГДА ""00172""
	               |		КОНЕЦ, ""000092773"") КАК Контрагент,
	               |	втНоменклатура.Номенклатура.Код КАК НоменклатураКод,
	               |	втНоменклатура.Номенклатура.ВидТовара КАК НоменклатураВидТовара,
	               |	втНоменклатура.Номенклатура КАК Номенклатура,
	               |	Табл1.КоличествоВПути,
	               |	Табл1.ДатаПоступления,
	               |	ЕСТЬNULL(Табл1.СвободныйОстаток, 0) КАК Остаток,
	               |	ЕСТЬNULL(Табл1.Заказано, 0) КАК ВРезерве,
	               |	ЕСТЬNULL(Табл1.ФактКоличество, 0) КАК ФактКоличество,
	               |	ЕСТЬNULL(Табл1.ИндивидуальныйРезерв, 0) КАК ИндивидуальныйРезерв
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		А.ПодразделениеКод КАК ПодразделениеКод,
	               |		А.НоменклатураКод КАК НоменклатураКод,
	               |		А.остаток КАК остаток,
	               |		А.Заказано КАК Заказано,
	               |		А.НоменклатураВидТовара КАК НоменклатураВидТовара,
	               |		А.Номенклатура КАК Номенклатура,
	               |		А.остаток - А.Заказано КАК СвободныйОстаток,
	               |		А.ФактКоличество КАК ФактКоличество,
	               |		А.ИндивидуальныйРезерв КАК ИндивидуальныйРезерв,
	               |		А.КоличествоВПути КАК КоличествоВПути,
	               |		А.ДатаПоступления КАК ДатаПоступления
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			""00005"" КАК ПодразделениеКод,
	               |			остатки.Номенклатура.Код КАК НоменклатураКод,
	               |			МАКСИМУМ(остатки.КоличествоОстаток) КАК остаток,
	               |			СУММА(ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0)) КАК Заказано,
	               |			остатки.Номенклатура.ВидТовара КАК НоменклатураВидТовара,
	               |			остатки.Номенклатура КАК Номенклатура,
	               |			СУММА(остатки.КоличествоОстаток) КАК ФактКоличество,
	               |			СУММА(остатки.ИндивидуальныйРезерв) КАК ИндивидуальныйРезерв,
	               |			СУММА(остатки.КоличествоВПути) КАК КоличествоВПути,
	               |			МИНИМУМ(остатки.ДатаПоступления) КАК ДатаПоступления
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				Остатки3.Номенклатура КАК Номенклатура,
	               |				СУММА(Остатки3.КоличествоОстаток) КАК КоличествоОстаток,
	               |				Остатки3.СторПоставщикКод КАК СторПоставщикКод,
	               |				СУММА(Остатки3.ИндивидуальныйРезерв) КАК ИндивидуальныйРезерв,
	               |				СУММА(Остатки3.КоличествоВПути) КАК КоличествоВПути,
	               |				МИНИМУМ(Остатки3.ДатаПоступления) КАК ДатаПоступления
	               |			ИЗ
	               |				(ВЫБРАТЬ
	               |					ТоварыВРезервеНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |					ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |					0 КАК СторПоставщикКод,
	               |					0 КАК ИндивидуальныйРезерв,
	               |					0 КАК КоличествоВПути,
	               |					ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПоступления
	               |				ИЗ
	               |					РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |							,
	               |							НЕ Склад.Транзитный
	               |								И Номенклатура В
	               |									(ВЫБРАТЬ
	               |										втНоменклатура.Номенклатура
	               |									ИЗ
	               |										втНоменклатура)
	               |								И НЕ Склад.ЗапретитьИспользование
	               |								И ВЫБОР
	               |									КОГДА Склад.Подразделение = &ПодразделениеМСК
	               |										ТОГДА Склад = &СкладМоскваИМ
	               |									ИНАЧЕ ИСТИНА
	               |								КОНЕЦ
	               |								И Склад <> &АнгарРемонт
	               |								И Склад <> &ЯрОшиповка) КАК ТоварыВРезервеНаСкладахОстатки
	               |				
	               |				ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |				ВЫБРАТЬ
	               |					ТоварыНаОтветственномХраненииОстатки.Номенклатура,
	               |					ТоварыНаОтветственномХраненииОстатки.КоличествоОстаток,
	               |					0,
	               |					0,
	               |					0,
	               |					ДАТАВРЕМЯ(1, 1, 1)
	               |				ИЗ
	               |					РегистрНакопления.ТоварыНаОтветственномХранении.Остатки(
	               |							,
	               |							НЕ Склад.Транзитный
	               |								И Номенклатура В
	               |									(ВЫБРАТЬ
	               |										втНоменклатура.Номенклатура
	               |									ИЗ
	               |										втНоменклатура)
	               |								И НЕ Склад.ЗапретитьИспользование
	               |								И Контрагент В (&СписокКонтрагентовОТХ)
	               |								И Склад <> &АнгарРемонт
	               |								И Склад <> &ЯрОшиповка) КАК ТоварыНаОтветственномХраненииОстатки
	               |				
	               |				ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |				ВЫБРАТЬ
	               |					РезервДляИМОстатки.Номенклатура,
	               |					РезервДляИМОстатки.КоличествоОстаток,
	               |					0,
	               |					РезервДляИМОстатки.КоличествоОстаток,
	               |					0,
	               |					ДАТАВРЕМЯ(1, 1, 1)
	               |				ИЗ
	               |					РегистрНакопления.РезервДляИМ.Остатки(
	               |							,
	               |							Подразделение В (&СписокГоловное)
	               |								И КонтрагентДляРезерваИМ = &КонтрагентДляРезерва) КАК РезервДляИМОстатки
	               |				
	               |				ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |				ВЫБРАТЬ
	               |					ЗаказыПоставщикамОстатки.Номенклатура,
	               |					0,
	               |					0,
	               |					0,
	               |					СУММА(ЗаказыПоставщикамОстатки.КоличествоОстаток),
	               |					МИНИМУМ(ЗаказыПоставщикамОстатки.ЗаказПоставщику.ДатаПоступления)
	               |				ИЗ
	               |					РегистрНакопления.ЗаказыПоставщикам.Остатки(
	               |							,
	               |							Подразделение В (&СписокГоловное)
	               |								И ЗаказПоставщику.ДатаПоступления > &ТекущаяДата) КАК ЗаказыПоставщикамОстатки
	               |				ГДЕ
	               |					ЗаказыПоставщикамОстатки.КоличествоОстаток > 0
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ЗаказыПоставщикамОстатки.Номенклатура
	               |				
	               |				ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |				ВЫБРАТЬ
	               |					Номенклатура.Ссылка,
	               |					16,
	               |					0,
	               |					0,
	               |					0,
	               |					&Дата2Недели
	               |				ИЗ
	               |					Справочник.Номенклатура КАК Номенклатура
	               |				ГДЕ
	               |					Номенклатура.НоменклатурнаяГруппа = &НоменклатурнаяГруппаКованые
	               |					И Номенклатура.Производитель = &ПроизводительVISSOL
	               |					И Номенклатура.ПометкаУдаления = ЛОЖЬ) КАК Остатки3
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				Остатки3.Номенклатура,
	               |				Остатки3.СторПоставщикКод) КАК остатки
	               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(
	               |						,
	               |						НЕ ЗаказПокупателя.Транзит
	               |							И ЗаказПокупателя.Проверен
	               |							И Номенклатура В
	               |								(ВЫБРАТЬ
	               |									втНоменклатура.Номенклатура
	               |								ИЗ
	               |									втНоменклатура)) КАК ЗаказыПокупателейОстатки
	               |				ПО остатки.Номенклатура = ЗаказыПокупателейОстатки.Номенклатура
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			остатки.Номенклатура.Код,
	               |			остатки.Номенклатура.ВидТовара,
	               |			остатки.Номенклатура
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			остаткиТр.Подразделение.Код,
	               |			остаткиТр.Номенклатура.Код,
	               |			МАКСИМУМ(остаткиТр.КоличествоОстаток),
	               |			СУММА(ЕСТЬNULL(ЗапросЗаказы.КоличествоОстаток, 0)),
	               |			остаткиТр.Номенклатура.ВидТовара,
	               |			остаткиТр.Номенклатура,
	               |			СУММА(остаткиТр.ФактКоличество),
	               |			СУММА(остаткиТр.ИндивидуальныйРезерв),
	               |			СУММА(0),
	               |			МИНИМУМ(ДАТАВРЕМЯ(1, 1, 1))
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				ТоварыНаСкладахТр.Подразделение КАК Подразделение,
	               |				ТоварыНаСкладахТр.Номенклатура КАК Номенклатура,
	               |				СУММА(ЕСТЬNULL(ТоварыНаСкладахТр.КоличествоОстаток, 0)) КАК КоличествоОстаток,
	               |				МИНИМУМ(ТоварыНаСкладахТр.СторПоставщикКод) КАК СторПоставщикКод,
	               |				СУММА(ТоварыНаСкладахТр.ФактКоличество) КАК ФактКоличество,
	               |				СУММА(ТоварыНаСкладахТр.ИндивидуальныйРезерв) КАК ИндивидуальныйРезерв
	               |			ИЗ
	               |				(ВЫБРАТЬ
	               |					ТоварыНаСкладахОстатки.Склад.Подразделение КАК Подразделение,
	               |					ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |					ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |					0 КАК СторПоставщикКод,
	               |					ТоварыНаСкладахОстатки.КоличествоОстаток КАК ФактКоличество,
	               |					0 КАК ИндивидуальныйРезерв
	               |				ИЗ
	               |					РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |							,
	               |							НЕ Склад.Подразделение = &ПодрЕКБ
	               |								И Склад.Транзитный
	               |								И НЕ Склад.ЗапретитьИспользование
	               |								И НЕ Склад.Подразделение = &ПустоеПодразделение
	               |								И НЕ Склад.Подразделение = &Ярославль
	               |								И Номенклатура В
	               |									(ВЫБРАТЬ
	               |										втНоменклатура.Номенклатура
	               |									ИЗ
	               |										втНоменклатура)
	               |								И Склад.Подразделение В (&СписокДоступныхПодразделений)
	               |								И ВЫБОР
	               |									КОГДА Склад.Подразделение = &ПодразделениеМСК
	               |										ТОГДА Склад = &СкладМоскваИМ
	               |									ИНАЧЕ ИСТИНА
	               |								КОНЕЦ) КАК ТоварыНаСкладахОстатки
	               |				
	               |				ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |				ВЫБРАТЬ
	               |					ТоварыНаОтветственномХраненииОстатки.Склад.Подразделение,
	               |					ТоварыНаОтветственномХраненииОстатки.Номенклатура,
	               |					ТоварыНаОтветственномХраненииОстатки.КоличествоОстаток,
	               |					0,
	               |					ТоварыНаОтветственномХраненииОстатки.КоличествоОстаток,
	               |					0
	               |				ИЗ
	               |					РегистрНакопления.ТоварыНаОтветственномХранении.Остатки(
	               |							,
	               |							НЕ Склад.Подразделение = &ПодрЕКБ
	               |								И Склад.Транзитный
	               |								И Номенклатура В
	               |									(ВЫБРАТЬ
	               |										втНоменклатура.Номенклатура
	               |									ИЗ
	               |										втНоменклатура)
	               |								И НЕ Склад.ЗапретитьИспользование
	               |								И НЕ Склад.Подразделение = &ПустоеПодразделение
	               |								И НЕ Склад.Подразделение = &Ярославль
	               |								И Контрагент В (&СписокКонтрагентовОТХ)
	               |								И Склад.Подразделение В (&СписокДоступныхПодразделений)) КАК ТоварыНаОтветственномХраненииОстатки
	               |				
	               |				ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |				ВЫБРАТЬ
	               |					РезервДляИМОстатки.Подразделение,
	               |					РезервДляИМОстатки.Номенклатура,
	               |					РезервДляИМОстатки.КоличествоОстаток,
	               |					0,
	               |					0,
	               |					РезервДляИМОстатки.КоличествоОстаток
	               |				ИЗ
	               |					РегистрНакопления.РезервДляИМ.Остатки(
	               |							,
	               |							НЕ Подразделение В (&СписокГоловное)
	               |								И КонтрагентДляРезерваИМ = &КонтрагентДляРезерва
	               |								И Подразделение В (&СписокДоступныхПодразделений)) КАК РезервДляИМОстатки) КАК ТоварыНаСкладахТр
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ТоварыНаСкладахТр.Подразделение,
	               |				ТоварыНаСкладахТр.Номенклатура) КАК остаткиТр
	               |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |					ЗаказыПокупателейОстатки.ЗаказПокупателя.Подразделение КАК Подразделение,
	               |					ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	               |					СУММА(ЗаказыПокупателейОстатки.КоличествоОстаток) КАК КоличествоОстаток
	               |				ИЗ
	               |					РегистрНакопления.ЗаказыПокупателей.Остатки(
	               |							,
	               |							ЗаказПокупателя.Транзит
	               |								И Номенклатура В
	               |									(ВЫБРАТЬ
	               |										втНоменклатура.Номенклатура
	               |									ИЗ
	               |										втНоменклатура)
	               |								И ЗаказПокупателя.Проверен
	               |								И НЕ ЗаказПокупателя.Подразделение = &ПустоеПодразделение
	               |								И НЕ ЗаказПокупателя.Подразделение = &Ярославль) КАК ЗаказыПокупателейОстатки
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ЗаказыПокупателейОстатки.ЗаказПокупателя.Подразделение,
	               |					ЗаказыПокупателейОстатки.Номенклатура) КАК ЗапросЗаказы
	               |				ПО остаткиТр.Номенклатура = ЗапросЗаказы.Номенклатура
	               |					И остаткиТр.Подразделение = ЗапросЗаказы.Подразделение
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			остаткиТр.Подразделение.Код,
	               |			остаткиТр.Номенклатура.Код,
	               |			остаткиТр.Номенклатура.ВидТовара,
	               |			остаткиТр.Номенклатура) КАК А
	               |	ГДЕ
	               |		(А.остаток - А.Заказано >= &МинОстаток
	               |				ИЛИ А.КоличествоВПути > 0)) КАК Табл1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втНоменклатура КАК втНоменклатура
	               |		ПО Табл1.Номенклатура = втНоменклатура.Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НоменклатураКод,
	               |	Контрагент
	               |ИТОГИ ПО
	               |	НоменклатураВидТовара,
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";
				   
				   СписокГоловное = новый СписокЗначений;
				   СписокГоловное.Добавить(справочники.Подразделения.ПустаяСсылка());
				   СписокГоловное.Добавить(справочники.Подразделения.НайтиПоКоду("00005"));
				   
				   Запрос.УстановитьПараметр("СвойствоВидУпаковки",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90165"));
				   Запрос.УстановитьПараметр("ЗначениеПалеты", Справочники.ЗначенияСвойствОбъектов.НайтиПоКоду("01593"));

				   
				   Запрос.УстановитьПараметр("АнгарРемонт",Справочники.Склады.НайтиПоКоду("02316"));
				   Запрос.УстановитьПараметр("ЯрОшиповка",Справочники.Склады.НайтиПоКоду("00010"));
				   
				   Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
				   Запрос.УстановитьПараметр("СписокГоловное",СписокГоловное);
	Запрос.УстановитьПараметр("ПустоеПодразделение",справочники.Подразделения.ПустаяСсылка());
	Запрос.УстановитьПараметр("Ярославль",справочники.Подразделения.НайтиПоКоду("00005") );
	Запрос.УстановитьПараметр("ПодрЕКБ",справочники.Подразделения.НайтиПоКоду("00122") );
	Запрос.УстановитьПараметр("ПодразделениеМСК",справочники.Подразделения.НайтиПоКоду("00133") );
    Запрос.УстановитьПараметр("СкладМоскваИМ",справочники.Склады.НайтиПоКоду("02136") );
	
	Запрос.УстановитьПараметр("РодительАКБ",справочники.Номенклатура.НайтиПоКоду("0080021"));
	Запрос.УстановитьПараметр("РодительАКсы",справочники.Номенклатура.НайтиПоКоду("0000001"));
	Запрос.УстановитьПараметр("РодительДиски",справочники.Номенклатура.НайтиПоКоду("0001752"));
	Запрос.УстановитьПараметр("РодительШины",справочники.Номенклатура.НайтиПоКоду("0001746"));

	Запрос.УстановитьПараметр("ПроизводительVISSOL",Справочники.Производители.НайтиПоКоду("3657"));
	Запрос.УстановитьПараметр("НоменклатурнаяГруппаКованые",Справочники.НоменклатурныеГруппы.НайтиПоКоду("00022"));

	Запрос.УстановитьПараметр("Дата2Недели", ТекущаяДата()+14*24*60*60 );
	
	Запрос.УстановитьПараметр("МинОстаток", -2001 ); // Остаток на складах от 0 и более	
	
	СписокДоступныхПодразделений = новый СписокЗначений;
	СписокДоступныхПодразделений.Добавить(справочники.Подразделения.ПустаяСсылка());
	СписокДоступныхПодразделений.Добавить(справочники.Подразделения.НайтиПоКоду("00005"));
	СписокДоступныхПодразделений.Добавить(справочники.Подразделения.НайтиПоКоду("00138"));
	СписокДоступныхПодразделений.Добавить(справочники.Подразделения.НайтиПоКоду("00106"));
	СписокДоступныхПодразделений.Добавить(справочники.Подразделения.НайтиПоКоду("00112"));
	СписокДоступныхПодразделений.Добавить(справочники.Подразделения.НайтиПоКоду("00133"));
	СписокДоступныхПодразделений.Добавить(справочники.Подразделения.НайтиПоКоду("00172"));
	
	Запрос.УстановитьПараметр("СписокДоступныхПодразделений", СписокДоступныхПодразделений); //
	
	Запрос.УстановитьПараметр("КонтрагентДляРезерва", Справочники.Контрагенты.НайтиПоКоду("П004703") ); // 
	
	СписокКонтрагентовОТХ = яштПоставщики.ПолучитьСписокПоставщиков(Истина);  //+++ 01.10.2014
	Запрос.УстановитьПараметр("СписокКонтрагентовОТХ",СписокКонтрагентовОТХ);
	//Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
    		
	ЗаписьXML=Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ФайлОстатков);
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Остатки");
	ЗаписьXML.ЗаписатьАтрибут("Дата",""+ТекущаяДата());
	дНачала=ТекущаяДата();

	ВыборкаВидНоменклатуры=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	сек=ТекущаяДата()-дНачала;
    Сообщить("Выполнение запроса: "+сек);

	Пока ВыборкаВидНоменклатуры.Следующий()Цикл
		ВыборкаНоменклатура=ВыборкаВидНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока  ВыборкаНоменклатура.Следующий() цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура");
			ЗаписьXML.ЗаписатьАтрибут("Код",СокрЛП(ВыборкаНоменклатура.НоменклатураКод));
			//ЗаписьXML.ЗаписатьАтрибут("УИД",""+ВыборкаНоменклатура.Номенклатура.УникальныйИдентификатор());
			ЗаписьXML.ЗаписатьАтрибут("Вид",СокрЛП(ВыборкаВидНоменклатуры.НоменклатураВидТовара));
			ВыборкаСклад=ВыборкаНоменклатура.Выбрать();
			Пока  ВыборкаСклад.Следующий() цикл
				ЗаписьXML.ЗаписатьНачалоЭлемента("Склад");
				ЗаписьXML.ЗаписатьАтрибут("Код",""+СокрЛП(ВыборкаСклад.Контрагент));
				Количество = ?(ВыборкаСклад.Остаток>ВыборкаСклад.ФактКоличество,ВыборкаСклад.ФактКоличество,ВыборкаСклад.Остаток);
				ЗаписьXML.ЗаписатьАтрибут("Количество",""+Формат(?(Количество<0,0,Количество),"ЧН=; ЧГ=0"));
				ЗаписьXML.ЗаписатьАтрибут("КоличествоРезерв",""+Формат(ВыборкаСклад.ВРезерве,"ЧН=; ЧГ=0"));
				ЗаписьXML.ЗаписатьАтрибут("ВТЧИндивидуальныйРезерв",""+Формат(ВыборкаСклад.ИндивидуальныйРезерв,"ЧН=; ЧГ=0"));
				
				Если ЗначениеЗаполнено(ВыборкаСклад.ДатаПоступления) тогда
					ЗаписьXML.ЗаписатьАтрибут("КоличествоВПути",""+Формат(ВыборкаСклад.КоличествоВПути,"ЧН=; ЧГ=0"));
					ЗаписьXML.ЗаписатьАтрибут("ДатаПоступления",""+Формат(ВыборкаСклад.ДатаПоступления,"ЧН=; ЧГ=0; ДФ=dd.MM.yyyy"));
				КонецЕсли;
				
				ЗаписьXML.ЗаписатьКонецЭлемента();//Склад
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента();//Номенклатура
		КонецЦикла;
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();
	
	#Если Клиент тогда
		сек=ТекущаяДата()-дНачала;
		Сообщить("Генерация файла: "+сек+"с.");
	#КонецЕсли
    дНачала=ТекущаяДата();
	Сообщить(ФайлОстатков);
	//Попытка
		//ИмяФайлаСообщения="test_rest_1c.xml";	
		ИмяФайлаСообщения="rest_1c.xml";
		//FTPсервер = "kolesatyt.ru";
		//FTPсервер = "95.213.228.43";
		//FTPсервер = "95.213.228.42";
		FTPсервер = "188.93.20.230";
		//FTPсервер = "31.186.103.151";
		//врФТП = Новый FTPСоединение(FTPсервер,,"bitrix", "eequajaiz4uNaku",, Истина );                                  
		//ПутьКфайлуFTP = "www/_common/upload/";
		//врФТП = Новый FTPСоединение(FTPсервер,,"1cuser", "Sith4Hio",, Истина );                                  
		врФТП = Новый FTPСоединение(FTPсервер,,"user1c", "oebohaCh5ohyaiko6Aer",, Истина ); 
		ПутьКфайлуFTP = "/upload/1c/";
		врФТП.Записать(ФайлОстатков , ПутьКфайлуFTP+ИмяФайлаСообщения);
		
		#Если Клиент тогда
		сек=ТекущаяДата()-дНачала;
		Сообщить("отправка файла Колесатут: "+сек+"с.");
		#КонецЕсли
		дНачала=ТекущаяДата();

		//25.01.17 Смирнов
		//для шинтрейда те же остатки
		врФТП = Новый FTPСоединение("yst.ru",,"dc140403_shinnik", "4r8m2mbE",, Истина, 30);
		ПутьКфайлуFTP = "goods/";
		врФТП.Записать(ФайлОстатков , ПутьКфайлуFTP+ИмяФайлаСообщения);
		
		//запускаем скрипт
		Соединение = Неопределено;
		
		#Если Клиент тогда
		сек=ТекущаяДата()-дНачала;
		Сообщить("отправка файла шинтрейд: "+сек+"с.");
		#КонецЕсли
		дНачала=ТекущаяДата();

		СтруктураПараметровСайта = Новый Структура;
		//СтруктураПараметровСайта.Вставить("ИмяПользователя", "1cvigr");         
		//СтруктураПараметровСайта.Вставить("Пароль"		   , "$Tiptronic!13");
		СтруктураПараметровСайта.Вставить("ИмяПользователя", "1cuser");         
		СтруктураПараметровСайта.Вставить("Пароль"		   , "Sith4Hio");

		//СтруктураПараметровСайта.Вставить("Сервер"		, "95.213.228.43");
		СтруктураПараметровСайта.Вставить("Сервер"		, "31.186.103.151");
		СтруктураПараметровСайта.Вставить("Порт"		, неопределено);
		СтруктураПараметровСайта.Вставить("ПроксиИспользование"  , Ложь);
		СтруктураПараметровСайта.Вставить("ЗащищенноеСоединение",  ЛОЖЬ);
		СтруктураПараметровСайта.Вставить("ПроксиСервер"		 , "");
		СтруктураПараметровСайта.Вставить("ПроксиПорт"		     , 0);
		СтруктураПараметровСайта.Вставить("ПроксиИмяПользователя", "");
		СтруктураПараметровСайта.Вставить("ПроксиПароль"		 , "");
		
		СтруктураПараметровСайта.Вставить("АдресСкрипта", "/local/scripts/1c/1c_rest.php");
		//скрипты не запускаем, задача 29845
		//ЗапуститьСкрипт(СтруктураПараметровСайта);
	//Исключение
	//	ТекстОшибки=ОписаниеОшибки();
	//	Сообщить(ТекстОшибки);
	//КонецПопытки;
	#Если Клиент тогда
		сек=ТекущаяДата()-дНачала;
		Сообщить("Работа скрипта: "+сек+"с.");
	#КонецЕсли

КонецФункции

процедура ЗапуститьСкрипт(СтруктураПараметровСайта)

	Соединение = HTTPУстановитьСоединение(СтруктураПараметровСайта);
	Если Соединение = Неопределено Тогда
		#Если Клиент тогда
			сообщить("Соединение с сайтом - НЕ установлено!", СтатусСообщения.Внимание);
		#КонецЕсли
	Иначе
		#Если Клиент тогда
			сообщить("Соединение с сайтом - УСПЕШНО установлено!", СтатусСообщения.Информация);
		#КонецЕсли
	КонецЕсли;
	
	Заголовки="";
	СтрокаСообщенияПользователю = "";
	
	ответСервера = HTTPПолучитьДанныеССервера(Соединение, СтруктураПараметровСайта.АдресСкрипта, Заголовки, СтрокаСообщенияПользователю );
	СтрокаСообщенияПользователю = СокрЛП(СтрокаСообщенияПользователю);
	#Если Клиент тогда
		Если Не ПустаяСтрока(СтрокаСообщенияПользователю) Тогда
			Сообщить(СтрокаСообщенияПользователю, СтатусСообщения.Информация);
		Иначе
			Сообщить("Ответ с сервера - пустая строка!", СтатусСообщения.Внимание);
		КонецЕсли;
	#КонецЕсли
	
	Если ответСервера=неопределено Тогда
		#Если Клиент тогда
			сообщить(строка(ТекущаяДата())+" - Скрипт "+СтруктураПараметровСайта.АдресСкрипта+" выполнен УСПЕШНО!", СтатусСообщения.Информация);
		#КонецЕсли
	Иначе
		ответСервера = СокрЛП( стрЗаменить(ответСервера, "<br>", "
		|") );
		#Если Клиент тогда
			сообщить("При выполнении скрипта: "+СтруктураПараметровСайта.АдресСкрипта+" получен ответ сервера: 
			|"+ответСервера);
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

Функция HTTPУстановитьСоединение(СтруктураПараметровСайта) Экспорт
	
	Соединение = НеОпределено;
	
	ИнтернетПрокси = НеОпределено;
	
	Если СтруктураПараметровСайта.ПроксиИспользование Тогда
		
		ИнтернетПрокси = Новый ИнтернетПрокси;
		ИнтернетПрокси.Пользователь = СтруктураПараметровСайта.ПроксиИмяПользователя;
		ИнтернетПрокси.Пароль		= СтруктураПараметровСайта.ПроксиПароль;
		
		ПротоколПрокси = ?(СтруктураПараметровСайта.ЗащищенноеСоединение, "HTTPS", "HTTP");
		
		Если СтруктураПараметровСайта.ПроксиПорт = 0 Тогда
			ИнтернетПрокси.Установить(ПротоколПрокси, СтруктураПараметровСайта.ПроксиСервер);
		Иначе
			ИнтернетПрокси.Установить(ПротоколПрокси, СтруктураПараметровСайта.ПроксиСервер, СтруктураПараметровСайта.ПроксиПорт);
		КонецЕсли;
		
	КонецЕсли;
	
	Порт = ?(ЗначениеЗаполнено(СтруктураПараметровСайта.Порт), СтруктураПараметровСайта.Порт, 80); //+++ 14.02.2013 ?(СтруктураПараметровСайта.ЗащищенноеСоединение, 443,80)
	
	Попытка
		
		Соединение = Новый HTTPСоединение(СтруктураПараметровСайта.Сервер, Порт, СтруктураПараметровСайта.ИмяПользователя, СтруктураПараметровСайта.Пароль, ИнтернетПрокси, СтруктураПараметровСайта.ЗащищенноеСоединение);
		
	Исключение
		
		ТексОшибки = "Не удалось установить соединение с сервером " + СтруктураПараметровСайта.Сервер + ":" + Строка(СтруктураПараметровСайта.Порт) + ".
		|Проверьте правильность адреса сервера, порт, имя пользователя и пароль.";
		
		Соединение = Неопределено;
		
	Конецпопытки;
	
	Возврат Соединение;
	
КонецФункции

Функция HTTPПолучитьДанныеССервера(Соединение, ПараметрыЗапроса="", Заголовки="", СтрокаСообщенияПользователю = "") Экспорт
	
	ОтветСервера   = Неопределено; 
	
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	
	Попытка
		Соединение.Получить(СокрЛП(ПараметрыЗапроса), ИмяФайлаОтвета, СокрЛП(Заголовки));
	Исключение
		СтрокаСообщенияПользователю = "Не удалось получить данные с сервера. Проверьте правильность адреса сервера, порт, имя пользователя и пароль,"
		+ Символы.ПС + "а также настройки подключения к Интернет." + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;	
	
	ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
	
	Если ФайлОтвета.Существует() Тогда
		
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяФайлаОтвета);
		Если ТекстОтвета.КоличествоСтрок()>0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();
		Иначе
			СтрокаСообщенияПользователю = СтрокаСообщенияПользователю + Символы.ПС + "Получение данных с сервера: Получен пустой ответ сервера."; 	
		КонецЕсли;
		
	Иначе	
		СтрокаСообщенияПользователю = СтрокаСообщенияПользователю + Символы.ПС + "Получение данных с сервера: Ответ сервера не получен."; 
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаОтвета);
	Исключение
	КонецПопытки;
	
	Возврат ОтветСервера;
	
КонецФункции

функция ПолучитьСписокНомАЭ()
	//соединение
	Списокном = новый СписокЗначений;
	Base="Srvr=""sigma:2041"";Ref=""v82ib_fedunov_ut""";
	UsrPwd = "Usr=Администратор;Pwd=cegthuthjq";
	СтрокаСоединенияCOM = Base+";"+UsrPwd;
	
	Соединение = ПолучитьСоединение(СтрокаСоединенияCOM); 
	Если Соединение = неопределено тогда
		возврат ЛОЖЬ;
	КонецЕсли;
	
	Запрос = Соединение.NewObject("Запрос");
	Запрос.Текст=Запрос = Соединение.NewObject("Запрос");
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|ТоварыНаСайте.Номенклатура.Код
	|ИЗ
	|	РегистрСведений.ТоварыНаСайте КАК ТоварыНаСайте";
	;
    рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() цикл
		Списокном.Добавить(Рез.НоменклатураКод);	
	КонецЦикла;
	Возврат Списокном;
КонецФункции

функция ПолучитьСоединение(СтрокаСоединенияCOM="", v8="V82") Экспорт
	
	v8connect = Новый COMОбъект(v8+".ComConnector");
	Попытка
	Соединение = v8connect.Connect(СтрокаСоединенияCOM);
	#Если Клиент Тогда
	ТипБазы = "Ref=";  длТипаБазы=3;
	Если Найти(СтрокаСоединенияCOM,"File=")>0 тогда		
		ТипБазы = "File="; длТипаБазы=4;
	КонецЕсли;	
	имяБД = Прав(СтрокаСоединенияCOM,стрДлина(СтрокаСоединенияCOM) - найти(СтрокаСоединенияCOM,ТипБазы)-длТипаБазы);
	имяБД = Лев(имяБД, найти(имяБД,";")-1);
	Сообщить("Соединение с базой: "+имяБД+" - успешно установлено.", СтатусСообщения.Информация);
	#КонецЕсли
	Исключение
	#Если Клиент Тогда
		Сообщить("Ошибка соединения с базой: " + ОписаниеОшибки(), СтатусСообщения.Внимание);
	#КонецЕсли
		Возврат неопределено;
	КонецПопытки;
	
	Возврат Соединение;
	
КонецФункции

