Перем ПараметрДанныхНачалоПериода, ПараметрДанныхКонецПериода, ПараметрДанныхКонПериода;

Процедура ДатаНачалаПриИзменении(Элемент)
	
	ПараметрДанныхНачалоПериода.Значение = ДатаНачала;	
	
КонецПроцедуры

Процедура ДатаОкончанияПриИзменении(Элемент)
	
	ПараметрДанныхКонецПериода.Значение = КонецДня(ДатаОкончания);
	ПараметрДанныхКонПериода.Значение = КонецДня(ДатаОкончания)+1;
	
КонецПроцедуры

Процедура КнопкаВыбораПериодаНажатие(Элемент)
	
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.УстановитьПериод(ДатаНачала, ?(ДатаОкончания='0001-01-01', ДатаОкончания, КонецДня(ДатаОкончания)));
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	Если НастройкаПериода.Редактировать() Тогда
		ДатаНачала = НастройкаПериода.ПолучитьДатуНачала();
		ДатаОкончания = НастройкаПериода.ПолучитьДатуОкончания();
		ПараметрДанныхНачалоПериода.Значение = ДатаНачала;	
		ПараметрДанныхКонецПериода.Значение = КонецДня(ДатаОкончания);
		ПараметрДанныхКонПериода.Значение = КонецДня(ДатаОкончания)+1;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ЭлементыФормы.Периодичность.СписокВыбора.Добавить("День", "День");
	ЭлементыФормы.Периодичность.СписокВыбора.Добавить("Неделя", "Неделя");
	ЭлементыФормы.Периодичность.СписокВыбора.Добавить("Месяц", "Месяц");
	
	СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	УстановитьНастройки();
	
КонецПроцедуры

Процедура УстановитьНастройки()
	
	ПараметрДанныхНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0];
	ПараметрДанныхНачалоПериода.Значение = ДатаНачала;
	ПараметрДанныхНачалоПериода.Использование = Истина;
	
	ПараметрДанныхКонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1];
	ПараметрДанныхКонецПериода.Значение = КонецДня(ДатаОкончания);
	ПараметрДанныхКонецПериода.Использование = Истина;
	
	ПараметрДанныхКонПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[3];
	ПараметрДанныхКонПериода.Значение = КонецДня(ДатаОкончания)+1;
	ПараметрДанныхКонПериода.Использование = Истина;
		
	Настройки = КомпоновщикНастроек.Настройки;
		
КонецПроцедуры

Процедура ПериодичностьПриИзменении(Элемент)
	
	ПараметрДанныхПериодичность = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[2];
	ПараметрДанныхПериодичность.Значение = Элемент.Значение;
	ПараметрДанныхПериодичность.Использование = Истина;
	
КонецПроцедуры
