
Процедура ПередУдалением(Отказ)
	Для каждого стр из Товары Цикл
		Если ЗначениеЗаполнено(стр.Комплектация) Тогда	
			Док = Стр.Комплектация.ПолучитьОбъект();
			Док.УстановитьПометкуУдаления(Истина);
			Док.Записать(РежимЗаписиДокумента.Запись);
		конецЕсли;	
	конецЦикла;	

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Для каждого стр из Товары Цикл
		Если ЗначениеЗаполнено(стр.Комплектация) Тогда	
			Док = Стр.Комплектация.ПолучитьОбъект();
			Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		конецЕсли;	
	конецЦикла;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если пометкаУдаления Тогда
		Для каждого стр из Товары Цикл
			Если ЗначениеЗаполнено(стр.Комплектация) Тогда	
				Если не стр.Комплектация.ПометкаУдаления Тогда
				Док = Стр.Комплектация.ПолучитьОбъект();
				Док.УстановитьПометкуУдаления(Истина);
				Док.Записать(РежимЗаписиДокумента.Запись);
				конецесли;
			конецЕсли;	
		конецЦикла;	
	конецесли;
	
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
			Для каждого стр из Товары Цикл
			Если ЗначениеЗаполнено(стр.Комплектация) Тогда	
				Если не стр.Комплектация.ПометкаУдаления Тогда
				Док = Стр.Комплектация.ПолучитьОбъект();
				Док.Записать(РежимЗаписиДокумента.Проведение);
				конецесли;
			конецЕсли;	
		конецЦикла;	

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения <> Неопределено Тогда
		//Если ТипЗнч(ДанныеЗаполнения.ЗаявкаОснование.ДокументОснование) = тип("ДокументСсылка.ЗаявкаНаБрак") Тогда
			ДокументОснование = ДанныеЗаполнения.Ссылка;	
			Организация = ДанныеЗаполнения.Организация;
			Подразделение = ДанныеЗаполнения.Подразделение;
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаявкаНаБракРасшифровка.Номенклатура,
			|	ЗаявкаНаБракРасшифровка.ВидДефектаДляУценки,
			|	ЗаявкаНаБракРасшифровка.КоличествоПринято
			|ПОМЕСТИТЬ Заявка
			|ИЗ
			|	Документ.ЗаявкаНаБрак.Расшифровка КАК ЗаявкаНаБракРасшифровка
			|ГДЕ
			|	ЗаявкаНаБракРасшифровка.Ссылка = &СсылкаЗаявка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
			|	СУММА(ВозвратТоваровОтПокупателяТовары.Количество) КАК Количество,
			|	ВозвратТоваровОтПокупателяТовары.Склад
			|ПОМЕСТИТЬ Возврат
			|ИЗ
			|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
			|ГДЕ
			|	ВозвратТоваровОтПокупателяТовары.Ссылка = &СсылкаВозврат
			|
			|СГРУППИРОВАТЬ ПО
			|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
			|	ВозвратТоваровОтПокупателяТовары.Склад
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Возврат.Номенклатура КАК Номенклатура,
			|	Возврат.Количество КАК Количество,
			|	Заявка.ВидДефектаДляУценки,
			|	Заявка.КоличествоПринято КАК КоличествоПринято,
			|	Возврат.Склад
			|ИЗ
			|	Возврат КАК Возврат
			|		ЛЕВОЕ СОЕДИНЕНИЕ Заявка КАК Заявка
			|		ПО Возврат.Номенклатура = Заявка.Номенклатура
			|ИТОГИ
			|	МАКСИМУМ(Количество),
			|	СУММА(КоличествоПринято)
			|ПО
			|	Номенклатура";
			
			Запрос.УстановитьПараметр("СсылкаВозврат", ДанныеЗаполнения.Ссылка);
			Запрос.УстановитьПараметр("СсылкаЗаявка", ДанныеЗаполнения.ЗаявкаОснование.ДокументОснование);
			
			Результат = Запрос.Выполнить();
			
			ВыборкаНоменклатура = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаНоменклатура.Следующий() Цикл
				Если ВыборкаНоменклатура.Количество > ВыборкаНоменклатура.КоличествоПринято Тогда
					Сообщить("В возврате номенклатуры "+ВыборкаНоменклатура.Номенклатура.Код+" "+ВыборкаНоменклатура.Номенклатура+ " больше чем в заявке на брак");	
				иначе
					ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						строка = Товары.Добавить();
						Строка.Номенклатура = ВыборкаДетальныеЗаписи.номенклатура;
						строка.Дефект = ВыборкаДетальныеЗаписи.ВидДефектаДляУценки;
						строка.Склад =  ВыборкаДетальныеЗаписи.Склад;
						строка.Количество =  ВыборкаДетальныеЗаписи.КоличествоПринято;
						
					КонецЦикла;
				конецЕсли;
			КонецЦикла;
		//иначе
		//	Сообщить("Документ возврата создан не наосновании заявки на брак!");	
		//конецЕсли;	
	конецесли;
КонецПроцедуры
