
Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
	
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = НачПериода;
    		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = КонецДня(КонПериода);


КонецПроцедуры

Процедура КонПериодаПриИзменении(Элемент)
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = КонецДня(КонПериода);

КонецПроцедуры

Процедура НачПериодаПриИзменении(Элемент)
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = НачПериода;

КонецПроцедуры

Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	ЭлементРасшифровкиДанных = ДанныеРасшифровки.Элементы[Расшифровка];
	ЭлементРасшифровкиДанныхПоля = ЭлементРасшифровкиДанных.ПолучитьПоля()[0];
	Если  ЭлементРасшифровкиДанныхПоля.Поле = "ДоляЗатрат"  тогда
		СтандартнаяОбработка = Ложь;
		
		попытка
		ПодразделениеДохода =ЭлементРасшифровкиДанных.ПолучитьРодителей()[1].ПолучитьПоля()[0].Значение;
	    исключение
		ПодразделениеДохода = "Прибылеобразующие";
		конецПопытки;
		
		Аналитика1 =ЭлементРасшифровкиДанных.ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
		попытка
			Аналитика2 = ЭлементРасшифровкиДанных.ПолучитьРодителей()[0].ПолучитьРодителей()[0].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
		исключение
			Аналитика2 = Неопределено;
		конецПопытки;
		
		Если Аналитика1<>"3. Валовая прибыль" и Аналитика1<>"2. Сумма себестоимости" и Аналитика1<>"1. Сумма продаж" тогда
			
			
			Форма = ПолучитьФорму("ФормаОтчета1");
			
			Если ТипЗнч(Аналитика1) = Тип("СправочникСсылка.СтатьиЗатрат") тогда
				Форма.СтатьяЗатрат = Аналитика1;
				Если Аналитика2 = "4.Затраты подразделения" тогда
					форма.подразделение = ПодразделениеДохода;	
				иначе
					форма.Подразделение = "Распределяемые";
				конецЕсли;
			ИначеЕсли ТипЗнч(Аналитика1) = Тип("СправочникСсылка.Подразделения") тогда
				форма.подразделение = Аналитика1;	
				Форма.СтатьяЗатрат = Аналитика2;
			ИначеЕсли Аналитика1 = "4.Затраты подразделения" тогда
				форма.подразделение = ПодразделениеДохода;	
				Форма.СтатьяЗатрат = неопределено;
			иначе
				форма.СтатьяЗатрат = Неопределено;
				форма.Подразделение = "Распределяемые";
			конецЕсли;
			
			форма.началоПериода = НачПериода;
			Форма.КонецПериода = КонПериода;
			форма.Открыть();
			
		иначе
			ЭлементСправочника = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Валовая прибыль");
			ХранилищеВО = ЭлементСправочника.ХранилищеВнешнейОбработки.Получить();
			ИмяФайла = КаталогВременныхФайлов()+"PrnForm.tmp";
			ХранилищеВО.Записать(ИмяФайла);
			ОбработкаДЗ = ВнешниеОбработки.Создать(ИмяФайла);
			ФормаОбработки = ОбработкаДЗ.ПолучитьОсновнуюФорму();
			ФормаОбработки.Открыть();
			ОбработкаДЗ.ОбщийОтчет.ДатаНач = НачПериода;
			ОбработкаДЗ.ОбщийОтчет.ДатаКон = КонецДня(КонПериода);
			Если типЗнч(ПодразделениеДохода) = Тип("СправочникСсылка.Подразделения") тогда
			ОтборПодразделение = ОбработкаДЗ.ОбщийОтчет.ПостроительОтчета.Отбор.Добавить("Подразделение");
			ОтборПодразделение.ВидСравнения = ВидСравнения.ВИерархии;
			ОтборПодразделение.Значение = ПодразделениеДохода;
			ОтборПодразделение.Использование = Истина;
			конецЕсли;
			
			ФормаОбработки.ОбновитьОтчет();
			
			
			
		конецесли;
		
	конецЕсли;
	
	
	
КонецПроцедуры

Процедура ПоОплатеПриИзменении(Элемент)
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПоНачислению"));
	ПараметрСКД.Использование = Истина;
	если элементыформы.поОплате.Значение=1 тогда
		ПараметрСКД.Значение  = Истина;
	иначе
		ПараметрСКД.Значение  = ложь;

	конецесли;	

КонецПроцедуры

Процедура ДействияФормыДействие6(Кнопка)
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПоНачислению"));
	ПараметрСКД.Использование = Истина;
	если элементыформы.поОплате.Значение=1 тогда
		ПараметрСКД.Значение  = Истина;
	иначе
		ПараметрСКД.Значение  = ложь;

	конецесли;	
	
	
список = Новый списокЗначений;
Список.Добавить(Справочники.СтатьиЗатрат.НайтиПоКоду("О0177"));//ндс
Список.Добавить(Справочники.СтатьиЗатрат.НайтиПоКоду("О0172"));//прибыль местный
Список.Добавить(Справочники.СтатьиЗатрат.НайтиПоКоду("О0174"));//прибыль федеральный	

ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтатьиНалогов"));
ПараметрСКД.Использование = Истина;
ПараметрСКД.Значение  =список;

ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НДС"));
ПараметрСКД.Использование = истина ;
ПараметрСКД.Значение  =Справочники.СтатьиЗатрат.НайтиПоКоду("О0177");
	
//ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("прибыль"));
//ПараметрСКД.Использование = Истина;
//ПараметрСКД.Значение  =Справочники.СтатьиЗатрат.НайтиПоКоду("О0172");
//	
	
ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Бонусы"));
ПараметрСКД.Использование = Истина;
ПараметрСКД.Значение  =Справочники.Номенклатура.НайтиПоКоду("9278960");
	
	
	СКДНастроек = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	ТекстЗапроса = СКДНастроек.НаборыДанных.НаборДанных1.Запрос;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	
	"ВЫБРАТЬ
	|	ДАТАВРЕМЯ(2017, 1, 1) КАК Период,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	0 КАК Бонус
	|ПОМЕСТИТЬ втБонусы",
	ПолучитьБонусы(ложь).ТекстЗапросаБонусы);
	
	ЭлементыФормы.Результат.Очистить();
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = ТекстЗапроса;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных,   ЭтотОбъект.КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ЭлементыФормы.Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);

КонецПроцедуры
