
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
   СтандартнаяОбработка = Ложь;	
    ТабЗвонков = ПолучитьЗвонки(ДобавитьМесяц(ТекущаяДата(),-6),ТекущаяДата());
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки = КомпоновщикНастроек.Настройки;
   ПараметрСКД = Настройки.ПараметрыДанных.Элементы.Найти("Свойство");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90218");
   ПараметрСКД = Настройки.ПараметрыДанных.Элементы.Найти("ПервичныйКонтрагент");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90230");
   
   
    ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ВнешнийНаборДанных = Новый Структура("ТабЗвонков", ТабЗвонков);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки,истина);
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

Функция  ПолучитьЗвонки(ДатаН,ДатаК)
   Запрос = Новый запрос;
   запрос.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
   Запрос.Текст = "ВЫБРАТЬ
                  |	ВЫБОР
                  |		КОГДА ТИПЗНАЧЕНИЯ(КонтактнаяИнформация.Объект) = ТИП(Справочник.КонтактныеЛица)
                  |				И ТИПЗНАЧЕНИЯ(КонтактнаяИнформация.Объект.ОбъектВладелец) = ТИП(Справочник.Контрагенты)
                  |			ТОГДА КонтактнаяИнформация.Объект.ОбъектВладелец
                  |		ИНАЧЕ КонтактнаяИнформация.Объект
                  |	КОНЕЦ КАК Объект,
                  |	КонтактнаяИнформация.Представление
                  |ИЗ
                  |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
                  |ГДЕ
                  |	КонтактнаяИнформация.Тип = &Тип
                  |	И КонтактнаяИнформация.Представление ПОДОБНО ""%___""";
				  
   Телефоны = Запрос.Выполнить().Выгрузить();
   Обработать = Телефоны.Скопировать();
   
   
   
   КС = Новый КвалификаторыСтроки(6);
   Массив = Новый Массив;
   Массив.Добавить(Тип("Строка"));
   ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
   Телефоны.Колонки.Добавить("Поиск",ОписаниеТиповС);
   Телефоны.Очистить();
   Для каждого стр из Обработать Цикл
	Строка = Стр.Представление;
    Строка = СтрЗаменить(Строка,"(","");
   	Строка = СтрЗаменить(Строка,")","");
   	Строка = СтрЗаменить(Строка,"-","");
   	Строка = СтрЗаменить(Строка,".",",");
    Строка = СтрЗаменить(Строка," ","");
	Строка = СтрЗаменить(Строка,";",",");
	Строка = СтрЗаменить(Строка,":","");
	
	ТекущаяСтрока = СтрЗаменить(Строка, ",", Символы.ПС); 
	Для Счетчик = 1 По СтрЧислоСтрок(ТекущаяСтрока) Цикл
		Если СтрДлина(СтрПолучитьСтроку(ТекущаяСтрока, Счетчик)) > 2 Тогда
		    Нов = Телефоны.Добавить();
		    Нов.Объект = стр.Объект;
		    Нов.Поиск = Прав(СтрПолучитьСтроку(ТекущаяСтрока, Счетчик),6);
		КонецЕсли;
	КонецЦикла;
	
	
   КонецЦикла;


		ЗапросМобильные = Новый Запрос;
		ЗапросМобильные.УстановитьПараметр("Телефоны",Телефоны);
		ЗапросМобильные.УстановитьПараметр("ДатаН",ДатаН);
		ЗапросМобильные.УстановитьПараметр("ДатаК",ДатаК);
		ЗапросМобильные.УстановитьПараметр("ПервичныйКонтрагент",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90230"));
		ЗапросМобильные.Текст = "ВЫБРАТЬ
		                        |	Журнал.Дата,
		                        |	Журнал.ПоискСотрудник КАК НомерСотрудника,
		                        |	Журнал.ПоискАбонент КАК НомерАбонента,
		                        |	Журнал.ДлительностьЗвонка,
		                        |	Журнал.Исход_Вход,
		                        |	Журнал.НомерСотрудника КАК НомерСотрудника1,
		                        |	Журнал.НомерАбонента КАК НомерАбонента1,
		                        |	Журнал.Ссылка
		                        |ПОМЕСТИТЬ Журнал
		                        |ИЗ
		                        |	РегистрСведений.ЖурналЗвонков КАК Журнал
		                        |ГДЕ
		                        |	Журнал.Дата МЕЖДУ &ДатаН И &ДатаК
		                        |	И Журнал.ДлительностьЗвонка > 179
		                        |	И Журнал.ПоискАбонент ПОДОБНО ""______""
		                        |;
		                        |
		                        |////////////////////////////////////////////////////////////////////////////////
		                        |ВЫБРАТЬ
		                        |	Телефоны.Объект,
		                        |	Телефоны.Поиск КАК Представление
		                        |ПОМЕСТИТЬ Телефоны
		                        |ИЗ
		                        |	&Телефоны КАК Телефоны
		                        |
		                        |ИНДЕКСИРОВАТЬ ПО
		                        |	Представление
		                        |;
		                        |
		                        |////////////////////////////////////////////////////////////////////////////////
		                        |ВЫБРАТЬ
		                        |	Журнал.Дата,
		                        |	МАКСИМУМ(Телефоны1.Объект) КАК Контрагент
		                        |ПОМЕСТИТЬ Звонки
		                        |ИЗ
		                        |	Журнал КАК Журнал
		                        |		ЛЕВОЕ СОЕДИНЕНИЕ Телефоны КАК Телефоны
		                        |		ПО Журнал.НомерСотрудника = Телефоны.Представление
		                        |		ЛЕВОЕ СОЕДИНЕНИЕ Телефоны КАК Телефоны1
		                        |		ПО Журнал.НомерАбонента = Телефоны1.Представление
		                        |
		                        |СГРУППИРОВАТЬ ПО
		                        |	Журнал.Дата
		                        |;
		                        |
		                        |////////////////////////////////////////////////////////////////////////////////
		                        |ВЫБРАТЬ
		                        |	ЗначенияСвойствОбъектов.Объект,
		                        |	ЗначенияСвойствОбъектов.Значение
		                        |ПОМЕСТИТЬ ПервичныйКонтрагент
		                        |ИЗ
		                        |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		                        |ГДЕ
		                        |	ЗначенияСвойствОбъектов.Свойство = &ПервичныйКонтрагент
		                        |;
		                        |
		                        |////////////////////////////////////////////////////////////////////////////////
		                        |ВЫБРАТЬ
		                        |	КОЛИЧЕСТВО(Звонки.Дата) КАК КоличествоЗвонков,
		                        |	ЕСТЬNULL(ПервичныйКонтрагент.Значение, Звонки.Контрагент) КАК Контрагент
		                        |ИЗ
		                        |	Звонки КАК Звонки
		                        |		ЛЕВОЕ СОЕДИНЕНИЕ ПервичныйКонтрагент КАК ПервичныйКонтрагент
		                        |		ПО Звонки.Контрагент = ПервичныйКонтрагент.Объект
		                        |
		                        |СГРУППИРОВАТЬ ПО
		                        |	ЕСТЬNULL(ПервичныйКонтрагент.Значение, Звонки.Контрагент)";
        Рез = ЗапросМобильные.Выполнить().Выгрузить();
				
		
	    возврат  Рез;
	
	
конецФункции	