
Процедура КнопкаВыполнитьНажатие(Кнопка)
	ТабличныйДокумент = Новый ТабличныйДокумент();
	Макет=ПолучитьМакет("Макет");
	
	Для сч=0 по ТабличноеПоле1.Количество()-1 Цикл
		НоваяСтрока=ТабличноеПоле1[сч];
		Если Не ЗначениеНеЗаполнено(НоваяСтрока.Контрагент) Тогда
			ОбластьЗаголовок= Макет.ПолучитьОбласть("Заголовок");
			
			ПолноеНаименование=ОписаниеОрганизации(СведенияОЮрФизЛице(НоваяСтрока.Контрагент, ТекущаяДата()), "ПолноеНаименование,");	
			ПочтовыйАдрес=ПолучитьПочтовыйАдрес(НоваяСтрока.Контрагент);
			Если ЗначениеНеЗаполнено(ПочтовыйАдрес) Тогда
				ПочтовыйАдрес=ОписаниеОрганизации(СведенияОЮрФизЛице(НоваяСтрока.Контрагент, ТекущаяДата()), "Фактический,");	
				
				Если ЗначениеНеЗаполнено(ПочтовыйАдрес) Тогда
					ПочтовыйАдрес=ОписаниеОрганизации(СведенияОЮрФизЛице(НоваяСтрока.Контрагент, ТекущаяДата()), "ЮридическийАдрес,");	
				КонецЕсли;
			КонецЕсли;	
			ОбластьЗаголовок.Параметры.ПочтовыйАдрес= "Кому:"+ПолноеНаименование+Символы.ВК+"Куда:"+ПочтовыйАдрес;	
			ТабличныйДокумент.Вывести(ОбластьЗаголовок); 
			Если сч>0 и Цел(сч/2)=сч/2 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
		КонецЕсли;	
	КонецЦикла;	
	ТабличныйДокумент.ОтображатьЗаголовки=Ложь;
	ТабличныйДокумент.ОтображатьСетку=Ложь;
	      ТабличныйДокумент.Показать();
КонецПроцедуры

Процедура КоманднаяПанель1Действие1(Кнопка)
	ФормаСписка = Справочники.Контрагенты.ПолучитьФормуСписка(,ЭтаФорма);
	ФормаСписка.РежимВыбора=Истина;
	ФормаСписка.ЗакрыватьПриВыборе=Ложь;
	ФормаСписка.Открыть();
	
КонецПроцедуры

Процедура ОбработкаВыбора(ЗначениеВыбора, Источник)
	НоваяСтрока=ТабличноеПоле1.Добавить();
	НоваяСтрока.Контрагент= ЗначениеВыбора;
	
КонецПроцедуры


Функция  ПолучитьПочтовыйАдрес(КонтрагентСсылка)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Объект", КонтрагентСсылка);
	Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Адрес);// это не адрес!
	Запрос.УстановитьПараметр("Вид"   , Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("00015"));
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	//|	И
	//|	КонтактнаяИнформация.Тип = &Тип
	|	И
	|	КонтактнаяИнформация.Вид = &Вид
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].Представление;
	КонецЕсли;

КонецФункции	