Перем ФактАдресОрганизации, ЮрАдресОрганизации, ТелефонОрганизации;
Перем ФактАдресКонтрагента, ЮрАдресКонтрагента, ТелефонКонтрагента;

/////////////////////////////////////////////////////////////////////////////////////////////
// РАБОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ
/////////////////////////////////////////////////////////////////////////////////////////////


Процедура ПолучитьДанныеПоДокументу()
	
	Расхождения.Очистить();
	Комиссия.Очистить();
	
	ЭтаФорма.МестоПриемкиТовара="";
	ЭтаФорма.СпособДоставки="";	
	ЭтаФорма.НомерАкта="";
	ЭтаФорма.ДатаАкта="";
	ЭтаФорма.МестоОпределениеКолво = "";
	ЭтаФорма.ОпределениеКоличества = "";

 	ЭтаФорма.ДолжностьПредставителя ="";
    ЭтаФорма.РасшифровкаПод="";
	
	ЭтаФорма.ДокументУдостоверяющийПолномочия="";
	ЭтаФорма.НомерДокумента="";
	ЭтаФорма.КемВыданДата="";
	
	ВыбраннаяОрганизация = СсылкаНаОбъект.Организация;
	
	// Лунегов П.В. +++
	//Определим фактический, юридический адрес организации и телефон
	Запрос = Новый Запрос;
	Запрос.текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация,                                  
	|	ФактическийАдрес.Представление КАК ФактическийАдрес,
	|	ЮридическийАдрес.Представление КАК ЮридическийАдрес,
	|	Телефон.Представление КАК Телефон
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ФактическийАдрес
	|		ПО (ФактическийАдрес.Объект = Организации.Ссылка)
	|			И (ФактическийАдрес.Тип = &ТипКонтактнойИнформацииАдрес)
	|			И (ФактическийАдрес.Вид = &ВидКонтактнойИнформацииФактическийАдресОрганизации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ЮридическийАдрес
	|		ПО (ЮридическийАдрес.Объект = Организации.Ссылка)
	|			И (ЮридическийАдрес.Вид = &ВидКонтактнойИнформацииЮридическийАдресОрганизации)
	|			И (ЮридическийАдрес.Тип = &ТипКонтактнойИнформацииАдрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК Телефон
	|		ПО (Телефон.Объект = Организации.Ссылка)
	|			И (Телефон.Тип = &ТипКонтактнойИнформацииТелефон)
	|			И (Телефон.Вид = &ВидКонтактнойИнформацииТелефонОрганизации)
	|ГДЕ
	|	Организации.Ссылка = &Организация";
	Запрос.УстановитьПараметр("ТипКонтактнойИнформацииАдрес", 							Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ВидКонтактнойИнформацииФактическийАдресОрганизации", 	Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
	Запрос.УстановитьПараметр("ВидКонтактнойИнформацииЮридическийАдресОрганизации", 	Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	Запрос.УстановитьПараметр("ВидКонтактнойИнформацииТелефонОрганизации", 				Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	Запрос.УстановитьПараметр("ТипКонтактнойИнформацииТелефон", 						Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Организация", 											ВыбраннаяОрганизация);
	РезультатЗапроса = Запрос.выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		Сообщить("НЕ найдено ни фактического адреса организации документа, ни юридического, ни телефона!");
		Сообщить("Заполните поле ""Место приемки товара"" (и др. поля) вручную!");
	ИначеЕсли РезультатЗапроса.Количество() <> 0 Тогда
		ФактАдресОрганизации 	= РезультатЗапроса[0].ФактическийАдрес;
		ЮрАдресОрганизации		= РезультатЗапроса[0].ЮридическийАдрес;
		ТелефонОрганизации		= РезультатЗапроса[0].Телефон;
		Если ФактАдресОрганизации = "" Тогда
			Сообщить("НЕ найден фактический адрес организации документа!");
		КонецЕсли;
		Если ЮрАдресОрганизации = "" Тогда
			Сообщить("НЕ найден юридический адрес организации документа!");
		КонецЕсли;
		Если ТелефонОрганизации = "" Тогда
			Сообщить("НЕ найден телефон организации документа!");
		КонецЕсли;
	КонецЕсли;
	
	//Определим фактический, юридический адрес контрагента и телефон
	Запрос = Новый Запрос;
	Запрос.текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ФактическийАдрес.Представление КАК ФактическийАдрес,
	|	ЮридическийАдрес.Представление КАК ЮридическийАдрес,
	|	Телефон.Представление КАК Телефон
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ФактическийАдрес
	|		ПО (ФактическийАдрес.Объект = Контрагенты.Ссылка)
	|			И (ФактическийАдрес.Тип = &ТипКонтактнойИнформацииАдрес)
	|			И (ФактическийАдрес.Вид = &ВидКонтактнойИнформацииФактическийАдресКонтрагента)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ЮридическийАдрес
	|		ПО (ЮридическийАдрес.Объект = Контрагенты.Ссылка)
	|			И (ЮридическийАдрес.Вид = &ВидКонтактнойИнформацииЮридическийАдресКонтрагента)
	|			И (ЮридическийАдрес.Тип = &ТипКонтактнойИнформацииАдрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК Телефон
	|		ПО (Телефон.Объект = Контрагенты.Ссылка)
	|			И (Телефон.Тип = &ТипКонтактнойИнформацииТелефон)
	|			И (Телефон.Вид = &ВидКонтактнойИнформацииТелефонКонтрагента)
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент";
	Запрос.УстановитьПараметр("ТипКонтактнойИнформацииАдрес", 							Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ВидКонтактнойИнформацииФактическийАдресКонтрагента", 	Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
	Запрос.УстановитьПараметр("ВидКонтактнойИнформацииЮридическийАдресКонтрагента", 	Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	Запрос.УстановитьПараметр("ВидКонтактнойИнформацииТелефонКонтрагента", 				Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	Запрос.УстановитьПараметр("ТипКонтактнойИнформацииТелефон", 						Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Контрагент", 											ВыбраннаяОрганизация);
	РезультатЗапроса = Запрос.выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		Сообщить("НЕ найдено ни фактического адреса организации документа, ни юридического, ни телефона!");
		Сообщить("Заполните поле ""Место приемки товара"" (и др. поля) вручную!");
	ИначеЕсли РезультатЗапроса.Количество() <> 0 Тогда
		ФактАдресКонтрагента 	= РезультатЗапроса[0].ФактическийАдрес;
		ЮрАдресКонтрагента		= РезультатЗапроса[0].ЮридическийАдрес;
		ТелефонКонтрагента		= РезультатЗапроса[0].Телефон;
		Если ФактАдресКонтрагента = "" Тогда
			Сообщить("НЕ найден фактический адрес организации документа!");
		КонецЕсли;
		Если ЮрАдресКонтрагента = "" Тогда
			Сообщить("НЕ найден юридический адрес организации документа!");
		КонецЕсли;
		Если ТелефонКонтрагента = "" Тогда
			Сообщить("НЕ найден телефон организации документа!");
		КонецЕсли;
	КонецЕсли;
	
	// Лунегов П.В. ---
	
	ЭтаФорма.МестоПриемкиТовара 		= ФактАдресОрганизации; 
	ЭтаФорма.МестоОпределениеКолво 		= ФактАдресОрганизации;
	ЭтаФорма.ОпределениеКоличества 		= "счетом";
	
	ЭтаФорма.СпособДоставки 			= "автомобильный";
	
	ЭтаФорма.ДокументУдостоверяющийПолномочия = "паспорт";
    ЭтаФорма.Решение="";
	
	ЗапросНоменклатура = Новый Запрос;
	ЗапросНоменклатура.УстановитьПараметр("Заказ",СсылкаНаОбъект.Сделка);
	ЗапросНоменклатура.УстановитьПараметр("Поступление",СсылкаНаОбъект);
	ЗапросНоменклатура.Текст = "ВЫБРАТЬ
	                           |	ПоступлениеТоваровУслугТовары.Номенклатура,
	                           |	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество
	                           |ПОМЕСТИТЬ Поступления
	                           |ИЗ
	                           |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	                           |ГДЕ
	                           |	ПоступлениеТоваровУслугТовары.Ссылка = &Поступление
	                           |
	                           |СГРУППИРОВАТЬ ПО
	                           |	ПоступлениеТоваровУслугТовары.Номенклатура
	                           |;
	                           |
	                           |////////////////////////////////////////////////////////////////////////////////
	                           |ВЫБРАТЬ
	                           |	ЗаказПоставщикуТовары.Номенклатура,
	                           |	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество
	                           |ПОМЕСТИТЬ Заказы
	                           |ИЗ
	                           |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	                           |ГДЕ
	                           |	ЗаказПоставщикуТовары.Ссылка = &Заказ
	                           |
	                           |СГРУППИРОВАТЬ ПО
	                           |	ЗаказПоставщикуТовары.Номенклатура
	                           |;
	                           |
	                           |////////////////////////////////////////////////////////////////////////////////
	                           |ВЫБРАТЬ
	                           |	Поступления.Номенклатура,
	                           |	Поступления.Количество КАК КоличествоПоступление,
	                           |	Заказы.Количество КАК КоличествоЗаказ
	                           |ИЗ
	                           |	Поступления КАК Поступления
	                           |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Заказы КАК Заказы
	                           |		ПО Поступления.Номенклатура = Заказы.Номенклатура";
							   
	Рез = ЗапросНоменклатура.Выполнить().Выгрузить();
	
	Для Каждого Стр ИЗ Рез Цикл
		  НовСтр 					= Расхождения.Добавить();
		  НовСтр.Номенклатура 		= Стр.Номенклатура.Наименование;
		  НовСтр.Артикул 			= Стр.Номенклатура.Артикул;
		  НовСтр.КоличествоДок 		= Стр.КоличествоПоступление;
		  //НовСтр.ЦенаЕд 			= Стр.Цена;
		  //НовСтр.СуммаДок 		= Стр.Сумма;
		  НовСтр.КоличествоФакт 	= Стр.КоличествоПоступление;
	КонецЦикла;
	  
	ПолучитьРуководителя = Новый Запрос(
	"ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо КАК ФизЛицо,
	|	ОтветственныеЛицаОрганизацииСрезПоследних.Должность КАК Должность
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних КАК ОтветственныеЛицаОрганизацииСрезПоследних
	|ГДЕ
	|	ОтветственныеЛицаОрганизацииСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ОтветственныеЛицаОрганизацииСрезПоследних.ОтветственноеЛицо = &ОтветственноеЛицо"); 
	
	  
	ПолучитьРуководителя.УстановитьПараметр("СтруктурнаяЕдиница", ЭтаФорма.Поступление.Организация.Ссылка);
	ПолучитьРуководителя.УстановитьПараметр("ОтветственноеЛицо",  Перечисления.ОтветственныеЛицаОрганизации.Руководитель);
	Руковод = ПолучитьРуководителя.Выполнить().Выбрать();  
	
	Если Руковод.Следующий() Тогда
		НовСтр = Комиссия.Добавить();
		НовСтр.Должность = Руковод.Должность;
		НовСтр.Руководитель = Истина;
		НовСтр.РасшифровкаПодписи = СократитьФамилию(Руковод.ФизЛицо);
	КонецЕсли;	
КонецПроцедуры

Функция СократитьФамилию(ФизическоеЛицо)
	Если ТипЗнч(ФизическоеЛицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Если ФизическоеЛицо <> Справочники.ФизическиеЛица.ПустаяСсылка() тогда
			МассивФИО 			= ПолучитьМассивФИО(ФизическоеЛицо.Наименование);
			Фамилия  			= МассивФИО[0];
			Имя      			= МассивФИО[1];
			Отчество 			= МассивФИО[2];
			
			ФамилияСИнициалами 	= Фамилия + " "+Лев(Имя,1) + ". " + Лев(Отчество,1) + ". " ;
			
			Возврат ФамилияСИнициалами;
		КонецЕсли;
	КонецЕсли;
	Возврат "";
КонецФункции

Функция ПолучитьМассивФИО(ФИО)

	МассивФИО = Новый Массив;
	МассивФИО.Добавить("");
	МассивФИО.Добавить("");
	МассивФИО.Добавить("");
	
	МассивПодсток = РазложитьСтрокуВМассивПодстрок(ФИО, " ");
	Для Индекс = 0 По МассивПодсток.ВГраница() Цикл
		Если Индекс < 3 Тогда
			МассивФИО[Индекс] = МассивПодсток[Индекс];
		Иначе
			МассивФИО[2] = МассивФИО[2] + " " + МассивПодсток[Индекс];
		КонецЕсли;
	КонецЦикла;

	Возврат МассивФИО;
	
КонецФункции // ПолучитьМассивФИО()

Процедура КнопкаВыполнитьНажатие(Кнопка)
		
	ВыбраннаяОрганизация = СсылкаНаОбъект.Организация;
	ВыбранныйКонтрагент = СсылкаНаОбъект.Контрагент;
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.АвтоМасштаб = Истина;
	ПоляОтступа =5;
	ТабДок.ПолеСверху         = ПоляОтступа;
	ТабДок.ПолеСлева          = 15;
	ТабДок.ПолеСнизу          = ПоляОтступа;
	ТабДок.ПолеСправа         = 0;
 	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
 	Макет = ПолучитьМакет("Макет_Торг_2");		
	
//Страница 1

	ОблМакетаСтраница1Шапка    = Макет.ПолучитьОбласть("Страница1Шапка");
	
	ОблМакетаСтраница1Шапка.Параметры.Организация = ВыбраннаяОрганизация.НаименованиеПолное+", "+ЮрАдресОрганизации+", "+ТелефонОрганизации;
	ОблМакетаСтраница1Шапка.Параметры.КодОКПО = ВыбраннаяОрганизация.КодПоОКПО;
	ОблМакетаСтраница1Шапка.Параметры.КодОКДП = "";
	ОблМакетаСтраница1Шапка.Параметры.НомерДок = ЭтаФорма.НомерАкта;
	ОблМакетаСтраница1Шапка.Параметры.ДатаДок = Формат(ЭтаФорма.ДатаАкта,"ДФ=dd.MM.yyyy");
	
	
	ОблМакетаСтраница1Шапка.Параметры.АД = Формат(ЭтаФорма.ДатаАкта, "ДФ=dd");
	ОблМакетаСтраница1Шапка.Параметры.АМ = Формат(ЭтаФорма.ДатаАкта, "ДФ=MM");
	ОблМакетаСтраница1Шапка.Параметры.АГ = Формат(ЭтаФорма.ДатаАкта, "ДФ=yyyy");

//=================================================	
	Для Каждого Стр ИЗ Комиссия Цикл
		
		Если Стр.Руководитель = Истина Тогда
			ДолжРук = Стр.Должность;
			ФИОРук = Стр.РасшифровкаПодписи;
			Прервать;	
		КонецЕсли;	
		
		
	КонецЦикла;
//=================================================	
	ОблМакетаСтраница1Шапка.Параметры.ДолжностьРуководителя = ДолжРук;
	ОблМакетаСтраница1Шапка.Параметры.ФИОРуководитель = ФИОРук;
	ОблМакетаСтраница1Шапка.Параметры.Поставщик = ВыбранныйКонтрагент.НаименованиеПолное+", "+ЮрАдресКонтрагента+", "+ТелефонКонтрагента;
	
	
	ОблМакетаСтраница1Шапка.Параметры.СкладОтправителяТовара = ЮрАдресКонтрагента;
	
	ОблМакетаСтраница1Шапка.Параметры.МестоПриемкиТовара = ЭтаФорма.МестоПриемкиТовара;
//=================================================

    ВыражениеДоговор = СсылкаНаОбъект.Контрагент.ОсновнойДоговорКонтрагента;

	ОблМакетаСтраница1Шапка.Параметры.ДоговорНом = ВыражениеДоговор;
//=================================================	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		НайдемСФДоставки = Новый Запрос("ВЫБРАТЬ
		|	СчетФактураПолученный.ДатаВходящегоДокумента КАК ДатаПоставщика,
		|	СчетФактураПолученный.НомерВходящегоДокумента КАК НомерПоставщика
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	СчетФактураПолученный.ДокументОснование = &ДокументОснование");
		НайдемСФДоставки.УстановитьПараметр("ДокументОснование", СсылкаНаОбъект.Ссылка);
		СФДоставки = НайдемСФДоставки.Выполнить().Выбрать();
		Если СФДоставки.Следующий() Тогда
			ОблМакетаСтраница1Шапка.Параметры.СфНом = СФДоставки.НомерПоставщика;
			ОблМакетаСтраница1Шапка.Параметры.СФД = Формат(СФДоставки.ДатаПоставщика, "ДФ=dd");
			ОблМакетаСтраница1Шапка.Параметры.СФМ = Формат(СФДоставки.ДатаПоставщика, "ДФ=MM");
			ОблМакетаСтраница1Шапка.Параметры.СФГ = Формат(СФДоставки.ДатаПоставщика, "ДФ=yyyy");
		Иначе //Если СФ отсутствует, то берем номер ТН. (так сказали)
			ОблМакетаСтраница1Шапка.Параметры.СфНом = СсылкаНаОбъект.НомерВходящегоДокумента;
			ОблМакетаСтраница1Шапка.Параметры.СФД = Формат(СсылкаНаОбъект.ДатаВходящегоДокумента, "ДФ=dd");
			ОблМакетаСтраница1Шапка.Параметры.СФМ = Формат(СсылкаНаОбъект.ДатаВходящегоДокумента, "ДФ=MM");
			ОблМакетаСтраница1Шапка.Параметры.СФГ = Формат(СсылкаНаОбъект.ДатаВходящегоДокумента, "ДФ=yyyy");		
		КонецЕсли;	
	
		ОблМакетаСтраница1Шапка.Параметры.ТоварнаяНакладная = "Товарная накладная №"+СсылкаНаОбъект.НомерВходящегоДокумента+" от "+Формат(СсылкаНаОбъект.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy")+"г.";
		ОблМакетаСтраница1Шапка.Параметры.СпособДоставки = ЭтаФорма.СпособДоставки;
		ОблМакетаСтраница1Шапка.Параметры.ДатаТоварнойНакладной = Формат(СсылкаНаОбъект.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy")+"г.";
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		НайдемСФДоставки = Новый Запрос("ВЫБРАТЬ
		|	СчетФактураВыданный.Дата КАК ДатаПоставщика,
		|	СчетФактураВыданный.Номер КАК НомерПоставщика
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование = &ДокументОснование");
		НайдемСФДоставки.УстановитьПараметр("ДокументОснование", СсылкаНаОбъект.Ссылка);
		СФДоставки = НайдемСФДоставки.Выполнить().Выбрать();
		
		Если СФДоставки.Следующий() Тогда
			ОблМакетаСтраница1Шапка.Параметры.СфНом = СФДоставки.НомерПоставщика;
			ОблМакетаСтраница1Шапка.Параметры.СФД 	= Формат(СФДоставки.ДатаПоставщика, "ДФ=dd");
			ОблМакетаСтраница1Шапка.Параметры.СФМ 	= Формат(СФДоставки.ДатаПоставщика, "ДФ=MM");
			ОблМакетаСтраница1Шапка.Параметры.СФГ 	= Формат(СФДоставки.ДатаПоставщика, "ДФ=yyyy");
		Иначе
			ОблМакетаСтраница1Шапка.Параметры.СфНом = "";
			ОблМакетаСтраница1Шапка.Параметры.СФД 	= "";
			ОблМакетаСтраница1Шапка.Параметры.СФМ 	= "";
			ОблМакетаСтраница1Шапка.Параметры.СФГ 	= "";
		КонецЕсли;			
	КонецЕсли;
	
	
	ТабДок.Вывести(ОблМакетаСтраница1Шапка);
	
	Страница1Таблица1Шапка    = Макет.ПолучитьОбласть("Страница1Таблица1Шапка");	
	ТабДок.Вывести(Страница1Таблица1Шапка);
	
	Страница1Таблица1Строка    = Макет.ПолучитьОбласть("Страница1Таблица1Строка");	
	ТабДок.Вывести(Страница1Таблица1Строка);
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
//Страница 2	

	ОблМакетаСтраница2Шапка    = Макет.ПолучитьОбласть("Страница2Шапка");	
    ТабДок.Вывести(ОблМакетаСтраница2Шапка);

	
	ОблМакетаСтраница2Таблица2Шапка    = Макет.ПолучитьОбласть("Страница2Таблица2Шапка");	
    ТабДок.Вывести(ОблМакетаСтраница2Таблица2Шапка);

	
	ОблМакетаСтраница2Таблица2Строка    = Макет.ПолучитьОбласть("Страница2Таблица2Строка");	
    ТабДок.Вывести(ОблМакетаСтраница2Таблица2Строка);

	
	ОблМакетаСтраница2Продолжение1    = Макет.ПолучитьОбласть("Страница2Продолжение1");	
    ТабДок.Вывести(ОблМакетаСтраница2Продолжение1);

//====Фактическое расхождение==============	
	ОблМакетаСтраница2Таблица2    = Макет.ПолучитьОбласть("Страница2Таблица2");	
	
		ПоДокументам= ЭтаФорма.Расхождения.Итог("КоличествоДок");
		ПоФакту = ЭтаФорма.Расхождения.Итог("КоличествоФакт");
	 	ОблМакетаСтраница2Таблица2.Параметры.ПоДокам = ПоДокументам;
		ОблМакетаСтраница2Таблица2.Параметры.Фактически = ПоФакту;
		ИтогВсего = ПоФакту - ПоДокументам;
		Если ИтогВсего <=0 Тогда
			ИтогТекст =   Строка(ИтогВсего);
		КонецЕсли;
		Если ИтогВсего >0 Тогда
			ИтогТекст =  "+"+ Строка(ИтогВсего);
		КонецЕсли;
		ОблМакетаСтраница2Таблица2.Параметры.Расхождение=ИтогТекст;
		
	ТабДок.Вывести(ОблМакетаСтраница2Таблица2);
//=========================================	
	
	ОблМакетаСтраница2Таблица3Шапка    = Макет.ПолучитьОбласть("Страница2Таблица3Шапка");	
    ТабДок.Вывести(ОблМакетаСтраница2Таблица3Шапка);
	
//====По документам заказчика числиться====	
    Пункт=1;
	Для Каждого Стр ИЗ Расхождения Цикл
	 	ОблМакетаСтраница2Таблица3Строка  = Макет.ПолучитьОбласть("Страница2Таблица3Строка");	
	 	ОблМакетаСтраница2Таблица3Строка.Параметры.НомПункт 	= Пункт;
		ОблМакетаСтраница2Таблица3Строка.Параметры.Товар 		= Стр.Номенклатура;
		ОблМакетаСтраница2Таблица3Строка.Параметры.ЕдИзм 		= "шт.";
		ОблМакетаСтраница2Таблица3Строка.Параметры.КолвоДок 	= Стр.КоличествоДок;
		ОблМакетаСтраница2Таблица3Строка.Параметры.ЦенаЕд 		= Стр.ЦенаЕд;
		ОблМакетаСтраница2Таблица3Строка.Параметры.Сумма 		= Стр.СуммаДок;
		ОблМакетаСтраница2Таблица3Строка.Параметры.Артикул 		= Стр.Артикул;
		ТабДок.Вывести(ОблМакетаСтраница2Таблица3Строка);	
		Пункт=Пункт+1;	
	КонецЦикла;
//=========================================
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();

	
//Страница 3

	ОблМакетаСтраница3Шапка    = Макет.ПолучитьОбласть("Страница3Шапка");	
	ОблМакетаСтраница3Шапка.Параметры.ДатаВскрытияТары = Формат(ЭтаФорма.ДатаАкта, "ДФ=dd.MM.yyyy")+"г.";
	
	ТабДок.Вывести(ОблМакетаСтраница3Шапка);

	
	
	
	
	ОблМакетаСтраница3Таблица4Шапка    = Макет.ПолучитьОбласть("Страница3Таблица4Шапка");	
    ТабДок.Вывести(ОблМакетаСтраница3Таблица4Шапка);
	
	
//==========================================	
    Для Каждого Стр Из Расхождения Цикл
		
		
		
		
		Если Стр.КоличествоДок=Стр.КоличествоФакт Тогда	
			
			Продолжить;	
			
		Иначе
			
			ОблМакетаСтраница3Таблица4Строка    = Макет.ПолучитьОбласть("Страница3Таблица4Строка");	
	
			
		
		    Если Стр.КоличествоДок>Стр.КоличествоФакт Тогда  //недостача
				
				ОблМакетаСтраница3Таблица4Строка.Параметры.ФактКолво=Стр.КоличествоФакт;	
				ОблМакетаСтраница3Таблица4Строка.Параметры.ФактЦена=Стр.ЦенаЕд;
				ОблМакетаСтраница3Таблица4Строка.Параметры.ФактСумма=Стр.КоличествоФакт*Стр.ЦенаЕд;
				
				ОблМакетаСтраница3Таблица4Строка.Параметры.НедКолво=Стр.КоличествоДок-Стр.КоличествоФакт;
				ОблМакетаСтраница3Таблица4Строка.Параметры.НедСумма=(Стр.КоличествоДок-Стр.КоличествоФакт)*Стр.ЦенаЕд;
		 	Иначе
				
				
				ОблМакетаСтраница3Таблица4Строка.Параметры.ФактКолво=Стр.КоличествоФакт;	
				ОблМакетаСтраница3Таблица4Строка.Параметры.ФактЦена=Стр.ЦенаЕд;
				ОблМакетаСтраница3Таблица4Строка.Параметры.ФактСумма=Стр.КоличествоФакт*Стр.ЦенаЕд;
				
				
				ОблМакетаСтраница3Таблица4Строка.Параметры.ИзлКолво=Стр.КоличествоФакт-Стр.КоличествоДок;
				ОблМакетаСтраница3Таблица4Строка.Параметры.ИзлСумма=(Стр.КоличествоФакт-Стр.КоличествоДок)*Стр.ЦенаЕд;
			КонецЕсли;

		 	ТабДок.Вывести(ОблМакетаСтраница3Таблица4Строка);	
			
		КонецЕсли;
		
	КонецЦикла;
		
//==========================================	
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();

	
//Страница 4

	ОблМакетаСтраница4Шапка    = Макет.ПолучитьОбласть("Страница4Шапка");	
	
	ОблМакетаСтраница4Шапка.Параметры.МетодОпределенияКоличества = ЭтаФорма.ОпределениеКоличества;
	ОблМакетаСтраница4Шапка.Параметры.МестоОпределенияКоличества = ЭтаФорма.МестоОпределениеКолво;
	
	
	ПолучитьБуха = Новый Запрос("ВЫБРАТЬ
	                                    |	ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо КАК ФизЛицо,
	                                    |	ОтветственныеЛицаОрганизацииСрезПоследних.Должность КАК Должность
	                                    |ИЗ
	                                    |	РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних КАК ОтветственныеЛицаОрганизацииСрезПоследних
	                                    |ГДЕ
	                                    |	ОтветственныеЛицаОрганизацииСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                                    |	И ОтветственныеЛицаОрганизацииСрезПоследних.ОтветственноеЛицо = &ОтветственноеЛицо"); 
	  
	  
	ПолучитьБуха.УстановитьПараметр("СтруктурнаяЕдиница", ЭтаФорма.СсылкаНаОбъект.Организация.Ссылка);
	ПолучитьБуха.УстановитьПараметр("ОтветственноеЛицо",  Перечисления.ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
	Бух = ПолучитьБуха.Выполнить().Выбрать();	
	Бух.Следующий();
	
	ОблМакетаСтраница4Шапка.Параметры.ПечГлавБух = СократитьФамилию(Бух.ФизЛицо);
	
	
	ОблМакетаСтраница4Шапка.Параметры.ПредседательКомиссии = СсылкаНаОбъект.Организация.Наименование + ", " + ДолжРук;
	ОблМакетаСтраница4Шапка.Параметры.РасшифровкаПодписиПредседателя = ФиоРук;
	
	
//=========================================================	
     ОпДефектов="";
	 
	 Для Каждого Стр ИЗ Расхождения Цикл
		 
		Если Стр.КоличествоДок<>Стр.КоличествоФакт Тогда	
		
		Если Стр.КоличествоДок>Стр.КоличествоФакт Тогда  //недосдача
			Недосдача = Стр.КоличествоДок-Стр.КоличествоФакт;
			ОпДефектов=ОпДефектов + "Обнаружена недостача "+Стр.Номенклатура+" в количестве " +Недосдача+ " шт.; причина - недовложение.";	
		КонецЕсли;
		Если Стр.КоличествоДок<Стр.КоличествоФакт Тогда  //излишки
			Излишек = -Стр.КоличествоДок+Стр.КоличествоФакт;
            ОпДефектов=ОпДефектов + "Обнаружен излишек "+Стр.Номенклатура+" в количестве " +Излишек+ " шт.;";	
		КонецЕсли;
		
		//ТабДок.Вывести(ОблМакетаСтраница3Таблица4Строка);	
	
	    КонецЕсли;
		 
	 КонецЦикла;		 
 
	 ОблМакетаСтраница4Шапка.Параметры.ОписаниеДефектов=ОпДефектов;
//=========================================================	 
	 Заключение="";
	 ВсегоСумма =0;
	 
	 ФормСтрока = "Л = ru_RU; ДП = Ложь";
	 ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
	 
	 Для Каждого Стр ИЗ Расхождения Цикл
		 
		Если Стр.КоличествоДок<>Стр.КоличествоФакт Тогда	
		
		Если Стр.КоличествоДок>Стр.КоличествоФакт Тогда  //недосдача
			
			Недосдача = Стр.КоличествоДок-Стр.КоличествоФакт;
			
			ОбщСумма=Недосдача*Стр.ЦенаЕд;
			ПрописьЧисла = ЧислоПрописью(ОбщСумма, ФормСтрока, ПарПредмета);
			
			ВсегоСумма = ВсегоСумма+ОбщСумма;
			
			ТвоеЧисло = Недосдача*Стр.ЦенаЕд;
			ВыражениеНедосдачиСтрокой = ""+Цел(ТвоеЧисло)+" ("+СокрЛП(ЧислоПрописью(Цел(ТвоеЧисло), "", ",,,,,,,,0"))+") руб. "+(ТвоеЧисло-Цел(ТвоеЧисло))*100+" коп.";
			
			Заключение=Заключение + "Обнаружена недостача "+Стр.Номенклатура+" в количестве " +Недосдача+ " шт. на сумму "+ВыражениеНедосдачиСтрокой+" ";	
			
		КонецЕсли;
		
		Если Стр.КоличествоДок<Стр.КоличествоФакт Тогда  //излишки
			
			
			Излишек = -Стр.КоличествоДок+Стр.КоличествоФакт;
			
			ОбщСумма=Излишек*Стр.ЦенаЕд;
			ПрописьЧисла = ЧислоПрописью(ОбщСумма, ФормСтрока, ПарПредмета);
			
			ВсегоСумма = ВсегоСумма+ОбщСумма;
			
			ТвоеЧисло = Излишек*Стр.ЦенаЕд;
			ВыражениеИзлишкаСтрокой = ""+Цел(ТвоеЧисло)+" ("+СокрЛП(ЧислоПрописью(Цел(ТвоеЧисло), "", ",,,,,,,,0"))+") руб. "+(ТвоеЧисло-Цел(ТвоеЧисло))*100+" коп.";
			
			Заключение=Заключение + "Обнаружен излишек "+Стр.Номенклатура+" в количестве " +Излишек+ " шт. на сумму "+ВыражениеИзлишкаСтрокой+" ";	
			
		КонецЕсли;
		
		    	
	    КонецЕсли;
		 
	КонецЦикла;
	
			ВсегоСуммаПропись = ""+Цел(ВсегоСумма)+" ("+СокрЛП(ЧислоПрописью(Цел(ВсегоСумма), "", ",,,,,,,,0"))+") руб. "+(ВсегоСумма-Цел(ВсегоСумма))*100+" коп.";
			Заключение=Заключение + "Всего на сумму "+ВсегоСуммаПропись+" ";
//=========================================================	

	ОблМакетаСтраница4Шапка.Параметры.ТипДокумента=ЭтаФорма.ДокументУдостоверяющийПолномочия;
	ОблМакетаСтраница4Шапка.Параметры.НомерСерия=ЭтаФорма.НомерДокумента;
	ОблМакетаСтраница4Шапка.Параметры.КемВыданКогда=ЭтаФорма.КемВыданДата;
	
	
	
	
	
	ОблМакетаСтраница4Шапка.Параметры.ЗаключениеКомиссии=Заключение;
	
	
	ОблМакетаСтраница4Шапка.Параметры.РешениеРуководителя=ЭтаФорма.Решение;
//=========================================================	
	

    Если Комиссия.Количество()>1 Тогда
    	ОблМакетаСтраница4Шапка.Параметры.Чел1=Комиссия[1].Должность;
		ОблМакетаСтраница4Шапка.Параметры.РасшЧел1=Комиссия[1].РасшифровкаПодписи;
	КонецЕсли;
	
	Если Комиссия.Количество()>2 Тогда
		ОблМакетаСтраница4Шапка.Параметры.Чел2=Комиссия[2].Должность;
		ОблМакетаСтраница4Шапка.Параметры.РасшЧел2=Комиссия[2].РасшифровкаПодписи;
	КонецЕсли;
	
	Если Комиссия.Количество()>3 Тогда
		ОблМакетаСтраница4Шапка.Параметры.Чел3=Комиссия[3].Должность;
    	ОблМакетаСтраница4Шапка.Параметры.РасшЧел3=Комиссия[3].РасшифровкаПодписи;
    КонецЕсли;

 		ОблМакетаСтраница4Шапка.Параметры.Предст1=ЭтаФорма.ДолжностьПредставителя;
    	ОблМакетаСтраница4Шапка.Параметры.РасшПредст1=ЭтаФорма.РасшифровкаПод;
		
//=========================================================
	ТабДок.Вывести(ОблМакетаСтраница4Шапка);	
	
	ТабДок.Показать();
	
КонецПроцедуры

Процедура ПолучитьДанныеПоДокументуНажатие(Элемент)
	ПолучитьДанныеПоДокументу();
КонецПроцедуры


Процедура ФайлВыгрузкиНачалоВыбора(Элемент, СтандартнаяОбработка)
	//стрФильтр = "Файлы txt (*.txt)|*.txt";
	//ФайлВыгрузки = ВыбратьФайл(стрФильтр, "Выберите txt-файл");
КонецПроцедуры

Процедура ПриОткрытии()
	// Вставить содержимое обработчика.
КонецПроцедуры


 



