Перем Организация ;

Функция НастроитьСписокВнешнихПечатныхФорм(парОрганизация=Неопределено) Экспорт 
	Организация = парОрганизация;
	Возврат ОткрытьМодально();
КонецФункции	


Процедура ПриОткрытии()
	КартинкаЗаголовка= ЭДО_БиблиотекаКартинок().КартинкаЗаголовка;
	ТаблицаВПФ.Очистить();
	
	Для каждого элемент из массивВПФ цикл 
		стр = ТаблицаВПФ.Добавить();
		стр.ВнешняяПечатнаяФорма = Элемент;
	КонецЦикла;	
КонецПроцедуры


Функция  получитьСписокВнешнихПечатныхФорм(МетаданныеОбъекта)
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнешниеОбработкиПринадлежность.Ссылка
	 	|ИЗ
	 	|	Справочник.ВнешниеОбработки.Принадлежность КАК ВнешниеОбработкиПринадлежность
	 	|ГДЕ
	 	|	//ВнешниеОбработкиПринадлежность.СсылкаОбъекта В(&МетаданныеОбъекта) и
	 	|	 ВнешниеОбработкиПринадлежность.Ссылка.ПометкаУдаления = Ложь
	 	|	И ВнешниеОбработкиПринадлежность.Ссылка.ВидОбработки = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма)";
	 
	Запрос.УстановитьПараметр("МетаданныеОбъекта", МетаданныеОбъекта);
	 
	МассивВыбора =   Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Результат = Новый СписокЗначений;
	Результат.ЗагрузитьЗначения(МассивВыбора);
	
	Возврат Результат; 
	 
КонецФункции	

Функция ВыбратьВнешнююФПИзСписка(СписокВыбора)
	фрм = справочники.ВнешниеОбработки.ПолучитьФормуВыбора();
	отбор = фрм.СправочникСписок.Отбор.Ссылка;
	отбор.видсравнения = видСравнения.ВСписке;
	отбор.использование = Истина;
	отбор.значение = СписокВыбора;
	
	Возврат фрм.ОткрытьМодально();

КонецФункции

Процедура КоманднаяПанель1Добавить(Кнопка)
	
	СтандартнаяОбработка = Ложь;
	
	МетаданныеОбъекта = Новый списокЗначений;
	МетаданныеОбъекта.Добавить(Документы.РеализацияТоваровУслуг.ПустаяСсылка());

	СписокВыбора = получитьСписокВнешнихПечатныхФорм(МетаданныеОбъекта);
	выбранноеЗначение = ВыбратьВнешнююФПИзСписка(СписокВыбора);

	Если НЕ ВыбранноеЗначение = Неопределено И
		ТаблицаВПФ.НайтиСтроки(Новый Структура("ВнешняяПечатнаяФорма", ВыбранноеЗначение)).Количество()=0 Тогда
		стр =  ТаблицаВПФ.Добавить();
		стр.ВнешняяПечатнаяФорма = выбранноеЗначение;
    КонецЕсли;
КонецПроцедуры


Процедура ОсновныеДействияФормыПрименить(Кнопка)
	
	массивВПФ.очистить();
	Для каждого строка из ТаблицаВПФ цикл 
		массивВПФ.добавить(строка.ВнешняяПечатнаяФорма)
	КонецЦикла;	
	
	Закрыть(Истина);
КонецПроцедуры


Процедура КоманднаяПанель1Удалить(Кнопка)
	текСтрока = ЭлементыФормы.ТаблицаВПФ.ТекущиеДанные;
	Если текСтрока = Неопределено Тогда
		предупреждение("Не выбрана строка!", , НаименованиеСистемы);
		Возврат
	КонецЕсли;
	
	ТаблицаВПФ.Удалить(текстрока);
КонецПроцедуры


Процедура ТаблицаВПФПередНачаломДобавления(Элемент, Отказ, Копирование)
	// Вставить содержимое обработчика.
	Отказ = Истина;
	КоманднаяПанель1Добавить("");
КонецПроцедуры

Процедура ТаблицаВПФПередНачаломИзменения(Элемент, Отказ)
	отказ = Истина;
	текСтрока =  ЭлементыФормы.ТаблицаВПФ.ТекущиеДанные;
	Если текСтрока <> Неопределено Тогда
			текСтрока.ВнешняяПечатнаяФорма.ПолучитьФорму().открыть();
	КонецЕсли;		
КонецПроцедуры



