
Процедура Печать() Экспорт
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.РеестрПрочихДокументов.ПолучитьМакет("Печать");
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.номер = Номер;
	Область.Параметры.Дата = Формат(Дата,"ДФ=dd.MM.yy");
	ТабДок.Вывести(Область);
	// СписокДокументов
	Область = Макет.ПолучитьОбласть("СписокДокументовШапка");
	ТабДок.Вывести(Область);
	ОбластьСписокДокументов = Макет.ПолучитьОбласть("СписокДокументов");
	Для Каждого ТекСтрокаСписокДокументов Из СписокДокументов Цикл
		ОбластьСписокДокументов.Параметры.Заполнить(ТекСтрокаСписокДокументов);
		ТабДок.Вывести(ОбластьСписокДокументов);
	КонецЦикла;

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();
	//}}_КОНСТРУКТОР_ПЕЧАТИ_ЭЛЕМЕНТ
КонецПроцедуры
