Функция Печать() экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	ТабДок.Вывести(Макет);
	
	ЗапросКонтрагентов = Новый Запрос;
	ЗапросКонтрагентов.УстановитьПараметр("ОтветственноеЛицо", СсылкаНаОбъект);
	ЗапросКонтрагентов.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ОтветственноеЛицо = &ОтветственноеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыКонтрагентов.Владелец";
	ВыборкаКонтрагентов = ЗапросКонтрагентов.Выполнить().Выбрать();
	
	Пока ВыборкаКонтрагентов.Следующий() Цикл
		
		МакетСтррока =  Макет.ПолучитьОбласть("Строка");
        
		МакетСтррока.Параметры.ПолнНаименованиеКонтрагента = ВыборкаКонтрагентов.Контрагент.НаименованиеПолное;
		
		//Контакты
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект,
		|	КонтактнаяИнформация.Тип,
		|	КонтактнаяИнформация.Вид,
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Контрагент";
		
		Запрос.УстановитьПараметр("Контрагент", ВыборкаКонтрагентов.Контрагент);
		Результат = Запрос.Выполнить().Выгрузить();
		ЮрАдрес = Результат.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента, "Вид");
		ФактАдрес = Результат.Найти(Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента, "Вид");
		Телефон = Результат.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента, "Вид");
		ЭлАдрес = Результат.Найти(СПравочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДляОбменаДокументами, "Вид");
		
		Если НЕ ЮрАдрес = Неопределено Тогда
			МакетСтррока.Параметры.ЮрАдрес = ЮрАдрес.Представление; 
		КонецЕсли;
		Если НЕ ФактАдрес = Неопределено Тогда
			МакетСтррока.Параметры.ФактАдрес	= ФактАдрес.Представление; 
		КонецЕсли;
		Если НЕ Телефон = Неопределено Тогда
			МакетСтррока.Параметры.Телефон = Телефон.Представление;
		КонецЕсли;
		Если НЕ ЭлАдрес = Неопределено Тогда
			МакетСтррока.Параметры.Почта = ЭлАдрес.Представление;
			МакетСтррока.Параметры.ДоставкаСчетаАдрес = ЭлАдрес.Представление;
		КонецЕсли;
		
		//Контактные лица
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактныеЛица.Ссылка,
		|	КонтактныеЛица.ОбъектВладелец
		|ИЗ
		|	Справочник.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.ОбъектВладелец = &Контрагент";
		
		Запрос.УстановитьПараметр("Контрагент", ВыборкаКонтрагентов.Контрагент);
		Результат = Запрос.Выполнить().Выбрать();
		ЭтоПервый = Истина;
		Пока Результат.Следующий() Цикл
			КонтактноеЛицо = Результат.Ссылка.Наименование;
			Если ЭтоПервый Тогда
				КонтактныеЛица = КонтактноеЛицо;
				ЭтоПервый = Ложь;
			Иначе 
				КонтактныеЛица = КонтактныеЛица + ", " + КонтактноеЛицо;
			КонецЕсли;
		КонецЦикла;
		МакетСтррока.Параметры.КонтактноеЛицоКонтрагента = КонтактныеЛица;
		
				
		//ОГРН
		МакетСтррока.Параметры.ИНН = ВыборкаКонтрагентов.Контрагент.ОГРН;
		
		//ИНН
		МакетСтррока.Параметры.ИНН = ВыборкаКонтрагентов.Контрагент.ИНН;
		
		//КПП
		МакетСтррока.Параметры.КПП = ВыборкаКонтрагентов.Контрагент.КПП;
		
		//ОКПО
		МакетСтррока.Параметры.ОКПО = ВыборкаКонтрагентов.Контрагент.КодПоОКПО;
			
		//РС
		МакетСтррока.Параметры.РасСчет = ВыборкаКонтрагентов.Контрагент.ОсновнойБанковскийСчет.НомерСчета;
				
		//КоррСчет
		МакетСтррока.Параметры.КорСчет = ВыборкаКонтрагентов.Контрагент.ОсновнойБанковскийСчет.Банк.КоррСчет;
				
		//БИК
		МакетСтррока.Параметры.БИК = ВыборкаКонтрагентов.Контрагент.ОсновнойБанковскийСчет.Банк.Код;
				
		МакетСтррока.Параметры.НаименованиеБанка = ВыборкаКонтрагентов.Контрагент.ОсновнойБанковскийСчет.Банк;
		
		ТабДок.Вывести(МакетСтррока);
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции