Функция Печать() Экспорт
	
	Если Не Метаданные.Имя = "УправлениеТорговлей" Тогда
		Сообщить("Печатная форма предназначена для использования в конфигурации ""Управление торговлей""", СтатусСообщения.Внимание);
	КонецЕсли;
	
	Возврат ПечатьРеализации(СсылкаНаОбъект);
	
КонецФункции // Печать


Функция ПечатьРеализации( Регистратор) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ЗаказПокупателя", Регистратор);
	Запрос.УстановитьПараметр("Крышки", Справочники.Номенклатура.НайтиПоКоду("0080004"));
	СписокПроизводителей = Новый СписокЗначений;
	СписокПроизводителей.Добавить(Справочники.Производители.НайтиПоКоду("3333"));
	СписокПроизводителей.Добавить(Справочники.Производители.НайтиПоКоду("3400"));
	Запрос.УстановитьПараметр("СписокПроизводителей", СписокПроизводителей);

	тип = СсылкаНаОбъект.Метаданные().Имя;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	А.Номенклатура,
	             |	А.Комплектующая КАК Комплектующая,
	             |	А.Комплектующая.Код КАК Код,
	             |	А.Комплектующая.КодСБИС КАК КодСБИС,
	             |	СУММА(А.КоличествоЗаказано) КАК Количество,
	             |	МАКСИМУМ(А.КоличествоОстаток) КАК Остаток
	             |ПОМЕСТИТЬ ВТ_ТаблицаКомплектующихПоНоменклатуре
	             |ИЗ
	             |(ВЫБРАТЬ
	             |		ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	             |		ЗаказыПокупателейОстатки.КоличествоОстаток КАК КоличествоЗаказано,
	             |		КомплектующиеНоменклатуры.Комплектующая.Код КАК Код,
	             |		КомплектующиеНоменклатуры.Комплектующая КАК Комплектующая,
	             |		КомплектующиеНоменклатуры.Комплектующая.КодСБИС КАК КомплектующаяКодСБИС,
	             |		ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	             |"+?(тип="ЗаказПокупателя",	"ИЗ
	             |		РегистрНакопления.ЗаказыПокупателей.Остатки(
	             |				,
	             |				ЗаказПокупателя = &ЗаказПокупателя
				 //|					И (Номенклатура.Наименование ПОДОБНО ""%LegeArtis%""
				 //|						ИЛИ Номенклатура.Наименование ПОДОБНО ""%YST%"" ИЛИ Номенклатура.Производитель в (&СписокПроизводителей))
	             |					И (Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.Видытоваров.Диски)
				|		ИЛИ Номенклатура.Наименование ПОДОБНО ""%олпак%"") ) КАК ЗаказыПокупателейОстатки
	             |", "ИЗ
	                 |(ВЫБРАТЬ Ссылка, Номенклатура, Количество  как КоличествоОстаток 
					 |  ИЗ Документ."+тип+".Товары КАК ЗаказыОстатки
	                 |	ГДЕ
	                 |	ЗаказыОстатки.Ссылка = &ЗаказПокупателя
				 //	|		И (ЗаказыОстатки.Номенклатура.Наименование ПОДОБНО ""%LegeArtis%""
				 //|				ИЛИ ЗаказыОстатки.Номенклатура.Наименование ПОДОБНО ""%YST%"" ИЛИ ЗаказыОстатки.Номенклатура.Производитель в (&СписокПроизводителей))
	             |			И ЗаказыОстатки.Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски) ) КАК ЗаказыПокупателейОстатки ") 
				 +"
				 |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |				КомплектующиеНоменклатуры.Номенклатура КАК Номенклатура,
	             |				КомплектующиеНоменклатуры.Комплектующая КАК Комплектующая
	             |			ИЗ
	             |				РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	             |			ГДЕ
	             |				 (Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.Видытоваров.Диски)
				 |		ИЛИ Номенклатура.Наименование ПОДОБНО ""%олпак%"")
	             |				И КомплектующиеНоменклатуры.Комплектующая В ИЕРАРХИИ(&Крышки)) КАК КомплектующиеНоменклатуры
	             |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, ) КАК ТоварыНаСкладахОстатки
	             |				ПО КомплектующиеНоменклатуры.Комплектующая = ТоварыНаСкладахОстатки.Номенклатура
	             |			ПО ЗаказыПокупателейОстатки.Номенклатура = КомплектующиеНоменклатуры.Номенклатура) КАК А
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	А.Номенклатура,
	             |	А.Комплектующая,
	             |	А.Комплектующая.Код,
	             |	А.Комплектующая.КодСБИС
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Комплектующая КАК Номенклатура,
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Комплектующая.Код КАК Код,
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Комплектующая.КодСБИС КАК КодСБИС,
	             |	СУММА(ВТ_ТаблицаКомплектующихПоНоменклатуре.Количество) КАК Количество,
	             |	МАКСИМУМ(ВТ_ТаблицаКомплектующихПоНоменклатуре.Остаток) КАК Остаток
	             |ПОМЕСТИТЬ ВТ_ТаблицаКрышек
	             |ИЗ
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре КАК ВТ_ТаблицаКомплектующихПоНоменклатуре
	             |ГДЕ
	             |	(НЕ ВТ_ТаблицаКомплектующихПоНоменклатуре.Комплектующая ЕСТЬ NULL )
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Комплектующая,
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Комплектующая.Код,
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Комплектующая.КодСБИС
	             |
				 | Объединить все
				 |ВЫБРАТЬ
				 | ЗаказПокупателяКрышки.Крышка,
				 | ЗаказПокупателяКрышки.Крышка.Код,
				 | ЗаказПокупателяКрышки.Крышка.КодСБИС,
				 | ЗаказПокупателяКрышки.Количество,
				 | ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)
				 |ИЗ
				 | Документ.ЗаказПокупателя.Крышки КАК ЗаказПокупателяКрышки
				 |  	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
				 |	     ПО ЗаказПокупателяКрышки.Крышка = ТоварыНаСкладахОстатки.Номенклатура
				 |ГДЕ
				 |	ЗаказПокупателяКрышки.Ссылка = &ЗаказПокупателя
				 |
				 |УПОРЯДОЧИТЬ ПО
				 |КодСБИС
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Номенклатура,
	             |	СУММА(ВТ_ТаблицаКомплектующихПоНоменклатуре.Количество) КАК Количество,
	             |	МАКСИМУМ(ВТ_ТаблицаКомплектующихПоНоменклатуре.Остаток) КАК Остаток
	             |ПОМЕСТИТЬ ВТ_ТаблицаДисковБезПривязкиКрышек
	             |ИЗ
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре КАК ВТ_ТаблицаКомплектующихПоНоменклатуре
	             |ГДЕ
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Комплектующая ЕСТЬ NULL 
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Номенклатура
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Комплектующая КАК Комплектующая,
	             |	СУММА(ВТ_ТаблицаКомплектующихПоНоменклатуре.Количество) КАК Количество,
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Комплектующая.Код КАК Код,
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Комплектующая.КодСБИС КАК КодСБИС,
				 |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Номенклатура.Наименование НоменклатураНаименование,
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Номенклатура,
	             |	МАКСИМУМ(ВТ_ТаблицаКомплектующихПоНоменклатуре.Остаток) КАК Остаток
	             |ИЗ
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре КАК ВТ_ТаблицаКомплектующихПоНоменклатуре
	             |ГДЕ
	             |	(НЕ ВТ_ТаблицаКомплектующихПоНоменклатуре.Комплектующая ЕСТЬ NULL )
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Номенклатура,
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Комплектующая,
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Комплектующая.Код,
	             |	ВТ_ТаблицаКомплектующихПоНоменклатуре.Комплектующая.КодСБИС
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	КодСБИС
	             |ИТОГИ
	             |	СУММА(Количество)
	             |ПО
	             |	Комплектующая";
				 
Результат=Запрос.Выполнить();
//ТаблицаДисковПоАлфавиту=Результат.Выгрузить();

//ТаблицаДисковПоАлфавиту.Сортировать("НоменклатураНаименование");

ВыборкаДискиПоКрышкам=Результат.Выбрать();
 
 
ЗапросКрышки=Новый Запрос;
ЗапросКрышки.МенеджерВременныхТаблиц=Запрос.МенеджерВременныхТаблиц;
ЗапросКрышки.Текст="ВЫБРАТЬ * ИЗ ВТ_ТаблицаКрышек";
ТаблицаКрышки=ЗапросКрышки.Выполнить().Выгрузить();
//ТаблицаКрышки.ВыбратьСтроку();

ЗапросДискиБезКрышек=Новый Запрос;
ЗапросДискиБезКрышек.МенеджерВременныхТаблиц=Запрос.МенеджерВременныхТаблиц;
ЗапросДискиБезКрышек.Текст="ВЫБРАТЬ * ИЗ ВТ_ТаблицаДисковБезПривязкиКрышек";
ТаблицаДискиБезКрышек=ЗапросДискиБезКрышек.Выполнить().Выгрузить();
//ТаблицаДискиБезКрышек.ВыбратьСтроку();
Если тип="ЗаказПокупателя" тогда
ДопЗаголовок=?(ЗначениеЗаполнено(Регистратор.ДатаГотовностиНаборки),Символы.ПС+"Подготовить к "+Регистратор.ДатаГотовностиНаборки+", отнести "+Регистратор.КудаНестиКрышки+" "+?(Регистратор.КудаНестиКрышки="к менеджеру",Регистратор.ДоговорКонтрагента.ОтветственноеЛицо,""),"");
Иначе
ДопЗаголовок="";
КонецЕсли;	

ТабДок=Новый ТабличныйДокумент;
ТабДок.Очистить();

Макет = ПолучитьМакет("ОтчетРеализация");
	ОбластьКомм= Макет.ПолучитьОбласть("Комментарий");
	ОбластьКомм.Параметры.Комм=Регистратор.Комментарий;
	ТабДок.Вывести(ОбластьКомм);

	ОбластьЗаголовок= Макет.ПолучитьОбласть("Заголовок");
	
	ОбластьЗаголовок.Параметры.ЗаголовокДокумента="Заказ покупателя №" +  Регистратор.Номер +" от "+Формат(Регистратор.Дата,"ДФ=dd.MM.yyyy") +". Покупатель: "+Регистратор.Контрагент.Наименование+ДопЗаголовок;
	ОбластьШапка= Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ТабДок.Вывести(ОбластьШапка);
	ОбщееКоличество=0;   ОбщийОстаток = 0;
 	Для каждого ВыборкаДетали ИЗ ТаблицаКрышки  Цикл
		ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
		ОбщееКоличество=ОбщееКоличество+ВыборкаДетали.КОличество;
		ОбщийОстаток   =ОбщийОстаток + ВыборкаДетали.Остаток;
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла;
	ОбластьПодвалТаблицы.Параметры.Количество=ОбщееКоличество;
	ОбластьПодвалТаблицы.Параметры.Остаток   =ОбщийОстаток;//+++
	ТабДок.Вывести(ОбластьПодвалТаблицы);	
	
	
	// Выводим дважды
	
	Для сч=1 по 2 Цикл
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();	
	ОбластьЗаголовок= Макет.ПолучитьОбласть("ЗаголовокДиски");	
	ОбластьЗаголовок.Параметры.ЗаголовокДискиБезПривязки="Диски в привязке к крышкам";
	ОбластьЗаголовок.Параметры.ЗаголовокДокумента="Заказ покупателя №" +  Регистратор.Номер +" от "+Формат(Регистратор.Дата,"ДФ=dd.MM.yyyy") +". Покупатель: "+Регистратор.Контрагент.Наименование+ДопЗаголовок;
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ОбластьШапка1= Макет.ПолучитьОбласть("Шапка1");
	ОбластьПодвалТаблицы1 = Макет.ПолучитьОбласть("ПодвалТаблицы1");
	ТабДок.Вывести(ОбластьШапка1);
	ОбщееКоличество=0;   ОбщийОстаток = 0;
	
	
	ВыборкаДискиПоКрышкам.Сбросить(); 
	
	Пока ВыборкаДискиПоКрышкам.Следующий() Цикл
		// выводим только детальные записи
		Если ВыборкаДискиПоКрышкам.ТипЗаписи()=ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
		ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("ДеталиДиски1");
		
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДискиПоКрышкам);
		ОбластьДетальныхЗаписей.Параметры.Код=ВыборкаДискиПоКрышкам.Номенклатура.Код;
		ОбластьДетальныхЗаписей.Параметры.Номенклатура=ВыборкаДискиПоКрышкам.Номенклатура.Наименование;
		
		ОбщееКоличество=ОбщееКоличество+ВыборкаДискиПоКрышкам.КОличество;
		
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
		Иначе
		ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали1");
		ОбластьДетальныхЗаписей.Параметры.Номенклатура=ВыборкаДискиПоКрышкам.Комплектующая;
		ОбластьДетальныхЗаписей.Параметры.КодСБИС=ВыборкаДискиПоКрышкам.Комплектующая.КодСБИС;
		ОбластьДетальныхЗаписей.Параметры.Код=ВыборкаДискиПоКрышкам.Комплектующая.Код;
		ОбластьДетальныхЗаписей.Параметры.Количество=ВыборкаДискиПоКрышкам.Количество;
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
		КонецЕсли;
	КонецЦикла; 
	
	//Для каждого СтрокаДиск ИЗ  ТаблицаДисковПоАлфавиту Цикл
	//	Если ЗначениеЗаполнено(СтрокаДиск.Номенклатура) Тогда
	//	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали1");
	//	ОбластьДетальныхЗаписей.Параметры.Заполнить(СтрокаДиск);
	//	ОбщееКоличество=ОбщееКоличество+СтрокаДиск.КОличество;
	//	
	//	ТабДок.Вывести(ОбластьДетальныхЗаписей);
	//	КонецЕсли;
	//КонецЦикла;	
	
    ОбластьПодвалТаблицы1.Параметры.Количество  = ОбщееКоличество;
	//ОбластьПодвалТаблицы.Параметры.Остаток     =ОбщийОстаток;//+++
	ТабДок.Вывести(ОбластьПодвалТаблицы1);
		
	КонецЦикла; 

	
	
	// Диски без привязки к крышкам
	
		
		
	Если ТаблицаДискиБезКрышек.Количество()>0 Тогда
		ОбластьЗаголовок= Макет.ПолучитьОбласть("ЗаголовокДиски");	
		ОбластьЗаголовок.Параметры.ЗаголовокДискиБезПривязки="Диски без привязки";
		
		ТабДок.Вывести(ОбластьЗаголовок);
		Для каждого Выборка ИЗ ТаблицаДискиБезКрышек Цикл
			ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("ДеталиДиски");
			ОбластьДетальныхЗаписей.Параметры.Заполнить(Выборка);
			ОбластьДетальныхЗаписей.Параметры.Код=Выборка.Номенклатура.Код;
			ОбластьДетальныхЗаписей.Параметры.Количество=Выборка.Количество;
			ТабДок.Вывести(ОбластьДетальныхЗаписей);
		КонецЦикла;	
		
	КонецЕсли;	
	ТабДок.ВерхнийКолонтитул.Выводить=Истина;
	ТабДок.ВерхнийКолонтитул.ТекстВЦентре ="[&НомерСтраницы]";
    Возврат ТабДок;
	КонецФункции