перем СостоянияИМДляПечатиреестра        ;
Функция Печать() Экспорт
	
	ТабДокумент = неопределено;
	ТК =  справочники.Контрагенты.НайтиПоКоду("94121");    //Армадило
	DPD = справочники.Контрагенты.НайтиПоКоду("94247  ");  //Розничный покупатель DPD
	ПечатьРеестраDPD(ТабДокумент, ТК, DPD);	
	
	ТабДокумент2 = неопределено;
	ВторойРеестрПоЮрЛицам(ТабДокумент2, ТК, DPD);
	//
	//Если ТабДокумент = неопределено 
	//	и ТабДокумент2 <> неопределено тогда
	//	ТабДокумент = ТабДокумент2;
	//иначеЕсли ТабДокумент <> неопределено 
	Если ТабДокумент2 <> неопределено тогда
			ТабДокумент2.Показать("Реестр DPD (Юр.лица)"); // и 1 и 2
	//иначе или только 1 или ничего...	
	КонецЕсли;

	
	Если ТабДокумент = неопределено и ТабДокумент2=неопределено тогда
		
		ТК =  справочники.Контрагенты.НайтиПоКоду("94346");    //Подорожник
		DPD = справочники.Контрагенты.НайтиПоКоду("П005342");    //Розничный покупатель Подорожник
		ПечатьРеестраDPD(ТабДокумент, ТК, DPD, "Подорожник");
		ВторойРеестрПоЮрЛицам(ТабДокумент2, ТК, DPD, "Подорожник");
		//
		//Если ТабДокумент = неопределено 
		//	и ТабДокумент2 <> неопределено тогда  //только 2
		//	ТабДокумент = ТабДокумент2;
		//	
		//иначеЕсли ТабДокумент <> неопределено 
		Если ТабДокумент2 <> неопределено тогда
				ТабДокумент2.Показать("Реестр Подорожник (Юр.лица)"); // и 1 и 2
		//иначе или только 1 или ничего...	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТабДокумент = неопределено и ТабДокумент2=неопределено тогда
		
		ТК =  справочники.Контрагенты.НайтиПоКоду("П019371");    //ПИТСТОП
		DPD = справочники.Контрагенты.НайтиПоКоду("95768");    //Розничный покупатель Питстоп
		ПечатьРеестраDPD(ТабДокумент, ТК, DPD, "Питстоп");
		ВторойРеестрПоЮрЛицам(ТабДокумент2, ТК, DPD, "Питстоп");
		//
		//Если ТабДокумент = неопределено 
		//	и ТабДокумент2 <> неопределено тогда  //только 2
		//	ТабДокумент = ТабДокумент2;
		//	
		//иначеЕсли ТабДокумент <> неопределено 
		Если ТабДокумент2 <> неопределено тогда
				ТабДокумент2.Показать("Реестр Питстоп (Юр.лица)"); // и 1 и 2
		//иначе или только 1 или ничего...	
		КонецЕсли;
		
    КонецЕсли;


//	Если ТабДокумент = неопределено и ТабДокумент2=неопределено тогда

	//ТК =  справочники.Контрагенты.НайтиПоКоду("П005344");   //Розничный покупатель Подорожник
	//DPD = справочники.Контрагенты.НайтиПоКоду("П005344");
	//ПечатьРеестраDPD(ТабДокумент, ТК, DPD, "СПСР");	
	//ВторойРеестрПоЮрЛицам(ТабДокумент2, ТК, DPD, "СПСР");
		//Если ТабДокумент = неопределено 
		//	и ТабДокумент2 <> неопределено тогда  //только 2
		//	ТабДокумент = ТабДокумент2;
		//иначеЕсли ТабДокумент <> неопределено 
		// 		и ТабДокумент2 <> неопределено тогда
		//		ТабДокумент2.Показать("Реестр DPD (Юр.лица)"); // и 1 и 2
		////иначе или только 1 или ничего...	
		//КонецЕсли;

//	КонецЕсли;

	Возврат ТабДокумент;
	
КонецФункции

процедура ПечатьРеестраDPD(ТабДокумент, ТК, DPD, макетИмя = "DPD")
	
	Макет = ПолучитьМакет(макетИмя);
	//СостоянияИМДляПечатиреестра.Добавить(Перечисления.СостояниеЗаказовИМ.ОтмененИМ);
	// Выводим шапку накладной
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СостоянияИМДляПечатиреестра",СостоянияИМДляПечатиреестра);
	//----------------запрос по тч РеквизитыЗаказаТК ---------------------	
	Если типЗнч(СсылкаНаОбъект) = тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
		Если ТипЗнч(СсылкаНаОбъект.Сделка)<>Тип("ДокументСсылка.ЗаказПокупателя") тогда
			сообщить("Печать реестра "+макетИмя+" - не возможна без заказа покупателя!");
			возврат;
		КонецЕсли;
		
		ЗаказПокупателя = СсылкаНаОбъект.Сделка;
		
		Если НЕ (ЗаказПокупателя.Контрагент = DPD
			И (ЗаказПокупателя.ТранспортнаяКомпания = ТК
			ИЛИ Найти(ЗаказПокупателя.Комментарий, макетИмя)>0
			)  ) тогда
			//	сообщить("Печать реестра "+макетИмя+" - не требуется!");
			возврат;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("СсылкаЗаказ", ЗаказПокупателя);
		Запрос.Текст ="ВЫБРАТЬ
		              |	Заказы.ЗаказПокупателя
		              |ПОМЕСТИТЬ ВТ_Заказы
		              |ИЗ
		              |	Документ.ЗаказПокупателя.Заказы КАК Заказы
		              |ГДЕ
		              |	Заказы.Ссылка = &СсылкаЗаказ
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	Заказ1.Ссылка
		              |ИЗ
		              |	Документ.ЗаказПокупателя КАК Заказ1
		              |ГДЕ
		              |	Заказ1.Ссылка = &СсылкаЗаказ
		              |;
		              |
		              |////////////////////////////////////////////////////////////////////////////////
		              |ВЫБРАТЬ РАЗЛИЧНЫЕ
		              |	ЗаказПокупателяРеквизитыЗаказаТК.Ссылка КАК Заказ,
		              |	ЗаказПокупателяРеквизитыЗаказаТК.Поле КАК Поле,
		              |	ВЫРАЗИТЬ(ЗаказПокупателяРеквизитыЗаказаТК.Значение КАК СТРОКА(1000)) КАК Значение
		              |ИЗ
		              |	Документ.ЗаказПокупателя.РеквизитыЗаказаТК КАК ЗаказПокупателяРеквизитыЗаказаТК
		              |ГДЕ
		              |	ЗаказПокупателяРеквизитыЗаказаТК.Ссылка В
		              |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		              |				ВТ_Заказы.ЗаказПокупателя
		              |			ИЗ
		              |				ВТ_Заказы)
					  |И ЗаказПокупателяРеквизитыЗаказаТК.Ссылка В
					  |	(ВЫБРАТЬ
					  |		СостояниеЗаказовИМ.ЗаказПервичный
					  |	ИЗ
					  |		РегистрСведений.СостояниеЗаказовИМ КАК СостояниеЗаказовИМ
					  |	ГДЕ
					  |		СостояниеЗаказовИМ.Состояние В (&СостоянияИМДляПечатиреестра))
					  
					  |	И (ВЫРАЗИТЬ(ЗаказПокупателяРеквизитыЗаказаТК.Поле КАК СТРОКА(1000))) <> """"
		              |ИТОГИ ПО
		              |	Заказ
		              |;
		              |
		              |////////////////////////////////////////////////////////////////////////////////
		              |УНИЧТОЖИТЬ ВТ_Заказы";
		ВыборкаЗак = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Иначе	
		
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
		Запрос.УстановитьПараметр("ТранспортнаяКомпания",  ТК);
		Запрос.УстановитьПараметр("DPD",  DPD );
		
		Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя,
		|	ЗаданиеНаОтгрузкуЗаказыПокупателей.Реализация
		|ПОМЕСТИТЬ ВТ_Заказы1
		|ИЗ
		|	Документ.ЗаданиеНаОтгрузку.ЗаказыПокупателей КАК ЗаданиеНаОтгрузкуЗаказыПокупателей
		|ГДЕ
		|	ЗаданиеНаОтгрузкуЗаказыПокупателей.Ссылка = &Ссылка

		|	И (ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя.Контрагент = &DPD или ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя.Контрагент.КатегорияПокупателя = Значение(Справочник.КатегорииПокупателей.КонечныйПотребительФЛ))
		//27.09.16 Смирнов было ИЛИ, сделал И, т.к. печаталось в кучу и юрики и физ лица
		|	   И( ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя.ТранспортнаяКомпания = &ТранспортнаяКомпания
		|	   ИЛИ ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя.Комментарий ПОДОБНО ""%"+макетИмя+"%"")
		|	И НЕ ЗаданиеНаОтгрузкуЗаказыПокупателей.Реализация = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.пустаяСсылка)
		|	И НЕ ЗаданиеНаОтгрузкуЗаказыПокупателей.Реализация = ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.пустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заказы.ЗаказПокупателя
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	Документ.ЗаказПокупателя.Заказы КАК Заказы
		|ГДЕ
		|	Заказы.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_Заказы1.ЗаказПокупателя
		|			ИЗ
		|				ВТ_Заказы1)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Заказ1.ЗаказПокупателя
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Заказы1.ЗаказПокупателя КАК ЗаказПокупателя
		|	ИЗ
		|		ВТ_Заказы1 КАК ВТ_Заказы1) КАК Заказ1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	ЗаказПокупателяРеквизитыЗаказаТК.Ссылка КАК Заказ,
		|	ЗаказПокупателяРеквизитыЗаказаТК.Поле КАК Поле,
		|	ЗаказПокупателяРеквизитыЗаказаТК.Значение как Значение
		|ИЗ
		|	Документ.ЗаказПокупателя.РеквизитыЗаказаТК КАК ЗаказПокупателяРеквизитыЗаказаТК
		|ГДЕ
		|	ЗаказПокупателяРеквизитыЗаказаТК.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВТ_Заказы.ЗаказПокупателя
		|			ИЗ
		|				ВТ_Заказы)
		|И ЗаказПокупателяРеквизитыЗаказаТК.Ссылка В
		|	(ВЫБРАТЬ
		|		СостояниеЗаказовИМ.ЗаказПервичный
		|	ИЗ
		|		РегистрСведений.СостояниеЗаказовИМ КАК СостояниеЗаказовИМ
		|	ГДЕ
		|		СостояниеЗаказовИМ.Состояние В (&СостоянияИМДляПечатиреестра))
		|	И выразить(ЗаказПокупателяРеквизитыЗаказаТК.Значение как строка(1000)) <> """"
		|ИТОГИ ПО
		|	Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Заказы1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Заказы";
		
		
		
		ВыборкаЗак = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	
	Если ВыборкаЗак.Количество()=0 тогда
		сообщить("Нет данных по "+макетИмя+"!", СтатусСообщения.Внимание);
		возврат;
	КонецЕсли;
	
	ТабДокумент = новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_Накладная";
	
	//=======================================================================================	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//23.10.17
	Попытка
	ОбШтрихКод=ОбластьМакета.Рисунки.Штрихкод.Объект;
	ОбШтрихКод.ТипКода = 4; 
	ОбШтрихКод.Сообщение = СформироватьШКРеализации(СсылкаНаОбъект,"R");//XMLСтрока(ЭтотОбъект.Ссылка.УникальныйИдентификатор()); 
	ОбШтрихКод.ОтображатьТекст = Ложь;
    Исключение
	Конецпопытки;

	//24.03.2016
	//	ОбластьМакета.Параметры.НомерЗадания     = СсылкаНаОбъект.Номер;
	Если типЗнч(СсылкаНаОбъект) = тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
		ОбластьМакета.Параметры.ДатаЗабораГруза  = формат(СсылкаНаОбъект.Дата, "ДЛФ=D");
		ОбластьМакета.Параметры.НомерЗадания     = СсылкаНаОбъект.Номер//+" от "+формат(СсылкаНаОбъект.Дата,"ДЛФ=D")
		;
	Иначе	
		ОбластьМакета.Параметры.ДатаЗабораГруза  = формат(макс(СсылкаНаОбъект.ВремяНапоминания,СсылкаНаОбъект.Дата), "ДЛФ=D");
		Запрос1 = новый Запрос;
		Запрос1.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя,
		|	ЗаданиеНаОтгрузкуЗаказыПокупателей.Реализация.Номер КАК РеализацияНомер,
		|	ЗаданиеНаОтгрузкуЗаказыПокупателей.Реализация.Дата КАК РеализацияДата
		|ИЗ
		|	Документ.ЗаданиеНаОтгрузку.ЗаказыПокупателей КАК ЗаданиеНаОтгрузкуЗаказыПокупателей
		|ГДЕ
		|	ЗаданиеНаОтгрузкуЗаказыПокупателей.Ссылка = &Ссылка
		|	И (ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя.Контрагент = &DPD или ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя.Контрагент.КатегорияПокупателя = Значение(Справочник.КатегорииПокупателей.КонечныйПотребительФЛ))
		|	И (ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя.ТранспортнаяКомпания = &ТранспортнаяКомпания
		|			ИЛИ ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя.Комментарий ПОДОБНО ""%"+макетИмя+"%"")
		|	И НЕ ЗаданиеНаОтгрузкуЗаказыПокупателей.Реализация = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.пустаяСсылка)
		|	И НЕ ЗаданиеНаОтгрузкуЗаказыПокупателей.Реализация = ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.пустаяСсылка)";
		Запрос1.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
		Запрос1.УстановитьПараметр("ТранспортнаяКомпания",  ТК);
		Запрос1.УстановитьПараметр("DPD",  DPD );
		ВыборкаРеализаций = Запрос1.Выполнить().Выбрать();
		НомераРеализаций = "";
		пока ВыборкаРеализаций.Следующий() цикл
			НомераРеализаций = НомераРеализаций+Строка(ВыборкаРеализаций.РеализацияНомер)
			//+" от "+формат(ВыборкаРеализаций.РеализацияДата,"ДЛФ=D")
			+"; ";	
		КонецЦикла;	
		
		Если НомераРеализаций="" тогда //30.08.2016
			ТабДокумент = неопределено;
			возврат;
		КонецЕсли;	
			
		ОбластьМакета.Параметры.НомерЗадания     = НомераРеализаций;
	КонецЕсли;
	
	филиал = СсылкаНаОбъект.Подразделение.Контрагент;
	СведенияОГрузоотправитель = СведенияОЮрФизЛице(филиал, СсылкаНаОбъект.Дата);
	ОбластьМакета.Параметры.АдресОтправителя = ОписаниеОрганизации(СведенияОГрузоотправитель, "ФактическийАдрес,");
	
	ВыборкаЗак.Следующий(); 	
	адр = ВыборкаЗак.Заказ.АдресДоставки;
	ОбластьМакета.Параметры.ФактАдресDPD = СокрЛП( стрЗаменить(адр, макетИмя, "") );
	//DPD г. Ярославль, проспект Фрунзе, д. 24 А, павильон-склад №26
	//DPD, г. Екатеринбург, ул. Крайля, дом 76		
	
	Если ТипЗнч(СсылкаНаОбъект)=тип("ДокументСсылка.РеализацияТоваровУслуг") тогда // 19.04.2016
		Контр = СсылкаНаОбъект.Контрагент;
	Иначе
		Контр = ВыборкаЗак.Заказ.Контрагент;
	КонецЕсли;
	
	Если Контр.Код = "П000382" тогда // АЭ
		ОбластьМакета.Параметры.Орг =  Контр.НаименованиеПолное;
		ОбластьМакета.Параметры.ИННКПП   = "ИНН: "+строка(Контр.ИНН)+", КПП: " +строка(Контр.КПП);
	Иначе	
		ОбластьМакета.Параметры.Орг = "ЗАО ТК ""Яршинторг""";
		ОбластьМакета.Параметры.ИННКПП   = "ИНН: "+строка(филиал.ИНН)+", КПП: "+строка(филиал.КПП);
	КонецЕсли;
	
	ОбластьМакета.Параметры.Название = СокрЛП(филиал.НаименованиеПолное);
	
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	КолМест = 0;
	СуммаТоваровИтого=0; СуммаУслугИтого=0; ОбъявленнаяценностьИтого=0; //19.04.2016
	
	ВыборкаЗак.Сбросить(); //+++
	пока ВыборкаЗак.Следующий() цикл
		
		//Если типЗнч(СсылкаНаОбъект)=тип("ДокументСсылка.ЗаданиеНаОтгрузку") тогда
		//	Если НетТоваровВЗадании(ВыборкаЗак.Заказ) тогда 
		//		продолжить;
		//	КонецЕсли;	
		//КонецЕсли;	
		
		если ВыборкаЗак.Заказ.Подразделение.Код = "00005" тогда
			НомФилиала = "000092773"; //Яршинторг
		Иначе 
			НомФилиала = СокрЛП(ВыборкаЗак.Заказ.Подразделение.Контрагент.Код);
			//"Ф00000010"; //Филиал Ростов-на-Дону
			//"П000835";// Яршинторг Филиал Санкт-Петербург
			//"УТ0000494";// Яршинторг Филиал Екатеринбург
		КонецЕсли;
		
		ОбластьМакета.Параметры.НомерЗаказа = ВыборкаЗак.Заказ.НомерВходящегоДокумента+"_"+НомФилиала;
		//    ОбластьМакета.Параметры.АдресДоставки = ВыборкаЗак.Заказ.АдресДоставки;
		
		//+++ 24.03.2016
		СуммаУслуг   = ВыборкаЗак.Заказ.Услуги.Итог("Сумма");
		ОбластьМакета.Параметры.СуммаУслуг = СуммаУслуг;
		
		ВыборкаСтр = ВыборкаЗак.Выбрать();
		сообщить(ВыборкаСтр.Заказ);  списокТоваровЭтойСтроки = "";
		пока ВыборкаСтр.Следующий() цикл
			назв = стрЗаменить(ВыборкаСтр.Поле," ","");
			Если назв ="ШК" тогда 	
				значение1 = стрЗаменить(ВыборкаСтр.Значение, ";", ";
				|");
			иначе 
				значение1 = СокрЛП(ВыборкаСтр.Значение);
			КонецЕсли;	
			
			Если назв ="Количествомест" тогда
				КолМест = КолМест + число(значение1);
			КонецЕсли;
			
			//+++ 24.03.2016
			Если назв ="Объявленнаяценность" тогда  //14.07.2016  это "сумма" товаров, а услуги - отдельно!
				Если МакетИмя="DPD" тогда
					ОбластьМакета.Параметры.СуммаТоваров   = значение1 - СуммаУслуг; //задача №21031
					значение1 = число(стрЗаменить(значение1, " ",""));  //26.08.2016 НЕ НАДО!!!  + СуммаУслуг;
				иначе
					ОбластьМакета.Параметры.СуммаТоваров   = значение1;
					значение1 = число(стрЗаменить(значение1, " ","")) + СуммаУслуг;   //задача 57016 
				КонецЕсли;

			КонецЕсли;
			
			//14.07.2016 Проверка наличия товара в отгрузке...
			Если назв ="Содержимое" тогда
			   списокТоваровЭтойСтроки =  значение1;
		    КонецЕсли;

			//Адиянов<<<Срочно надо было поправть 20160921194100
			//Заключил в попытку
			Попытка 	
				ОбластьМакета.Параметры[назв] = значение1;	
			Исключение
				//Сообщить(ОписаниеОшибки());
			КонецПопытки;
			
		КонецЦикла;
		
		//14.07.2016 Проверка
		естьТовар = Ложь;
		для каждого стр1 из СсылкаНаОбъект.Товары цикл // товары в реалзиации или товары из Задания на отгрузку
			Если Найти(списокТоваровЭтойСтроки, "("+строка(стр1.Номенклатура.Код)+")")>0 
				   и стр1.Количество>0 тогда
				естьТовар = истина; прервать; // Ура, нашли товар
			КонецЕсли;	
		КонецЦикла; 
		
		Если естьТовар тогда  //14.07.2016
			ТабДокумент.Вывести(ОбластьМакета);
		иначе
			Сообщить("Из реестра исключен исключён товар: "+списокТоваровЭтойСтроки, СтатусСообщения.Внимание);
			продолжить;
		КонецЕсли;
		
		//19.04.2016
		СуммаТоваровИтого=СуммаТоваровИтого+ ОбластьМакета.Параметры.СуммаТоваров;
		СуммаУслугИтого  =СуммаУслугИтого  + ОбластьМакета.Параметры.СуммаУслуг;
		ОбъявленнаяценностьИтого=ОбъявленнаяценностьИтого+ОбластьМакета.Параметры.Объявленнаяценность; 
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	//+++ 19.04.2016
	ОбластьМакета.Параметры.СуммаТоваров = СуммаТоваровИтого;
	ОбластьМакета.Параметры.СуммаУслуг   = СуммаУслугИтого;
	ОбластьМакета.Параметры.Объявленнаяценность = ОбъявленнаяценностьИтого;
	
	ОбластьМакета.Параметры.КолМест = КолМест;
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
		ТабДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

Процедура ВторойРеестрПоЮрЛицам(ТабДокумент, ТК, DPD, макетИмя="DPD")
	
	Макет = ПолучитьМакет(макетИмя);
	// Выводим шапку накладной
	//----------------запрос по тч РеквизитыЗаказаТК ---------------------	
	//----------------запрос по тч РеквизитыЗаказаТК ---------------------	
	Если типЗнч(СсылкаНаОбъект) = тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
		Если ТипЗнч(СсылкаНаОбъект.Сделка)<>Тип("ДокументСсылка.ЗаказПокупателя") тогда
			сообщить("Печать реестра "+макетИмя+" - не возможна без заказа покупателя!");
			возврат;
		КонецЕсли;
		
		ЗаказПокупателя = СсылкаНаОбъект.Сделка;
		
		Если НЕ (ЗаказПокупателя.Контрагент <> DPD
			И (ЗаказПокупателя.ТранспортнаяКомпания = ТК
			ИЛИ Найти(ЗаказПокупателя.Комментарий,макетИмя)>0
			)  ) тогда
			//		сообщить("Печать реестра "+макетИмя+" - не требуется!");
			возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СсылкаЗаказ", ЗаказПокупателя);
		Запрос.УстановитьПараметр("СостоянияИМДляПечатиреестра",СостоянияИМДляПечатиреестра);
		Запрос.Текст ="ВЫБРАТЬ
		              |	Заказы.ЗаказПокупателя
		              |ПОМЕСТИТЬ ВТ_Заказы
		              |ИЗ
		              |	Документ.ЗаказПокупателя.Заказы КАК Заказы
		              |ГДЕ
		              |	Заказы.Ссылка = &СсылкаЗаказ
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	Заказ1.Ссылка
		              |ИЗ
		              |	Документ.ЗаказПокупателя КАК Заказ1
		              |ГДЕ
		              |	Заказ1.Ссылка = &СсылкаЗаказ
		              |;
		              |
		              |////////////////////////////////////////////////////////////////////////////////
		              |ВЫБРАТЬ РАЗЛИЧНЫЕ
		              |	ЗаказПокупателяРеквизитыЗаказаТК.Ссылка КАК Заказ,
		              |	ЗаказПокупателяРеквизитыЗаказаТК.Поле КАК Поле,
		              |	ВЫРАЗИТЬ(ЗаказПокупателяРеквизитыЗаказаТК.Значение КАК СТРОКА(1000)) КАК Значение
		              |ИЗ
		              |	Документ.ЗаказПокупателя.РеквизитыЗаказаТК КАК ЗаказПокупателяРеквизитыЗаказаТК
		              |ГДЕ
		              |	ЗаказПокупателяРеквизитыЗаказаТК.Ссылка В
		              |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		              |				ВТ_Заказы.ЗаказПокупателя
		              |			ИЗ
		              |				ВТ_Заказы)
		              |	И ЗаказПокупателяРеквизитыЗаказаТК.Ссылка В
		              |			(ВЫБРАТЬ
		              |				СостояниеЗаказовИМ.ЗаказПервичный
		              |			ИЗ
		              |				РегистрСведений.СостояниеЗаказовИМ КАК СостояниеЗаказовИМ
		              |			ГДЕ
		              |				СостояниеЗаказовИМ.Состояние В (&СостоянияИМДляПечатиреестра))
		              |	И (ВЫРАЗИТЬ(ЗаказПокупателяРеквизитыЗаказаТК.Значение КАК СТРОКА(1000))) <> """"
		              |ИТОГИ ПО
		              |	Заказ
		              |;
		              |
		              |////////////////////////////////////////////////////////////////////////////////
		              |УНИЧТОЖИТЬ ВТ_Заказы";
		ВыборкаЗак = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Иначе	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
		Запрос.УстановитьПараметр("ТранспортнаяКомпания",  ТК);
		Запрос.УстановитьПараметр("DPD",  DPD );
		Запрос.УстановитьПараметр("СостоянияИМДляПечатиреестра",СостоянияИМДляПечатиреестра);
		Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя
		|ПОМЕСТИТЬ ВТ_Заказы1
		|ИЗ
		|	Документ.ЗаданиеНаОтгрузку.ЗаказыПокупателей КАК ЗаданиеНаОтгрузкуЗаказыПокупателей
		|ГДЕ
		|	ЗаданиеНаОтгрузкуЗаказыПокупателей.Ссылка = &Ссылка
		|	И НЕ ЗаданиеНаОтгрузкуЗаказыПокупателей.Реализация = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.пустаяСсылка)
		|			И НЕ ЗаданиеНаОтгрузкуЗаказыПокупателей.Реализация = ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.пустаяСсылка)
		
		//============================================================================================			  
		//++++ 
		|	И ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя.Контрагент <> &DPD
		|   и ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя.Контрагент.КатегорияПокупателя <> Значение(Справочник.КатегорииПокупателей.КонечныйПотребительФЛ)
		|	И (ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя.ТранспортнаяКомпания = &ТранспортнаяКомпания 
		|			ИЛИ ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя.Комментарий ПОДОБНО ""%"+макетИмя+"%"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заказы.ЗаказПокупателя
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	Документ.ЗаказПокупателя.Заказы КАК Заказы
		|ГДЕ
		|	Заказы.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_Заказы1.ЗаказПокупателя
		|			ИЗ
		|				ВТ_Заказы1)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Заказ1.ЗаказПокупателя
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Заказы1.ЗаказПокупателя КАК ЗаказПокупателя
		|	ИЗ
		|		ВТ_Заказы1 КАК ВТ_Заказы1) КАК Заказ1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяРеквизитыЗаказаТК.Ссылка КАК Заказ,
		|	ЗаказПокупателяРеквизитыЗаказаТК.Поле КАК Поле,
		|	(ВЫРАЗИТЬ(ЗаказПокупателяРеквизитыЗаказаТК.Значение КАК СТРОКА(1000))) как Значение
		|ИЗ
		|	Документ.ЗаказПокупателя.РеквизитыЗаказаТК КАК ЗаказПокупателяРеквизитыЗаказаТК
		|ГДЕ
		|	ЗаказПокупателяРеквизитыЗаказаТК.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВТ_Заказы.ЗаказПокупателя
		|			ИЗ
		|				ВТ_Заказы)
		|	И ЗаказПокупателяРеквизитыЗаказаТК.Ссылка В
		              |			(ВЫБРАТЬ
		              |				СостояниеЗаказовИМ.ЗаказПервичный
		              |			ИЗ
		              |				РегистрСведений.СостояниеЗаказовИМ КАК СостояниеЗаказовИМ
		              |			ГДЕ
		              |				СостояниеЗаказовИМ.Состояние В (&СостоянияИМДляПечатиреестра))

		      |	И (ВЫРАЗИТЬ(ЗаказПокупателяРеквизитыЗаказаТК.Значение КАК СТРОКА(1000))) <> """"

		|ИТОГИ
		|ПО
		|	Заказ;
		|УНИЧТОЖИТЬ ВТ_Заказы1;
		|УНИЧТОЖИТЬ ВТ_Заказы";
		
		ВыборкаЗак = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	
	Если ВыборкаЗак.Количество()=0 тогда
		Сообщить("Нет данных по Юр.лицам с перевозчиком "+макетИмя+"!", СтатусСообщения.Внимание);
		возврат;
	КонецЕсли;
	
	если ТабДокумент = неопределено тогда
		ТабДокумент = новый ТабличныйДокумент;
	иначе
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;	
	
	
	//=======================================================================================	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//23.10.17
	Попытка
	ОбШтрихКод=ОбластьМакета.Рисунки.Штрихкод.Объект;
	ОбШтрихКод.ТипКода = 4; 
	ОбШтрихКод.Сообщение = СформироватьШКРеализации(СсылкаНаОбъект,"U");//XMLСтрока(ЭтотОбъект.Ссылка.УникальныйИдентификатор()); 
	ОбШтрихКод.ОтображатьТекст = Ложь;
    Исключение
	Конецпопытки;

	
	//24.03.2016
	//	ОбластьМакета.Параметры.НомерЗадания     = СсылкаНаОбъект.Номер;
	Если типЗнч(СсылкаНаОбъект) = тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
		ОбластьМакета.Параметры.ДатаЗабораГруза  = формат(СсылкаНаОбъект.Дата, "ДЛФ=D");
		ОбластьМакета.Параметры.НомерЗадания     = СсылкаНаОбъект.Номер
		//+" от "+формат(СсылкаНаОбъект.Дата,"ДЛФ=D")
		;
	Иначе	
		ОбластьМакета.Параметры.ДатаЗабораГруза  = формат(макс(СсылкаНаОбъект.ВремяНапоминания,СсылкаНаОбъект.Дата), "ДЛФ=D");
		НомераРеализаций = "";
		Запрос1 = новый Запрос;
		Запрос1.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя,
		|	ЗаданиеНаОтгрузкуЗаказыПокупателей.Реализация.Номер как РеализацияНомер,
		|	ЗаданиеНаОтгрузкуЗаказыПокупателей.Реализация.Дата как РеализацияДата
		|ИЗ
		|	Документ.ЗаданиеНаОтгрузку.ЗаказыПокупателей КАК ЗаданиеНаОтгрузкуЗаказыПокупателей
		|ГДЕ
		|	ЗаданиеНаОтгрузкуЗаказыПокупателей.Ссылка = &Ссылка
		|	И ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя.Контрагент <> &DPD
		|   и ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя.Контрагент.КатегорияПокупателя <> Значение(Справочник.КатегорииПокупателей.КонечныйПотребительФЛ)
		|
		|	И (ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя.ТранспортнаяКомпания = &ТранспортнаяКомпания
		|			ИЛИ ЗаданиеНаОтгрузкуЗаказыПокупателей.ЗаказПокупателя.Комментарий ПОДОБНО ""%"+макетИмя+"%"")
		|	И НЕ ЗаданиеНаОтгрузкуЗаказыПокупателей.Реализация = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.пустаяСсылка)
		|	И НЕ ЗаданиеНаОтгрузкуЗаказыПокупателей.Реализация = ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.пустаяСсылка)
		|";
		Запрос1.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
		Запрос1.УстановитьПараметр("ТранспортнаяКомпания",  ТК);
		Запрос1.УстановитьПараметр("DPD",  DPD );
		ВыборкаРеализаций = Запрос1.Выполнить().Выбрать();
		пока ВыборкаРеализаций.Следующий() цикл
			НомераРеализаций = НомераРеализаций + Строка(ВыборкаРеализаций.РеализацияНомер)
			//+" от "+формат(ВыборкаРеализаций.РеализацияДата,"ДЛФ=D")
			+"; ";	
		КонецЦикла;	
		ОбластьМакета.Параметры.НомерЗадания     = НомераРеализаций;
	КонецЕсли;
	
	филиал = СсылкаНаОбъект.Подразделение.Контрагент;
	СведенияОГрузоотправитель = СведенияОЮрФизЛице(филиал, СсылкаНаОбъект.Дата);
	ОбластьМакета.Параметры.АдресОтправителя = ОписаниеОрганизации(СведенияОГрузоотправитель, "ФактическийАдрес,");
	
	ОбластьМакета.Параметры.Название = СокрЛП(филиал.НаименованиеПолное);
	
	ВыборкаЗак.Следующий(); 	
	адр = ВыборкаЗак.Заказ.АдресДоставки;
	ОбластьМакета.Параметры.ФактАдресDPD = СокрЛП( стрЗаменить(адр, "DPD", "") );
	//DPD г. Ярославль, проспект Фрунзе, д. 24 А, павильон-склад №26
	//DPD, г. Екатеринбург, ул. Крайля, дом 76		
	
		
	Если ТипЗнч(СсылкаНаОбъект)=тип("ДокументСсылка.РеализацияТоваровУслуг") тогда // 19.04.2016
		Контр = СсылкаНаОбъект.Контрагент;
	Иначе
		Контр = ВыборкаЗак.Заказ.Контрагент;
	КонецЕсли;
	
	
	Если Контр.Код = "П000382" тогда // АЭ
		ОбластьМакета.Параметры.Орг =  Контр.НаименованиеПолное;
		ОбластьМакета.Параметры.ИННКПП   = "ИНН: "+строка(Контр.ИНН)+", КПП: " +строка(Контр.КПП);
	Иначе	
		ОбластьМакета.Параметры.Орг = "ЗАО ТК ""Яршинторг""";
		ОбластьМакета.Параметры.ИННКПП   = "ИНН: "+строка(филиал.ИНН)+", КПП: "+строка(филиал.КПП);
	КонецЕсли;

	
	ТабДокумент.Вывести(ОбластьМакета);
	
	//==================================================
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	КолМест = 0; 
	СуммаТоваровИтого=0; СуммаУслугИтого=0; ОбъявленнаяценностьИтого=0; //19.04.2016
	ВыборкаЗак.Сбросить();
	пока ВыборкаЗак.Следующий() цикл
		
		//Если типЗнч(СсылкаНаОбъект)=тип("ДокументСсылка.ЗаданиеНаОтгрузку") тогда
		//	Если НетТоваровВЗадании(ВыборкаЗак.Заказ) тогда
		//		продолжить;
		//	КонецЕсли;	
		//КонецЕсли;	
		
		если ВыборкаЗак.Заказ.Подразделение.Код = "00005" тогда
			НомФилиала = "000092773"; //Яршинторг
			НомФилиалаОпт = "00001";
		Иначе 
			НомФилиала = СокрЛП(ВыборкаЗак.Заказ.Подразделение.Контрагент.Код);
			НомФилиалаОпт = СокрЛП(ВыборкаЗак.Заказ.Грузоотправитель.Код);

			//"Ф00000010"; //Филиал Ростов-на-Дону
			//"П000835";// Яршинторг Филиал Санкт-Петербург
			//"УТ0000494";// Яршинторг Филиал Екатеринбург
		КонецЕсли;
		
		Если  ВыборкаЗак.Заказ.TerminalОтгрузкаТранспортнойКомпанией  или ВыборкаЗак.Заказ.ПередатьВТК Тогда
		ОбластьМакета.Параметры.НомерЗаказа = ВыборкаЗак.Заказ.Номер;
		ОбластьМакета.Параметры.Покупатель = ВыборкаЗак.Заказ.Контрагент.наименованиеПолное;
		иначе	
		ОбластьМакета.Параметры.НомерЗаказа = ВыборкаЗак.Заказ.НомерВходящегоДокумента+"_"+НомФилиала;
		//ОбластьМакета.Параметры.Покупатель = "";

		конецЕсли;
		//    ОбластьМакета.Параметры.АдресДоставки = ВыборкаЗак.Заказ.АдресДоставки;
		
		//+++ 24.03.2016
		СуммаУслуг   = ВыборкаЗак.Заказ.Услуги.Итог("Сумма");
		ОбластьМакета.Параметры.СуммаУслуг = СуммаУслуг;
		
		ВыборкаСтр = ВыборкаЗак.Выбрать();
		сообщить(ВыборкаСтр.Заказ);
		
		значение1="";  списокТоваровЭтойСтроки = "";
		пока ВыборкаСтр.Следующий() цикл
			назв = стрЗаменить(ВыборкаСтр.Поле," ","");
			Если назв ="ШК" тогда 	
				значение1 = стрЗаменить(ВыборкаСтр.Значение, ";", ";
				|");
			иначе 
				значение1 = СокрЛП(ВыборкаСтр.Значение);
			КонецЕсли;	
			
			Если назв ="Количествомест" тогда
				КолМест = КолМест + число(значение1);
			КонецЕсли;
			
			//+++ 24.03.2016
			Если назв ="Объявленнаяценность" тогда //14.07.2016 - это цена товаров!  а услуги - сверху надо! см. реализацию ТК020654 от 06.07.2016
					ОбластьМакета.Параметры.СуммаТоваров   = значение1;
					значение1 = число(стрЗаменить(значение1, " ","")); //26.08.2016 НЕ НАДО!!! + СуммаУслуг;
			КонецЕсли;
			
			//Адиянов<<<Срочно надо было поправть 20160921194100
			//Заключил в попытку
			Попытка 	
				ОбластьМакета.Параметры[назв] = значение1;
			Исключение
				//Сообщить(ОписаниеОшибки());
			КонецПопытки;
			
				
			
			//14.07.2016 Проверка наличия товара в отгрузке...
			Если назв ="Содержимое" тогда
			   списокТоваровЭтойСтроки =  значение1;
		    КонецЕсли;
		 
		КонецЦикла;
		
		//14.07.2016 Проверка
		естьТовар = Ложь;
		для каждого стр1 из СсылкаНаОбъект.Товары цикл // товары в реалзиации или товары из Задания на отгрузку
			Если Найти(списокТоваровЭтойСтроки, "("+строка(стр1.Номенклатура.Код)+")")>0 
				   и стр1.Количество>0 тогда
				естьТовар = истина; прервать; // Ура, нашли товар
			КонецЕсли;	
		КонецЦикла; 
		
		Если естьТовар тогда  //14.07.2016
			ТабДокумент.Вывести(ОбластьМакета);
		иначе
			Сообщить("Из реестра исключен исключён товар: "+списокТоваровЭтойСтроки, СтатусСообщения.Внимание);
			продолжить
		КонецЕсли;
		
		//19.04.2016
		СуммаТоваровИтого=СуммаТоваровИтого+ ОбластьМакета.Параметры.СуммаТоваров;
		СуммаУслугИтого  =СуммаУслугИтого  + ОбластьМакета.Параметры.СуммаУслуг;
		ОбъявленнаяценностьИтого=ОбъявленнаяценностьИтого+ОбластьМакета.Параметры.Объявленнаяценность; 
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	//+++ 19.04.2016
	ОбластьМакета.Параметры.СуммаТоваров = СуммаТоваровИтого;
	ОбластьМакета.Параметры.СуммаУслуг   = СуммаУслугИтого;
	ОбластьМакета.Параметры.Объявленнаяценность = ОбъявленнаяценностьИтого;
	
	ОбластьМакета.Параметры.КолМест = КолМест;
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб = Истина;
КонецПроцедуры

функция НетТоваровВЗадании(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Номенклатура.Код КАК Код,
	|	ЗаказПокупателяТовары.Количество КАК КоличествоЗаказано,
	|	ЕСТЬNULL(ЗаданиеНаОтгрузкуТовары.Количество, 0) КАК КоличествоОтгружено
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Задание.Номенклатура КАК Номенклатура,
	|			СУММА(Задание.Количество) КАК Количество
	|		ИЗ
	|			Документ.ЗаданиеНаОтгрузку.Товары КАК Задание
	|		ГДЕ
	|			Задание.Ссылка = &Задание
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Задание.Номенклатура) КАК ЗаданиеНаОтгрузкуТовары
	|		ПО ЗаказПокупателяТовары.Номенклатура = ЗаданиеНаОтгрузкуТовары.Номенклатура
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка = &Заказ";
	Запрос.УстановитьПараметр("Задание", СсылкаНаОбъект.Ссылка);
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Результат = Запрос.Выполнить();
	выборка = результат.Выбрать();
	рез = ложь;
	пока выборка.Следующий() цикл
		если выборка.КоличествоОтгружено<выборка.КоличествоЗаказано  тогда
			сообщить("По заказу: "+строка(Заказ)+" товар с кодом: "+выборка.Код +" заказано: "+строка(выборка.КоличествоЗаказано)+"  отгружено: "+строка(выборка.КоличествоОтгружено), СтатусСообщения.Внимание);
			рез = Истина;
		КонецЕсли;	 
	КонецЦикла;	 
	
	возврат  рез;	 
КонецФункции

СостоянияИМДляПечатиреестра = новый СписокЗначений;
	СостоянияИМДляПечатиреестра.Добавить(Перечисления.СостояниеЗаказовИМ.Перемещен);
	СостоянияИМДляПечатиреестра.Добавить(Перечисления.СостояниеЗаказовИМ.Возвращен);
	СостоянияИМДляПечатиреестра.Добавить(Перечисления.СостояниеЗаказовИМ.Отгружен);
	СостоянияИМДляПечатиреестра.Добавить(Перечисления.СостояниеЗаказовИМ.Отменен);
