
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Если Запись.Номенклатура.Пустая() Тогда
			Отказ = Истина;
			Сообщить("Нельзя записывать с незаполненным значением номенклатуры.");
			Продолжить;
		КонецЕсли; 
		//+++ сильно тормозит запись элемента!
		//Если Запись.Номенклатура.ЭтоГруппа Тогда
		//	Отказ = Истина;
		//	Сообщить("Нельзя выбирать группу номенклатуры в качестве номенклатуры контрагента.");
		//	Продолжить;
		//КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

