
Процедура КнопкаВыполнитьНажатие(Кнопка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателя.ЗаявкаОснование
		|ПОМЕСТИТЬ Заявки
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
		|ГДЕ
		|	ВозвратТоваровОтПокупателя.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И ВозвратТоваровОтПокупателя.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СРЕДНЕЕ(ЗаявкаНавозврат.Количество) КАК ПланЗаявки,
		|	СУММА(Возвраты.Количество) КАК ФактЗаявки,
		|	ЗаявкаНавозврат.Ссылка,
		|	ЗаявкаНавозврат.Ссылка.ПричинаВозврата
		|ПОМЕСТИТЬ ВыполнениеЗаявки
		|ИЗ
		|	(ВЫБРАТЬ
		|		СУММА(ЗаявкаНаВозвратТоваровТовары.Количество) КАК Количество,
		|		ЗаявкаНаВозвратТоваровТовары.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.ЗаявкаНаВозвратТоваров.Товары КАК ЗаявкаНаВозвратТоваровТовары
		|	ГДЕ
		|		ЗаявкаНаВозвратТоваровТовары.Ссылка В
		|				(ВЫБРАТЬ
		|					Заявки.ЗаявкаОснование
		|				ИЗ
		|					Заявки КАК Заявки)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЗаявкаНаВозвратТоваровТовары.Ссылка) КАК ЗаявкаНавозврат
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(ВозвратТоваровОтПокупателяТовары.Количество) КАК Количество,
		|			ВозвратТоваровОтПокупателяТовары.Ссылка.ЗаявкаОснование КАК ЗаявкаОснование
		|		ИЗ
		|			Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		|		ГДЕ
		|			ВозвратТоваровОтПокупателяТовары.Ссылка.Проведен
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВозвратТоваровОтПокупателяТовары.Ссылка.ЗаявкаОснование) КАК Возвраты
		|		ПО ЗаявкаНавозврат.Ссылка = Возвраты.ЗаявкаОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаНавозврат.Ссылка,
		|	ЗаявкаНавозврат.Ссылка.ПричинаВозврата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателяТовары.Ссылка.Дата КАК ДатаВозврата,
		|	ВозвратТоваровОтПокупателяТовары.Ссылка.МаркаАвтомобиля КАК МаркаАвтомобиляВозврат,
		|	ВозвратТоваровОтПокупателяТовары.Ссылка.ГосНомерАвтомобиля КАК ГосНомерАвтомобиляВозврат,
		|	ВозвратТоваровОтПокупателяТовары.Ссылка.Водитель КАК ВодительВозврат,
		|	ВозвратТоваровОтПокупателяТовары.ДокументПартии.Дата КАК ДатаОтгрузки,
		|	ВозвратТоваровОтПокупателяТовары.ДокументПартии.МаркаАвтомобиля,
		|	ВозвратТоваровОтПокупателяТовары.ДокументПартии.ГосНомерАвтомобиля,
		|	ВозвратТоваровОтПокупателяТовары.ДокументПартии.Водитель,
		|	ЗаданиеНаОтгрузкуЗаказыПокупателей.Ссылка.Номер КАК НомерЗадания,
		|	ЗаданиеНаОтгрузкуЗаказыПокупателей.Ссылка.Ссылка КАК СсылкаЗадание,
		|	ВозвратТоваровОтПокупателяТовары.ДокументПартии.Контрагент КАК Контрагент,
		|	ВыполнениеЗаявки.Ссылка КАК Заявка,
		|	ВыполнениеЗаявки.ПланЗаявки,
		|	ВыполнениеЗаявки.ФактЗаявки,
		|	ВозвратТоваровОтПокупателяТовары.Ссылка КАК Возврат,
		|	ВозвратТоваровОтПокупателяТовары.ДокументПартии,
		|	ВозвратТоваровОтПокупателяТовары.Ссылка.ФактическаяПричинаВозврата,
		|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
		|	ВозвратТоваровОтПокупателяТовары.Количество,
		|	ВыполнениеЗаявки.СсылкаПричинаВозврата КАК ПричинаВозврата
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаОтгрузку.ЗаказыПокупателей КАК ЗаданиеНаОтгрузкуЗаказыПокупателей
		|		ПО ВозвратТоваровОтПокупателяТовары.ДокументПартии = ЗаданиеНаОтгрузкуЗаказыПокупателей.Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВыполнениеЗаявки КАК ВыполнениеЗаявки
		|		ПО ВозвратТоваровОтПокупателяТовары.Ссылка.ЗаявкаОснование = ВыполнениеЗаявки.Ссылка
		|ГДЕ
		|	ВозвратТоваровОтПокупателяТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И ВозвратТоваровОтПокупателяТовары.Ссылка.Проведен ";
		Если ЗначениеЗаполнено(ФактическаяПричинаВозврата) Тогда
		Запрос.Текст = Запрос.Текст +"	И ВозвратТоваровОтПокупателяТовары.Ссылка.ФактическаяПричинаВозврата = &ФактическаяПричинаВозврата";
		Запрос.УстановитьПараметр("ФактическаяПричинаВозврата", ФактическаяПричинаВозврата);
	конецЕсли;
	    Запрос.Текст = Запрос.Текст+"
		|
		|УПОРЯДОЧИТЬ ПО
		|	Заявка";
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(КонПериода));
	Запрос.УстановитьПараметр("ДатаНач", НачПериода);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();
    КоличествоВозвратов=0;
	ЗаявкаСтр = Неопределено;
	Дерево = ЭлементыФормы.Возвраты.Значение;
	Дерево.Строки.Очистить();
	Пока Выборка.Следующий() Цикл
		Если ЗаявкаСтр = Неопределено или ЗаявкаСтр.Документ <> ?(Выборка.Заявка=Null,Неопределено,Выборка.Заявка) Тогда
		 КоличествоВозвратов= КоличествоВозвратов+1;
		 
		 ЗаявкаСтр = Дерево.Строки.Добавить();
		 ЗаявкаСтр.Документ =  Выборка.Заявка;
		 Если ЗначениеЗаполнено(Выборка.Заявка) Тогда
		 ЗаявкаСтр.Дата =   Выборка.Заявка.Дата;
		 конецесли;
		 ЗаявкаСтр.План =  Выборка.ПланЗаявки;
		 ЗаявкаСтр.Факт =  Выборка.ФактЗаявки;

		 
		 
		 
		 возвратСтр = ЗаявкаСтр.Строки.Добавить();
		 ВозвратСтр.Документ = Выборка.Возврат;
		 ВозвратСтр.Дата = Выборка.ДатаВозврата;
		 ВозвратСтр.Авто = Выборка.МаркаАвтомобиляВозврат;
		 ВозвратСтр.ГосНомер = Выборка.ГосНомерАвтомобиляВозврат;
		 ВозвратСтр.Контрагент = Выборка.Контрагент;
		 ВозвратСтр.причинаВозврата = Выборка.Причинавозврата;
		 ВозвратСтр.ФактическаяПричина = Выборка.ФактическаяПричинаВозврата; 
		 
		 РеализацияСтр = ВозвратСтр.Строки.Добавить();
		 РеализацияСтр.Документ =  выборка.ДокументПартии;
		 РеализацияСтр.Дата = Выборка.ДатаОтгрузки;
		 РеализацияСтр.Авто = Выборка.ДокументПартииМаркаАвтомобиля;
		 РеализацияСтр.ГосНомер = ВЫборка.ДокументПартииГосномерАвтомобиля;
		 РеализацияСтр.Водитель = Выборка.ДокументПартииВодитель;
		 РеализацияСтр.Контрагент = Выборка.контрагент;
		 РеализацияСтр.причинаВозврата = Выборка.НомерЗадания;
		 
		 
		 НоменклатураСтр = возвратСтр.Строки.Добавить();
		 НоменклатураСтр.Номенклатура = Выборка.Номенклатура;
		 НоменклатураСтр.количество = Выборка.Количество;
		 ВозвратСтр.количество= ВозвратСтр.количество+Выборка.Количество;
		 ЗаявкаСтр.количество = ЗаявкаСтр.количество+Выборка.Количество;
	   иначеЕсли  ВозвратСтр.Документ <> Выборка.Возврат Тогда
		 возвратСтр = ЗаявкаСтр.Строки.Добавить();
		 ВозвратСтр.Документ = Выборка.Возврат;
		 ВозвратСтр.Дата = Выборка.ДатаВозврата;
		 ВозвратСтр.Авто = Выборка.МаркаАвтомобиляВозврат;
		 ВозвратСтр.ГосНомер = Выборка.ГосНомерАвтомобиляВозврат;
		 ВозвратСтр.Контрагент = Выборка.Контрагент;
		 ВозвратСтр.причинаВозврата = Выборка.Причинавозврата;
		 ВозвратСтр.ФактическаяПричина = Выборка.ФактическаяПричинаВозврата; 
		 
		 РеализацияСтр = ВозвратСтр.Строки.Добавить();
		 РеализацияСтр.Документ =  выборка.ДокументПартии;
		 РеализацияСтр.Дата = Выборка.ДатаОтгрузки;
		 РеализацияСтр.Авто = Выборка.ДокументПартииМаркаАвтомобиля;
		 РеализацияСтр.ГосНомер = ВЫборка.ДокументПартииГосномерАвтомобиля;
		 РеализацияСтр.Водитель = Выборка.ДокументПартииВодитель;
		 РеализацияСтр.Контрагент = Выборка.контрагент;
		 РеализацияСтр.причинаВозврата = Выборка.НомерЗадания;
		 
		 
		 НоменклатураСтр = возвратСтр.Строки.Добавить();
		 НоменклатураСтр.Номенклатура = Выборка.Номенклатура;
		 НоменклатураСтр.количество = Выборка.Количество;
	     ВозвратСтр.количество= ВозвратСтр.количество+Выборка.Количество;
		 ЗаявкаСтр.количество = ЗаявкаСтр.количество+Выборка.Количество;
		иначе	
		 //ЗаявкаСтр.План = ЗаявкаСтр.План + Выборка.ПланЗаявки;
		 //ЗаявкаСтр.Факт = ЗаявкаСтр.Факт + Выборка.ФактЗаявки;
		 НоменклатураСтр = возвратСтр.Строки.Добавить();
		 НоменклатураСтр.Номенклатура = Выборка.Номенклатура;
		 НоменклатураСтр.количество = Выборка.Количество;
		 ВозвратСтр.количество= ВозвратСтр.количество+Выборка.Количество;
		 ЗаявкаСтр.количество = ЗаявкаСтр.количество+Выборка.Количество;
		 конецЕсли; 
	КонецЦикла;

    ЭлементыФормы.Возвраты.Значение = Дерево;
	Элементыформы.Итого.Заголовок = "Всего возвратов за период "+КоличествоВозвратов;
	
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

Процедура ВозвратыФактическаяПричинаПриИзменении(Элемент)
	Текстрока = Элементыформы.Возвраты.ТекущиеДанные;
	Если ТипЗнч(Текстрока.Документ)= Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")  Тогда
	ДокОбъект = ТекСтрока.Документ.ПолучитьОбъект();	
	ДокОбъект.ФактическаяПричинаВозврата = ТекСтрока.ФактическаяПричина;
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
    иначе
	сообщить("Причину возврата надо вводить в строке с возвратом!");
   конецЕсли;
    ТекСтрока.ФактическаяПричина = Перечисления.ПричиныВозвратаТовара.ПустаяСсылка();
КонецПроцедуры

Процедура ФактическаяПричинаВозвратаПриИзменении(Элемент)
	КнопкаВыполнитьНажатие(Истина);
КонецПроцедуры

Процедура ПриОткрытии()
	//	Редактирующие = Новый СписокЗначений;
	//Редактирующие.Добавить(Справочники.Пользователи.НайтиПоКоду("Фролов"));
	//Редактирующие.Добавить(Справочники.Пользователи.НайтиПоКоду("Гаричев"));
	//Редактирующие.Добавить(Справочники.Пользователи.НайтиПоКоду("Цверава В.У."));
	//Редактирующие.Добавить(Справочники.Пользователи.НайтиПоКоду("Князева"));
	//Редактирующие.Добавить(Справочники.Пользователи.НайтиПоКоду("Невежина И.Н."));
	//
	//Если Редактирующие.НайтиПоЗначению(ПараметрыСеанса.ТекущийПользователь) = Неопределено Тогда
	//	ЭлементыФормы.Возвраты.Колонки.ФактическаяПричина.ТолькоПросмотр = Истина;
	//иначе	
	//	ЭлементыФормы.Возвраты.Колонки.ФактическаяПричина.ТолькоПросмотр = Ложь;
	//конецЕсли;	

КонецПроцедуры
