Функция  ОткрытьКарточку(парОбъектДД, парКонтрагент, парПодразделениеКонтрагента, парDepartmentID)  Экспорт 
	ОбъектДД = парОбъектДД;
    Контрагент = парКонтрагент;
	ПодразделениеКонтрагента =парПодразделениеКонтрагента;	
	DepartmentID = парDepartmentID;
	Возврат ОткрытьМодально();
КонецФункции
	
	
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(контрагент) = Ложь Тогда
		предупреждение("Не указан контрагент!",,НаименованиеСистемы);
	Иначе 
		Закрыть(Новый Структура("Контрагент, ПодразделениеКонтрагента, DepartmentID",Контрагент, ПодразделениеКонтрагента, DepartmentID))
	КонецЕсли;	
КонецПроцедуры

Процедура КонтрагентНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбКонтрагент = ПолучитьФорму("ФормаВыбораКонтрагента").ВыбратьКонтрагента(ОбъектДД.Organization, ОбъектДД.INN);
	Если ЗначениеЗаполнено(выбКонтрагент) Тогда 
		контрагент = выбКонтрагент
	КонецЕсли;	
КонецПроцедуры

Процедура ПодразделениеКонтрагентаНачалоВыбора(Элемент, СтандартнаяОбработка)
	 Отказ = Истина;
	
	 стОрганизация = ПолучитьФорму("ФормаВыбораОрганизацииПодразделения").ВыбратьПодразделениеКонтрагентаДиадок(ОбъектДД.Organization.id,ОбъектДД.id ,  DepartmentID);
	 Если стОрганизация <>Неопределено Тогда
		 ПодразделениеКонтрагента = стОрганизация.ПредставлениеПодразделения;
		 DepartmentID =  стОрганизация.DepartmentID;
 	 КонецЕсли;	
КонецПроцедуры

Процедура ПодразделениеКонтрагентаОчистка(Элемент, СтандартнаяОбработка)
	ПодразделениеКонтрагента = "";
	DepartmentID = "";
КонецПроцедуры

Процедура ПриОткрытии()
		КартинкаЗаголовка= ЭДО_БиблиотекаКартинок().КартинкаЗаголовка;
КонецПроцедуры
