
Перем Эксель, Лист, Книга, Файл;

Процедура КнопкаВыполнитьНажатие(Кнопка)
	//
	Эксель = Новый COMОбъект("Excel.Application");
	//ПутьКФайлу="\\Novikova\Таблица11\таблица 11.xls";
	ПутьКФайлу="c:\Таблица11\таблица 11.xls";
	Файл = Новый Файл(ПутьКФайлу);
	Если Не Файл.Существует() Тогда
		Сообщить("Файл не существует!");
		Возврат;
	КонецЕсли; 
	Книга   = Эксель.Workbooks.Open(ПутьКФайлу);
	КоличествоЛистов = Книга.Sheets.Count;
	НомерЛиста=1;
	СписокЛистов=новый СписокЗначений;
	Пока НомерЛиста <= КоличествоЛистов Цикл
		СписокЛистов.Добавить(Книга.Sheets(НомерЛиста).Name);
		НомерЛиста=НомерЛиста+1;
	КонецЦикла;
	ЛистСезон=СписокЛистов.ВыбратьЭлемент("Укажите сезон");
	Лист                = Книга.Worksheets(ЛистСезон.Значение);
	КоличествоСтрок     = Лист.Cells(1,1).SpecialCells(11).Row;

	//
	
	
	тзДатыПоступлений=новый ТаблицаЗначений;
	тзДатыПоступлений.Колонки.Добавить("ДатаПоступления",Новый ОписаниеТипов("Дата"));
	тзДатыПоступлений.Колонки.Добавить("Контейнер",Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(20)));
	
	КоличествоСтрок     = Лист.Cells(1,1).SpecialCells(11).Row;
	НачалоТекДня=НачалоДня(ТекущаяДата());
	для сч = 1 по КоличествоСтрок Цикл
		Контейнер =  СокрЛП(Строка(Лист.Cells(сч,  "I").Value));
		ДатаПоступленияВЯрославль =  СокрЛП(Строка(Лист.Cells(сч,  "V").Value));
		Если Контейнер<>"" тогда
			ДатаПоступленияЭксель=ПреобразоватьВДату(ДатаПоступленияВЯрославль);
			Если ДатаПоступленияЭксель>=НачалоТекДня тогда
				нстр=тзДатыПоступлений.Добавить();
				нстр.ДатаПоступления=ДатаПоступленияЭксель;
				нстр.Контейнер=Контейнер;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//тзДатыПоступлений.ВыбратьСтроку();
	//проверим есть ли уже заказы на отгрузку с этими контейнерами
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ДатыПоступления.ДатаПоступления,
	             |	ДатыПоступления.Контейнер
	             |ПОМЕСТИТЬ втНовыеКонтейнеры
	             |ИЗ
	             |	&ДатыПоступления КАК ДатыПоступления
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ВЫРАЗИТЬ(ЗаданиеНаОтгрузкуЗаказыПоставщикам.ЗаказПоставщику.НомерКонтейнера КАК СТРОКА(20)) КАК Контейнер
	             |ПОМЕСТИТЬ втКонтейнерыИзЗаданий
	             |ИЗ
	             |	Документ.ЗаданиеНаОтгрузку.ЗаказыПоставщикам КАК ЗаданиеНаОтгрузкуЗаказыПоставщикам
	             |ГДЕ
	             |	ЗаданиеНаОтгрузкуЗаказыПоставщикам.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	             |	И ЗаданиеНаОтгрузкуЗаказыПоставщикам.Ссылка.ПометкаУдаления = ЛОЖЬ
	             |	И ЗаданиеНаОтгрузкуЗаказыПоставщикам.Ссылка.Дата >= &НачалоТекДня
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	втНовыеКонтейнеры.ДатаПоступления,
	             |	втНовыеКонтейнеры.Контейнер,
	             |	ЗаказПоставщику.Ссылка КАК ЗаказПоставщику,
	             |	ЗаказПоставщику.Контрагент,
	             |	ЗаказПоставщику.Комментарий
	             |ИЗ
	             |	втНовыеКонтейнеры КАК втНовыеКонтейнеры
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
	             |		ПО втНовыеКонтейнеры.Контейнер = ЗаказПоставщику.НомерКонтейнера
	             |ГДЕ
	             |	НЕ ВЫРАЗИТЬ(втНовыеКонтейнеры.Контейнер КАК СТРОКА(20)) В
	             |				(ВЫБРАТЬ
	             |					втКонтейнерыИзЗаданий.Контейнер
	             |				ИЗ
	             |					втКонтейнерыИзЗаданий КАК втКонтейнерыИзЗаданий)";
	Запрос.УстановитьПараметр("НачалоТекДня",НачалоТекДня);
	Запрос.УстановитьПараметр("ДатыПоступления",тзДатыПоступлений);
	Результат=Запрос.Выполнить();
	Рез=Результат.Выбрать();
	//тз=Результат.Выгрузить();
	//тз.ВыбратьСтроку();
	СеребренниковаАА=Справочники.Пользователи.НайтиПоНаименованию("Серебренникова Анна Александровна");
	Пока Рез.Следующий() Цикл
		//создаем задания
		ДокЗадание=Документы.ЗаданиеНаОтгрузку.СоздатьДокумент();
		ДокЗадание.Дата=Рез.ДатаПоступления;
		ДокЗадание.Ответственный=СеребренниковаАА;
		ДокЗадание.ВидОперации=Перечисления.ВидыДвиженийПриходРасход.Приход;
		ДокЗадание.Контрагент=Рез.Контрагент;
		стр1 = ДокЗадание.ЗаказыПоставщикам.Добавить();
		стр1.ЗаказПоставщику = Рез.ЗаказПоставщику;
		
		ДокЗадание.Комментарий = Рез.Комментарий;
		ДокЗадание.ВводитьИтогиВручную = Истина; // чтобы комментарий не удалялся
		
		ДокЗадание.Важность=Перечисления.Важность.Средняя;
		Подразделение = СеребренниковаАА.ОсновноеПодразделение;
        Организация   = ПолучитьЗначениеПоУмолчанию(СеребренниковаАА,"ОсновнаяОрганизация");
		
		
		УстановитьНомерДокумента(ДокЗадание);
		ДокЗадание.Записать();
		Сообщить(ДокЗадание);
	КонецЦикла;
КонецПроцедуры

// Фунция преобразовывает строку вида "01.01.2011" в дату
Функция  ПреобразоватьВДату(Дата) Экспорт
	НормальнаяДата = '00010101';
	
	Если ЗначениеЗаполнено(Дата) Тогда
		Попытка
			День = Число(Сред(Дата, 1, 2));
			Месяц = Число(Сред(Дата, 4, 2));
			Год = Число(Сред(Дата, 7, 4));
			
			НормальнаяДата = Дата(Год, Месяц, День);
		Исключение
			
		КонецПопытки;
	КонецЕсли;
	
	Возврат НормальнаяДата;
КонецФункции

Процедура ПриОткрытии()
	//флБезСтраховки=истина;
	//Эксель = Новый COMОбъект("Excel.Application");
	//ПутьКФайлу="\\Novikova\Таблица11\таблица 11.xls";
	//Файл = Новый Файл(ПутьКФайлу);
	//Если Не Файл.Существует() Тогда
	//	Сообщить("Файл не существует!");
	//	Возврат;
	//КонецЕсли; 
	//Книга   = Эксель.Workbooks.Open(ПутьКФайлу);
	//КоличествоЛистов = Книга.Sheets.Count;
	//НомерЛиста=1;
	//СписокЛистов=новый СписокЗначений;
	//Пока НомерЛиста <= КоличествоЛистов Цикл
	//	СписокЛистов.Добавить(Книга.Sheets(НомерЛиста).Name);
	//	НомерЛиста=НомерЛиста+1;
	//КонецЦикла;
	//ЛистСезон=СписокЛистов.ВыбратьЭлемент("Укажите сезон");
	//Лист                = Книга.Worksheets(ЛистСезон.Значение);
	//КоличествоСтрок     = Лист.Cells(1,1).SpecialCells(11).Row;
КонецПроцедуры

Процедура ПриЗакрытии()
	Если Эксель<>неопределено тогда
		Эксель.DisplayAlerts = 0; 
		Эксель.Quit();
		//Эксель.DisplayAlerts = 1; 
	КонецЕсли;
КонецПроцедуры
