
Процедура ДействияФормыОтчетСформировать(Кнопка)

	ТабДок = ЭлементыФормы.ПолеТабличногоДокумента;
	Отчет(ТабДок);

	
КонецПроцедуры

Процедура Отчет(ТабДок) Экспорт
	
	Макет = ПолучитьМакет("Отчет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗапросПрибыль.НоменклатурнаяГруппа,
	|	ЗапросПрибыль.ВаловаяПрибыль,
	|	ЗапросПрибыль.СтоимостьОборот
	|ПОМЕСТИТЬ ЗапросПрибыль
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапросПрибыль.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|		СУММА(ЗапросПрибыль.ВаловаяНаценка) КАК ВаловаяПрибыль,
	|		СУММА(ЗапросПрибыль.СтоимостьОборот) КАК СтоимостьОборот
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПродажиОбороты.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|			СУММА(ПродажиОбороты.СтоимостьОборот) КАК СтоимостьОборот,
	|			СУММА(ПродажиСебестоимостьОбороты.СтоимостьОборот) КАК СебестоимостьОборот,
	|			СУММА(ПродажиОбороты.СтоимостьОборот - ЕСТЬNULL(ПродажиСебестоимостьОбороты.СтоимостьОборот, 0)) КАК ВаловаяНаценка
	|		ИЗ
	|			РегистрНакопления.Продажи.Обороты(
	|					&НачДата,
	|					&КонДата,
	|					Регистратор,
	|					(НЕ Номенклатура.Услуга)
	|						И ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоЗаказам
	|						И (НЕ ДоговорКонтрагента.Владелец = &Формула2015)) КАК ПродажиОбороты
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиСебестоимость.Обороты(&НачДата, &КонДата, Регистратор, (НЕ Номенклатура.Услуга)) КАК ПродажиСебестоимостьОбороты
	|				ПО ПродажиОбороты.Номенклатура = ПродажиСебестоимостьОбороты.Номенклатура
	|					И ПродажиОбороты.Регистратор = ПродажиСебестоимостьОбороты.Регистратор
	|					И ПродажиОбороты.ЗаказПокупателя = ПродажиСебестоимостьОбороты.ЗаказПокупателя
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПродажиОбороты.Номенклатура.НоменклатурнаяГруппа) КАК ЗапросПрибыль
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗапросПрибыль.НоменклатурнаяГруппа) КАК ЗапросПрибыль
	|;
	| ВЫБРАТЬ СУММА(ЗапросПрибыль.ВаловаяПрибыль) Сумма ПОМЕСТИТЬ ОбщаяПрибыльБезФ_Ф   ИЗ  ЗапросПрибыль 
	|;

	
	|////////////////////////////////////////////////////////////////////////////////     Запрос старый БОНУСЫ (не используется)
	|ВЫБРАТЬ
	|	ЗапросБонусы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ЗапросБонусы.Сумма КАК СуммаБонусов
	|ПОМЕСТИТЬ ЗапросБонусыСтарые // Не используются
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПлатежноеПоручениеВходящееЗатраты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|		СУММА(ПлатежноеПоручениеВходящееЗатраты.Сумма) КАК Сумма
	|	ИЗ
	|		Документ.ПлатежноеПоручениеВходящее.Затраты КАК ПлатежноеПоручениеВходящееЗатраты
	|	ГДЕ
	|		ПлатежноеПоручениеВходящееЗатраты.Ссылка.Дата МЕЖДУ &НачДата И &КонДата
	|		И ПлатежноеПоручениеВходящееЗатраты.Ссылка.ВидОперации = &ПрочееПоступлениеДС
	|		И ПлатежноеПоручениеВходящееЗатраты.Ссылка.Проведен
	|		И ПлатежноеПоручениеВходящееЗатраты.Ссылка.ОтражатьВЗатратах
	|		И ПлатежноеПоручениеВходящееЗатраты.НоменклатурнаяГруппа <> &ПустаяНоменклатурнаяГруппа
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПлатежноеПоручениеВходящееЗатраты.НоменклатурнаяГруппа) КАК ЗапросБонусы
	|;
	| //////////////////////////////////////////////////////////////////////////////    Запрос новый БОНУСЫ 
    |	ВЫБРАТЬ 
    |  НоменклатурнаяГруппа,
    |  СУММА (СтоимостьОборот) СуммаБонусов
	|  ПОМЕСТИТЬ ЗапросБонусы
    |  ИЗ
    |(
    |ВЫБРАТЬ
    |ЗначенияСвойствОбъектов.Значение НоменклатурнаяГруппа,
    |Продажи.Регистратор ДокументПродажи,
   	|Продажи.СтоимостьОборот
	|
	|ИЗ
	|РегистрНакопления.Продажи.Обороты(&НачДата, &КонДата,Регистратор,Номенклатура.Услуга И Номенклатура=&ОТК) КАК Продажи
	|
	| СОЕДИНЕНИЕ (
	|ВЫБРАТЬ Объект, Свойство, Значение ИЗ
	|РегистрСведений.ЗначенияСвойствОбъектов
	|ГДЕ Свойство = &НоменклатурнаяГруппа
	|)    ЗначенияСвойствОбъектов
	|ПО  Продажи.ДокументПродажи= ЗначенияСвойствОбъектов.Объект ) А
	|СГРУППИРОВАТЬ ПО НоменклатурнаяГруппа
    |
	| ;
	|////////////////////////////////////////////////////////////////////////////////
	|///////////////////////Диски в плюс по желанию Егора (добавляет в диски и убавляет из остальных групп)
	|////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|НоменклатурнаяГруппаПриход НоменклатурнаяГруппа,
	|СУММА(СуммаДокумента)  Сумма
	|    ПОМЕСТИТЬ ТаблицаОбменДискиВПлюс
	|		ИЗ
	|		Документ.ВзаимозачетНоменклатурныеГруппы 
	|	ГДЕ
	|		НЕ Проведен И Не ПометкаУдаления И ВидОперации  =Значение(Перечисление.ВидОбменаМеждуТоварнымиГруппами.ОбменПрибылью)
	|		И НоменклатурнаяГруппаРасход = &ПустаяНоменклатурнаяГруппа 
	|			И Дата МЕЖДУ &НачДата И &КонДата
	|		СГРУППИРОВАТЬ ПО (НоменклатурнаяГруппаПриход)
	|; ///////////////////////////////////////////////
	| ВЫБРАТЬ НоменклатурнаяГруппа, СтоимостьОборот Сумма ПОМЕСТИТЬ ТаблицаНоменклатурныеГруппыВМинус  ИЗ  ЗапросПрибыль 
	| ГДЕ НЕ НоменклатурнаяГруппа В (ВЫБРАТЬ  НоменклатурнаяГруппа ИЗ  ТаблицаОбменДискиВПлюс)
	|;
    | ВЫБРАТЬ СУММА (Сумма) ПОМЕСТИТЬ ТаблицаОбщаяНоменклатурныеГруппыВМинус ИЗ   ТаблицаНоменклатурныеГруппыВМинус                         
	|
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
    | ВЫБРАТЬ СУММА(Сумма) Сумма 
	| ПОМЕСТИТЬ ТаблицаОбщаяСуммаДискиВПлюс
	| ИЗ  ТаблицаОбменДискиВПлюс  
	| ;
	|////////////////////////////////////////////////////////////////////////////////
    |
	|ВЫБРАТЬ       
	|	ТаблицаНоменклатурныеГруппыВМинус.НоменклатурнаяГруппа,
	|	-ТаблицаНоменклатурныеГруппыВМинус.Сумма/ТаблицаОбщаяНоменклатурныеГруппыВМинус.Сумма * ТаблицаОбщаяСуммаДискиВПлюс.Сумма Сумма
	| ПОМЕСТИТЬ ЗапросА
	| ИЗ ТаблицаНоменклатурныеГруппыВМинус  ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаОбщаяНоменклатурныеГруппыВМинус ПО Истина ПОЛНОЕ СОЕДИНЕНИЕ  ТаблицаОбщаяСуммаДискиВПлюс ПО ИСТИНА
    | ОБЪЕДИНИТЬ 
	| ВЫБРАТЬ  НоменклатурнаяГруппа,Сумма ИЗ  ТаблицаОбменДискиВПлюс
	|   ;
	|////////////////////////////////////////////////////////////////////////////////
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ЗатратыОбороты.СуммаОборот КАК ЗатратыОборот
	|ПОМЕСТИТЬ ЗатратыОбороты
	|ИЗ
	|	РегистрНакопления.Затраты.Обороты(
	|			&НачДата,
	|			&КонДата,
	|			,
	|			(НЕ СтатьяЗатрат В ИЕРАРХИИ (&ПроцентыПоКредитам))
	|				И ( НЕ СтатьяЗатрат  В (&списокНалогов))
	|				И НоменклатурнаяГруппа = &ПустаяНоменклатурнаяГруппа
	| И Подразделение НЕ В ИЕРАРХИИ(&Аренда)
	|И НоменклатурнаяГруппа <> &НеУчитывать
    |
	|) КАК ЗатратыОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Оборот,
	|	СУММА(ВЫБОР
	|			КОГДА ПродажиОбороты.ДоговорКонтрагента.Владелец=&Формула2015
	|				ТОГДА ПродажиОбороты.СтоимостьОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОборотФ_Ф,
	|	СУММА(ВЫБОР
	|			КОГДА (НЕ ПродажиОбороты.ДоговорКонтрагента.Владелец=&Формула2015)
	|				ТОГДА ПродажиОбороты.СтоимостьОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОборотБезФ_Ф,
	|	ПродажиОбороты.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	|ПОМЕСТИТЬ ПродажиОбороты
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПродажиОбороты.СтоимостьОборот КАК СтоимостьОборот,
	|		ПродажиОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|		ПродажиОбороты.Номенклатура КАК Номенклатура
	|	ИЗ
	|		РегистрНакопления.Продажи.Обороты(&НачДата, &КонДата, , ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоЗаказам) КАК ПродажиОбороты) КАК ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Номенклатура.НоменклатурнаяГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ПродажиОбороты.ОборотБезФ_Ф) / СУММА(ПродажиОбороты.Оборот) КАК Коэффициент,
	|	СУММА(ПродажиОбороты.ОборотБезФ_Ф) КАК ОборотБезФ_Ф  
	|ПОМЕСТИТЬ КоэффициентБезФ_Ф
	|ИЗ
	|	ПродажиОбороты КАК ПродажиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КоэффициентБезФ_Ф.Коэффициент,
	|	ЗатратыОбороты.ЗатратыОборот,
	|	КоэффициентБезФ_Ф.Коэффициент * ЗатратыОбороты.ЗатратыОборот КАК СуммаЗатратКРаспределению,
	|	КоэффициентБезФ_Ф.ОборотБезФ_Ф
	|ПОМЕСТИТЬ ВсеПоказателиДляУчетаЗатрат
	|ИЗ
	|	КоэффициентБезФ_Ф КАК КоэффициентБезФ_Ф
	|		ПОЛНОЕ СОЕДИНЕНИЕ ЗатратыОбороты КАК ЗатратыОбороты
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗатратыРаспределенные.НоменклатурнаяГруппа,
	|	ЗатратыРаспределенные.СуммаЗатрат
	|ПОМЕСТИТЬ ЗатратыРаспределенные
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПродажиОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|		ПродажиОбороты.ОборотБезФ_Ф КАК ОборотБезФ_Ф,
	|		ВсеПоказателиДляУчетаЗатрат.ОборотБезФ_Ф КАК ОборотБезФ_Ф1,
	|		ВсеПоказателиДляУчетаЗатрат.СуммаЗатратКРаспределению КАК СуммаЗатратКРаспределению,
	|		ВЫРАЗИТЬ(ВсеПоказателиДляУчетаЗатрат.СуммаЗатратКРаспределению * ПродажиОбороты.ОборотБезФ_Ф / ВсеПоказателиДляУчетаЗатрат.ОборотБезФ_Ф КАК ЧИСЛО(15, 2)) КАК СуммаЗатрат
	|	ИЗ
	|		ПродажиОбороты КАК ПродажиОбороты
	|			ПОЛНОЕ СОЕДИНЕНИЕ ВсеПоказателиДляУчетаЗатрат КАК ВсеПоказателиДляУчетаЗатрат
	|			ПО (ИСТИНА)) КАК ЗатратыРаспределенные
	|;
	|///////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ -Сумма(Сумма)  Сумма
	| ПОМЕСТИТЬ НДСКЗачету ИЗ
	|(	
	|/// Исходящий НДС Услуги
	|
	|ВЫБРАТЬ
	|СУММА(СуммаНДС) Сумма  
	|ИЗ  Документ.РеализацияТоваровУслуг.Услуги
	|ГДЕ  	Ссылка.Дата МЕЖДУ &НачДата И &КонДата И Ссылка.Проведен	И Ссылка.ОтражатьВБухгалтерскомУчете  И Номенклатура.НоменклатурнаяГруппа <>&НеУчитывать
	|СГРУППИРОВАТЬ ПО Номенклатура.НоменклатурнаяГруппа
	|ОБЪЕДИНИТЬ
	|/// Входящий НДС Услуги
	|ВЫБРАТЬ 	-СУММА (СуммаНДС)   Сумма
	|ИЗ  	Документ.ПоступлениеТоваровУслуг.Услуги 
	|ГДЕ  	Ссылка.Дата МЕЖДУ &НачДата И &КонДата   И Ссылка.Проведен 	И Ссылка.ОтражатьВБухгалтерскомУчете    И Номенклатура.НоменклатурнаяГруппа <>&НеУчитывать
	|СГРУППИРОВАТЬ ПО Номенклатура.НоменклатурнаяГруппа
	|) А 
    |;
	|////////////////////////////////////////////////////////////////////////////////
	|   ВЫБРАТЬ		ЗапросПрибыль.НоменклатурнаяГруппа, ВЫРАЗИТЬ (НДСКЗачету.Сумма *ЗапросПрибыль.ВаловаяПрибыль / ОбщаяПрибыльБезФ_Ф.Сумма КАК ЧИСЛО(15,2)) Сумма ПОМЕСТИТЬ НДСКЗачетуРаспределенный
    |    ИЗ ЗапросПрибыль		ПОЛНОЕ СОЕДИНЕНИЕ НДСКЗачету КАК НДСКЗачету		ПО (ИСТИНА)
	|  ПОЛНОЕ СОЕДИНЕНИЕ ОбщаяПрибыльБезФ_Ф КАК ОбщаяПрибыльБезФ_Ф	ПО (ИСТИНА)
	|      ;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗатратыПрямые.НоменклатурнаяГруппа,
	|	ЗатратыПрямые.СуммаОборот КАК ЗатратыОборот
	|ПОМЕСТИТЬ ЗатратыПрямые
	|ИЗ
	|	РегистрНакопления.Затраты.Обороты(
	|			&НачДата,
	|			&КонДата,
	|			,
	|			(НЕ СтатьяЗатрат В ИЕРАРХИИ (&ПроцентыПоКредитам))
	|				И (НЕ СтатьяЗатрат В (&списокНалогов))
	|				И НоменклатурнаяГруппа <> &ПустаяНоменклатурнаяГруппа
	|				И НоменклатурнаяГруппа <> &НеУчитывать
	|	И Подразделение НЕ В ИЕРАРХИИ(&Аренда)) КАК ЗатратыПрямые
	|;
	|ВЫБРАТЬ
	|НоменклатурнаяГруппа, 	СУММА(УвеличениеДолгаКонтрагентаУпр-УменьшениеДолгаКонтрагентаУпр) СуммаУпр
	| ПОМЕСТИТЬ КорректировкаДолгаПоТГ
	|ИЗ  Документ.КорректировкаДолга.СуммыДолга 
	|ГДЕ 	Ссылка.Дата МЕЖДУ &НачДата И &КонДата И Ссылка.Проведен 
	|И  НоменклатурнаяГруппа<>&ПустаяНоменклатурнаяГруппа
	|	СГРУППИРОВАТЬ ПО   НоменклатурнаяГруппа
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДТГ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ДТГ.СуммаПроцентовЗаДТГ КАК СуммаПроцентовЗаДТГ
	|ПОМЕСТИТЬ ДТГ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДТГ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|		ДТГ.СредняяСуммаДТГ КАК СредняяСуммаДТГ,
	|		ВЫРАЗИТЬ(ДТГ.СредняяСуммаДТГ * &БанковскийПроцент / 36500 * РАЗНОСТЬДАТ(&НачДата, &КОнДата, ДЕНЬ) КАК ЧИСЛО(15, 2)) КАК СуммаПроцентовЗаДТГ
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ДеньгиВТоварныхГруппах.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|			СУММА(ДеньгиВТоварныхГруппах.Сумма) КАК СуммаСуммДТГ,
	|			РАЗНОСТЬДАТ(&НачДата, &КОнДата, ДЕНЬ) КАК ЧислоДней,
	|			ВЫРАЗИТЬ(СУММА(ДеньгиВТоварныхГруппах.Сумма) / РАЗНОСТЬДАТ(&НачДата, &КОнДата, ДЕНЬ) КАК ЧИСЛО(15, 2)) КАК СредняяСуммаДТГ
	|		ИЗ
	|			РегистрСведений.ДеньгиВТоварныхГруппах КАК ДеньгиВТоварныхГруппах
	|		ГДЕ
	|			ДеньгиВТоварныхГруппах.Период МЕЖДУ &НачДата И &КОнДата
	|			И НЕ ДеньгиВТоварныхГруппах.НеУчитыватьФ_Ф
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДеньгиВТоварныхГруппах.НоменклатурнаяГруппа) КАК ДТГ) КАК ДТГ
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КомпенсацияЗаДебиторку.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	КомпенсацияЗаДебиторку.СуммаПроцентовЗаДТГ КАК СуммаПроцентовЗаДебиторку
	|	ПОМЕСТИТЬ КомпенсацияЗаДебиторку
	|	ИЗ
	|	(ВЫБРАТЬ
	|		ДТГ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|		ДТГ.СредняяСуммаДТГ КАК СредняяСуммаДТГ,
	|		ВЫРАЗИТЬ(ДТГ.СредняяСуммаДТГ * &БанковскийПроцент / 36500 * РАЗНОСТЬДАТ(&НачДата, &КОнДата, ДЕНЬ) КАК ЧИСЛО(15, 2)) КАК СуммаПроцентовЗаДТГ
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ДеньгиВТоварныхГруппах.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|			СУММА(ДеньгиВТоварныхГруппах.Сумма) КАК СуммаСуммДТГ,
	|			РАЗНОСТЬДАТ(&НачДата, &КОнДата, ДЕНЬ) КАК ЧислоДней,
	|			ВЫРАЗИТЬ(СУММА(ДеньгиВТоварныхГруппах.Сумма) / РАЗНОСТЬДАТ(&НачДата, &КОнДата, ДЕНЬ) КАК ЧИСЛО(15, 2)) КАК СредняяСуммаДТГ
	|		ИЗ
	|			РегистрСведений.ДеньгиВТоварныхГруппах КАК ДеньгиВТоварныхГруппах
	|		ГДЕ
	|			ДеньгиВТоварныхГруппах.Период МЕЖДУ &НачДата И &КОнДата
	|			И ДеньгиВТоварныхГруппах.НеУчитыватьФ_Ф
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДеньгиВТоварныхГруппах.НоменклатурнаяГруппа) КАК ДТГ) КАК КомпенсацияЗаДебиторку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
    |
	| ВЫБРАТЬ
	|РАЗНОСТЬДАТ(НачалоПериодаДействия,КонецПериодаДействия,ДЕНЬ)*&БанковскийПроцент/36500*СуммаДокумента СуммаПроцентовВзаимозачет,
 	|НоменклатурнаяГруппаПриход,
	|НоменклатурнаяГруппаРасход,
	|СуммаДокумента
	|ПОМЕСТИТЬ ВЗАИМОЗАЧЕТЫ_ТГ
	|ИЗ
 	|(ВЫБРАТЬ
	|ВЫБОР КОГДА ДатаНачала>=&НачДата ТОГДА ДатаНачала ИНАЧЕ &НачДата КОНЕЦ НачалоПериодаДействия,
	|ВЫБОР КОГДА ДатаОкончания<НачалоПериода(&КонДата,ДЕНЬ) ТОГДА ДатаОкончания ИНАЧЕ НачалоПериода(&КонДата,ДЕНЬ) КОНЕЦ КонецПериодаДействия,
	|//ДатаОкончания,
	|НоменклатурнаяГруппаПриход,
	|НоменклатурнаяГруппаРасход,
	|СуммаДокумента
	|ИЗ 	Документ.ВзаимозачетНоменклатурныеГруппы 
	|ГДЕ	Проведен И ВидОперации=Значение(Перечисление.ВидОбменаМеждуТоварнымиГруппами.ОбменТоварами) 
	|  И ДатаНачала>=&НачДата И ДатаОкончания<КонецПериода(&КонДата,ДЕНЬ)
	|)А
	|;
	|
	|// Обмен прибылью
	|
	|ВЫБРАТЬ НоменклатурнаяГруппа,
	|Сумма 
	|ПОМЕСТИТЬ ВТ_ОбменПрибылью
	|ИЗ
	|(ВЫБРАТЬ
	|НоменклатурнаяГруппаПриход НоменклатурнаяГруппа,
	|СУММА(СуммаДокумента) Сумма
	|ИЗ 	Документ.ВзаимозачетНоменклатурныеГруппы 
	|ГДЕ	Проведен И ВидОперации=Значение(Перечисление.ВидОбменаМеждуТоварнымиГруппами.ОбменПрибылью)
	| И ДатаНачала>=&НачДата И ДатаОкончания<КонецПериода(&КонДата,ДЕНЬ)
	| СГРУППИРОВАТЬ ПО НоменклатурнаяГруппаПриход
	|ОБЪЕДИНИТЬ	
	|ВЫБРАТЬ
	|НоменклатурнаяГруппаРасход НоменклатурнаяГруппа,
	|-СУММА(СуммаДокумента) Сумма
	|ИЗ 	Документ.ВзаимозачетНоменклатурныеГруппы 
	|ГДЕ	Проведен И ВидОперации=Значение(Перечисление.ВидОбменаМеждуТоварнымиГруппами.ОбменПрибылью)
	| И ДатаНачала>=&НачДата И ДатаОкончания<КонецПериода(&КонДата,ДЕНЬ)
	| СГРУППИРОВАТЬ ПО НоменклатурнаяГруппаРасход  ) А
    |
    |
	|;
    |
    |
	|ВЫБРАТЬ
	|Б.НоменклатурнаяГруппа,
	|СУММА(ПроцентПоОбменамМеждуТГ) ПроцентПоОбменамМеждуТГ
	| ПОМЕСТИТЬ  ЗАПРОСВзаимозачеты
	|ИЗ
	|(ВЫБРАТЬ
	|-СуммаПроцентовВзаимозачет ПроцентПоОбменамМеждуТГ,
	|НоменклатурнаяГруппаПриход НоменклатурнаяГруппа
	|ИЗ
	|ВЗАИМОЗАЧЕТЫ_ТГ
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ СуммаПроцентовВзаимозачет ПроцентПоОбменамМеждуТГ,
	|НоменклатурнаяГруппаРасход НоменклатурнаяГруппа
	|ИЗ
	|ВЗАИМОЗАЧЕТЫ_ТГ ) Б
	|СГРУППИРОВАТЬ ПО Б.НоменклатурнаяГруппа
    |
	|;
	| //////////////////////////////////////////////////////////////////////////////
	|/////////////////////// Курсовые разницы 1 запрос
     |
|ВЫБРАТЬ
| ВзаиморасчетыСКонтрагентамиОбороты.ДоговорКонтрагента.Владелец,
| ВзаиморасчетыСКонтрагентамиОбороты.Сделка,
| СУММА(ВзаиморасчетыСКонтрагентамиОбороты.СуммаВзаиморасчетовРасход) КАК СуммаВзаиморасчетовРасход,
| СУММА(ВзаиморасчетыСКонтрагентамиОбороты.СуммаУпрРасход) КАК СуммаУпрРасход
|ПОМЕСТИТЬ ВТ
|ИЗ
| РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(&НачДата, &КонДата, Регистратор, ) КАК ВзаиморасчетыСКонтрагентамиОбороты
|ГДЕ
| ВзаиморасчетыСКонтрагентамиОбороты.СуммаВзаиморасчетовРасход = 0
|СГРУППИРОВАТЬ ПО
| ВзаиморасчетыСКонтрагентамиОбороты.ДоговорКонтрагента.Владелец,
| ВзаиморасчетыСКонтрагентамиОбороты.Сделка
|;
|
|/////////////////////// Курсовые разницы 2 запрос
|ВЫБРАТЬ
| ЗаказПоставщикуТовары.Номенклатура.НоменклатурнаяГруппа НоменклатурнаяГруппа,
| СУММА(ВЫБОР
|   КОГДА ЗаказПоставщикуТовары.Ссылка.СуммаВключаетНДС
|    ТОГДА ЗаказПоставщикуТовары.Сумма
|   ИНАЧЕ ЗаказПоставщикуТовары.Сумма + ЗаказПоставщикуТовары.СуммаНДС
|  КОНЕЦ) КАК Сумма,
| ЗаказПоставщикуТовары.Ссылка.СуммаДокумента,
| ЗаказПоставщикуТовары.Ссылка
|ПОМЕСТИТЬ ЗаказысНомГруппами
|ИЗ
| ВТ КАК ВТ
|  ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
|  ПО ВТ.Сделка = ЗаказПоставщикуТовары.Ссылка
|
|СГРУППИРОВАТЬ ПО
| ЗаказПоставщикуТовары.Номенклатура.НоменклатурнаяГруппа,
| ЗаказПоставщикуТовары.Ссылка.СуммаДокумента,
| ЗаказПоставщикуТовары.Ссылка
|;
|
|
|///////////////////////      Курсовые разницы весь запрос
|ВЫБРАТЬ РАЗЛИЧНЫЕ
| ЗаказысНомГруппами.НоменклатурнаяГруппа,
| -СУММА(ВЫБОР
|   КОГДА ЗаказысНомГруппами.СуммаДокумента = 0
|    ТОГДА 0
|   ИНАЧЕ ВЫРАЗИТЬ(ВТ.СуммаУпрРасход * (ЗаказысНомГруппами.Сумма / ЗаказысНомГруппами.СуммаДокумента) КАК ЧИСЛО(15, 2))
|  КОНЕЦ) КАК Сумма
| ПОМЕСТИТЬ ЗапросКурсовыеРазницы
|ИЗ
| ВТ КАК ВТ
|  ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаказысНомГруппами КАК ЗаказысНомГруппами
|  ПО ВТ.Сделка = ЗаказысНомГруппами.Ссылка
|
|СГРУППИРОВАТЬ ПО ЗаказысНомГруппами.НоменклатурнаяГруппа
|;
| ////////////////////////////////////////////////////// Оприходования и списания
| ВЫБРАТЬ   НоменклатурнаяГруппа, Стоимость
| ПОМЕСТИТЬ ЗапросСписания
| ИЗ
| (
| ВЫБРАТЬ   НоменклатурнаяГруппа, СУММА(Стоимость)
| ИЗ
|(ВЫБРАТЬ
|	ПартииТоваровНаСкладах.Номенклатура.НоменклатурнаяГруппа НоменклатурнаяГруппа,
|	-СУММА(ПартииТоваровНаСкладах.Стоимость) КАК Стоимость
|
|ИЗ
|	РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
|ГДЕ
|	ПартииТоваровНаСкладах.Период МЕЖДУ &НачДата И &КонДата
|	И ПартииТоваровНаСкладах.ВидДвижения = Значение(ВидДвиженияНакопления.Расход)
|	И ПартииТоваровНаСкладах.Регистратор ССЫЛКА Документ.СписаниеТоваров
|
|СГРУППИРОВАТЬ ПО
|	ПартииТоваровНаСкладах.Номенклатура.НоменклатурнаяГруппа
|	ОБЪЕДИНИТЬ
|	ВЫБРАТЬ
|	ПартииТоваровНаСкладах.Номенклатура.НоменклатурнаяГруппа НоменклатурнаяГруппа,
|	СУММА(ПартииТоваровНаСкладах.Стоимость) КАК Стоимость
|
|ИЗ
|	РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
|ГДЕ
|	ПартииТоваровНаСкладах.Период МЕЖДУ &НачДата И &КонДата
|	И ПартииТоваровНаСкладах.ВидДвижения = Значение(ВидДвиженияНакопления.Приход)
|	И ПартииТоваровНаСкладах.Регистратор ССЫЛКА Документ.ОприходованиеТоваров
|
|СГРУППИРОВАТЬ ПО
|	ПартииТоваровНаСкладах.Номенклатура.НоменклатурнаяГруппа ) А 
|	 СГРУППИРОВАТЬ ПО  НоменклатурнаяГруппа
| ) Б
|		
|     ;
| //////////////////////////////////////////////////////////////////////////////   ПОЛНЫЙ ЗАПРОС
	|ВЫБРАТЬ
	|	ЧистаяПрибыль.НоменклатурнаяГруппа.ВидТовара ВидТовара,
	|	ЧистаяПрибыль.НоменклатурнаяГруппа,
	|	ЧистаяПрибыль.СтоимостьОборот,
	|	ЧистаяПрибыль.ВаловаяПрибыль,
	|	ЧистаяПрибыль.СуммаБонусов,
	|	ЧистаяПрибыль.СуммаПрямыхЗатрат,
	|	ЧистаяПрибыль.СуммаРаспределенныхЗатрат,
	|	ЧистаяПрибыль.ПроцентыЗаДТГ,
	|	ЧистаяПрибыль.ПроцентыЗаДебиторку,
	|	ЧистаяПрибыль.ПроцентПоОбменамМеждуТГ,
	|	ЧистаяПрибыль.НДС,
	|	ЧистаяПрибыль.НДСКЗачету,
	|   ЧистаяПрибыль.СуммаОбменПрибылью,
	|   ЧистаяПрибыль.СуммаКурсовыеРазницы,
	|   ЧистаяПрибыль.СуммаСписания,
	|	ЧистаяПрибыль.СуммаДискиВПлюс,
	|	ЧистаяПрибыль.СуммаКорректировок,
	|	ЧистаяПрибыль.ПрибыльДоНалогообложения,
	|	ВЫРАЗИТЬ(ЧистаяПрибыль.ПрибыльДоНалогообложения * 0.2 КАК ЧИСЛО(15, 2)) КАК НалогНаПрибыль,
	|	ВЫРАЗИТЬ(ЧистаяПрибыль.ПрибыльДоНалогообложения * 0.8 КАК ЧИСЛО(15, 2)) КАК ЧистаяПрибыль
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапросПрибыль.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|		ЗапросПрибыль.ВаловаяПрибыль КАК ВаловаяПрибыль,
	|		ЗапросПрибыль.СтоимостьОборот КАК СтоимостьОборот,
	|		ЕСТЬNULL(ЗапросБонусы.СуммаБонусов, 0) КАК СуммаБонусов,
	|	-	ЕСТЬNULL(ЗатратыПрямые.ЗатратыОборот, 0) КАК СуммаПрямыхЗатрат,
	|	-	ВЫРАЗИТЬ(ЕСТЬNULL(ЗатратыРаспределенные.СуммаЗатрат, 0) КАК ЧИСЛО(15, 2)) КАК СуммаРаспределенныхЗатрат,
	|	-	ЕСТЬNULL(ДТГ.СуммаПроцентовЗаДТГ, 0) КАК ПроцентыЗаДТГ,
	|       ЕСТЬNULL(КомпенсацияЗаДебиторку.СуммаПроцентовЗаДебиторку, 0) КАК ПроцентыЗаДебиторку,
	|		ВЫРАЗИТЬ(ЗапросВзаимозачеты.ПроцентПоОбменамМеждуТГ КАК ЧИСЛО (15,2)) ПроцентПоОбменамМеждуТГ,
	|	-	ВЫРАЗИТЬ(ЕСТЬNULL(ЗапросПрибыль.ВаловаяПрибыль, 0) * 18 / 118 КАК ЧИСЛО(15, 2)) КАК НДС,
	|       ЕстьNULL(НДСКЗачетуРаспределенный.Сумма,0) НДСКЗачету,
	|		ЕстьNULL(ОбменПрибылью.Сумма,0) СуммаОбменПрибылью,
	|       ЕстьNULL(КорректировкаДолгаПоТГ.СуммаУпр,0) СуммаКорректировок,
	|		ЕСТЬNULL(ЗапросКурсовыеРазницы.Сумма, 0) КАК СуммаКурсовыеРазницы,
	|		ЕстьNULL(ЗапросСписания.Стоимость,0) СуммаСписания,
	|       ЕстьNULL(ЗапросА.Сумма,0) СуммаДискиВПлюс,
	|		ЗапросПрибыль.ВаловаяПрибыль + ЕСТЬNULL(ЗапросБонусы.СуммаБонусов, 0) - ЕСТЬNULL(ЗатратыРаспределенные.СуммаЗатрат, 0) - ЕСТЬNULL(ЗатратыПрямые.ЗатратыОборот, 0) +  ЕСТЬNULL(ЗапросКурсовыеРазницы.Сумма, 0)  +  ЕСТЬNULL(ЗапросСписания.Стоимость, 0)  +  ЕстьNULL(КорректировкаДолгаПоТГ.СуммаУпр,0)
	|	- ЕСТЬNULL(ДТГ.СуммаПроцентовЗаДТГ, 0) + ЕСТЬNULL(КомпенсацияЗаДебиторку.СуммаПроцентовЗаДебиторку, 0) +ЕстьNULL(ОбменПрибылью.Сумма,0)-ЕСТЬNULL(ЗапросВзаимозачеты.ПроцентПоОбменамМеждуТГ, 0) - ЕСТЬNULL(ЗапросПрибыль.ВаловаяПрибыль, 0) * 18 / 118  + ЕстьNULL(НДСКЗачетуРаспределенный.Сумма,0)   + ЕстьNULL(ЗапросА.Сумма,0)
	|	КАК ПрибыльДоНалогообложения
	|	ИЗ
	|		ЗапросПрибыль КАК ЗапросПрибыль
	|			ЛЕВОЕ СОЕДИНЕНИЕ ЗапросБонусы КАК ЗапросБонусы
	|			ПО ЗапросПрибыль.НоменклатурнаяГруппа = ЗапросБонусы.НоменклатурнаяГруппа
	|			ЛЕВОЕ СОЕДИНЕНИЕ ЗатратыРаспределенные КАК ЗатратыРаспределенные
	|			ПО ЗапросПрибыль.НоменклатурнаяГруппа = ЗатратыРаспределенные.НоменклатурнаяГруппа
	|			ЛЕВОЕ СОЕДИНЕНИЕ ЗатратыПрямые КАК ЗатратыПрямые
	|			ПО ЗапросПрибыль.НоменклатурнаяГруппа = ЗатратыПрямые.НоменклатурнаяГруппа
	|			ЛЕВОЕ СОЕДИНЕНИЕ ДТГ КАК ДТГ
	|			ПО ЗапросПрибыль.НоменклатурнаяГруппа = ДТГ.НоменклатурнаяГруппа
	|           ЛЕВОЕ СОЕДИНЕНИЕ ЗапросВзаимозачеты КАК ЗапросВзаимозачеты
	|			ПО ЗапросПрибыль.НоменклатурнаяГруппа = ЗапросВзаимозачеты.НоменклатурнаяГруппа
	|			ЛЕВОЕ СОЕДИНЕНИЕ КомпенсацияЗаДебиторку КАК КомпенсацияЗаДебиторку
	|			ПО ЗапросПрибыль.НоменклатурнаяГруппа = КомпенсацияЗаДебиторку.НоменклатурнаяГруппа
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбменПрибылью КАК ОбменПрибылью
	|			ПО ЗапросПрибыль.НоменклатурнаяГруппа = ОбменПрибылью.НоменклатурнаяГруппа
	|			ЛЕВОЕ СОЕДИНЕНИЕ ЗапросКурсовыеРазницы КАК ЗапросКурсовыеРазницы
	|			ПО ЗапросПрибыль.НоменклатурнаяГруппа = ЗапросКурсовыеРазницы.НоменклатурнаяГруппа
	|			ЛЕВОЕ СОЕДИНЕНИЕ ЗапросСписания 
	|			ПО ЗапросПрибыль.НоменклатурнаяГруппа = ЗапросСписания.НоменклатурнаяГруппа
	|           ЛЕВОЕ СОЕДИНЕНИЕ НДСКЗачетуРаспределенный 
	|			ПО ЗапросПрибыль.НоменклатурнаяГруппа = НДСКЗачетуРаспределенный.НоменклатурнаяГруппа
	|           ЛЕВОЕ СОЕДИНЕНИЕ КорректировкаДолгаПоТГ 
	|           ПО ЗапросПрибыль.НоменклатурнаяГруппа = КорректировкаДолгаПоТГ.НоменклатурнаяГруппа
	|           ЛЕВОЕ СОЕДИНЕНИЕ ЗапросА
	|			ПО ЗапросПрибыль.НоменклатурнаяГруппа = ЗапросА.НоменклатурнаяГруппа
	|) КАК ЧистаяПрибыль
	|	ГДЕ (ЧистаяПрибыль.НоменклатурнаяГруппа В (&СписокНоменклатурныеГруппы)  ИЛИ НЕ  &ОтборПоТоварнымГруппам  ) И НЕ НоменклатурнаяГруппа.ВидТовара ЕСТЬ NULL
	|	УПОРЯДОЧИТЬ ПО НоменклатурнаяГруппа.ВидТовара.Порядок ,  ЧистаяПрибыль.НоменклатурнаяГруппа.Наименование
	|   ИТОГИ  СУММА (СтоимостьОборот),
	|   СУММА(ВаловаяПрибыль), СУММА(СуммаБонусов),СУММА(СуммаПрямыхЗатрат),СУММА(СуммаРаспределенныхЗатрат),
	|   СУММА(ПроцентыЗаДТГ), СУММА(ПроцентыЗаДебиторку), СУММА(ПроцентПоОбменамМеждуТГ),СУММА(НДС),СУММА(НДСКЗачету), СУММА(СуммаОбменПрибылью), Сумма(СуммаКорректировок),
	| СУММА(СуммаКурсовыеРазницы), СУММА (СуммаСписания),СУММА (СуммаДискиВПлюс),СУММА(ПрибыльДоНалогообложения),СУММА(НалогНаПрибыль), СУММА(ЧистаяПрибыль)
	|   ПО ОБЩИЕ, ВидТовара";

	
	Запрос.УстановитьПараметр("НачДата",НачДата);
	Запрос.УстановитьПараметр("КонДата",КонецДня(КонДата));
	Запрос.УстановитьПараметр("ПустаяНоменклатурнаяГруппа",Справочники.НоменклатурныеГруппы.ПустаяСсылка());
	Запрос.УстановитьПараметр("НеУчитывать",Справочники.НоменклатурныеГруппы.НеУчитывать);
	Запрос.УстановитьПараметр("Аренда",Справочники.Подразделения.Аренда);
	Запрос.УстановитьПараметр("НоменклатурнаяГруппа",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90209"));
	Запрос.УстановитьПараметр("ОТК",Справочники.Номенклатура.НайтиПоКоду("ЛН02398"));    // Бонусы
	Запрос.УстановитьПараметр("Формула2015",Справочники.Контрагенты.НайтиПоКоду("93980  "));
	
	Запрос.УстановитьПараметр("СписокНоменклатурныеГруппы",ТоварныеГруппы);
	Запрос.УстановитьПараметр("ОтборПоТоварнымГруппам",ОтборПоТоварнымГруппам);
	
	
	
	массивНалогов= Новый Массив ();
	НалогНаПрибыльГор=Справочники.СтатьиЗатрат.НайтиПоКоду("О0175");
	НалогНаПрибыльОбл=Справочники.СтатьиЗатрат.НайтиПоКоду("О0172");
	НалогНаПрибыльФед=Справочники.СтатьиЗатрат.НайтиПоКоду("О0174");
	НалогНДС=Справочники.СтатьиЗатрат.НайтиПоКоду("О0177");
	массивНалогов.Добавить(НалогНаПрибыльГор);
	массивНалогов.Добавить(НалогНаПрибыльОбл);
	массивНалогов.Добавить(НалогНаПрибыльФед);
	массивНалогов.Добавить(НалогНДС);
	
	Запрос.УстановитьПараметр("списокНалогов",массивНалогов);
	Запрос.УстановитьПараметр("ПоЗаказам",Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам);
	Запрос.УстановитьПараметр("ПроцентыПоКредитам",Справочники.СтатьиЗатрат.ПроцентыПоКредитамИЗаймам);
	Запрос.УстановитьПараметр("ПрочееПоступлениеДС",Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств);
	Запрос.УстановитьПараметр("БанковскийПроцент",БанковскийПроцент);
	
	Результат = Запрос.Выполнить();

	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ПредставлениеПериода=ПредставлениеПериода(НачДата,КонецДня(КонДата),"ФП=Истина"); 
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	ОбластьВидТовара=Макет.ПолучитьОбласть("ОбластьВидТовара");

	ТабДок.Очистить();
	      ТабДок.ФиксацияСверху=6;
		  

	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
 	
	//ВыборкаДетали = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	//
	//Пока ВыборкаДетали.Следующий() Цикл
	//	Если ВыборкаДетали.ТипЗаписи()=ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
	//	ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
	//	ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетали.Уровень());
	//	КонецЕсли;
	//КонецЦикла;
	
		
	ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ВыборкаОбщийИтог.Следующий();		// Общий итог
	ОбластьПодвалТаблицы.Параметры.Заполнить(ВыборкаОбщийИтог);
	ТабДок.Вывести(ОбластьПодвалТаблицы, ВыборкаОбщийИтог.Уровень());

	ВыборкаВидТовара = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаВидТовара.Следующий() Цикл
		ОбластьВидТовара.Параметры.Заполнить(ВыборкаВидТовара);
		ТабДок.Вывести(ОбластьВидТовара, ВыборкаВидТовара.Уровень());

		ВыборкаДетали = ВыборкаВидТовара.Выбрать(ОбходРезультатаЗапроса.Прямой);

		Пока ВыборкаДетали.Следующий() Цикл
		Если ВыборкаДетали.ТипЗаписи()=ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетали.Уровень());
		КонецЕсли;
	КонецЦикла;

	КонецЦикла;



//	ВыборкаИтого = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

//	ВыборкаИтого.Следующий();		// Общий итог
//	ОбластьПодвалТаблицы.Параметры.Заполнить(ВыборкаИтого);
	//ТабДок.Вывести(ОбластьПодвалТаблицы);

	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.ФиксацияСлева=2;
	//ТабДок.НачатьАвтогруппировкуСтрок();

	//ВыборкаНоменклатура = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	//Пока ВыборкаНоменклатура.Следующий() Цикл
	//	ОбластьНоменклатура.Параметры.Заполнить(ВыборкаНоменклатура);
	//	ТабДок.Вывести(ОбластьНоменклатура, ВыборкаНоменклатура.Уровень());

	//	ВыборкаДокументПродажи = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	//	Пока ВыборкаДокументПродажи.Следующий() Цикл
	//		ОбластьДокументПродажи.Параметры.Заполнить(ВыборкаДокументПродажи);
	//		ТабДок.Вывести(ОбластьДокументПродажи, ВыборкаДокументПродажи.Уровень());
	//	КонецЦикла;
	//КонецЦикла;

	//ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
//	ТабДок.Вывести(ОбластьПодвалТаблицы);
//	ТабДок.Вывести(ОбластьПодвал);

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.УстановитьПериод(НачДата, ?(КонДата='0001-01-01', КонДата, КонецДня(КонДата)));
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	Если НастройкаПериода.Редактировать() Тогда
		НачДата = НастройкаПериода.ПолучитьДатуНачала();
		КонДата = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

Процедура ОтборПоТоварнымГруппамПриИзменении(Элемент)
	
	ЭлементыФормы.КоманднаяПанельВремяПубликации.Видимость=ОтборПоТоварнымГруппам ;
	ЭлементыФормы.ТабличноеПолеТоварныеГруппы.Видимость=ОтборПоТоварнымГруппам   ;
	Если НЕ ОтборПоТоварнымГруппам Тогда
		ЭлементыФормы.Панель1.Высота=46;
	ЭлементыФормы.ПолеТабличногоДокумента.Верх=50;
	Иначе
	ЭлементыФормы.Панель1.Высота=171;
	ЭлементыФормы.ПолеТабличногоДокумента.Верх=213;
	КонецЕсли;
КонецПроцедуры

Процедура ПриОткрытии()
	ЭлементыФормы.Панель1.Высота=46;

КонецПроцедуры


Процедура КоманднаяПанельВремяПубликацииДействие(Кнопка)
	ФормаПодбора=Справочники.НоменклатурныеГруппы.ПолучитьФорму("ФормаСписка",ЭтаФорма);
	ФормаПодбора.РежимВыбора=Истина;
	ФормаПодбора.ЗакрыватьПриВыборе=Ложь;
	ФормаПодбора.ОткрытьМодально();
	
КонецПроцедуры

Процедура ОбработкаВыбора(ЗначениеВыбора, Источник)
	ТоварныеГруппы.Добавить(ЗначениеВыбора);

КонецПроцедуры

Процедура КоманднаяПанельВремяПубликацииДействиеКама(Кнопка)
	ТоварныеГруппы.Очистить();
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ Ссылка
	 |ИЗ Справочник.НоменклатурныеГруппы 
	 |ГДЕ	Наименование ПОДОБНО ""%Кама%""
	 |  ИЛИ Наименование ПОДОБНО ""%Viatti%""";
	 Выборка=Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		ТоварныеГруппы.Добавить(Выборка.Ссылка); 
	 КонецЦикла;	 
	
КонецПроцедуры
