
функция СлучайныйНабор(КолСимв = 6) Экспорт
	
	//начЧисло = 534523512;
	рез = "";
	ГСЧ = Новый ГенераторСлучайныхЧисел;

	для i=1 по КолСимв цикл    //48 - 122 это максимально... но попадаются спецсимволы, скобки и т.п.

		вар = ГСЧ.СлучайноеЧисло(1, 3);
		если Цел(вар)=1 тогда
			рез = рез + Символ( Цел(ГСЧ.СлучайноеЧисло(65, 90)) );		//41-5A  Б буквы латинского алф.
		иначеесли Цел(вар)=2 тогда
			рез = рез + Символ( Цел(ГСЧ.СлучайноеЧисло(97, 122)) );		//61-7A  м буквы латинского алф.
		иначе //Цел(вар)=1 тогда
			рез = рез + Символ( Цел(ГСЧ.СлучайноеЧисло(48, 57)) );		//цифры
		КонецЕсли;
		
	КонецЦикла;
	
	возврат рез;
	
КонецФункции

