функция  Печать() Экспорт
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) тогда
		Возврат неопределено;
	КонецЕсли;	
		
	ТабДок =  Новый ТабличныйДокумент;
	
	ТабДок.ПолеСлева=0;
	ТабДок.ПолеСправа=0;
	ТабДок.ПолеСверху=0;
	ТабДок.ПолеСнизу=0;

 	Макет = ПолучитьМакет("МакетЭтикетка");
    ОбластьСтрока=Макет.ПолучитьОбласть("Строка1|Столбец");
	
	выборка = получитьВсеПараметры(СсылкаНаОбъект);
	ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, выборка);
	 ОбластьСтрока.Параметры.Размер = выборка.Диаметр+"Х"+выборка.Ширина;
	 
	 //------------------ШтрихКод-------------------------------
	 ШтрихКод1 = мПолучитьКодШтрихКода(СсылкаНаОбъект);
	Если ШтрихКод1 ="" тогда
		ШтрихКод=мПолучитьНовыйКодДляШтрихКодаЯШТ(СсылкаНаОбъект.Код);
	иначе
		ШтрихКод= ШтрихКод1;
	КонецЕсли;	
		ОбШтрихКод=ОбластьСтрока.Рисунки.ШК1.Объект;
		ОбШтрихКод.ТипКода = 1; 
		ОбШтрихКод.Сообщение = ШтрихКод; 
		ОбШтрихКод.ОтображатьТекст = Истина;
		ОбШтрихКод.ТекстКода = ШтрихКод; 
 
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();//чтобы началась новая этикетка!			
	ТабДок.Вывести(ОбластьСтрока);
	ТабДок.ТолькоПросмотр = Истина;	
	
	возврат ТабДок;
	
КонецФункции

функция получитьВсеПараметры( Тов1 )
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	Ном.Модель,
	 //размер
	 |	ЕстьNull(Ном.Типоразмер.Диаметр,"""") как Диаметр,
	 |	ЕстьNull(Ном.Типоразмер.Ширина,"""") как Ширина,
	 
	 |	Ном.Типоразмер.PCD как PCD,
	 |	Ном.Типоразмер.КоличествоОтверстий как КолОтв,
	 |	Ном.Типоразмер.Вылет как Вылет,
	 |	Ном.Типоразмер.ДиаметрСтупицы как Ступица,
	 |
	 |	ЕстьNull(ЗначенияСвойствОбъектов.Значение,"""") как Цвет
	 
	 |ИЗ
	 |	Справочник.Номенклатура КАК Ном
	 
	 |		ЛЕВОЕ СОЕДИНЕНИЕ (выбрать свВа.* из РегистрСведений.ЗначенияСвойствОбъектов как свВа
	 |ГДЕ свВа.Объект =  &Тов1
	 |	И свВа.Свойство = &Цвет
	 |)КАК ЗначенияСвойствОбъектов
	 |		ПО Ном.Ссылка = ЗначенияСвойствОбъектов.Объект
	 |  ГДЕ ном.ссылка = &Тов1
	 |";
	 Запрос.УстановитьПараметр("Тов1", Тов1);
	 Запрос.УстановитьПараметр("Цвет", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90166") );
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 Выборка.Следующий();
	 
	 возврат выборка;

КонецФункции

//+++13.05.2015
функция мПолучитьКодШтрихКода( Номенклатура ) Экспорт
	
 запрос = новый Запрос;
 запрос.Текст = "ВЫБРАТЬ
                |	ШК.Код,
                |	ШК.ТипШтрихкода,
                |	ШК.Штрихкод,
                |	ШК.Владелец
	            |ИЗ
                |	РегистрСведений.Штрихкоды КАК ШК
                |ГДЕ
                |	ШК.Владелец = &Номенклатура";
 запрос.Параметры.Вставить("Номенклатура", Номенклатура);
 рез = запрос.Выполнить().Выбрать();
 
 если рез.Следующий() тогда
	 ШК = строка(рез.Штрихкод);
 иначе 
	 ШК = ""; //ПолучитьНовыйКодДляШтрихКодаЯШТ(КодТов);
 КонецЕсли;
 
 возврат ШК;
	 
конецФункции

функция мПолучитьНовыйКодДляШтрихКодаЯШТ(Код) Экспорт

Если стрДлина(Код)<7 тогда
	попытка	
	код1 = Формат(число(Код), "ЧЦ=7; ЧВН=; ЧГ=0");
	исключение
		код1 = "55"+Формат(число(прав(Код,5)), "ЧЦ=5; ЧВН=; ЧГ=0");
 		сообщить("Код: "+Код+" - содержит буквы, поэтому штрихКод будет сформирован по коду: "+код1+"!");
	КонецПопытки;
иначе 
	попытка	
	код1 = Формат(число(Код), "ЧЦ=7; ЧВН=; ЧГ=0");
	исключение
		код1 = "55"+Формат(число(прав(Код,5)), "ЧЦ=5; ЧВН=; ЧГ=0");
 		сообщить("Код: "+Код+" - содержит буквы, поэтому штрихКод будет сформирован по коду: "+код1+"!");
	КонецПопытки;
КонецЕсли;	
	
ШтрихКод = "05000"+ Код1;
ШтрихКод = ШтрихКод + КонтрольныйСимволEAN(ШтрихКод, 13);

возврат ШтрихКод;

КонецФункции

