
Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
	
	   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаН");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = (НачПериода);
   
      ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаК");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = КонецДня(КонПериода);


КонецПроцедуры

Процедура ПоставщикПриИзменении(Элемент)
     ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Контрагент");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = Поставщик;
   
   Если поставщик = справочники.Контрагенты.НайтиПоКоду("91735") тогда
     ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Проц1");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = 100;
	   
   иначе
     ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Проц1");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = 25;
	   
   конецЕсли;	   
	   
КонецПроцедуры

Процедура НачПериодаПриИзменении(Элемент)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаН");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = (НачПериода);
КонецПроцедуры

Процедура КонПериодаПриИзменении(Элемент)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаК");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = КонецДня(КонПериода);
КонецПроцедуры

Процедура ПриОткрытии()
	Производители =  Новый СписокЗначений;
	Производители.Добавить(Справочники.Производители.НайтиПоКоду("3485"));   //megami
	Производители.Добавить(Справочники.Производители.НайтиПоКоду("3291"));   //CROSSSTREET
	     ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Производители");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = Производители;

КонецПроцедуры
