
Процедура Отчет(ТабДок, ВыбДата) Экспорт
	
	Макет = ЭтотОбъект.ПолучитьМакет("Отчет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Документ.Ссылка,
	|	Документ.Ссылка.Контрагент КАК Контрагент,
	|   Документ.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	Документ.Ссылка.Ответственный КАК Ответственный
	|ИЗ
	|	Документ." + ЭлементыФормы.ТипДокумента.Значение + ".Товары КАК Документ
	|ГДЕ
	|	Документ.Цена < &Цена
	|	И Документ.Ссылка.Дата > &ВыбДата
	|	И Документ.Ссылка.Проведен = ИСТИНА
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Ссылка.Дата";

	Запрос.УстановитьПараметр("ВыбДата", НачалоДня(ВыбДата));
	Запрос.УстановитьПараметр("Цена", ЦенаНеМеньше);
	
	Результат = Запрос.Выполнить();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаДетали = Результат.Выбрать();

	Пока ВыборкаДетали.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетали.Уровень());
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

КонецПроцедуры

Процедура ОсновныеДействияФормыОсновныеДействияФормыВыполнить(Кнопка)
	
	ТабДок = ЭлементыФормы.ПолеТабличногоДокумента;
	Отчет(ТабДок, ВыбДата);

КонецПроцедуры

СписокДоков = Новый СписокЗначений;

СписокДоков.Очистить();
СписокДоков.Добавить("РеализацияТоваровУслуг", "Реализация товаров и услуг");
СписокДоков.Добавить("ПоступлениеТоваровУслуг", "Поступление товаров и услуг");
СписокДоков.Добавить("ВозвратТоваровОтПокупателя", "Возврат товаров от покупателя");
СписокДоков.Добавить("ВозвратТоваровПоставщику", "Возврат товаров поставщику");
СписокДоков.Добавить("ЗаказПокупателя", "Заказы покупателей");
СписокДоков.Добавить("ЗаказПоставщику", "Заказы поставщикам");


ЭлементыФормы.ТипДокумента.СписокВыбора = СписокДоков;     

ЭлементыФормы.ТипДокумента.Значение = ЭлементыФормы.ТипДокумента.СписокВыбора.НайтиПоЗначению("РеализацияТоваровУслуг").Значение;

ВыбДата = Дата('20060729');
ЦенаНеМеньше = 10;

