
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Удалим все записи, которые есть в регистре запрещенных товаров по выбранным НГ
	Для каждого НГ из СписокНоменклатурныхГрупп цикл
		НаборЗаписей = РегистрыСведений.ЗапрещенныеТипоРазмеры.СоздатьНаборЗаписей();
	    НаборЗаписей.Отбор.НоменклатурнаяГруппа.Установить(НГ.Значение);
	    НаборЗаписей.Записать(); 
	КонецЦикла;
	
	Для Каждого Стр из Группы Цикл
		Если Стр.Запрещен  Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Типоразмер = Стр.Типоразмер;
			НоваяЗапись.НоменклатурнаяГруппа = Стр.НоменклатурнаяГруппа;
			НоваяЗапись.ПроцентПродаж = Стр.ПроцентПродажи;
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

Процедура КоманднаяПанель1ЗаолнитьТипоразмеры(Кнопка)
	Группы.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.Номенклатура.Типоразмер КАК Типоразмер,
	|	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот,
	|	ПродажиОбороты.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачДата, &КонДата, , Номенклатура.НоменклатурнаяГруппа В (&СписокНомГрупп)) КАК ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Номенклатура.Типоразмер,
	|	ПродажиОбороты.Номенклатура.НоменклатурнаяГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоОборот УБЫВ,
	|	ПродажиОбороты.Номенклатура.Типоразмер.Код
	|ИТОГИ
	|	СУММА(КоличествоОборот)
	|ПО
	|	ОБЩИЕ";
	Запрос.УстановитьПараметр("СписокНомГрупп",СписокНоменклатурныхГрупп);
	Запрос.УстановитьПараметр("НачДата",НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("КонДата",КонецДня(КонПериода));
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока Выборка.Следующий() Цикл
		ОбщееКоличествоПроданного = Выборка.КоличествоОборот;
		ЭлементыФормы.ИтогоПродано.Заголовок = "Всего продаж: " + ОбщееКоличествоПроданного + " шт.";
		ВыборкаДетали = Выборка.Выбрать();
		ИтогоПроцент = 0;
		Пока ВыборкаДетали.Следующий() Цикл
			НовСтрока = Группы.Добавить();
			НовСтрока.НоменклатурнаяГруппа = ВыборкаДетали.НоменклатурнаяГруппа;						
			НовСтрока.Типоразмер = ВыборкаДетали.Типоразмер;
			НовСтрока.КоличествоПродано = ВыборкаДетали.КоличествоОборот;
			НовСтрока.ПроцентПродажи = ВыборкаДетали.КоличествоОборот*100/ОбщееКоличествоПроданного;
			ИтогоПроцент =  ИтогоПроцент + НовСтрока.ПроцентПродажи;
			Если ИтогоПроцент > ПроцентОграничения Тогда
				НовСтрока.Запрещен = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ГруппыПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если ДанныеСтроки.Запрещен = Истина Тогда
		ОформлениеСтроки.ЦветФона = WebЦвета.Лосось;
	КонецЕсли;
КонецПроцедуры
