
Процедура ДействияФормыОтчетСформировать(Кнопка)
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	ТабДок = ЭлементыФормы.ПолеТабличногоДокумента;
	Отчет(ТабДок);

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА
КонецПроцедуры

Процедура Отчет(ТабДок) Экспорт
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Макет = ВнешняяОбработкаОбъект.ПолучитьМакет("Отчет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ОтветственноеЛицо.ОсновноеПодразделение КАК Подразделение,
	|	ДоговорыКонтрагентов.Ссылка.ОтветственноеЛицо КАК ОтветственныйМенеджер,
	|	"""" КАК ПереадресоватьМенеджеру,
	|	ДоговорыКонтрагентов.Ссылка.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Ссылка.Номер КАК Номер,
	|	ДоговорыКонтрагентов.Ссылка.Дата КАК ДатаДоговора,
	|	ДоговорыКонтрагентов.Ссылка.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентов.Ссылка.ТипДоговора КАК ТипДоговора,
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток,
	|	Взаиморасчеты.ДатаПоследнейСделки КАК ДатаПоследнейСделкиПоДоговору
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК ВзаиморасчетыСКонтрагентамиОстатки
	|		ПО ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ВзаиморасчетыСКонтрагентами.Регистратор.Дата) КАК ДатаПоследнейСделки,
	|			ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента КАК ДоговорКонтрагента
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыСКонтрагентами КАК ВзаиморасчетыСКонтрагентами
	|		ГДЕ
	|			(НЕ ВзаиморасчетыСКонтрагентами.Регистратор ССЫЛКА Документ.Взаимозачет)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента) КАК Взаиморасчеты
	|		ПО ДоговорыКонтрагентов.Ссылка = Взаиморасчеты.ДоговорКонтрагента
	|ГДЕ
	|	(НЕ ДоговорыКонтрагентов.ПометкаУдаления)
	|	И (НЕ ДоговорыКонтрагентов.Ссылка.Владелец В ИЕРАРХИИ (&Дубли))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорыКонтрагентов.ОтветственноеЛицо.ОсновноеПодразделение.Наименование,
	|	ДоговорыКонтрагентов.Ссылка.ОтветственноеЛицо.Наименование,
	|	ДоговорыКонтрагентов.Ссылка.Владелец.Наименование";

	Запрос.УстановитьПараметр("Дубли", Справочники.Контрагенты.НайтиПоКоду("90213"));
	
	Результат = Запрос.Выполнить();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	ОбластьПодразделение = Макет.ПолучитьОбласть("ДанныеПодразделения");
	ОбластьМенеджера = Макет.ПолучитьОбласть("ДанныеМенеджера");

	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаДетали = Результат.Выбрать();
	Пока ВыборкаДетали.СледующийПоЗначениюПоля("Подразделение") Цикл
		
		
		Пока ВыборкаДетали.СледующийПоЗначениюПоля("ОтветственныйМенеджер") Цикл
			
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			ОбластьПодразделение = Макет.ПолучитьОбласть("ДанныеПодразделения");
			
			ОбластьПодразделение.Параметры.Подразделение=ВыборкаДетали.Подразделение;
			ТабДок.Вывести(ОбластьПодразделение);
			ОбластьМенеджера = Макет.ПолучитьОбласть("ДанныеМенеджера");
			ОбластьМенеджера.Параметры.Менеджер=ВыборкаДетали.ОтветственныйМенеджер;
			
		
			ТабДок.Вывести(ОбластьМенеджера);
			ТабДок.Вывести(ОбластьШапкаТаблицы);
			Пока ВыборкаДетали.Следующий() Цикл
				ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
				ОбластьДетальныхЗаписей.Параметры.ДатаДоговора=Формат(ВыборкаДетали.ДатаДоговора, "ДФ=dd.MM.yyyy");
				//ОбластьДетальныхЗаписей.Параметры.ДатаПоследнейСделкиПоДоговору=Формат(ВыборкаДетали.ДатаПоследнейСделкиПоДоговору, "ДФ=dd.MM.yyyy");
				ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетали.Уровень());
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ
КонецПроцедуры
