
Процедура ДействияФормыДействие(Кнопка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СезонныйАссортиментЭкспорт.Номенклатура
	               |ИЗ
	               |	РегистрСведений.СезонныйАссортиментЭкспорт КАК СезонныйАссортиментЭкспорт
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СезонныйАссортимент.Номенклатура
	               |ИЗ
	               |	РегистрСведений.СезонныйАссортимент КАК СезонныйАссортимент";
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	табЗнач1  = ОбменСУТИнтернетМагазин.ПолучитьЦеныДляКонтрагента_РегСвЭкспорт(Справочники.Контрагенты.НайтиПоКоду("11031"), РезультатЗапроса,,,,,БезРаспродажи);
	Если ТипЗнч(табЗнач1) = Тип("Строка") Тогда // нет политики ценообразования!
		сообщить("Ошибка при расчете цены А: " + табЗнач1, СтатусСообщения.Внимание); 
		Возврат;
	КонецЕсли;
	
	//ТабЦенА = табЗнач1.Скопировать(,"Номенклатура, ЦенаПоТипуЦен");
	ТабЦенА = табЗнач1.Скопировать(,"Номенклатура, МинимальнаяЦена,Приоритет");
		
	Настройки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ВнешнийНаборДанных = Новый Структура("ТабЦенА", ТабЦенА);
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);	
	
	ЭлементыФормы.Результат.Очистить();
	ДокументРезультат = ЭлементыФормы.Результат;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
			
КонецПроцедуры
