Процедура ОбновитьПлановыеДатыПлатежей(ДатаН,ДатаК) Экспорт
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗаказПоставщикуПлановыеДопРасходы.Номенклатура,
	             |	ЗаказПоставщикуПлановыеДопРасходы.ДатаПлатежа КАК ДатаПлатежаПлан,
	             |	ЗаказПоставщикуПлановыеДопРасходы.Ссылка.Дата КАК ДатаЗаказа,
	             |	ЗаказПоставщикуПлановыеДопРасходы.Ссылка КАК ЗаказПоставщику,
	             |	ЗаказПоставщикуПлановыеДопРасходы.Ссылка.Контрагент
	             |ПОМЕСТИТЬ втПлановыеДанные
	             |ИЗ
	             |	Документ.ЗаказПоставщику.ПлановыеДопРасходы КАК ЗаказПоставщикуПлановыеДопРасходы
	             |ГДЕ
	             |	ЗаказПоставщикуПлановыеДопРасходы.Ссылка.ВалютаДокумента <> &ВалютаРуб
	             |	И ЗаказПоставщикуПлановыеДопРасходы.Ссылка.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаН, МЕСЯЦ, -6) И &ДатаК
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	втПлановыеДанные.ЗаказПоставщику КАК ЗаказПоставщику,
	             |	ПоступлениеТоваровУслуг.Ссылка КАК Поступление,
	             |	втПлановыеДанные.Номенклатура,
	             |	втПлановыеДанные.ДатаПлатежаПлан,
	             |	втПлановыеДанные.ДатаЗаказа,
	             |	НАЧАЛОПЕРИОДА(ВЫБОР
	             |			КОГДА втПлановыеДанные.Номенклатура = ""FOB""
	             |					И втПлановыеДанные.Контрагент = &Freeman
	             |				ТОГДА ДОБАВИТЬКДАТЕ(втПлановыеДанные.ЗаказПоставщику.Дата, ДЕНЬ, 7)
	             |			КОГДА втПлановыеДанные.Номенклатура = ""FOB""
	             |				ТОГДА ДОБАВИТЬКДАТЕ(втПлановыеДанные.ЗаказПоставщику.Дата, ДЕНЬ, 30)
	             |			КОГДА втПлановыеДанные.Номенклатура = &Фрахт
	             |				ТОГДА ДОБАВИТЬКДАТЕ(ПоступлениеТоваровУслуг.Дата, ДЕНЬ, 60)
	             |			КОГДА втПлановыеДанные.Номенклатура = &Налоги
	             |				ТОГДА ДОБАВИТЬКДАТЕ(втПлановыеДанные.ДатаЗаказа, ДЕНЬ, 30)
	             |			КОГДА втПлановыеДанные.Номенклатура = &Таможня
	             |				ТОГДА ДОБАВИТЬКДАТЕ(втПлановыеДанные.ДатаЗаказа, ДЕНЬ, 30)
	             |			КОГДА втПлановыеДанные.Номенклатура = &Брокерские
	             |				ТОГДА ДОБАВИТЬКДАТЕ(ПоступлениеТоваровУслуг.Дата, ДЕНЬ, 60)
	             |			КОГДА втПлановыеДанные.Номенклатура = &Доставка
	             |				ТОГДА ДОБАВИТЬКДАТЕ(ПоступлениеТоваровУслуг.Дата, ДЕНЬ, 60)
	             |		КОНЕЦ, ДЕНЬ) КАК ДатаНовая
	             |ПОМЕСТИТЬ вт
	             |ИЗ
	             |	втПлановыеДанные КАК втПлановыеДанные
	             |		ПОЛНОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	             |		ПО втПлановыеДанные.ЗаказПоставщику = ПоступлениеТоваровУслуг.Сделка
	             |ГДЕ
	             |	ПоступлениеТоваровУслуг.Дата МЕЖДУ &ДатаН И &ДатаК
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	вт.ЗаказПоставщику КАК ЗаказПоставщику,
	             |	вт.Поступление,
	             |	вт.Номенклатура,
	             |	вт.ДатаПлатежаПлан,
	             |	вт.ДатаЗаказа,
	             |	вт.ДатаНовая
	             |ИЗ
	             |	вт КАК вт
	             |ГДЕ
	             |	вт.ДатаПлатежаПлан <> вт.ДатаНовая
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	вт.ЗаказПоставщику
	             |ИТОГИ ПО
	             |	ЗаказПоставщику
	             |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ВалютаРуб",Справочники.Валюты.НайтиПоКоду("643"));
	Запрос.УстановитьПараметр("ДатаН",ДатаН);
	Запрос.УстановитьПараметр("ДатаК",ДатаК);
	Запрос.УстановитьПараметр("Freeman",Справочники.Контрагенты.НайтиПоКоду("91735"));
	
	Запрос.УстановитьПараметр("Налоги",Справочники.Номенклатура.НайтиПоНаименованию("Таможня, НДС",,Справочники.Номенклатура.НайтиПоКоду("ЛН00001")));
	Запрос.УстановитьПараметр("Фрахт",Справочники.Номенклатура.НайтиПоНаименованию("Фрахт",,Справочники.Номенклатура.НайтиПоКоду("ЛН00001")));
	Запрос.УстановитьПараметр("Таможня",Справочники.Номенклатура.НайтиПоНаименованию("Таможенная пошлина",,Справочники.Номенклатура.НайтиПоКоду("ЛН00001")));
	Запрос.УстановитьПараметр("Брокерские",Справочники.Номенклатура.НайтиПоНаименованию("Брокерские услуги",,Справочники.Номенклатура.НайтиПоКоду("ЛН00001")));
	Запрос.УстановитьПараметр("Доставка",Справочники.Номенклатура.НайтиПоНаименованию("Автодоставка",,Справочники.Номенклатура.НайтиПоКоду("ЛН00001")));
	
	ВыборкаЗаказ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	пока ВыборкаЗаказ.Следующий() Цикл
		ЗаказОб = ВыборкаЗаказ.ЗаказПоставщику.ПолучитьОбъект();
		ТЧДопРасходы = ЗаказОб.ПлановыеДопРасходы;
		ВыборкаДопРасход = ВыборкаЗаказ.Выбрать();
		Пока ВыборкаДопРасход.Следующий() Цикл
			Если ВыборкаДопРасход.ДатаПлатежаПлан<>ВыборкаДопРасход.ДатаНовая тогда
				стр = ТЧДопРасходы.Найти(ВыборкаДопРасход.Номенклатура,"Номенклатура");
				Если стр<>неопределено тогда
					сообщить(""+ЗаказОб+" "+стр.Номенклатура+" "+стр.ДатаПлатежа+">"+ВыборкаДопРасход.ДатаНовая);
					стр.ДатаПлатежа = ВыборкаДопРасход.ДатаНовая;
				КонецЕсли;
			КонецЕсли;
			ЗаказОб.ОбменДанными.Загрузка = истина;
			ЗаказОб.Записать(РежимЗаписиДокумента.Запись);	 
		КонецЦикла;
	КонецЦикла;
	
	////// суммы
	ОбновитьПлановыеСуммыФрахтИТаможня(ДатаН,ДатаК);
КонецПроцедуры

Процедура ОбновитьПлановыеСуммыФрахтИТаможня(ДатаН, ДатаК)
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗаказПоставщикуПлановыеДопРасходы.Номенклатура,
	             |	ЗаказПоставщикуПлановыеДопРасходы.ДатаПлатежа КАК ДатаПлатежаПлан,
	             |	ЗаказПоставщикуПлановыеДопРасходы.Ссылка.Дата КАК ДатаЗаказа,
	             |	ЗаказПоставщикуПлановыеДопРасходы.Ссылка КАК ЗаказПоставщику,
	             |	ЗаказПоставщикуПлановыеДопРасходы.Ссылка.Контрагент,
	             |	ЗаказПоставщикуПлановыеДопРасходы.СуммаВзаиморасчетов,
	             |	ЗаказПоставщикуПлановыеДопРасходы.СуммаУпр
	             |ПОМЕСТИТЬ втПлановыеДанные
	             |ИЗ
	             |	Документ.ЗаказПоставщику.ПлановыеДопРасходы КАК ЗаказПоставщикуПлановыеДопРасходы
	             |ГДЕ
	             |	ЗаказПоставщикуПлановыеДопРасходы.Ссылка.ВалютаДокумента <> &ВалютаРуб
	             |	И ЗаказПоставщикуПлановыеДопРасходы.Ссылка.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаН, МЕСЯЦ, -6) И &ДатаК
	             |	И ЗаказПоставщикуПлановыеДопРасходы.Номенклатура В(&Услуги)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	втПлановыеДанные.ЗаказПоставщику КАК ЗаказПоставщику,
	             |	втПлановыеДанные.Номенклатура,
	             |	втПлановыеДанные.ДатаПлатежаПлан,
	             |	втПлановыеДанные.ДатаЗаказа,
	             |	втПлановыеДанные.СуммаВзаиморасчетов,
	             |	ВложенныйЗапрос.Сумма КАК СуммаПланУточненная,
	             |	втПлановыеДанные.СуммаУпр
	             |ПОМЕСТИТЬ вт
	             |ИЗ
	             |	втПлановыеДанные КАК втПлановыеДанные
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			ПоступлениеДопРасходовТовары.ДокументПартии.Сделка КАК ДокументПартииСделка,
	             |			МАКСИМУМ(ПоступлениеДопРасходовТовары.Ссылка.Сумма) КАК Сумма,
	             |			ПоступлениеДопРасходовТовары.Ссылка.Услуга КАК Услуга
	             |		ИЗ
	             |			Документ.ПоступлениеДопРасходов.Товары КАК ПоступлениеДопРасходовТовары
	             |		ГДЕ
	             |			ПоступлениеДопРасходовТовары.Ссылка.Услуга В(&Услуги)
	             |			И ПоступлениеДопРасходовТовары.ДокументПартии.Сделка В
	             |					(ВЫБРАТЬ
	             |						втПлановыеДанные.ЗаказПоставщику
	             |					ИЗ
	             |						втПлановыеДанные КАК втПлановыеДанные)
	             |			И ПоступлениеДопРасходовТовары.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			ПоступлениеДопРасходовТовары.ДокументПартии.Сделка,
	             |			ПоступлениеДопРасходовТовары.Ссылка.Услуга) КАК ВложенныйЗапрос
	             |		ПО втПлановыеДанные.ЗаказПоставщику = ВложенныйЗапрос.ДокументПартииСделка
	             |			И втПлановыеДанные.Номенклатура = ВложенныйЗапрос.Услуга
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	вт.ЗаказПоставщику КАК ЗаказПоставщику,
	             |	вт.Номенклатура,
	             |	вт.ДатаПлатежаПлан,
	             |	вт.ДатаЗаказа,
	             |	вт.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	             |	вт.СуммаУпр,
	             |	вт.СуммаПланУточненная
	             |ИЗ
	             |	вт КАК вт
	             |ГДЕ
	             |	вт.СуммаПланУточненная <> вт.СуммаУпр
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	вт.ЗаказПоставщику
	             |ИТОГИ ПО
	             |	ЗаказПоставщику
	             |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ВалютаРуб",Справочники.Валюты.НайтиПоКоду("643"));
	Запрос.УстановитьПараметр("ДатаН",ДатаН);
	Запрос.УстановитьПараметр("ДатаК",ДатаК);
	Услуги = новый СписокЗначений;
	Услуги.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Фрахт",,Справочники.Номенклатура.НайтиПоКоду("ЛН00001")));
	Услуги.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Таможенная пошлина",,Справочники.Номенклатура.НайтиПоКоду("ЛН00001")));
	Услуги.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Автодоставка",,Справочники.Номенклатура.НайтиПоКоду("ЛН00001")));
	
	Запрос.УстановитьПараметр("Услуги",Услуги);
	
	ВыборкаЗаказ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	пока ВыборкаЗаказ.Следующий() Цикл
		ЗаказОб = ВыборкаЗаказ.ЗаказПоставщику.ПолучитьОбъект();
		ТЧДопРасходы = ЗаказОб.ПлановыеДопРасходы;
		ВыборкаДопРасход = ВыборкаЗаказ.Выбрать();
		Пока ВыборкаДопРасход.Следующий() Цикл
			Если ВыборкаДопРасход.СуммаПланУточненная<>ВыборкаДопРасход.СуммаУпр тогда
				стр = ТЧДопРасходы.Найти(ВыборкаДопРасход.Номенклатура,"Номенклатура");
				Если стр<>неопределено тогда
					сообщить(""+ЗаказОб+" "+стр.Номенклатура+" "+стр.СуммаУпр+">"+ВыборкаДопРасход.СуммаПланУточненная);
					стр.СуммаУпр = ВыборкаДопРасход.СуммаПланУточненная;
				КонецЕсли;
			КонецЕсли;
			ЗаказОб.ОбменДанными.Загрузка = истина;
			ЗаказОб.Записать(РежимЗаписиДокумента.Запись);	 
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
