перем Категория;
Процедура ПриОткрытии()
ОбновитьСписок();	
КонецПроцедуры
Процедура ОбновитьСписок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КатегорииОбъектов.Объект КАК Контрагент
		|ИЗ
		|	РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
		|ГДЕ
		|	КатегорииОбъектов.Категория = &Категория";
	
	Запрос.УстановитьПараметр("Категория", Категория);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Контрагенты.Загрузить(РезультатЗапроса.Выгрузить());
	
конецПроцедуры	

Процедура КоманднаяПанель1Обновить(Кнопка)
ОбновитьСписок();
КонецПроцедуры

Процедура КонтрагентыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НоваяСтрока и ЭлементыФормы.Контрагенты.ТекущиеДанные.Контрагент<>Справочники.Контрагенты.ПустаяСсылка() Тогда
		//ответ = Вопрос("Установить для контрагента категорию ответчики по судам?",РежимДиалогаВопрос.ДаНет);	
		//Если ответ = КодВозвратаДиалога.Да Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Контрагент",ЭлементыФормы.Контрагенты.ТекущиеДанные.Контрагент);
		ЕстьУже = Контрагенты.НайтиСтроки(Отбор);
		Если ЕстьУже.количество()>1 Тогда
			предупреждение("Контрагент уже есть в списке!");	
			Контрагенты.Удалить(ЭлементыФормы.Контрагенты.ТекущиеДанные);
		иначе
			МенеджерЗаписи = РегистрыСведений.КатегорииОбъектов.СоздатьМенеджерЗаписи(); 
			МенеджерЗаписи.Объект   = ЭлементыФормы.Контрагенты.ТекущиеДанные.Контрагент; 
			МенеджерЗаписи.Категория = Категория; 
			МенеджерЗаписи.Записать(); 
		КонецЕсли;
		//иначе	
		//	Контрагенты.Удалить(ЭлементыФормы.Контрагенты.ТекущиеДанные);
		//конецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Процедура КонтрагентыПередУдалением(Элемент, Отказ)
	//ответ = Вопрос("Удалить контрагента категорию ответчики по судам?",РежимДиалогаВопрос.ДаНет);	
	//Если ответ = КодВозвратаДиалога.Да Тогда
		МенеджерЗаписи = РегистрыСведений.КатегорииОбъектов.СоздатьМенеджерЗаписи(); 
        МенеджерЗаписи.Объект   = ЭлементыФормы.Контрагенты.ТекущиеДанные.Контрагент; 
        МенеджерЗаписи.Категория = Категория; 
        МенеджерЗаписи.Удалить(); 
	//иначе	
	//отказ =Истина;	
	//конецЕсли;	
КонецПроцедуры

Процедура КонтрагентыПередНачаломИзменения(Элемент, Отказ)
	Элемент.Колонки.Контрагент.ЭлементУправления.КнопкаВыбора = Ложь;
КонецПроцедуры

Процедура КонтрагентыПередНачаломДобавления(Элемент, Отказ, Копирование)
	Элемент.Колонки.Контрагент.ЭлементУправления.КнопкаВыбора = Истина;
КонецПроцедуры

Категория =Справочники.КатегорииОбъектов.НайтиПоКоду("00035");	
	