Перем тзМенеджерПомощник;

Процедура Пауза(Сек)
	scr = Новый COMОбъект("WScript.Shell");
	scr.Run("sleep "+СокрЛП(Число(Сек)),0,1);
КонецПроцедуры

Процедура ОповеститьПоПодразделениям(ДатаОповещения = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказыПоставщикамСезонныеОстаткиИОбороты.ЗаказПоставщикуСезонный КАК ЗаказПоставщикуСезонный,
	               |	ВЫБОР
	               |		КОГДА ЗаказыПоставщикамСезонныеОстаткиИОбороты.ЗаказПоставщикуСезонный.Транзит
	               |			ТОГДА ВЫБОР
	               |					КОГДА ЗаказыПоставщикамСезонныеОстаткиИОбороты.ЗаказПоставщикуСезонный.Грузополучатель = &Пустая
	               |						ТОГДА ЗаказыПоставщикамСезонныеОстаткиИОбороты.ЗаказПоставщикуСезонный.Подразделение
	               |					ИНАЧЕ ЗаказыПоставщикамСезонныеОстаткиИОбороты.ЗаказПоставщикуСезонный.Грузополучатель
	               |				КОНЕЦ
	               |		ИНАЧЕ ЗаказыПоставщикамСезонныеОстаткиИОбороты.ЗаказПоставщикуСезонный.Подразделение
	               |	КОНЕЦ КАК Получатель,
	               |	ЗаказыПоставщикамСезонныеОстаткиИОбороты.Номенклатура.Код КАК Код,
	               |	ЗаказыПоставщикамСезонныеОстаткиИОбороты.Номенклатура,
	               |	ЗаказыПоставщикамСезонныеОстаткиИОбороты.КоличествоПриход КАК Заказано,
	               |	ЗаказыПоставщикамСезонныеОстаткиИОбороты.КоличествоРасход КАК Отгружено,
	               |	ЗаказыПоставщикамСезонныеОстаткиИОбороты.КоличествоКонечныйОстаток КАК Остаток
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПоставщикамСезонные.ОстаткиИОбороты(, , , , ЗаказПоставщикуСезонный.ДатаДействияПо = ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&ДатаДействияПо, МЕСЯЦ, -1), ДЕНЬ, 7)) КАК ЗаказыПоставщикамСезонныеОстаткиИОбороты
	               |ГДЕ
	               |	ЗаказыПоставщикамСезонныеОстаткиИОбороты.КоличествоКонечныйОстаток > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаказыПоставщикамСезонныеОстаткиИОбороты.ЗаказПоставщикуСезонный.Транзит,
	               |	ЗаказПоставщикуСезонный
	               |ИТОГИ
	               |	СУММА(Заказано),
	               |	СУММА(Отгружено),
	               |	СУММА(Остаток)
	               |ПО
	               |	ЗаказПоставщикуСезонный
	               |АВТОУПОРЯДОЧИВАНИЕ";
				   
	Запрос.УстановитьПараметр("ДатаДействияПо", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Пустая",Справочники.Контрагенты.ПустаяСсылка());
	
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если Результат.Количество() > 0 Тогда
		
		ТабДок = Новый ТабличныйДокумент;
		Макет = ПолучитьМакет("Макет");
		ОбластьЗаголовок				 			   = Макет.ПолучитьОбласть("Заголовок");
		ОбластьСтрокаГруппировки	 			  	   = Макет.ПолучитьОбласть("СтрокаПодразделение");
		ОбластьСтрока							 	   = Макет.ПолучитьОбласть("СтрокаНоменклатура");
		
		ТабДок.Очистить();
		ТабДок.НачатьАвтогруппировкуСтрок();
		
		ОбластьЗаголовок.Параметры.ДатаДействияПо = Лев(НачалоДня(ТекущаяДата()) + 6*86400,10);
		ТабДок.Вывести(ОбластьЗаголовок);
		
		//ДокСобытие = Документы.Событие.СоздатьДокумент();
		//ДокСобытие.ТипСобытия = Перечисления.ВходящееИсходящееСобытие.Входящее;
		//ДокСобытие.ВидСобытия = Перечисления.ВидыСобытий.Прочее;
		//ДокСобытие.Важность = Перечисления.Важность.Высокая;
		//ДокСобытие.СостояниеСобытия = Перечисления.СостоянияСобытий.Запланировано;
		//ДокСобытие.НапомнитьОСобытии = Истина;
		//ДокСобытие.ВремяНапоминания = НачалоДня(ТекущаяДата())+28830;//8 утра
		//ДокСобытие.Дата = ТекущаяДата();
		//ДокСобытие.НачалоСобытия = НачалоДня(ТекущаяДата())+28800;//8 утра
		//ДокСобытие.ОкончаниеСобытия = КонецДня(ТекущаяДата())+5*24*60*60;//
		//ДокСобытие.ОписаниеСобытия = "Истекает срок действия по сезонным заказам поставщикам.";
		ТекстСообщения = "";
				
		Пока Результат.Следующий() Цикл
			нЗадача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
			нЗадача.Исполнитель = Справочники.Пользователи.НайтиПоКоду("Горицкий А. И.");
			нЗадача.Наименование = "Заканчивается срок действия сезонного заказа!";
			нЗадача.Описание = "Через 7 дней произойдет закрытие сезонного заказа: "+ Строка(Результат.ЗаказПоставщикуСезонный)+ Символы.ПС+"Неотгруженные товары:"+Символы.ПС;
			
			ТекстСообщения = ТекстСообщения + "" + Формат(Результат.ЗаказПоставщикуСезонный.ДатаДействияПо,"ДФ=dd.MM.yyyy") + Символы.Таб + Строка(Результат.ЗаказПоставщикуСезонный) + символы.Таб + Строка(Результат.ЗаказПоставщикуСезонный.Контрагент) + Символы.Таб + Символы.ПС;
			
			ОбластьСтрокаГруппировки.Параметры.ЗаказПоставщикуСезонный	 = Строка(Результат.ЗаказПоставщикуСезонный) + " / " + Строка(Результат.Получатель);
			ОбластьСтрокаГруппировки.Параметры.Заказано					 = Результат.Заказано;
			ОбластьСтрокаГруппировки.Параметры.Отгружено				 = Результат.Отгружено;
			ОбластьСтрокаГруппировки.Параметры.Остаток					 = Результат.Остаток;
			ТабДок.Вывести(ОбластьСтрокаГруппировки,1,,Ложь);
			
			ВыборкаДетали = Результат.Выбрать();
			
			Пока ВыборкаДетали.Следующий() Цикл
				
				ОбластьСтрока.Параметры.Код						 = ВыборкаДетали.Код;
				ОбластьСтрока.Параметры.Номенклатура			 = ВыборкаДетали.Номенклатура;
				ОбластьСтрока.Параметры.Заказано				 = ВыборкаДетали.Заказано;
				ОбластьСтрока.Параметры.Отгружено				 = ВыборкаДетали.Отгружено;
				ОбластьСтрока.Параметры.Остаток					 = ВыборкаДетали.Остаток;
				ТабДок.Вывести(ОбластьСтрока,2,,Ложь);
				
				нЗадача.Описание = нЗадача.Описание + "("+ВыборкаДетали.Код+") "+ВыборкаДетали.Номенклатура+" остаток: "+ВыборкаДетали.Остаток+Символы.ПС;
			КонецЦикла;
			нЗадача.Объект   	 = Результат.ЗаказПоставщикуСезонный;
			нЗадача.Дата 		    = ТекущаяДата();
			нЗадача.СрокИсполнения = КонецДня( ТекущаяДата() ); 	
			нЗадача.Оповещение     = истина;
			нЗадача.СрокОповещения = ТекущаяДата(); 
			нЗадача.Записать();
			
			попытка
				ДубльЗадача = нЗадача.Скопировать();
				Дубльзадача.Дата = ТекущаяДата();
				ДубльЗадача.Исполнитель = Справочники.Пользователи.НайтиПоКоду("Малышев Егор");
				ДубльЗадача.Записать();
			исключение
			КонецПопытки;
			
			попытка
				ДубльЗадача = нЗадача.Скопировать();
				Дубльзадача.Дата = ТекущаяДата();
				ДубльЗадача.Исполнитель = Справочники.Пользователи.НайтиПоКоду("Новикова С.");
				ДубльЗадача.Записать();
			исключение
			КонецПопытки;
			
			попытка
				ДубльЗадача = нЗадача.Скопировать();
				Дубльзадача.Дата = ТекущаяДата();
				ДубльЗадача.Исполнитель = Справочники.Пользователи.НайтиПоКоду("Яхшиян Тигран");
				ДубльЗадача.Записать();
			исключение
			КонецПопытки;
		КонецЦикла;
		
		//ДокСобытие.СодержаниеСобытия = ТекстСообщения;
		Менеджер = Справочники.Пользователи.НайтиПоКоду("Горицкий А. И.");
		//ДокСобытие.Ответственный = Менеджер;
		//ДокСобытие.Записать(РежимЗаписиДокумента.Проведение);
		
		
		ТабДок.ФиксацияСверху = 5;
		ТабДок.ЗакончитьАвтогруппировкуСтрок();
		ТабДок.ОтображатьЗаголовки = Ложь;
		ТабДок.ОтображатьСетку = Ложь;
		ТабДок.Показать();
		
		//Отправка на почту
		Вложение1 = ПолучитьИмяВременногоФайла("xls");
		ТабДок.Записать(Вложение1, ТипФайлаТабличногоДокумента.XLS);
		
		Профиль = Новый ИнтернетПочтовыйПрофиль;
		Профиль.АдресСервераSMTP   = "mail.yst76.ru";
		Профиль.ПортSMTP		   = 25;
		Профиль.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
		Профиль.ПарольSMTP         = "";
		Профиль.ПользовательSMTP   = "";
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Письмо.Отправитель = "no-reply@yst76.ru";
		Письмо.Получатели.Добавить("smirnov@yst.ru");
		Письмо.Получатели.Добавить("fedorova@yst.ru");
		Письмо.Получатели.Добавить("MALYSHEV@YST.RU");
		Письмо.Получатели.Добавить("goritsky@yst.ru");
		Письмо.Получатели.Добавить("novikova@yst.ru");

		
		Письмо.Тема = "Отчет об исполнении сезонных заказов поставщикам";
		Письмо.Вложения.Добавить(Вложение1,"Вложение 1");
		Письмо.Тексты.Добавить(ТекстСообщения,ТипТекстаПочтовогоСообщения.ПростойТекст);
		Почта = Новый ИнтернетПочта;
		
		Попытка
			Почта.Подключиться(Профиль);
			Почта.Послать(Письмо);
			Почта.Отключиться();
		Исключение
			Пауза(20);
			Почта.Подключиться(Профиль);
			Почта.Послать(Письмо);
			Почта.Отключиться();
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
