
Процедура КнопкаВыполнитьНажатие(Кнопка) экспорт
		
	Если ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "УчетТолькоПоПодразделениюПользователя") Тогда
		СписокКонтрагентов = ПолучитьКонтрагентовПользователейПодразделения();
		Если СписокКонтрагентов.найтиПоЗначению(Контрагент)=неопределено тогда
			Сообщить("Вам не разрешено использовать контрагента: "+строка(Контрагент)+"
			|Нет ни одного договора по вашему подразделению!");
			возврат;				
		КонецЕсли;					
	КонецЕсли;//+++)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ДоговорКонтрагента");
	ТЗ.Колонки.Добавить("ВалютаВзаиморасчетов");
	Для каждого элемент из ДоговораКонтрагента Цикл
		Если элемент.Пометка Тогда
			СтрТЗ = ТЗ.Добавить();
			СтрТЗ.ДоговорКонтрагента = элемент.ДоговорКонтрагента;
			СтрТЗ.ВалютаВзаиморасчетов = элемент.ВалютаВзаиморасчетов;
		КонецЕсли;	
	КонецЦикла;	
		
	Если ТЗ.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одного договора для взаиморасчетов");	
		Возврат;
	КонецЕсли;
	
	ТабДок = ПолучитьАкт(Контрагент, Организация, НачПериода, КонПериода, Флажок1, флПоДоговорам, ТЗ);
	НапечататьДокумент(ТабДок,,,"Таблица Акт сверки");
	
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если РольДоступна("ДополнительныеПраваВЭД") Тогда
		
		Организация=Справочники.Организации.НайтиПоКоду("00005");
		
	Иначе
		
		Организация=ПолучитьЗначениеПоУмолчанию(глТекущийПользователь,"ОсновнаяОрганизация");
		
	КонецЕсли;
КонецПроцедуры

Процедура КонтрагентПриИзменении(Элемент) экспорт
	
	ДоговораКонтрагента.Очистить();
	//+++( 14.09.2012  при ручном измении контрагента!
	Если ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "УчетТолькоПоПодразделениюПользователя") Тогда
		СписокКонтрагентов = ПолучитьКонтрагентовПользователейПодразделения();
		
		Если СписокКонтрагентов.найтиПоЗначению(Контрагент)=неопределено тогда
			Предупреждение("Вам не разрешено использовать контрагента: "+строка(Контрагент)+"
			|Нет ни одного договора по вашему подразделению!");
			возврат;				
		КонецЕсли;					
	КонецЕсли;//+++)
	
	//+++ 11.07.2013 доп проверка для ввода по строке
	СписокПользователей = новый СписокЗначений;
	Если не (РольДоступна("ПолныеПрава") 
		или ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "РазрешитьПолныйСписокДоговоров")
		или ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "РазрешитьПолныйСписокКонтрагентов")) тогда
		
		СписокПользователей = ПолучитьСписокПользователейСвоейГруппы();
		
		Если ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ЖурналыОтборПоРегиону") Тогда
			СписокКонтрагентов  = ПолучитьСписокКонтрагентовМенеджераПоРегиону(СписокПользователей);
		иначе	
			СписокКонтрагентов  = ПолучитьСписокКонтрагентовМенеджера(СписокПользователей);
		КонецЕсли;
		
		
		Если СписокКонтрагентов.НайтиПоЗначению(Контрагент)=неопределено тогда
			Предупреждение(" Вы не можете формировать ""Акт сверки""
			|по Контрагенту '"+строка(Контрагент)+"',
			|который не является контрагентом менеджеров вашей группы!");
			ВОЗВРАТ;
		КонецЕсли;
		
	КонецЕсли; 
	//+++)
	
	ДоговорКонтрагента=Контрагент.ОсновнойДоговорКонтрагента;
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	| выбор когда ДоговорыКонтрагентов.ОтветственноеЛицо=&ТекПользователь тогда истина
	| иначе ЛОЖЬ Конец как Пометка,
	|	ДоговорыКонтрагентов.Ссылка,
	|	ДоговорыКонтрагентов.ОтветственноеЛицо
	
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|"+?(СписокПользователей.Количество()>0,"	И ДоговорыКонтрагентов.ОтветственноеЛицо в (&СписокПользователей)", "")+"
	|";
	Запрос.УстановитьПараметр("Владелец",Контрагент);			 
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("СписокПользователей", СписокПользователей);
	
	Если ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоКоду("Уманский В. А.") Тогда //Лукьяненков 08.12.2017 
		Запрос.УстановитьПараметр("ТекПользователь", Справочники.Пользователи.НайтиПоКоду("Голубева В.С."));	
	Иначе
		Запрос.УстановитьПараметр("ТекПользователь", ПараметрыСеанса.ТекущийПользователь );
	КонецЕсли;
	
	Если ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ЖурналыОтборПоРегиону")  Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ДоговорыКонтрагентов.ОтветственноеЛицо в (&СписокПользователей)","");
	КонецЕсли;
	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		строкаДоговорКонтрагента = ДоговораКонтрагента.Добавить();
		строкаДоговорКонтрагента.Пометка				 = Выборка.Пометка;
		строкаДоговорКонтрагента.ДоговорКонтрагента		 = Выборка.Ссылка;
		строкаДоговорКонтрагента.ВалютаВзаиморасчетов	 = Выборка.Ссылка.ВалютаВзаиморасчетов;
		строкаДоговорКонтрагента.Менеджер				 = Выборка.ОтветственноеЛицо;
	КонецЦикла;	
	
КонецПроцедуры

Процедура КоманднаяПанельДоговораКонтрагентаКнДокументыУ(Кнопка) Экспорт
	Для каждого строкаДоговор	 ИЗ ДоговораКонтрагента Цикл
		строкаДоговор.Пометка=Истина;
	КонецЦикла;	
	
КонецПроцедуры

Процедура КоманднаяПанельДоговораКонтрагентаКнДокументыС(Кнопка)
	Для каждого строкаДоговор	 ИЗ ДоговораКонтрагента Цикл
		строкаДоговор.Пометка=ЛОЖЬ;
	КонецЦикла;	
	
КонецПроцедуры

Процедура КонтрагентНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	
	//+++ 11.07.2013 - всем отбор как в Заказах
	Если не (РольДоступна("ПолныеПрава") 
		или ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "РазрешитьПолныйСписокДоговоров")
		или ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "РазрешитьПолныйСписокКонтрагентов")) тогда
		СтандартнаяОбработка = ложь;
		
		форма = справочники.Контрагенты.ПолучитьФормуВыбора();
		
		СписокПользователей = ПолучитьСписокПользователейСвоейГруппы();
		Если ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ЖурналыОтборПоРегиону")  Тогда
			СписокКонтрагентов  = ПолучитьСписокКонтрагентовМенеджераПоРегиону(СписокПользователей);
		иначе
			СписокКонтрагентов  = ПолучитьСписокКонтрагентовМенеджера(СписокПользователей);
		КонецЕсли;
		
		//+++ 14.09.2012
		//Если ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "УчетТолькоПоПодразделениюПользователя") Тогда
		//	СписокКонтрагентов = ПолучитьКонтрагентовПользователейПодразделения();	
		//КонецЕсли;
		
		форма.СправочникСписок.Отбор["Ссылка"].Использование = Истина;
		форма.СправочникСписок.Отбор["Ссылка"].ВидСравнения = ВидСравнения.ВСписке;
		форма.СправочникСписок.Отбор["Ссылка"].Значение = СписокКонтрагентов;
		
		форма.ЭлементыФормы.СправочникСписок.НастройкаОтбора["Ссылка"].Доступность = Ложь;
		
		Контрагент = форма.ОткрытьМодально();
		
		КонтрагентПриИзменении(неопределено);  // загрузка договоров
	КонецЕсли;
	
КонецПроцедуры

Процедура ОрганизацияПриИзменении(Элемент)
	ДоговораКонтрагента.Очистить();
	//+++( 14.09.2012  при ручном измении контрагента!
	Если ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "УчетТолькоПоПодразделениюПользователя") Тогда
		СписокКонтрагентов = ПолучитьКонтрагентовПользователейПодразделения();
		
		Если СписокКонтрагентов.найтиПоЗначению(Контрагент)=неопределено тогда
			Предупреждение("Вам не разрешено использовать контрагента: "+строка(Контрагент)+"
			|Нет ни одного договора по вашему подразделению!");
			возврат;				
		КонецЕсли;					
	КонецЕсли;//+++)
	
	//+++ 11.07.2013 доп проверка для ввода по строке
	СписокПользователей = новый СписокЗначений;
	Если не (РольДоступна("ПолныеПрава") 
		или ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "РазрешитьПолныйСписокДоговоров")
		или ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "РазрешитьПолныйСписокКонтрагентов")) тогда
		
		СписокПользователей = ПолучитьСписокПользователейСвоейГруппы();
		
		Если ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ЖурналыОтборПоРегиону")  Тогда
			СписокКонтрагентов  = ПолучитьСписокКонтрагентовМенеджераПоРегиону(СписокПользователей);
		иначе
			СписокКонтрагентов  = ПолучитьСписокКонтрагентовМенеджера(СписокПользователей);
		КонецЕсли;
		Если СписокКонтрагентов.НайтиПоЗначению(Контрагент)=неопределено тогда
			Предупреждение(" Вы не можете формировать ""Акт сверки""
			|по Контрагенту '"+строка(Контрагент)+"',
			|который не является контрагентом менеджеров вашей группы!");
			ВОЗВРАТ;
		КонецЕсли;
		
	КонецЕсли; 
	//+++)
	
	ДоговорКонтрагента=Контрагент.ОсновнойДоговорКонтрагента;
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	| выбор когда ДоговорыКонтрагентов.ОтветственноеЛицо=&ТекПользователь тогда истина
	| иначе ЛОЖЬ Конец как Пометка,
	|	ДоговорыКонтрагентов.Ссылка,
	|	ДоговорыКонтрагентов.ОтветственноеЛицо
	
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|"+?(СписокПользователей.Количество()>0,"	И ДоговорыКонтрагентов.ОтветственноеЛицо в (&СписокПользователей)", "")+"
	|";
	Запрос.УстановитьПараметр("Владелец",Контрагент);			 
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("СписокПользователей", СписокПользователей);
	Запрос.УстановитьПараметр("ТекПользователь", ПараметрыСеанса.ТекущийПользователь );
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		строкаДоговорКонтрагента=ДоговораКонтрагента.Добавить();
		строкаДоговорКонтрагента.Пометка = выборка.Пометка;
		строкаДоговорКонтрагента.ДоговорКонтрагента=Выборка.Ссылка;
		строкаДоговорКонтрагента.Менеджер = выборка.ОтветственноеЛицо;
	КонецЦикла;	
	
КонецПроцедуры
