Процедура ВыбратьЗаказыДляСМСРассылки(НачПериода,КонПериода,Подразделение) экспорт
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ДатаН",НачПериода);
	Запрос.УстановитьПараметр("ДатаК",КонецДня(КонПериода));
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("ТипКИ",Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	SMSЯрославль = Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("39228");
	SMSЕкб  = Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("38842");
	SMSРнд  = Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("39230");
	SMSСпб  = Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("39229");
	
	ПодразделениеЯр  = Справочники.Подразделения.НайтиПоКоду("00005");
	ПодразделениеПустое =Справочники.Подразделения.ПустаяСсылка();
    ПодразделениеЕкб = Справочники.Подразделения.НайтиПоКоду("00138");
    ПодразделениеСпб = Справочники.Подразделения.НайтиПоКоду("00112");
	ПодразделениеРнд = Справочники.Подразделения.НайтиПоКоду("00106");
		
	Если Подразделение = ПодразделениеЕкб тогда
		Запрос.УстановитьПараметр("ВидКИ",SMSЕкб); //Телефон для смс рассылки Екат
	иначеЕсли Подразделение = ПодразделениеСпб тогда
		Запрос.УстановитьПараметр("ВидКИ",SMSСпб); //Телефон для SMS-рассылки Санкт-Петербург
	иначеЕсли Подразделение = ПодразделениеРнд тогда
		Запрос.УстановитьПараметр("ВидКИ",SMSРнд); //Телефон для SMS-рассылки Ростов-на-Дону
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ТипКИЕмаил",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ВидКИЕмаил",Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДляОбменаДокументами);

	
	Запрос.Текст="ВЫБРАТЬ
	             |	ПеремещениеТоваров.Ссылка,
	             |	ПеремещениеТоваров.Перемещение КАК ПеремещениеИзГоловного,
	             |	ПеремещениеТоваров.Перемещение.ВнутреннийЗаказ
	             |ПОМЕСТИТЬ втВнутренниеЗаказы
	             |ИЗ
	             |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	             |ГДЕ
	             |	ПеремещениеТоваров.Дата МЕЖДУ &ДатаН И &ДатаК
	             |	И ПеремещениеТоваров.СкладОтправитель.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.ВПути)
	             |	И ПеремещениеТоваров.СкладПолучатель.Транзитный
	             |	И ПеремещениеТоваров.Подразделение = &Подразделение
	             |	И ПеремещениеТоваров.Проведен
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ВнутреннийЗаказ.ДокументОснование
	             |ПОМЕСТИТЬ втЗаказыДляПерем
	             |ИЗ
	             |	втВнутренниеЗаказы КАК втВнутренниеЗаказы
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВнутреннийЗаказ КАК ВнутреннийЗаказ
	             |		ПО втВнутренниеЗаказы.ПеремещениеВнутреннийЗаказ = ВнутреннийЗаказ.Ссылка
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ЗаказПокупателяЗаказы.ЗаказПокупателя КАК ЗаказПокупателя,
	             |	ЗаказПокупателяЗаказы.ЗаказПокупателя.Контрагент,
	             |	""                                                                    "" КАК СтатусРасшифровка,
	             |	0 КАК Статус,
	             |	ВЫРАЗИТЬ(КонтактнаяИнформацияСМС.Представление КАК СТРОКА(100)) КАК ТелефонДляСМС,
	             |	ВЫРАЗИТЬ(КонтактнаяИнформацияЕмаил.Представление КАК СТРОКА(50)) КАК Емаил,
	             |	ЗаказПокупателяЗаказы.ЗаказПокупателя.Номер,
	             |	ЗаказПокупателяЗаказы.ЗаказПокупателя.Подразделение КАК Подразделение,
	             |	КонтактнаяИнформацияСМС.Вид КАК ВидКИ
	             |ИЗ
	             |	втЗаказыДляПерем КАК втЗаказыДляПерем
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Заказы КАК ЗаказПокупателяЗаказы
	             |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияСМС
	             |			ПО ЗаказПокупателяЗаказы.ЗаказПокупателя.Контрагент = КонтактнаяИнформацияСМС.Объект
	             |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияЕмаил
	             |			ПО ЗаказПокупателяЗаказы.ЗаказПокупателя.Контрагент = КонтактнаяИнформацияЕмаил.Объект
	             |		ПО втЗаказыДляПерем.ДокументОснование = ЗаказПокупателяЗаказы.Ссылка
	             |ГДЕ
	             |	НЕ ЗаказПокупателяЗаказы.ЗаказПокупателя В
	             |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |					SMSРассылка.Документ
	             |				ИЗ
	             |					РегистрСведений.SMSРассылка КАК SMSРассылка
	             |				ГДЕ
	             |					SMSРассылка.СтатусЗаказа = ""6.Доставлен На Склад"")
	             |	И КонтактнаяИнформацияСМС.Тип = &ТипКИ
	             |	И КонтактнаяИнформацияСМС.Вид = &ВидКИ
	             |	И КонтактнаяИнформацияЕмаил.Тип = &ТипКИЕмаил
	             |	И КонтактнаяИнформацияЕмаил.Вид = &ВидКИЕмаил
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ТелефонДляСМС,
	             |	ЗаказПокупателя
	             |АВТОУПОРЯДОЧИВАНИЕ";
	ТабЗаказов=Запрос.Выполнить().Выгрузить();
	ТабЗаказовДляРассылки = ТабЗаказов.Скопировать();
	ТабЗаказовДляРассылки.Очистить();
	СписокЗаказов = ТабЗаказов.ВыгрузитьКолонку("ЗаказПокупателя");
	Статусы = ОбменСУТИнтернетМагазин.ПолучитьстатусыЗаказов(списокЗаказов);
	отбор = новый структура("ЗаказПокупателя");
	
	Для каждого стрСтатусов из Статусы цикл
		Если ЗначениеЗаполнено(стрСтатусов.Заказ) тогда
			отбор.ЗаказПокупателя = стрСтатусов.Заказ;
			НайденныйСтроки = ТабЗаказов.НайтиСтроки(Отбор);
			Для каждого стр из НайденныйСтроки цикл
				стр.СтатусРасшифровка = СокрЛП(стрСтатусов.СтатусРасшифровка);
				стр.Статус = стрСтатусов.Статус;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого стр из ТабЗаказов цикл
		Если стр.Статус = 6 тогда
				нстр = ТабЗаказовДляРассылки.Добавить();
				ЗаполнитьЗначенияСвойств(нстр,стр);
		КонецЕсли;
	КонецЦикла;
	
	Сообщить("Заказов для оповещения:" +ТабЗаказовДляРассылки.Количество());

	//ТабЗаказовДляРассылки.ВыбратьСтроку();
	
	//ТекстСмс="Ваш заказ доставлен на склад филиала";
	
	Для каждого стр из ТабЗаказовДляРассылки цикл
		ТекстСмс="Ваш заказ доставлен на склад филиала. "+стр.ЗаказПокупателяНомер+". Яршинторг";
		МассивНомеров = яштПоставщики.яштРазложитьСтрокуВМассивПодстрок(СокрЛП(стр.ТелефонДляСМС),";");
		Для каждого номер из МассивНомеров цикл
			НаборЗаписей = РегистрыСведений.SMSРассылка.СоздатьМенеджерЗаписи();
			
			НаборЗаписей.GUID  = СокрЛП(Строка(Новый УникальныйИдентификатор)); 
			НаборЗаписей.ТекстСообщения  = ТекстСмс;  //перезатираем старое сообщение
			НаборЗаписей.НомерПолучателя=смсРаботаССообщениями.УбратьЛишниеСимволыТелефона(номер);
			НаборЗаписей.Активность=Истина;
			НаборЗаписей.СтатусЗаказа="6.Доставлен На Склад";
			//Если уже есть неотправленная смс на этот номер, то не помечаем его как отправленный
			Если  УжеЕстьСМСНаЭтотНомер(НаборЗаписей.НомерПолучателя, НаборЗаписей.СтатусЗаказа) тогда
				НаборЗаписей.ДатаОтправления = ТекущаяДата();
			КонецЕсли;
			//
			
			НаборЗаписей.Документ=стр.ЗаказПокупателя;
			НаборЗаписей.Срочное = ложь;
			НаборЗаписей.Записать(); // перезапись!
		КонецЦикла;
		Если СокрЛП(стр.Емаил)<>""тогда //и на почту зашлем
			ОтправитьПисьмо(стр);
		КонецЕсли;
		
	КонецЦикла;
	
	//Раскомментарить когда подтвердят буквенное имя
	смсРаботаССообщениями.РегламентноеЗаданиеПроверкаСМС();

	
КонецПроцедуры

Процедура ОтправитьПисьмо(стр)
	Почта = Новый ИнтернетПочта;
		УЗ = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("no-reply@yst76.ru");
		ИПП = Новый ИнтернетПочтовыйПрофиль;
		ИПП.АдресСервераSMTP = УЗ.SMTPСервер;
		ИПП.ПортSMTP = УЗ.ПортSMTP;
		Если УЗ.ТребуетсяSMTPАутентификация Тогда
			ИПП.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
			ИПП.ПарольSMTP         = УЗ.ПарольSMTP;
			ИПП.ПользовательSMTP   = УЗ.ЛогинSMTP;
		Иначе
			ИПП.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
			ИПП.ПарольSMTP         = "";
			ИПП.ПользовательSMTP   = "";
		КонецЕсли;
		
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Письмо.Отправитель = УЗ.АдресЭлектроннойПочты;
		СтрАдреса = "";
		Письмо.Получатели.Добавить("smirnov@yst.ru");
		Письмо.Получатели.Добавить(стр.Емаил);
					
		
		Письмо.Тема				 = "Ваш заказ поступил на склад филиала!";
		Письмо.ИмяОтправителя	 = "Робот ЯШТ";
		Письмо.Организация		 = "ТК ""Яршинторг""";
		
		
		
		ТекстПисьма = ""+стр.ЗаказПокупателя+" поступил на склад филиала.";
		ТекстПисьма = ТекстПисьма+Символы.ПС;
		
		Для каждого Товар ИЗ стр.ЗаказПокупателя.Товары Цикл 
			    ТекстПисьма=ТекстПисьма+Символы.ПС;
				ТекстПисьма = ТекстПисьма+"("+Товар.Номенклатура.Код+") "+ Товар.Номенклатура + "	" +Товар.Количество+" "+Товар.ЕдиницаИзмерения;
		КонецЦикла;
		
		ТекстПисьма = ТекстПисьма+Символы.ПС+Символы.ПС+"Итого: "+стр.ЗаказПокупателя.Товары.Итог("Количество")+" шт.";
		ТекстПисьма = ТекстПисьма+Символы.ПС+"По всем уточняющим вопросам( для уточнения информации) прошу связываться с вашим персональным менеджером.";
		
		Письмо.Тексты.Добавить(ТекстПисьма,ТипТекстаПочтовогоСообщения.ПростойТекст);
		Письмо.ОбработатьТексты();
		
		Попытка
			Почта.Подключиться(ИПП);
			Почта.Послать(Письмо);
			Почта.Отключиться();
			#Если Клиент Тогда
				сообщить(" >>>  Письмо отправлено на эл.адрес: "+СтрАдреса+".", СтатусСообщения.Информация);
			#КонецЕсли
		Исключение
			попытка
				Пауза(2);
				Почта.Подключиться(ИПП);
				Почта.Послать(Письмо);
				Почта.Отключиться();
				#Если Клиент Тогда
					сообщить(" >>>  Письмо отправлено на эл.адрес: "+СтрАдреса+". Со второй попытки", СтатусСообщения.Информация);
				#КонецЕсли
			исключение
				#Если Клиент Тогда
					сообщить("xxxxx Ошибка при отправке письма на эл.адрес: "+СтрАдреса+" - "+ОписаниеОшибки()+" попробуем еще раз.", СтатусСообщения.Внимание);
				#КонецЕсли
			конецПопытки;
		КонецПопытки;

КонецПроцедуры

Функция УжеЕстьСМСНаЭтотНомер(Номер, Статус)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерПолучателя",Номер);
	Запрос.УстановитьПараметр("СтатусЗаказа",Статус);
	Запрос.Текст="ВЫБРАТЬ
	             |	SMSРассылка.GUID
	             |ИЗ
	             |	РегистрСведений.SMSРассылка КАК SMSРассылка
	             |ГДЕ
	             |	SMSРассылка.НомерПолучателя = &НомерПолучателя
	             |	И SMSРассылка.СтатусЗаказа = &СтатусЗаказа
	             |	И SMSРассылка.ДатаОтправления = ДАТАВРЕМЯ(1, 1, 1)";
				 Рез =Запрос.Выполнить().Выбрать();
				 Если Рез.Количество()>0 тогда
					 Возврат Истина;
				 Иначе
					 Возврат ложь;
				 КонецЕсли;
КонецФункции
			 
Процедура Пауза(Сек)
	scr = Новый COMОбъект("WScript.Shell");
	scr.Run("sleep "+СокрЛП(Число(Сек)),0,1);
КонецПроцедуры
