
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = Период;
   Если не СезонныйЗаказ.Пустая() Тогда
	Список = Новый СписокЗначений;
	Список.Добавить(СезонныйЗаказ);
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Заказ");
   ПараметрСКД.Значение  = Список;
   параметрСКД.Использование = Истина;

   конецЕсли;
КонецПроцедуры
