
Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
	
	ПриИзмененииПараметраНастройки("НачалоПериода", НачПериода);
	ПриИзмененииПараметраНастройки("КонецПериода", КонецДня(КонПериода));
	
КонецПроцедуры

Процедура НачПериодаПриИзменении(Элемент)

	ПриИзмененииПараметраНастройки("НачалоПериода", НачПериода);
	
КонецПроцедуры

Процедура КонПериодаПриИзменении(Элемент)

	ПриИзмененииПараметраНастройки("КонецПериода", КонецДня(КонПериода));
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ПриВосстановленииПараметраНастройки("НачалоПериода", НачПериода); // Поместим значение параметра из компоновки на форму отчета
	ПриВосстановленииПараметраНастройки("КонецПериода" , КонПериода); // Поместим значение параметра из компоновки на форму отчета
	
КонецПроцедуры

Процедура ПриВосстановленииПараметраНастройки(ПараметрИмя, ПараметрЗначение)
	
	Парам = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных(ПараметрИмя));
	ПараметрЗначение = Парам.Значение;
	
КонецПроцедуры // ПриВосстановленииПараметраНастройки()

Процедура ПриИзмененииПараметраНастройки(ПараметрИмя, ПараметрЗначение)
	
	Парам = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных(ПараметрИмя));
	Парам.Значение = ПараметрЗначение;
	Парам.Использование = ИСТИНА;
	
КонецПроцедуры // ПриИзмененииПараметраНастройки()

Процедура ПослеВосстановленияЗначений()
	
	ПриВосстановленииПараметраНастройки("НачалоПериода", НачПериода); // Поместим значение параметра из компоновки на форму отчета
	ПриВосстановленииПараметраНастройки("КонецПериода" , КонПериода); // Поместим значение параметра из компоновки на форму отчета
	
КонецПроцедуры

