
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Закрыть(ПолеСписка1);
КонецПроцедуры


Процедура КоманднаяПанель1УбратьВсе(Кнопка)
	ФЛАГИ(0);
КонецПроцедуры

Процедура КоманднаяПанель1ВыбратьВсе(Кнопка)
	ФЛАГИ(1);
КонецПроцедуры

Процедура КоманднаяПанель1ПереклВсе(Кнопка)
	ФЛАГИ(2);
КонецПроцедуры

Процедура ФЛАГИ( выкл = 0 )
	для каждого стр1 из ПолеСписка1 цикл
		стр1.Пометка = ?(выкл=1, Истина, ?(выкл=0, ЛОЖЬ, не стр1.Пометка)); 
	КонецЦикла;	
КонецПроцедуры

Процедура КоманднаяПанель1ОтборПоРегиону(Кнопка)
	стрРег = "";
	если ВвестиСтроку(стрРег,"Регион") тогда
		для каждого стр1 из ПолеСписка1 цикл
			Если Найти(нрег(стр1.регион), нрег(стрРег) )>0 тогда
				стр1.Пометка = Истина; 
			КонецЕсли;	
		КонецЦикла;	
    КонецЕсли;
КонецПроцедуры
