
Процедура ДействияФормыОтчетСформировать(Кнопка)

	ТабДок = ЭлементыФормы.ПолеТабличногоДокумента;
	Отчет(ТабДок);

КонецПроцедуры

Процедура Отчет(ТабДок) Экспорт
	
	Перем Контрагент;
	Перем Адрес;
	Перем Категория;
	Перем КонтрагентСсылка;
	
	ТабДок.Очистить();
	
	Макет = ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонецДня(КонДата));
	Запрос.УстановитьПараметр("НоменклатурнаяГруппа", Справочники.НоменклатурныеГруппы.НайтиПоКоду("00038"));
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00119"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.ДоговорКонтрагента.Владелец.НаименованиеПолное КАК Контрагент,
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	ПродажиОбороты.КоличествоОборот КАК КоличествоОборот,
	|	КонтактнаяИнформация.Представление КАК Адрес,
	|	ПОДСТРОКА(ПродажиОбороты.Номенклатура.Наименование, 6, 2) КАК Префикс,
	|	ЗначенияСвойствОбъектов.Значение КАК КатегорияПокупателя,
	|	ПродажиОбороты.ДоговорКонтрагента.Владелец КАК КонтрагентСсылка
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачДата, &КонДата, , Номенклатура.НоменклатурнаяГруппа = &НоменклатурнаяГруппа) КАК ПродажиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ПродажиОбороты.ДоговорКонтрагента.Владелец = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = &Тип)
	|			И (КонтактнаяИнформация.Вид = &Вид)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ПродажиОбороты.ДоговорКонтрагента.Владелец = ЗначенияСвойствОбъектов.Объект
	|			И (ЗначенияСвойствОбъектов.Свойство = &Свойство)";
	
	Результат = Запрос.Выполнить();
	ТЗПродажи = Результат.Выгрузить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Период = ПредставлениеПериода(НачДата,КонецДня(КонДата),"ФП=Истина");
	ОбластьЗаголовок.Параметры.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.НайтиПоКоду("00038");
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	ТЗПродажи.Сортировать("Контрагент");
	a = 0; b = 0; c = 0; d = 0; f = 0; g = 0; h = 0; i = 0; j = 0; k = 0; l = 0;
	m = 0; n = 0; o = 0; p = 0; q = 0; r = 0; s = 0; t = 0; u = 0; e = 0;
	
	aa = 0; bb = 0; cc = 0; dd = 0; ff = 0; gg = 0; hh = 0; ii = 0; jj = 0; kk = 0; ll = 0;
	mm = 0; nn = 0; oo = 0; pp = 0; qq = 0; rr = 0; ss = 0; tt = 0; uu = 0; ee = 0;
	
	Для каждого СтрокаТЗ ИЗ ТЗПродажи Цикл
		Если СтрокаТЗ.Контрагент <> Контрагент И Контрагент <> Неопределено Тогда
			ОбластьСтрока.Параметры.Контрагент = Контрагент;
			ОбластьСтрока.Параметры.Адрес = Адрес;
			ОбластьСтрока.Параметры.Категория = Категория;
			ОбластьСтрока.Параметры.КатегорияР = КонтрагентСсылка;
			ОбластьСтрока.Параметры.a = a;
			ОбластьСтрока.Параметры.b = b;
			ОбластьСтрока.Параметры.c = c;
			ОбластьСтрока.Параметры.d = d;
			ОбластьСтрока.Параметры.e = e;
			ОбластьСтрока.Параметры.f = f;
			ОбластьСтрока.Параметры.g = g;
			ОбластьСтрока.Параметры.h = h;
			ОбластьСтрока.Параметры.i = i;
			ОбластьСтрока.Параметры.j = j;
			ОбластьСтрока.Параметры.k = k;
			ОбластьСтрока.Параметры.l = l;
			ОбластьСтрока.Параметры.m = m;
			ОбластьСтрока.Параметры.n = n;
			ОбластьСтрока.Параметры.o = o;
			ОбластьСтрока.Параметры.p = p;
			ОбластьСтрока.Параметры.q = q;
			ОбластьСтрока.Параметры.r = r;
			ОбластьСтрока.Параметры.s = s;
			ОбластьСтрока.Параметры.t = t;
			ОбластьСтрока.Параметры.u = u;
			ОбластьСтрока.Параметры.Итого = a + b + c + d + e + f + g + h + i + j + k + l + m + n + o + p + q + r + s + t + u;
			ТабДок.Вывести(ОбластьСтрока);
			a = 0; b = 0; c = 0; d = 0; f = 0; g = 0; h = 0; i = 0; j = 0; k = 0; l = 0;
			m = 0; n = 0; o = 0; p = 0; q = 0; r = 0; s = 0; t = 0; u = 0; e = 0;
		КонецЕсли;
		
		Контрагент = СтрокаТЗ.Контрагент;
		Адрес = СтрокаТЗ.Адрес;
		Категория = СтрокаТЗ.КатегорияПокупателя; 
		Префикс = СтрокаТЗ.Префикс;
		КонтрагентСсылка = СтрокаТЗ.КонтрагентСсылка;
		Если Найти(СтрокаТЗ.Номенклатура.Наименование, "R17.5") <> 0 Тогда
			Если СтрокаТЗ.Префикс = "NF" Тогда
				a = a + СтрокаТЗ.КоличествоОборот;
				aa = aa + a;
			ИначеЕсли СтрокаТЗ.Префикс = "NR" Тогда
				b = b + СтрокаТЗ.КоличествоОборот;
				bb = bb + b;
			ИначеЕсли СтрокаТЗ.Префикс = "NT" Тогда
				c = c + СтрокаТЗ.КоличествоОборот;
				cc = cc + c;
			КонецЕсли;
		ИначеЕсли Найти(СтрокаТЗ.Номенклатура.Наименование, "R19.5") <> 0 Тогда
			Если Найти(СтрокаТЗ.Номенклатура.Наименование, "245/70") <> 0 Тогда
				Если СтрокаТЗ.Префикс = "NF" Тогда
					d = d + СтрокаТЗ.КоличествоОборот;
					dd = dd + d;
				ИначеЕсли СтрокаТЗ.Префикс = "NR" Тогда
					e = e + СтрокаТЗ.КоличествоОборот;
					ee = ee + e;
				КонецЕсли;
			ИначеЕсли Найти(СтрокаТЗ.Номенклатура.Наименование, "265/70") <> 0 Тогда
				f = f + СтрокаТЗ.КоличествоОборот;
				ff = ff + f;
			ИначеЕсли Найти(СтрокаТЗ.Номенклатура.Наименование, "285/70") <> 0 Тогда
				g = g + СтрокаТЗ.КоличествоОборот;
				gg = gg + g;
			КонецЕсли;
		ИначеЕсли Найти(СтрокаТЗ.Номенклатура.Наименование, "R20") <> 0 Тогда
			h = h + СтрокаТЗ.КоличествоОборот;
			hh = hh + h;
		ИначеЕсли Найти(СтрокаТЗ.Номенклатура.Наименование, "R22.5") <> 0 Тогда
			Если Найти(СтрокаТЗ.Номенклатура.Наименование, "11") <> 0 Тогда
				i = i + СтрокаТЗ.КоличествоОборот;
				ii = ii + i;
			ИначеЕсли Найти(СтрокаТЗ.Номенклатура.Наименование, "275/70") <> 0 Тогда
				Если СтрокаТЗ.Префикс = "NF" Тогда
					j = j + СтрокаТЗ.КоличествоОборот;
					jj = jj + j;
				ИначеЕсли СтрокаТЗ.Префикс = "NR" Тогда
					k = k + СтрокаТЗ.КоличествоОборот;
					kk = kk + k;
				КонецЕсли;
			ИначеЕсли Найти(СтрокаТЗ.Номенклатура.Наименование, "295/80") <> 0 Тогда
				Если СтрокаТЗ.Префикс = "NF" Тогда
					l = l + СтрокаТЗ.КоличествоОборот;
					ll = ll + l;
				ИначеЕсли СтрокаТЗ.Префикс = "NR" Тогда
					m = m + СтрокаТЗ.КоличествоОборот;
					mm = mm + m;
				КонецЕсли;
			ИначеЕсли Найти(СтрокаТЗ.Номенклатура.Наименование, "315/60") <> 0 Тогда
				Если СтрокаТЗ.Префикс = "NF" Тогда
					n = n + СтрокаТЗ.КоличествоОборот;
					nn = nn + n;
				ИначеЕсли СтрокаТЗ.Префикс = "NR" Тогда
					o = o + СтрокаТЗ.КоличествоОборот;
					oo = oo + o;
				КонецЕсли;
			ИначеЕсли Найти(СтрокаТЗ.Номенклатура.Наименование, "315/70") <> 0 Тогда
				Если СтрокаТЗ.Префикс = "NF" Тогда
					p = p + СтрокаТЗ.КоличествоОборот;
					pp = pp + p;
				ИначеЕсли СтрокаТЗ.Префикс = "NR" Тогда
					q = q + СтрокаТЗ.КоличествоОборот;
					qq = qq + q;
				КонецЕсли;
			ИначеЕсли Найти(СтрокаТЗ.Номенклатура.Наименование, "315/80") <> 0 Тогда
				Если СтрокаТЗ.Префикс = "NF" Тогда
					r = r + СтрокаТЗ.КоличествоОборот;
					rr = rr + r;
				ИначеЕсли СтрокаТЗ.Префикс = "NR" Тогда
					s = s + СтрокаТЗ.КоличествоОборот;
					ss = ss + s;
				КонецЕсли;
			ИначеЕсли Найти(СтрокаТЗ.Номенклатура.Наименование, "385/65") <> 0 Тогда
				t = t + СтрокаТЗ.КоличествоОборот;
				tt = tt + t;
			КонецЕсли;
		ИначеЕсли Найти(СтрокаТЗ.Номенклатура.Наименование, "R24") <> 0 Тогда
			u = u + СтрокаТЗ.КоличествоОборот;
			uu = uu + u;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбластьСтрока.Параметры.Контрагент = Контрагент;
	ОбластьСтрока.Параметры.Адрес = Адрес;
	ОбластьСтрока.Параметры.Категория = Категория;
	ОбластьСтрока.Параметры.КатегорияР = КонтрагентСсылка;
	ОбластьСтрока.Параметры.a = a;
	ОбластьСтрока.Параметры.b = b;
	ОбластьСтрока.Параметры.c = c;
	ОбластьСтрока.Параметры.d = d;
	ОбластьСтрока.Параметры.e = e;
	ОбластьСтрока.Параметры.f = f;
	ОбластьСтрока.Параметры.g = g;
	ОбластьСтрока.Параметры.h = h;
	ОбластьСтрока.Параметры.i = i;
	ОбластьСтрока.Параметры.j = j;
	ОбластьСтрока.Параметры.k = k;
	ОбластьСтрока.Параметры.l = l;
	ОбластьСтрока.Параметры.m = m;
	ОбластьСтрока.Параметры.n = n;
	ОбластьСтрока.Параметры.o = o;
	ОбластьСтрока.Параметры.p = p;
	ОбластьСтрока.Параметры.q = q;
	ОбластьСтрока.Параметры.r = r;
	ОбластьСтрока.Параметры.s = s;
	ОбластьСтрока.Параметры.t = t;
	ОбластьСтрока.Параметры.u = u;
	ОбластьСтрока.Параметры.Итого = a + b + c + d + e + f + g + h + i + j + k + l + m + n + o + p + q + r + s + t + u;
	ТабДок.Вывести(ОбластьСтрока);
	
	ОбластьПодвал.Параметры.aa = aa;
	ОбластьПодвал.Параметры.bb = bb;
	ОбластьПодвал.Параметры.cc = cc;
	ОбластьПодвал.Параметры.dd = dd;
	ОбластьПодвал.Параметры.ee = ee;
	ОбластьПодвал.Параметры.ff = ff;
	ОбластьПодвал.Параметры.gg = gg;
	ОбластьПодвал.Параметры.hh = hh;
	ОбластьПодвал.Параметры.ii = ii;
	ОбластьПодвал.Параметры.jj = jj;
	ОбластьПодвал.Параметры.kk = kk;
	ОбластьПодвал.Параметры.ll = ll;
	ОбластьПодвал.Параметры.mm = mm;
	ОбластьПодвал.Параметры.nn = nn;
	ОбластьПодвал.Параметры.oo = oo;
	ОбластьПодвал.Параметры.pp = pp;
	ОбластьПодвал.Параметры.qq = qq;
	ОбластьПодвал.Параметры.rr = rr;
	ОбластьПодвал.Параметры.ss = ss;
	ОбластьПодвал.Параметры.tt = tt;
	ОбластьПодвал.Параметры.uu = uu;
	ОбластьПодвал.Параметры.ОбщийИтог = ТЗПродажи.Итог("КоличествоОборот");
	ТабДок.Вывести(ОбластьПодвал);
	
КонецПроцедуры

Процедура РезультатыОтчетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаРедактированияСвойства = РегистрыСведений.ЗначенияСвойствОбъектов.ПолучитьФормуРедактированияЗаписи();
	ФормаРедактированияСвойства.Объект = Расшифровка;
	ФормаРедактированияСвойства.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00119");
	
	РегЗначенияСвойств = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	РегЗначенияСвойств.Отбор.Объект.Установить(Расшифровка);
	РегЗначенияСвойств.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00119"));
	РегЗначенияСвойств.Прочитать();
	Если РегЗначенияСвойств.Количество() = 0 Тогда
		ФормаРедактированияСвойства.Значение = 0;
	Иначе
		Для каждого Запись ИЗ РегЗначенияСвойств Цикл
			ФормаРедактированияСвойства.Значение = Запись.Значение;
		КонецЦикла;
	КонецЕсли;
	ФормаРедактированияСвойства.ОткрытьМодально();
	
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.УстановитьПериод(НачДата, ?(КонДата='0001-01-01', КонДата, КонецДня(КонДата)));
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	Если НастройкаПериода.Редактировать() Тогда
		НачДата = НастройкаПериода.ПолучитьДатуНачала();
		КонДата = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

