
Процедура ПриОткрытии()
	ЭлементыФормы.ПолеГод.СписокВыбора.Добавить(Строка(Формат(НачалоГода(ТекущаяДата()) - 1,"ДФ=yyyy")));
	ЭлементыФормы.ПолеГод.СписокВыбора.Добавить(Строка(Формат(ТекущаяДата(),"ДФ=yyyy")));
	ЭлементыФормы.ПолеГод.СписокВыбора.Добавить(Строка(Формат(КонецГода(ТекущаяДата()) + 1,"ДФ=yyyy")));
КонецПроцедуры

Процедура ПолеГодПриИзменении(Элемент)
	ПериодС = Дата(СтрЗаменить(Год,Символы.НПП,"")+"0101000000");
	ПериодПо = КонецГода(Дата(СтрЗаменить(Год,Символы.НПП,"")+"0101000000"));
КонецПроцедуры
