Функция Печать() Экспорт 
	ТабДок=Новый ТабличныйДокумент;
	Макет=ПолучитьМакет("МакетРекламационнаяКарточка");
	Область=Макет.ПолучитьОбласть("Шапка");
	СведенияОГрузополучателе  = СведенияОЮрФизЛице(СсылкаНаОбъект.Контрагент,  СсылкаНаОбъект.Дата);
	Область.Параметры.АдресТелефон	= ОписаниеОрганизацииЗ(СведенияОГрузополучателе, "ФактическийАдрес,Телефоны");
	Область.Параметры.Дата=СсылкаНаОбъект.Дата;
	Область.Параметры.Контрагент=СсылкаНаОбъект.Контрагент;
	ТабДок.Вывести(Область);
	
	Область=Макет.ПолучитьОбласть("Строка");

	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗаявкаНаБрак.Ссылка,
	             |	ЗаявкаНаБрак.Ссылка.ПометкаУдаления,
	             |	ЗаявкаНаБрак.Ссылка.Номер,
	             |	ЗаявкаНаБрак.Ссылка.Дата,
	             |	ЗаявкаНаБрак.Ссылка.Проведен,
	             |	ЗаявкаНаБрак.Ссылка.Контрагент,
	             |	ЗаявкаНаБрак.Номенклатура,
	             |	ЗаявкаНаБрак.Количество,
	             |	ЗаявкаНаБрак.НомерРеализации,
	             |	ЗаявкаНаБрак.ДатаРеализации,
	             |	ЗаявкаНаБрак.СостояниеТовара КАК СостояниеДиска,
	             |	ЗаявкаНаБрак.ДатаПроизводства,
	             |	ВЫБОР
	             |		КОГДА ЗаявкаНаБрак.Качество = &Биение
	             |			ТОГДА ЗаявкаНаБрак.Комментарий
	             |	КОНЕЦ КАК Биение,
	             |	ВЫБОР
	             |		КОГДА ЗаявкаНаБрак.Качество = &ДефектЛитья
	             |			ТОГДА ЗаявкаНаБрак.Комментарий
	             |	КОНЕЦ КАК ДефектЛитья,
	             |	ВЫБОР
	             |		КОГДА ЗаявкаНаБрак.Качество = &ДефектЛКП
	             |			ТОГДА ЗаявкаНаБрак.Комментарий
	             |	КОНЕЦ КАК ДефектЛКП,
	             |	ВЫБОР
	             |		КОГДА ЗаявкаНаБрак.Качество = &Дисбаланс
	             |			ТОГДА ЗаявкаНаБрак.Комментарий
	             |	КОНЕЦ КАК Дисбаланс,
	             |	ВЫБОР
	             |		КОГДА ЗаявкаНаБрак.Качество = &МеханическиеПовреждения
	             |			ТОГДА ЗаявкаНаБрак.Комментарий
	             |	КОНЕЦ КАК МеханическиеПовреждения,
	             |	ВЫБОР
	             |		КОГДА ЗаявкаНаБрак.Качество = &НеПодходитНаЗаявленныйАвто
	             |			ТОГДА ЗаявкаНаБрак.Комментарий
	             |	КОНЕЦ КАК НеПодходитНаЗаявленныйАвто,
	             |	ВЫБОР
	             |		КОГДА ЗаявкаНаБрак.Качество = &Комплектация
	             |			ТОГДА ЗаявкаНаБрак.Комментарий
	             |	КОНЕЦ КАК Комплектация,
	             |	ВЫБОР
	             |		КОГДА ЗаявкаНаБрак.Качество = &Пересорт
	             |			ТОГДА ЗаявкаНаБрак.Комментарий
	             |	КОНЕЦ КАК Пересорт,
	             |	ЗаявкаНаБрак.Картинка,
	             |	ЗаявкаНаБрак.Ссылка.Комментарий,
	             |	ЗаявкаНаБрак.НомерРеализации КАК НомерРеализации1,
	        //    |	ЗаявкаНаБрак.Исследование,
	             |	ЗаявкаНаБрак.Ссылка.СостояниеЗаявки,
	        //     |	ЗаявкаНаБрак.Вывод,
	             |	ЗаявкаНаБрак.НачалоЭкспертизы,
	             |	ЗаявкаНаБрак.ОкончаниеЭкспертизы,
	             |	ЗаявкаНаБрак.Ссылка.Ответственный,
	             |	ЗаявкаНаБрак.Ссылка.ОтветственныйСоСтороныКлиента,
	             |	ЗаявкаНаБрак.Ссылка.Подразделение,
	             |	ЗаявкаНаБрак.ВидБрака,
	             |	ЗаявкаНаБрак.МетодУстранения,
	             |	ЗаявкаНаБрак.Заключение,
	             |	ЗаявкаНаБрак.Действие,
	             |	ЗаявкаНаБрак.Ссылка.КомментарийСклада
	             |ИЗ
	             |	Документ.ЗаявкаНаБрак.Расшифровка КАК ЗаявкаНаБрак
	             |ГДЕ
	             |	ЗаявкаНаБрак.Ссылка = &ссылка";
	             //|	ЗаявкаНаБрак.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК";
	             //|	И ЗаявкаНаБрак.Ссылка.Контрагент = &Контрагент
	             //|	И ЗаявкаНаБрак.Ссылка.ПометкаУдаления = ЛОЖЬ
	             //|	И ЗаявкаНаБрак.Номенклатура <> &Пусто";
				 
				 Запрос.УстановитьПараметр("ДатаН",НачалоДня(СсылкаНаОбъект.Дата));
				 Запрос.УстановитьПараметр("ДатаК",КонецДня(СсылкаНаОбъект.Дата));
				 Запрос.УстановитьПараметр("Контрагент",СсылкаНаОбъект.Контрагент);
				 Запрос.УстановитьПараметр("Номенклатура",Справочники.Номенклатура.ПустаяСсылка());
				 Запрос.УстановитьПараметр("Пусто",Справочники.Номенклатура.ПустаяСсылка());
				 Запрос.УстановитьПараметр("Биение",Справочники.Качество.Биение);
				 Запрос.УстановитьПараметр("ДефектЛитья",Справочники.Качество.ДефектЛитья);
				 Запрос.УстановитьПараметр("ДефектЛКП",Справочники.Качество.ДефектЛКП);
				 Запрос.УстановитьПараметр("Дисбаланс",Справочники.Качество.Дисбаланс);
				 Запрос.УстановитьПараметр("МеханическиеПовреждения",Справочники.Качество.МеханическиеПовреждения);
				 Запрос.УстановитьПараметр("НеПодходитНаЗаявленныйАвто",Справочники.Качество.НеПодходитНаАвто);
				 Запрос.УстановитьПараметр("Комплектация",Справочники.Качество.ДефектКомплектации);
				 Запрос.УстановитьПараметр("Пересорт",Справочники.Качество.Пересорт);
				 Запрос.УстановитьПараметр("Ссылка",СсылкаНаОбъект);
								 
				 Рез=Запрос.Выполнить().Выбрать();

	
	
	ТабДок=Новый ТабличныйДокумент;
	Макет=ПолучитьМакет("МакетЗаключениеЭкспертаКраткое");
	Область=Макет.ПолучитьОбласть("Шапка");
	//Область.Параметры.НачалоЭкспертизы=Формат(СсылкаНаОбъект.НачалоЭкспертизы,"ДФ='dd MMMM yyyy'; ДП=-");
	Область.Параметры.Контрагент=СсылкаНаОбъект.Контрагент.НаименованиеПолное;
	Область.Параметры.НачалоЭкспертизы=Формат(СсылкаНаОбъект.Расшифровка[0].ОкончаниеЭкспертизы,"ДФ='dd MMMM yyyy'; ДП=-");
    ТабДок.Вывести(Область);
	Шина = ложь;
	Пока Рез.Следующий() Цикл
		Область=Макет.ПолучитьОбласть("Строка");
		Если рез.Номенклатура.видТовара = Перечисления.ВидыТоваров.Шины Тогда
			Шина = Истина;
		КонецЕсли;
		Наименование=Рез.Номенклатура.Наименование;
					 Наименование=СтрЗаменить(Наименование," Replica "," ");
					 Наименование=СтрЗаменить(Наименование," replica "," ");
					 Наименование=СтрЗаменить(Наименование," REPLICA "," ");
					 Область.Параметры.Номенклатура=Наименование;

		Область.Параметры.Код=Рез.Номенклатура.Код;
		Область.Параметры.Количество=Рез.Количество;
		Область.Параметры.Видбрака=Рез.Видбрака;
		Область.Параметры.Состояние=Рез.СостояниеДиска;
		Область.Параметры.Заключение=Рез.Заключение;
		Область.Параметры.МетодУстранения=Рез.МетодУстранения;
		Область.Параметры.Действие=Рез.Действие;

		ТабДок.Вывести(Область);
	КонецЦикла;
	Если шина Тогда
	    Область=Макет.ПолучитьОбласть("Подвал1");
    Иначе
	    Область=Макет.ПолучитьОбласть("Подвал");
	КонецЕсли;
		//Область.Параметры.Вывод=Вывод;
	Область.Параметры.ОкончаниеЭкспертизы=Формат(СсылкаНаОбъект.ОкончаниеЭкспертизы,"ДФ='dd MMMM yyyy'; ДП=-");
	ТабДок.Вывести(Область);
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	Возврат ТабДок;
	
КонецФункции

// Возвращает структуру данных со сводным описанием контрагента
//
// Параметры: 
//  СписокСведений - список значений со значенийми параметров организации
//   СписокСведений формируется функцией СведенияОЮрФизЛице
//  Список         - список запрашиваемых параметров организаиии
//  СПрефиксом     - Признак выводить или нет префикс параметра организации
//
// Возвращаемое значение:
//  Строка - описатель организации / контрагента / физ.лица.
//
Функция ОписаниеОрганизацииЗ(СписокСведений, Список = "", СПрефиксом = Истина) Экспорт

	
	Если ПустаяСтрока(Список) Тогда
		Список = "ПолноеНаименование,ИНН,ОГРН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет";
	КонецЕсли; 

	Результат = "";

	СоответствиеПараметров = Новый Соответствие();
	СоответствиеПараметров.Вставить("ПолноеНаименование", " ");
	СоответствиеПараметров.Вставить("ИНН",        " ИНН ");
	СоответствиеПараметров.Вставить("КПП",        " КПП ");
	СоответствиеПараметров.Вставить("ОГРН",        " ОГРН ");
	СоответствиеПараметров.Вставить("ЮридическийАдрес",   " ");
	СоответствиеПараметров.Вставить("Телефоны",   " тел.: ");
	СоответствиеПараметров.Вставить("НомерСчета", " р/с ");
	СоответствиеПараметров.Вставить("Банк",       " в банке ");
	СоответствиеПараметров.Вставить("БИК",        " БИК ");
	СоответствиеПараметров.Вставить("КоррСчет",   " к/с ");
	СоответствиеПараметров.Вставить("КодПоОКПО",  " Код по ОКПО ");

	ЧислоПараметров = СтрЧислоВхождений(Список, ",");
	Для Счетчик = 1 по ЧислоПараметров Цикл

		ПозЗапятой = Найти(Список, ",");

		Если ПозЗапятой > 0  Тогда
			ИмяПараметра = Лев(Список, ПозЗапятой - 1);
			Список = Сред(Список, ПозЗапятой + 1, СтрДлина(Список));

			Попытка
				СтрокаДополнения = "";
				СписокСведений.Свойство(ИмяПараметра, СтрокаДополнения);

				Если ПустаяСтрока(СтрокаДополнения) Тогда
					Продолжить;
				КонецЕсли;

				Префикс = СоответствиеПараметров[ИмяПараметра];
				Если Не ПустаяСтрока(Результат)  Тогда
					Результат = Результат + ",";
				КонецЕсли; 

				Результат = Результат + ?(СПрефиксом = Истина, Префикс, "") + СтрокаДополнения;
			Исключение
				#Если Клиент Тогда
					Сообщить("Не удалось определить значение параметра организации: " + ИмяПараметра, СтатусСообщения.Внимание);
				#КонецЕсли
			КонецПопытки;

		КонецЕсли;

	КонецЦикла;

	Возврат СокрЛП(Результат);

КонецФункции // ОписаниеОрганизации()

                     