
Процедура ДействияФормыДействие(Кнопка)
	
	Настройки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);	
	
	ЭлементыФормы.Результат.Очистить();
	ДокументРезультат = ЭлементыФормы.Результат;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.НачатьВывод();
	
	Пока Истина Цикл
		ОбработкаПрерыванияПользователя();
		ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
		
		Если ЭлементРезультата= Неопределено Тогда
			Прервать;
		Иначе
			
			Если ЭлементРезультата.ЗначенияПараметров.Количество() > 0 Тогда 
				
				ИмяПараметра_СсылкаНаФото = Неопределено;
				
				// Поскольку имена параметров зашиты как "П1, П2..." то нужно понять какой из них нам нужен
				// Для этого идем в макеты и ищем имя параметра в выражении к параметру
				Для каждого ПараметрМакета Из МакетКомпоновки.Макеты[ЭлементРезультата.Макет].Параметры Цикл
					
					Если ТипЗнч(ПараметрМакета) = Тип("ПараметрОбластиВыражениеКомпоновкиДанных") Тогда
						
						Если Найти(ПараметрМакета.Выражение,"photo.yst.ru/allwheels") > 0 Тогда
							ИмяПараметра_СсылкаНаФото = ПараметрМакета.Имя;    
						КонецЕсли; 
						
					КонецЕсли;    
					
				КонецЦикла; 
				
				Если ИмяПараметра_СсылкаНаФото <> Неопределено Тогда
					//Обработка значения поля
					ЭлементРезультата.ЗначенияПараметров[ИмяПараметра_СсылкаНаФото].Значение = НРег(ЭлементРезультата.ЗначенияПараметров[ИмяПараметра_СсылкаНаФото].Значение);
				КонецЕсли; 
								
			КонецЕсли;
							
			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПроцессорВывода.ЗакончитьВывод();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	УстановитьНастройки();

КонецПроцедуры

Процедура УстановитьНастройки()
	
	ПараметрДанныхЯрославль = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1];   //при выборе этого варианта все равно запрос по продажам выполняется,т.о. сокращается скорость
	ПараметрДанныхЯрославль.Значение = Справочники.Подразделения.НайтиПоКоду("00005");
	ПараметрДанныхЯрославль.Использование = Истина;
	
	Настройки = КомпоновщикНастроек.Настройки;
		
КонецПроцедуры

