
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	ТабДокумент = новый ТабличныйДокумент;
	
	Если фл315 тогда
		Макет = ЭтотОбъект.ПолучитьМакет("Макет315");
		ОбластьМакетаШапка = Макет.ПолучитьОбласть("Ячейка");
//		ОбластьМакета = Макет.ПолучитьОбласть("Ячейка"); //ШК в Шапке!
		КолНаЛисте = 8;
	иначе
		Макет = ЭтотОбъект.ПолучитьМакет("Макет");
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакетаШапка = Макет.ПолучитьОбласть("Ячейка");
		КолНаЛисте = 2;
	КонецЕсли;
	
	//+++ Штрих-Код номера документа - февраль 2012
	// требуется установленная компонента 1CBarCode.exe
n = 0;
	для ряд=ряд0 по ряд1 цикл
		для яч=яч0 по яч1 цикл
			для пм=пм0 по пм1 цикл
		ОбластьМакетаШапка.Параметры.А   = "Ц";
		ОбластьМакетаШапка.Параметры.Код   = строка(КолЭтажей)+ДелЭР+строка(ряд)+ДелЭР+формат(яч,"ЧЦ=2; ЧВН=")
												+?( пм=0,"", ДелЭР
															+формат(пм, "ЧЦ=2; ЧВН=") );
		
		ОбластьМакетаШапка.Параметры.расшифровка = строка(Преф)+строка(КолЭтажей)+ДелЭР
															+строка(ряд)+ ДелЭР
															+формат(яч,"ЧЦ=2; ЧВН=")+ДелЭР
															+формат(пм, "ЧЦ=2; ЧН=00; ЧВН=");
		
		    ОбШтрихКодСообщение = "3"+ строка(КолЭтажей) + строка(ряд) + формат(яч,"ЧЦ=2; ЧВН=")+формат(пм, "ЧЦ=2; ЧН=00; ЧВН=");
			ОбШтрихКодСообщение = ОбШтрихКодСообщение  + КонтрольныйСимволEAN(ОбШтрихКодСообщение, 8);

		Если фл315 тогда // сразу в шапке!
			ОбШтрихКод=ОбластьМакетаШапка.Рисунки.ШК1.Объект;
		иначе
			ОбШтрихКод=ОбластьМакета.Рисунки.ШК1.Объект;
	    КонецЕсли;
			ОбШтрихКод.Сообщение = ОбШтрихКодСообщение; 
			ОбШтрихКод.ТекстКода = лев(ОбШтрихКодСообщение,7); 
				
		 ТабДокумент.Вывести( ОбластьМакетаШапка );
	   	 Если НЕ фл315 тогда
			 ТабДокумент.Вывести(ОбластьМакета);
		 КонецЕсли;	
		 
		 n=n+1;
		 если n%КолНаЛисте=0 тогда // по 2 на лист!
		 	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	 	 КонецЕсли;
	 
		 КонецЦикла;
		КонецЦикла;	
	КонецЦикла;//ряд
	
	//+++)
	ТабДокумент.Показать();
	
КонецПроцедуры



Процедура ПриОткрытии()
	//5000
	//Сектор0 = 1;   	Сектор1 = 1;
	// Ряд0 = 1; Ряд1 = 8;
	//ПМ0  = 1;  ПМ1 = 16; 
	//КолЭтажей = 5;
	//
	////4000
	//Сектор0 = 0;   	Сектор1 = 0;
	// Ряд0 = 0; Ряд1 = 9;
	//ПМ0  = 1;  ПМ1 = 9; 
	//КолЭтажей = 4;
	
	//все Ангары - имеют префик 4
	Ряд0 = 51; Ряд1 = 56;
	ПМ0  = 1;  ПМ1 = 23; 
	КолЭтажей = 4;
	Преф = 4;
	
	
	ДелЭР=","; 
КонецПроцедуры



// Функция вычисляет контрольный символ кода EAN
//
// Параметры:
//  ШтрихКод     - штрих-код (без контрольной цифры)
//  Тип          - тип штрих-кода: 13 - EAN13, 8 - EAN8
//
// Возвращаемое значение:
//  Контрольный символ штрих-кода
//
Функция КонтрольныйСимволEAN_лок(ШтрихКод, Тип) 
	
	Четн   = 0;
	Нечетн = 0;
	
	КоличествоИтераций = ?(Тип = 13, 6, 4);
	
	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) и (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Число(Сред(ШтрихКод, 2 * Индекс, 1));
		КонецЕсли;
		Нечетн = Нечетн + Число(Сред(ШтрихКод, 2 * Индекс - 1, 1));
	КонецЦикла;
	
	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;
	
	КонтЦифра = 10 - (Четн + Нечетн) % 10;
	
	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));
	
КонецФункции // КонтрольныйСимволEAN()

