Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("причина"));
    Если Параметр <> Неопределено Тогда
        Параметр.Значение = Перечисления.ПричиныВозвратаТовара.ВозвратСМаршрута;
        Параметр.Использование = Истина;
	КонецЕсли;
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
    Если Параметр <> Неопределено Тогда
        Параметр.Значение = НачалоДня(ДатаНачала);
        Параметр.Использование = Истина;
	КонецЕсли;
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
    Если Параметр <> Неопределено Тогда
        Параметр.Значение = КонецДня(ДатаКонца);
        Параметр.Использование = Истина;
	КонецЕсли;
КонецПроцедуры
