Перем СписокИсключаемыхНаправлений;

Процедура КнопкаВыполнитьНажатие(Кнопка)
	НачатьТранзакцию();
	//очистим старые планы
	СписокМенеджеров = новый СписокЗначений;
	ДобавитьВСписокМенеджеров(ЭлементыФормы.Продажи.Значение,СписокМенеджеров);
	
	Для каждого Менеджер из СписокМенеджеров Цикл
		НаборЗаписей = РегистрыСведений.МесячныйПланПродаж.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПериодПланирования.Установить(НачПериода);
		НаборЗаписей.Отбор.Менеджер.Установить(Менеджер.Значение);
		НаборЗаписей.Записать();
	КонецЦикла;
	
	//
	ЗаписатьВРегистр(ЭлементыФормы.Продажи.Значение, НачПериода);
	ЗафиксироватьТранзакцию();
КонецПроцедуры

 Процедура ДобавитьВСписокМенеджеров(Дерево,Список)
	 Для каждого стр из Дерево.Строки цикл
		 Если стр.Строки.Количество()=0 тогда
			 Если  ЗначениеЗаполнено(стр.Менеджер) тогда
				 Если Список.НайтиПоЗначению(стр.Менеджер)=неопределено тогда
					 Список.Добавить(стр.Менеджер);
				 КонецЕсли;
			 КонецЕсли;
		 иначе
			 ДобавитьВСписокМенеджеров(стр,Список);
		 КонецЕсли;
	 КонецЦикла;
 КонецПроцедуры


процедура ЗаписатьВРегистр(строка, МесяцПланирования, НаправлениеПродаж = неопределено)
	 Для каждого стр из Строка.Строки Цикл
		  Если стр.Строки.Количество()=0 тогда
			  Если ЗначениеЗаполнено(стр.НоменклатурнаяГруппа) и (стр.КоличествоПлан<>0 или стр.СуммаПлан<>0) тогда
				  Запись = РегистрыСведений.МесячныйПланПродаж.СоздатьМенеджерЗаписи();
				  Запись.ПериодПланирования = МесяцПланирования;
				  ЗаполнитьЗначенияСвойств(Запись,стр);
				  Если НаправлениеПродаж<>неопределено тогда
					  Запись.НаправлениеПродаж = НаправлениеПродаж; 
				  КонецЕсли;
				  Запись.Записать(Истина);
			  КонецЕсли;
		 иначе
		   ЗаписатьВРегистр(стр, МесяцПланирования,НаправлениеПродаж);	  	 
		 Конецесли;	  
	конецЦикла;	 
конецПроцедуры

Процедура кнЗаполнитьНажатие(Элемент)
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ПродажиОбороты.Номенклатура.НоменклатурнаяГруппа,
	             |	ПродажиОбороты.ДоговорКонтрагента.ОтветственноеЛицо,
	             |	ПродажиОбороты.КоличествоОборот,
	             |	ПродажиОбороты.СтоимостьОборот,
	             |	ПродажиОбороты.ДоговорКонтрагента.ОтветственноеЛицо.НаправлениеПродаж
	             |ПОМЕСТИТЬ втПродажиАналогичногоПериодаПрошлогоГода
	             |ИЗ
	             |	РегистрНакопления.Продажи.Обороты(
	             |			ДОБАВИТЬКДАТЕ(&ДатаНач, МЕСЯЦ, -12),
	             |			ДОБАВИТЬКДАТЕ(&ДатаКон, МЕСЯЦ, -12),
	             |			,
	             |			НЕ ДоговорКонтрагента.ОтветственноеЛицо.НаправлениеПродаж В (&СписокИсключаемыхНаправлений)
	             |				И Номенклатура.Услуга = ЛОЖЬ
	             |				И Номенклатура.НоменклатурнаяГруппа <> ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
	             |				И 99 = 99
	             |				И Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)) КАК ПродажиОбороты
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ПродажиОбороты.Номенклатура.НоменклатурнаяГруппа,
	             |	ПродажиОбороты.ДоговорКонтрагента.ОтветственноеЛицо,
	             |	ПродажиОбороты.КоличествоОборот,
	             |	ПродажиОбороты.СтоимостьОборот,
	             |	ПродажиОбороты.ДоговорКонтрагента.ОтветственноеЛицо.НаправлениеПродаж
	             |ПОМЕСТИТЬ втПродажиПрошлогоМесяца
	             |ИЗ
	             |	РегистрНакопления.Продажи.Обороты(
	             |			ДОБАВИТЬКДАТЕ(&ДатаНач, МЕСЯЦ, -1),
	             |			ДОБАВИТЬКДАТЕ(&ДатаКон, МЕСЯЦ, -1),
	             |			,
	             |			НЕ ДоговорКонтрагента.ОтветственноеЛицо.НаправлениеПродаж В (&СписокИсключаемыхНаправлений)
	             |				И Номенклатура.Услуга = ЛОЖЬ
	             |				И Номенклатура.НоменклатурнаяГруппа <> ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
	             |				И 99 = 99
	             |				И Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)) КАК ПродажиОбороты
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	А.НоменклатураНоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	             |	А.ДоговорКонтрагентаОтветственноеЛицо КАК Менеджер,
	             |	СУММА(А.КоличествоПрошлыйМесяц) КАК КоличествоПрошлыйМесяц,
	             |	СУММА(А.СтоимостьПрошлыйМесяц) КАК СтоимостьПрошлыйМесяц,
	             |	СУММА(А.КоличествоПрошлыйГод) КАК КоличествоПрошлыйГод,
	             |	СУММА(А.СтоимостьПрошлыйГод) КАК СтоимостьПрошлыйГод,
	             |	А.ДоговорКонтрагентаОтветственноеЛицоНаправлениеПродаж КАК НаправлениеПродаж,
	             |	СУММА(А.СуммаПлан) КАК СуммаПлан,
	             |	СУММА(А.КоличествоПлан) КАК КоличествоПлан
	             |ПОМЕСТИТЬ вт
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		втПродажиПрошлогоМесяца.НоменклатураНоменклатурнаяГруппа КАК НоменклатураНоменклатурнаяГруппа,
	             |		втПродажиПрошлогоМесяца.ДоговорКонтрагентаОтветственноеЛицо КАК ДоговорКонтрагентаОтветственноеЛицо,
	             |		втПродажиПрошлогоМесяца.КоличествоОборот КАК КоличествоПрошлыйМесяц,
	             |		втПродажиПрошлогоМесяца.СтоимостьОборот КАК СтоимостьПрошлыйМесяц,
	             |		0 КАК КоличествоПрошлыйГод,
	             |		0 КАК СтоимостьПрошлыйГод,
	             |		втПродажиПрошлогоМесяца.ДоговорКонтрагентаОтветственноеЛицоНаправлениеПродаж КАК ДоговорКонтрагентаОтветственноеЛицоНаправлениеПродаж,
	             |		0 КАК КоличествоПлан,
	             |		0 КАК СуммаПлан
	             |	ИЗ
	             |		втПродажиПрошлогоМесяца КАК втПродажиПрошлогоМесяца
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ
	             |		втПродажиАналогичногоПериодаПрошлогоГода.НоменклатураНоменклатурнаяГруппа,
	             |		втПродажиАналогичногоПериодаПрошлогоГода.ДоговорКонтрагентаОтветственноеЛицо,
	             |		0,
	             |		0,
	             |		втПродажиАналогичногоПериодаПрошлогоГода.КоличествоОборот,
	             |		втПродажиАналогичногоПериодаПрошлогоГода.СтоимостьОборот,
	             |		втПродажиАналогичногоПериодаПрошлогоГода.ДоговорКонтрагентаОтветственноеЛицоНаправлениеПродаж,
	             |		0,
	             |		0
	             |	ИЗ
	             |		втПродажиАналогичногоПериодаПрошлогоГода КАК втПродажиАналогичногоПериодаПрошлогоГода
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ
	             |		МесячныйПланПродаж.НоменклатурнаяГруппа,
	             |		МесячныйПланПродаж.Менеджер,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		МесячныйПланПродаж.НаправлениеПродаж,
	             |		МесячныйПланПродаж.КоличествоПлан,
	             |		МесячныйПланПродаж.СуммаПлан
	             |	ИЗ
	             |		РегистрСведений.МесячныйПланПродаж КАК МесячныйПланПродаж
	             |	ГДЕ
	             |		МесячныйПланПродаж.ПериодПланирования = &ДатаНач
	             |		И НЕ МесячныйПланПродаж.НаправлениеПродаж В (&СписокИсключаемыхНаправлений)
	             |		И 88 = 88) КАК А
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	А.НоменклатураНоменклатурнаяГруппа,
	             |	А.ДоговорКонтрагентаОтветственноеЛицо,
	             |	А.ДоговорКонтрагентаОтветственноеЛицоНаправлениеПродаж
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	вт.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	             |	вт.Менеджер КАК Менеджер,
	             |	вт.КоличествоПрошлыйМесяц КАК КоличествоПрошлыйМесяц,
	             |	вт.СтоимостьПрошлыйМесяц КАК СтоимостьПрошлыйМесяц,
	             |	вт.КоличествоПрошлыйГод КАК КоличествоПрошлыйГод,
	             |	вт.СтоимостьПрошлыйГод КАК СтоимостьПрошлыйГод,
	             |	вт.НаправлениеПродаж КАК НаправлениеПродаж,
	             |	вт.СуммаПлан КАК СуммаПлан,
	             |	вт.КоличествоПлан КАК КоличествоПлан,
	             |	ВЫБОР
	             |		КОГДА вт.СтоимостьПрошлыйГод <> 0
	             |			ТОГДА (вт.СуммаПлан / вт.СтоимостьПрошлыйГод - 1) * 100
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК ПриростПродажПлан
	             |ИЗ
	             |	вт КАК вт
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	НаправлениеПродаж,
	             |	Менеджер,
	             |	НоменклатурнаяГруппа
	             |ИТОГИ
	             |	СУММА(КоличествоПрошлыйМесяц),
	             |	СУММА(СтоимостьПрошлыйМесяц),
	             |	СУММА(КоличествоПрошлыйГод),
	             |	СУММА(СтоимостьПрошлыйГод),
	             |	СУММА(СуммаПлан),
	             |	СУММА(КоличествоПлан),
	             |	ВЫБОР
	             |		КОГДА СУММА(СтоимостьПрошлыйГод) <> 0
	             |			ТОГДА (СУММА(СуммаПлан) / СУММА(СтоимостьПрошлыйГод) - 1) * 100
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК ПриростПродажПлан
	             |ПО
	             |	ОБЩИЕ,
	             |	НаправлениеПродаж,
	             |	Менеджер
	             |АВТОУПОРЯДОЧИВАНИЕ";
				 Запрос.УстановитьПараметр("ДатаНач",НачПериода);
				 Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(НачПериода));
				 Запрос.УстановитьПараметр("НаправлениеПродаж",НаправлениеПродаж);
				 Запрос.УстановитьПараметр("СписокИсключаемыхНаправлений",СписокИсключаемыхНаправлений);
				 
				 Если ЗначениеЗаполнено(НаправлениеПродаж) тогда
					 Запрос.Текст = СтрЗаменить(Запрос.Текст,"99 = 99","ДоговорКонтрагента.ОтветственноеЛицо.НаправлениеПродаж в (&НаправлениеПродаж)");
					 Запрос.Текст = СтрЗаменить(Запрос.Текст,"88 = 88","МесячныйПланПродаж.НаправлениеПродаж в (&НаправлениеПродаж)");
				 КонецЕсли;
				 
				 Результат = Запрос.Выполнить();
	
	Элементыформы.Продажи.Значение = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);


КонецПроцедуры

Процедура НачПериодаПриИзменении(Элемент)
	КонПериода = КонецМесяца(НачПериода);
КонецПроцедуры

Процедура ПродажиПриПолученииДанных(Элемент, ОформленияСтрок)
	Для каждого ОформлениеСтроки из Оформлениястрок Цикл
		
		ОформлениеСтроки.Ячейки.ПрошлыйГод.Видимость = ЛожЬ; 	
		ОформлениеСтроки.Ячейки.ПрошлыйМесяц.Видимость = ЛожЬ; 
		ОформлениеСтроки.Ячейки.План.Видимость = ЛожЬ;
	КонецЦикла;
КонецПроцедуры

Процедура ПродажиОжидаемыйПриростПродажПриИзменении(Элемент)
	стр = ЭлементыФормы.Продажи.текущиеДанные;
	ПриростПродаж = стр.ПриростПродажПлан;
	//стр.ПриростПродажПлан = приростПродаж;
	стр.КоличествоПлан = Окр(стр.КоличествоПрошлыйГод*(1+приростПродаж/100),0);
	стр.СуммаПлан = Окр(стр.СтоимостьПрошлыйГод*(1+приростПродаж/100),0);
                
		
	РассчитатьКоличествоПлан(стр,ПриростПродаж);
	пересчетИтогов(стр);
	
КонецПроцедуры

процедура РассчитатьКоличествоПлан(ТекСтрока,ПриростПродаж)
	Для каждого стр из  ТекСтрока.Строки Цикл
		стр.ПриростПродажПлан = приростПродаж;
		стр.КоличествоПлан = Окр(стр.количествоПрошлыйГод*(1+приростПродаж/100),0);
        стр.СуммаПлан = Окр(стр.СтоимостьПрошлыйГод*(1+приростПродаж/100),0);
		
		РассчитатьКоличествоПлан(стр,ПриростПродаж);
		пересчетИтогов(стр);
	конеццикла;	
конецПроцедуры

процедура 	пересчетИтогов(стр);
	РодительскаяСтрока = Стр.Родитель;
	Если РодительскаяСтрока <> Неопределено Тогда
		приростПродажплан =0;
		Количествоплан =0;
		СуммаПлан =0;
		КоличествоСтрок =0;
		Для каждого ст из РодительскаяСтрока.Строки  Цикл
			приростПродажплан =приростПродажплан+ст.приростПродажплан;
			Количествоплан =Количествоплан+ст.Количествоплан;
			СуммаПлан =СуммаПлан+ст.СуммаПлан;
			КоличествоСтрок =КоличествоСтрок+1;
		конецЦикла; 
		
		если РодительскаяСтрока.количествоПрошлыйГод=0 Тогда
			РодительскаяСтрока.приростПродажплан =0;
		иначеесли  не ЗначениеЗаполнено(РодительскаяСтрока.НоменклатурнаяГруппа)  тогда
			РодительскаяСтрока.приростПродажплан =Окр((СуммаПлан-РодительскаяСтрока.СтоимостьПрошлыйГод)/РодительскаяСтрока.СтоимостьПрошлыйГод*100,2);
		иначе
			РодительскаяСтрока.приростПродажплан =Окр((КоличествоПлан-РодительскаяСтрока.количествоПрошлыйГод)/РодительскаяСтрока.количествоПрошлыйГод*100,2);
		конецЕсли;
		РодительскаяСтрока.Количествоплан =Количествоплан;
		РодительскаяСтрока.СуммаПлан =СуммаПлан;
		
		пересчетИтогов(РодительскаяСтрока);	 
	конецЕсли;	 
конецПроцедуры

Процедура НаправлениеПродажПриИзменении(Элемент)
	Видимость();
КонецПроцедуры

Процедура Видимость()
	Если глТекущийПользователь = Справочники.Пользователи.НайтиПоКоду("Малышев Егор") или глТекущийПользователь = Справочники.Пользователи.НайтиПоКоду("Никитин М.И.")   тогда //только отдел дисков
		НаправлениеПродаж.Очистить();
		НаправлениеПродаж.Добавить(Справочники.НаправленияПродаж.Диски);
	ИначеЕсли глТекущийПользователь = Справочники.Пользователи.НайтиПоКоду("Бондаренко Е.Д. (снабжение)") или глТекущийПользователь = Справочники.Пользователи.НайтиПоКоду("Серков")  тогда //только департамент продаж
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	НаправленияПродаж.Ссылка
		               |ИЗ
		               |	Справочник.НаправленияПродаж КАК НаправленияПродаж
		               |ГДЕ
		               |	НаправленияПродаж.Ссылка В ИЕРАРХИИ(&ДП)
		               |	И НаправленияПродаж.ЭтоГруппа = ЛОЖЬ";
		Запрос.УстановитьПараметр("ДП",Справочники.НаправленияПродаж.НайтиПоКоду("26"));			   
		Рез = Запрос.Выполнить().Выбрать();
		
		НаправлениеПродаж.Очистить();
		
		Пока рез.Следующий() цикл
			НаправлениеПродаж.Добавить(Рез.Ссылка);
		КонецЦикла;
	ИначеЕсли рольДоступна("ПравоЗавершенияРаботыПользователей") тогда
	иначе
		НаправлениеПродаж.Очистить();
	КонецЕсли;
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	Если рольДоступна("ПравоЗавершенияРаботыПользователей") 
		или глТекущийПользователь = Справочники.Пользователи.НайтиПоКоду("Малышев Егор") 
		или глТекущийПользователь = Справочники.Пользователи.НайтиПоКоду("Никитин М.И.") 
		или глТекущийПользователь = Справочники.Пользователи.НайтиПоКоду("Бондаренко Е.Д. (снабжение)") 
		или глТекущийПользователь = Справочники.Пользователи.НайтиПоКоду("Серков") тогда
	иначе
		возврат;
	КонецЕсли;
		
	Видимость();
КонецПроцедуры

Процедура кнОчиститьНажатие(Элемент)
	Ответ = Вопрос("Вы действительно хотите удалить планы?",РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;

	Если НаправлениеПродаж.Количество() = 0 и рольДоступна("ПравоЗавершенияРаботыПользователей") тогда
		НаборЗаписей = РегистрыСведений.МесячныйПланПродаж.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПериодПланирования.Установить(НачПериода);
		НаборЗаписей.Записать();
	иначе
		Для каждого Направление из НаправлениеПродаж Цикл
			НаборЗаписей = РегистрыСведений.МесячныйПланПродаж.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПериодПланирования.Установить(НачПериода);
			НаборЗаписей.Отбор.НаправлениеПродаж.Установить(Направление.Значение);
			НаборЗаписей.Записать();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


СписокИсключаемыхНаправлений = новый СписокЗначений;
СписокИсключаемыхНаправлений.Добавить(Справочники.НаправленияПродаж.ПустаяСсылка());
СписокИсключаемыхНаправлений.Добавить(Справочники.НаправленияПродаж.НайтиПоКоду("16")); //колеса тут
