
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	Запрос = новый Запрос;

	//ЭтотОбъект.Прочитать();
	Таб =  ЭтотОбъект.Выгрузить(,"Период, Приоритет, Производитель, Модель, НоменклатурнаяГруппа, Диаметр, Номенклатура");
	Запрос.УстановитьПараметр("тзЗаписей",Таб);
	Запрос.Текст="ВЫБРАТЬ
	             |	тзЗаписей.Период,
	             |	тзЗаписей.Приоритет,
	             |	тзЗаписей.Производитель,
	             |	тзЗаписей.Модель,
	             |	тзЗаписей.НоменклатурнаяГруппа,
	             |	тзЗаписей.Диаметр,
	             |	тзЗаписей.Номенклатура
	             |ПОМЕСТИТЬ втЗаписей
	             |ИЗ
	             |	&тзЗаписей КАК тзЗаписей
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	втЗаписей.Период,
	             |	втЗаписей.Приоритет,
	             |	втЗаписей.Производитель,
	             |	втЗаписей.Модель,
	             |	втЗаписей.НоменклатурнаяГруппа,
	             |	втЗаписей.Диаметр
	             |ИЗ
	             |	втЗаписей КАК втЗаписей
	             |ГДЕ
	             |	НЕ (втЗаписей.Период, втЗаписей.Приоритет, втЗаписей.Производитель, втЗаписей.Модель, втЗаписей.НоменклатурнаяГруппа, втЗаписей.Диаметр, втЗаписей.Номенклатура) В
	             |				(ВЫБРАТЬ
	             |					БонусыПоставщиковИнтернетМагазина.Период,
	             |					БонусыПоставщиковИнтернетМагазина.Приоритет,
	             |					БонусыПоставщиковИнтернетМагазина.Производитель,
	             |					БонусыПоставщиковИнтернетМагазина.Модель,
	             |					БонусыПоставщиковИнтернетМагазина.НоменклатурнаяГруппа,
	             |					БонусыПоставщиковИнтернетМагазина.Диаметр,
	             |					БонусыПоставщиковИнтернетМагазина.Номенклатура
	             |				ИЗ
	             |					РегистрСведений.БонусыПоставщиковИнтернетМагазина КАК БонусыПоставщиковИнтернетМагазина)
	             |	И (втЗаписей.Период, втЗаписей.Приоритет) В
	             |			(ВЫБРАТЬ
	             |				БонусыПоставщиковИнтернетМагазина.Период,
	             |				БонусыПоставщиковИнтернетМагазина.Приоритет
	             |			ИЗ
	             |				РегистрСведений.БонусыПоставщиковИнтернетМагазина КАК БонусыПоставщиковИнтернетМагазина)";
				 
				 Рез = Запрос.Выполнить().Выбрать();
				 Пока Рез.Следующий() Цикл
					 Сообщить("В периоде "+ рез.Период+" уже есть правило с приоритетом "+рез.Приоритет);
					 Отказ = истина;
				 КонецЦикла;

КонецПроцедуры
