
Процедура ПриОткрытии()
	Менеджер  = глТекущийПользователь;
	ДатаСреза = началоДня(ТекущаяДата());
	
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Менеджер");
   ПараметрСКД.Значение  = Менеджер;
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаСреза");
   ПараметрСКД.Значение  = ДатаСреза;
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Предоплата");
   ПараметрСКД.Значение  =Справочники.ТипыДоговоров.НайтиПоКоду("00001");
КонецПроцедуры

Процедура МенеджерПриИзменении(Элемент)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Менеджер");
   ПараметрСКД.Значение  = Менеджер;
КонецПроцедуры

Процедура ДатаСрезаПриИзменении(Элемент)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаСреза");
   ПараметрСКД.Значение  = ДатаСреза;
КонецПроцедуры
