перем Категория;


Процедура ПриОткрытии()
ОбновитьСписок();

Если РольДоступна("ПолныеПрава") или РольДоступна("ПравоЗавершенияРаботыПользователей") тогда
	ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Выполнить.Доступность = истина;
КонецЕсли;	
	
КонецПроцедуры

Процедура ОбновитьСписок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(ПолныйСписок.Флаг) КАК Флаг,
		|	ПолныйСписок.Контрагент КАК Контрагент,
		|	МАКСИМУМ(ПолныйСписок.ЗапретитьВводЗаказаПокупателя) КАК ЗапретитьВводЗаказаПокупателя,
		|	МАКСИМУМ(ПолныйСписок.ЗапретОтгрузки) КАК ЗапретОтгрузки,
		|	МАКСИМУМ(ПолныйСписок.Ответчик) КАК Ответчик,
		|	МАКСИМУМ(ПолныйСписок.ОбъектЗапретитьШины) КАК ЗапретитьШины,
		|	МАКСИМУМ(ПолныйСписок.ОбъектЗапретитьДиски) КАК ЗапретитьДиски,
		|	МАКСИМУМ(ПолныйСписок.ОбъектЗапретитьАКБ) КАК ЗапретитьАКБ,
		|	МАКСИМУМ(ПолныйСписок.ОбъектЗапретитьАксы) КАК ЗапретитьАксы
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЛОЖЬ КАК Флаг,
		|		КатегорииОбъектов.Объект КАК Контрагент,
		|		КатегорииОбъектов.Объект.ЗапретитьВводЗаказаПокупателя КАК ЗапретитьВводЗаказаПокупателя,
		|		КатегорииОбъектов.Объект.ЗапретОтгрузки КАК ЗапретОтгрузки,
		|		ИСТИНА КАК Ответчик,
		|		КатегорииОбъектов.Объект.ЗапретитьШины КАК ОбъектЗапретитьШины,
		|		КатегорииОбъектов.Объект.ЗапретитьДиски КАК ОбъектЗапретитьДиски,
		|		КатегорииОбъектов.Объект.ЗапретитьАКБ КАК ОбъектЗапретитьАКБ,
		|		КатегорииОбъектов.Объект.ЗапретитьАксы КАК ОбъектЗапретитьАксы
		|	ИЗ
		|		РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
		|	ГДЕ
		|		КатегорииОбъектов.Категория = &Категория
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЛОЖЬ,
		|		Контрагенты.Ссылка,
		|		Контрагенты.ЗапретитьВводЗаказаПокупателя,
		|		Контрагенты.ЗапретОтгрузки,
		|		ЛОЖЬ,
		|		Контрагенты.ЗапретитьШины,
		|		Контрагенты.ЗапретитьДиски,
		|		Контрагенты.ЗапретитьАКБ,
		|		Контрагенты.ЗапретитьАксы
		|	ИЗ
		|		Справочник.Контрагенты КАК Контрагенты
		|	ГДЕ
		|		(Контрагенты.ЗапретитьВводЗаказаПокупателя
		|				ИЛИ Контрагенты.ЗапретОтгрузки)
		|		И Контрагенты.ПометкаУдаления = ЛОЖЬ
		|		И НЕ Контрагенты.Наименование ПОДОБНО ""(Д)%"") КАК ПолныйСписок
		|
		|СГРУППИРОВАТЬ ПО
		|	ПолныйСписок.Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Категория", Категория);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Контрагенты.Очистить();
	Контрагенты = РезультатЗапроса.Выгрузить();
	
конецПроцедуры	

Процедура КоманднаяПанель1Обновить(Кнопка)
ОбновитьСписок();
КонецПроцедуры

Процедура КонтрагентыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НоваяСтрока и ЭлементыФормы.Контрагенты.ТекущиеДанные.Контрагент<>Справочники.Контрагенты.ПустаяСсылка() Тогда
		ответ = Вопрос("Установить для контрагента категорию ответчики по судам?",РежимДиалогаВопрос.ДаНет);	
		Если ответ = КодВозвратаДиалога.Да Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Контрагент",ЭлементыФормы.Контрагенты.ТекущиеДанные.Контрагент);
		ЕстьУже = Контрагенты.НайтиСтроки(Отбор);
		Если ЕстьУже.количество()>1 Тогда
			предупреждение("Контрагент уже есть в списке!");	
			Контрагенты.Удалить(ЭлементыФормы.Контрагенты.ТекущиеДанные);
		иначе
			МенеджерЗаписи = РегистрыСведений.КатегорииОбъектов.СоздатьМенеджерЗаписи(); 
			МенеджерЗаписи.Объект   = ЭлементыФормы.Контрагенты.ТекущиеДанные.Контрагент; 
			МенеджерЗаписи.Категория = Категория; 
			МенеджерЗаписи.Записать(); 
			
			 ЭлементыФормы.Контрагенты.ТекущиеДанные.Ответчик = истина;
		КонецЕсли;
		//иначе	
		//	Контрагенты.Удалить(ЭлементыФормы.Контрагенты.ТекущиеДанные);
		конецЕсли;	
	Иначе // сразу меняем!
	ЭлементыФормы.Контрагенты.ТекущиеДанные.Флаг = истина;	
	КонецЕсли;	
КонецПроцедуры

Процедура КонтрагентыПередУдалением(Элемент, Отказ)
	//ответ = Вопрос("Удалить контрагента категорию ответчики по судам?",РежимДиалогаВопрос.ДаНет);	
	//Если ответ = КодВозвратаДиалога.Да Тогда
		МенеджерЗаписи = РегистрыСведений.КатегорииОбъектов.СоздатьМенеджерЗаписи(); 
        МенеджерЗаписи.Объект   = ЭлементыФормы.Контрагенты.ТекущиеДанные.Контрагент; 
        МенеджерЗаписи.Категория = Категория; 
        МенеджерЗаписи.Удалить(); 
	//иначе	
	//отказ =Истина;	
	//конецЕсли;	
КонецПроцедуры

Процедура КонтрагентыПередНачаломИзменения(Элемент, Отказ)
	Элемент.Колонки.Контрагент.ЭлементУправления.КнопкаВыбора = Ложь;
КонецПроцедуры

Процедура КонтрагентыПередНачаломДобавления(Элемент, Отказ, Копирование)
	Элемент.Колонки.Контрагент.ЭлементУправления.КнопкаВыбора = Истина;
КонецПроцедуры


процедура Флаги(уст=0)
	для каждого стр1 из Контрагенты цикл
		стр1.Флаг = (уст=1);
	КонецЦикла;	
КонецПроцедуры	

Процедура КоманднаяПанель1Установить(Кнопка)
	Флаги(1);
КонецПроцедуры

Процедура КоманднаяПанель1Убрать(Кнопка)
	Флаги(0);
КонецПроцедуры

Процедура КоманднаяПанель1Заказы(Кнопка)
	Если Вопрос("Запретить ввод заказов для всех выбранных клиентов?", РежимДиалогаВопрос.ДаНет)<>КодВозвратаДиалога.Да тогда
		возврат;
	КонецЕсли;	
	ЗапретНовый("ЗапретитьВводЗаказаПокупателя", Истина);
КонецПроцедуры

Процедура КоманднаяПанель1Отгрузки(Кнопка)
	Если Вопрос("Запретить отгрузки для всех выбранных клиентов?", РежимДиалогаВопрос.ДаНет)<>КодВозвратаДиалога.Да тогда
		возврат;
	КонецЕсли;	
	ЗапретНовый("ЗапретОтгрузки", Истина);
КонецПроцедуры

процедура Запрет(уст=0, ВЫКЛЮЧИТЬ=ложь)
	N=0;
	для каждого стр1 из Контрагенты цикл
		если не стр1.Флаг тогда
			продолжить;
		КонецЕсли;
		
//================можно выключать?!==========================	
	Если ВЫКЛЮЧИТЬ тогда
		Если уст=1 тогда
			стр1.ЗапретитьВводЗаказаПокупателя = истина;
		иначе
			стр1.ЗапретОтгрузки = истина;
		КонецЕсли;
	КонецЕсли;
	
	
		попытка
			Контр = стр1.Контрагент.ПолучитьОбъект();
			Если уст=1 тогда
				Контр.ЗапретитьВводЗаказаПокупателя = стр1.ЗапретитьВводЗаказаПокупателя;
			иначе
				Контр.ЗапретОтгрузки = стр1.ЗапретОтгрузки;
			КонецЕсли;	
				сообщить(?(уст=1, "["+?(Контр.ЗапретитьВводЗаказаПокупателя,"v"," ")+"] Запрет Ввода Заказа",
					        "["+?(Контр.ЗапретОтгрузки,"v"," ")+"] Запрет Отгрузки")
							+" установлен у контрагента: "+строка(Контр), СтатусСообщения.Информация);
			Контр.Записать();
		N=N+1;							
		Исключение
			сообщить("Не удалось записать контрагента: "+строка(Контр)+" : "+ОписаниеОшибки(), СтатусСообщения.Внимание);
		КонецПопытки;
	
	КонецЦикла;	
	
	Если N=0 тогда
		Предупреждение("Не выбраны клиенты для установки флага "+?(уст=1, "'Запрет Ввода Заказа'","'Запрет Отгрузки'"),30);
	КонецЕсли;	
	
КонецПроцедуры	

//+Лукьяненков 2017.10.09
//Наименование колонок = наименованию реквизитов у контрагента
Процедура ЗапретНовый(КолонкиЗапретов = "ЗапретитьШины, ЗапретитьДиски, ЗапретитьАКБ, ЗапретитьАксы", ИстинаЛожь = Неопределено) 
	
	МассивКолонокДляЗаписи = Новый Массив;
	КолонкиЗапретов = СтрЗаменить(КолонкиЗапретов,",",Символы.ПС);
	Для Счетчик=1 По СтрЧислоСтрок(КолонкиЗапретов) Цикл
		МассивКолонокДляЗаписи.Добавить(СтрПолучитьСтроку(КолонкиЗапретов,Счетчик));
		МассивКолонокДляЗаписи[Счетчик-1] = СокрЛП(МассивКолонокДляЗаписи[Счетчик-1]);
	КонецЦикла;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Флаг", Истина);
	МассивКонтрагентовДляЗаписи = Контрагенты.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого СтрокаКонтрагента Из МассивКонтрагентовДляЗаписи Цикл
		
		КонтрагентОбъект = СтрокаКонтрагента.Контрагент.ПолучитьОбъект();
		
		ТекстСообщенияОбщий = "";
		
		Для каждого НаименованиеКолонки Из МассивКолонокДляЗаписи Цикл
			
			Если ИстинаЛожь <> Неопределено Тогда
				СтрокаКонтрагента[НаименованиеКолонки] = ИстинаЛожь;
			КонецЕсли;
			
			КонтрагентОбъект[НаименованиеКолонки] = СтрокаКонтрагента[НаименованиеКолонки];
			ТекстСообщения = "";
			ТекстСообщения = ТекстСообщения+"[&Галка] "+ ЭлементыФормы.Контрагенты.Колонки[НаименованиеКолонки].ТекстШапки+" установлен у контрагента: "+строка(СтрокаКонтрагента.Контрагент);
			Если КонтрагентОбъект[НаименованиеКолонки] Тогда
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"&Галка", "v");
			Иначе
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"&Галка", " ");
			КонецЕсли;
			ТекстСообщения = ТекстСообщения+Символы.ПС;
			ТекстСообщенияОбщий = ТекстСообщенияОбщий+ТекстСообщения;
		КонецЦикла;
		
		Попытка
			КонтрагентОбъект.Записать();
			Сообщить(ТекстСообщенияОбщий, СтатусСообщения.Информация);
		Исключение
			Сообщить("Не удалось записать контрагента: "+Строка(КонтрагентОбъект)+" : "+ОписаниеОшибки(), СтатусСообщения.Внимание);
		КонецПопытки;
		
	КонецЦикла;
	
	Если МассивКонтрагентовДляЗаписи.Количество() > 0 Тогда
	Иначе
		Предупреждение("Не выбраны клиенты для установки запретов",30);
	КонецЕсли;
	
КонецПроцедуры
//-Лукьяненков 2017.10.09

Процедура КоманднаяПанель1Действие2(Кнопка)
	ОбновитьСписок()
КонецПроцедуры


Процедура КонтрагентыКонтрагентПриИзменении(Элемент)
	текСтр = элементыФормы.Контрагенты.ТекущиеДанные;
	текСтр.ЗапретитьВводЗаказаПокупателя = текСтр.Контрагент.ЗапретитьВводЗаказаПокупателя;
	текСтр.ЗапретОтгрузки    = текСтр.Контрагент.ЗапретОтгрузки;
	
	текСтр.ЗапретитьШины     = текСтр.Контрагент.ЗапретитьШины;
	текСтр.ЗапретитьДиски    = текСтр.Контрагент.ЗапретитьДиски;
	текСтр.ЗапретитьАКБ    	 = текСтр.Контрагент.ЗапретитьАКБ;
	текСтр.ЗапретитьАксы     = текСтр.Контрагент.ЗапретитьАксы;
	
	текСтр.Флаг = истина;
КонецПроцедуры

Процедура КонтрагентыПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	если ДанныеСтроки.Флаг<>неопределено тогда
		Если ДанныеСтроки.Флаг тогда
			ОформлениеСтроки.ЦветФона = webЦвета.СветлоЖелтый;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Процедура ОсновныеДействияФормыВыполнить(Кнопка)
	Если Вопрос("Установить флаги Запрета ввода заказов и Запрета отгрузок для всех выбранных клиентов?", РежимДиалогаВопрос.ДаНет)<>КодВозвратаДиалога.Да тогда
		возврат;
	КонецЕсли;
	ЗапретНовый("ЗапретитьВводЗаказаПокупателя, ЗапретОтгрузки, ЗапретитьШины, ЗапретитьДиски, ЗапретитьАКБ, ЗапретитьАксы");
	//Запрет(1);
	//Запрет(0);
КонецПроцедуры

Процедура КоманднаяПанель1Шины(Кнопка)
	Если Вопрос("Запретить продавать шины для всех выбранных клиентов?", РежимДиалогаВопрос.ДаНет)<>КодВозвратаДиалога.Да тогда
		возврат;
	КонецЕсли;	
	ЗапретНовый("ЗапретитьШины", Истина);
КонецПроцедуры

Процедура КоманднаяПанель1Диски(Кнопка)
	Если Вопрос("Запретить продавать диски для всех выбранных клиентов?", РежимДиалогаВопрос.ДаНет)<>КодВозвратаДиалога.Да тогда
		возврат;
	КонецЕсли;	
	ЗапретНовый("ЗапретитьДиски", Истина);
КонецПроцедуры

Процедура КоманднаяПанель1АКБ(Кнопка)
	Если Вопрос("Запретить продавать АКБ для всех выбранных клиентов?", РежимДиалогаВопрос.ДаНет)<>КодВозвратаДиалога.Да тогда
		возврат;
	КонецЕсли;	
	ЗапретНовый("ЗапретитьАКБ", Истина);	
КонецПроцедуры

Процедура КоманднаяПанель1Аксы(Кнопка)
	Если Вопрос("Запретить продавать Аксы для всех выбранных клиентов?", РежимДиалогаВопрос.ДаНет)<>КодВозвратаДиалога.Да тогда
		возврат;
	КонецЕсли;	
	ЗапретНовый("ЗапретитьАксы", Истина);
КонецПроцедуры




Категория =Справочники.КатегорииОбъектов.НайтиПоКоду("00035");	
	