Функция СоздатьСтруктуру()
	Тест = Новый Структура;
	Тест.Вставить("Описание", ЭлементыФормы.ОписаниеТеста.ПолучитьТекст());
	Тест.Вставить("Код", ЭлементыФормы.ПТДКод.ПолучитьТекст());
	Тест.Вставить("Параметры", Параметры);
	Тест.Вставить("ФормаРедактирования", "Форма_ПроизвольныйКод");
	Возврат Тест;
КонецФункции

Процедура ЗаполнитьИзСтруктуры(СтруктураТеста) Экспорт 
	Если СтруктураТеста.Свойство("Описание") Тогда
		ЭлементыФормы.ОписаниеТеста.УстановитьТекст(СтруктураТеста.Описание);
	КонецЕсли;
	
	Если СтруктураТеста.Свойство("Параметры") Тогда
		Параметры = СтруктураТеста.Параметры;
	КонецЕсли;
	
	Если СтруктураТеста.Свойство("Код") Тогда
		ЭлементыФормы.ПТДКод.УстановитьТекст(СтруктураТеста.Код);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОсновныеДействияФормыОК(Кнопка)
	// Вставить содержимое обработчика.
	СтруктураТеста = СоздатьСтруктуру();
	Если МодальныйРежим Тогда 
		Закрыть(СтруктураТеста);
	Иначе
		СтрокаТеста.Описание = СтруктураТеста.Описание;
		СтрокаТеста.Тест = ЗначениеВСтрокуВнутр(СтруктураТеста);
		Закрыть(СтруктураТеста);
	КонецЕсли;
КонецПроцедуры

Процедура ПараметрыТипПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ТекСтрока = ЭлементыФормы.Параметры.ТекущиеДанные;
	ТекСтрока.Значение = Элемент.Значение.ПривестиЗначение(ТекСтрока.Значение);
КонецПроцедуры


Процедура КоманднаяПанель1Параметр(Кнопка)
	// Вставить содержимое обработчика.
	Строка = Параметры.ВыбратьСтроку();
	Если Строка <> Неопределено Тогда
		ЭлементыФормы.ПТДКОД.ВыделенныйТекст = "Параметры." + Строка.Имя;
	КонецЕсли;
	
КонецПроцедуры

Процедура КоманднаяПанель1ГлобальныйПараметр(Кнопка)
	// Вставить содержимое обработчика.
	Строка = ПараметрыТестов.ВыбратьСтроку();
	Если Строка <> Неопределено Тогда
		ЭлементыФормы.ПТДКОД.ВыделенныйТекст = "ГлобальныеПараметры." + Строка.Имя;
	КонецЕсли;
КонецПроцедуры
