перем СтруктураТеста0, СтруктураТеста;

Функция СоздатьСтруктуру()
	Тест = Новый Структура;
	Тест.Вставить("Описание", ЭлементыФормы.ОписаниеТеста.ПолучитьТекст());
	Тест.Вставить("Код", ЭлементыФормы.ПТДКод.ПолучитьТекст());
	Тест.Вставить("Параметры", Параметры);
	Тест.Вставить("ФормаРедактирования", "Форма_ПроизвольныйКод");
	Возврат Тест;
КонецФункции

Процедура ЗаполнитьИзСтруктуры(СтруктураТеста) Экспорт 
	Если СтруктураТеста.Свойство("Описание") Тогда
		ЭлементыФормы.ОписаниеТеста.УстановитьТекст(СтруктураТеста.Описание);
	КонецЕсли;
	
	Если СтруктураТеста.Свойство("Параметры") Тогда
		Параметры = СтруктураТеста.Параметры;
	КонецЕсли;
	
	Если СтруктураТеста.Свойство("Код") Тогда
		ЭлементыФормы.ПТДКод.УстановитьТекст(СтруктураТеста.Код);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОсновныеДействияФормыОК(Кнопка)
	// Вставить содержимое обработчика.
	Если МодальныйРежим Тогда 
		Закрыть(СтруктураТеста);
	Иначе
		СтрокаТеста.Описание = СтруктураТеста.Описание;
		СтрокаТеста.Тест = ЗначениеВСтрокуВнутр(СтруктураТеста);
		Закрыть(СтруктураТеста);
	КонецЕсли;
	СтруктураТеста0 = СоздатьСтруктуру(); //обновленная структура
КонецПроцедуры

Процедура ПараметрыТипПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ТекСтрока = ЭлементыФормы.Параметры.ТекущиеДанные;
	ТекСтрока.Значение = Элемент.Значение.ПривестиЗначение(ТекСтрока.Значение);
КонецПроцедуры


Процедура КоманднаяПанель1Параметр(Кнопка)
	// Вставить содержимое обработчика.
	Строка = Параметры.ВыбратьСтроку();
	Если Строка <> Неопределено Тогда
		ЭлементыФормы.ПТДКОД.ВыделенныйТекст = "Параметры." + Строка.Имя;
	КонецЕсли;
	
КонецПроцедуры

Процедура КоманднаяПанель1ГлобальныйПараметр(Кнопка)
	// Вставить содержимое обработчика.
	Строка = ПараметрыТестов.ВыбратьСтроку();
	Если Строка <> Неопределено Тогда
		ЭлементыФормы.ПТДКОД.ВыделенныйТекст = "ГлобальныеПараметры." + Строка.Имя;
	КонецЕсли;
КонецПроцедуры

Процедура ПриОткрытии()
 	СтруктураТеста = СоздатьСтруктуру();
	
  	СтруктураТеста0 = Новый Структура;
	Код0 = СтруктураТеста.Код;
	СтруктураТеста0.Вставить("Код", Код0);
	Описание0 = СтруктураТеста.Описание;
	СтруктураТеста0.Вставить("Описание", СтруктураТеста.Описание);
	
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	СтруктураТеста = СоздатьСтруктуру();
	Если СтруктураТеста0.Код <> СтруктураТеста.Код 
		или СтруктураТеста0.Описание <> СтруктураТеста.Описание 
			тогда
			Если Вопрос("Сохранить изменения?", РежимДиалогаВопрос.ДаНет, 30)=КодВозвратаДиалога.Да тогда
			 ОсновныеДействияФормыОК(неопределено);
			КонецЕсли; 
	КонецЕсли;	
КонецПроцедуры
