процедура ОповеститьМенеджеров(СписокАдресов="gorohov@yst.ru;serkov@yst.ru;plotnikov@yst.ru;", ТекстСообщения="") Экспорт
	
	УЗ = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("no-reply@yst76.ru");
	
	Если ТекстСообщения="" тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КатегорииОбъектов.Объект.Наименование КАК Контрагент,
		|	КатегорииОбъектов.Объект.Код КАК Код,
		|	КатегорииОбъектов.Объект.НаименованиеПолное КАК НаименованиеПолное,
		|	КатегорииОбъектов.Объект.ОсновнойМенеджерКонтрагента КАК Менеджер,
		|	КатегорииОбъектов.Объект КАК Ссылка
		|ИЗ
		|	РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
		|ГДЕ
		|	КатегорииОбъектов.Категория = &Категория
		|	И НЕ КатегорииОбъектов.Объект.ЗапретитьВводЗаказаПокупателя
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Категория =Справочники.КатегорииОбъектов.НайтиПоКоду("00035");
	Запрос.УстановитьПараметр("Категория", Категория);
	
	РезультатЗапроса = Запрос.Выполнить();
	Контрагенты = РезультатЗапроса.Выгрузить();
	если Контрагенты.Количество()>0 тогда
	ТекстСообщения = "Требуется Запретить отгрузку следующим клиентам:
	|";
	для каждого стр1 из Контрагенты цикл
		ТекстСообщения = ТекстСообщения +"[ ]"+стр1.Код+ ") "+СокрЛП(стр1.Контрагент)+" : "+стр1.НаименованиеПолное+"
		|";
		Контр = стр1.Ссылка.ПолучитьОбъект();          //Запретить ввод заказа
		Контр.ЗапретитьВводЗаказаПокупателя = Истина;  //
		Попытка
			Контр.Записать();                              //
		Исключение
			ВызватьИсключение(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;	
	КонецЕсли;
КонецЕсли;
    ТекстСообщения = " Здравствуйте,
	| следующие клиенты - являются ответчиками по судебным делам:
	|
	|"+ТекстСообщения +"
| (Запрет на ввод новых заказов проставляется атоматически,
|  отменить запрет отгрузки и/или запретить ввод новых заказов можно 
|  через внешнюю обработку № 371 Список ответчиков по судам)";

	СписокФайловВложений = новый СписокЗначений;
	
	Если ТекстСообщения<>"" тогда
		Послать(СписокАдресов, СписокФайловВложений, УЗ, ТекстСообщения);	  
	КонецЕсли;
		
КонецПроцедуры	


 //+++ Главная процедура отправки почты, везде так называется :)
Процедура Послать(АдресПолучателя,СписокФайловВложений, УЗ, ТекстСообщения="---")
	   //ТекстПисьма = ЭтаФорма.ЭлементыФормы.ПолеHTMLДокумента.ПолучитьТекст();
	    	
	    ИПП=Новый ИнтернетПочтовыйПрофиль;
		ИПП.АдресСервераSMTP=УЗ.SMTPСервер;
		ИПП.ПортSMTP=УЗ.ПортSMTP;
		Если УЗ.ТребуетсяSMTPАутентификация Тогда
			ИПП.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
			ИПП.ПарольSMTP         = УЗ.ПарольSMTP;
			ИПП.ПользовательSMTP   = УЗ.ЛогинSMTP;
		Иначе
			ИПП.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
			ИПП.ПарольSMTP         = "";
			ИПП.ПользовательSMTP   = "";
		КонецЕсли;
		Письмо=Новый ИнтернетПочтовоеСообщение;
		Письмо.Отправитель=УЗ.АдресЭлектроннойПочты;
		
		//+++( 19.12.2011 - разбор адреса на несколько адресов
		i = Найти(АдресПолучателя,";"); j=Найти(АдресПолучателя, ",");
		k=?(i>0 и i>j,  i, ?(j>0 и j>i, j, 0) );
			
		Если i=0 и j=0 тогда
			Письмо.Получатели.Добавить(АдресПолучателя);
		иначе
			АдрОстаток = СокрЛП(АдресПолучателя);
			пока (k>0) цикл
				Адр1 = Лев(АдрОстаток, k-1);
				Если СокрЛП(Адр1)<>"" и Найти(Адр1,"@")>0 и Найти(Адр1,".")>0 тогда
					Письмо.Получатели.Добавить(Адр1);
				КонецЕсли;
				АдрОстаток = Прав(АдрОстаток, стрДлина(АдрОстаток)-k);
				i = Найти(АдрОстаток,";"); j=Найти(АдрОстаток, ",");
				k=?(i>0 и i>j,  i, ?(j>0 и j>i, j, 0) );
			КонецЦикла;
			Если СокрЛП(АдрОстаток)<>"" и Найти(АдрОстаток,"@")>0 и Найти(АдрОстаток,".")>0 тогда
				Письмо.Получатели.Добавить(АдрОстаток);
			КонецЕсли;

		КонецЕсли; //+++ )
		
		Если ЗначениеЗаполнено(СписокФайловВложений) И СписокФайловВложений.Количество()>0 Тогда
			Для Каждого ТекАдр Из СписокФайловВложений Цикл
				Письмо.Вложения.Добавить(ТекАдр.Значение);
			КонецЦикла;
		КонецЕсли;
			
//------------------------------------------------------------------		
    	Письмо.ИмяОтправителя ="Робот ЯШТ";
	    Письмо.Организация    ="ЗАО ТК ""Яршинторг"", г.Ярославль";
		
		Письмо.Тема= "Оповещение о клиентах - ответчиках по судам";
	    Письмо.Тексты.Добавить(ТекстСообщения,ТипТекстаПочтовогоСообщения.простойТекст);
		
		Почта=Новый ИнтернетПочта;
		попытка
			Почта.Подключиться(ИПП);
			#Если Клиент тогда
		ОбработкаПрерыванияПользователя(); // при зависании подключения - можно остановить Ctrl+Brk
		#КонецЕсли
			Почта.Послать(Письмо);
	    	Почта.Отключиться();
			#Если Клиент тогда
				сообщить(" >>>  Письмо отправлено на эл.адрес: "+АдресПолучателя+".  "+строка(СписокФайловВложений.Количество())+" вложенных файлов...", СтатусСообщения.Информация);
			#КонецЕсли	
		исключение
			#Если Клиент тогда
			сообщить("xxxxx Ошибка при отправке письма на эл.адрес: "+АдресПолучателя+" - "+ОписаниеОшибки(), СтатусСообщения.Внимание);
			#КонецЕсли	
		конецПопытки;
КонецПроцедуры

