Перем НомерНаПечать Экспорт;

Функция Печать(НомерДока = "") Экспорт
	НомерНаПечать = НомерДока;
	Если Не Метаданные.Имя = "УправлениеТорговлей" Тогда
		Сообщить("Печатная форма предназначена для использования в конфигурации ""Управление торговлей""", СтатусСообщения.Внимание);
	КонецЕсли;
	
	//Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.Спецификация") Тогда
		Возврат ПечатьДокумента(СсылкаНаОбъект);
	//КонецЕсли;
	
КонецФункции // Печать

Функция ПечатьДокумента(СсылкаНаОбъект)
		
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Спецификация_СпецификацияЭкспорт";
	
	Если СсылкаНаОбъект.Контрагент.ДвуязычныйЭкспорт Тогда
		ДваЯзыка = Истина;
		ИмяМакета = "Спецификация_ЭкспортДваЯзыка";
	Иначе
		ДваЯзыка = Ложь;
		ИмяМакета = "Спецификация_ЭкспортРус";
	КонецЕсли;
	
	Макет = ПолучитьМакет(ИмяМакета);
	
	ОбластьЗаголовок    = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка        = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока       = Макет.ПолучитьОбласть("Строка");
	ОбластьИтог         = Макет.ПолучитьОбласть("Итог");
	ОбластьПодвал       = Макет.ПолучитьОбласть("Подвал");
	
	////Заголовок
	Если НомерНаПечать = "" Тогда
		Если СсылкаНаОбъект.ДокументОснование.НомерФормулаАвто = 0 Тогда 
	НомерДокумента = ЭтотОбъект.ПолучитьФорму("ВводНомераШинтрейдЯрославль").ОткрытьМодально();
		Иначе
			НомерДокумента = СтрЗаменить(Строка(СсылкаНаОбъект.ДокументОснование.НомерФормулаАвто),Символы.НПП,"");
		КонецЕсли;
	Иначе
		НомерДокумента = НомерНаПечать;
	КонецЕсли;

	ОбластьЗаголовок.Параметры.НомерСпецификации = СокрЛП(НомерДокумента);
	
	//СокрЛП(Объект.ДополнительныеПоля[13].ЗначениеПоля);
	ОбластьЗаголовок.Параметры.НомерКонтракта    = СсылкаНаОбъект.ДоговорКонтрагента.Номер;
	//ОбластьЗаголовок.Параметры.Датаконтракта  = формат(СсылкаНаОбъект.ДоговорКонтрагента.Дата,"ДЛФ=D");
	//ОбластьЗаголовок.Параметры.Дата              = Формат(СсылкаНаОбъект.Дата, "ДФ=dd.MM.yyyy");
	
	Покупатель  = СсылкаНаОбъект.Контрагент;
	СведенияОПокупателе     = СведенияОЮрФизЛице(Покупатель,  СсылкаНаОбъект.Дата);
    НаимКонтракта = "между Tyre Technology Co LTD и "+СведенияОПокупателе.ПолноеНаименование;
	Если ДваЯзыка Тогда
		НаимКонтракта = "between Tyre Technology Co LTD and "+СведенияОПокупателе.ПолноеНаименование+Символы.ПС+НаимКонтракта;
	КонецЕсли;
	ОбластьЗаголовок.Параметры.НаимКонтракта = НаимКонтракта;
	
	
	заголовок = макет.ПолучитьОбласть("Заголовок1");
	ТабДокумент.Вывести(заголовок);
		
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	//Шапка
	ВалютаДок = СсылкаНаОбъект.ВалютаДокумента;
	Если ДваЯзыка Тогда
		Если ВалютаДок.Наименование = "руб." Тогда
			ОбластьШапка.Параметры.ВалПоАнгл = "Russian rubles";
		Иначе
			ОбластьШапка.Параметры.ВалПоАнгл = ВалютаДок.Наименование;
		КонецЕсли;
	КонецЕсли;	
	ОбластьШапка.Параметры.ВалПоРус = ВалютаДок.НаименованиеПолное;
	ТабДокумент.Вывести(ОбластьШапка);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Документ.Номенклатура.Код КАК Код,
	               |	Документ.Номенклатура КАК Номенклатура,
				   |	Документ.Номенклатура.Производитель КАК Производитель,
	               |	Документ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	СУММА(Документ.Количество) КАК Количество,
				   |	СУММА(Документ.КоличествоМест) КАК КоличествоМест,
	               |	СУММА(Документ.Сумма) КАК Сумма,
				   |	СУММА(Документ.Вес) КАК ВесБрутто,
	               |	Документ.Цена КАК Цена
	               |ИЗ
	               |	Документ.ЗаказПокупателя.Товары КАК Документ
	               |ГДЕ
	               |	Документ.Ссылка = &ТекущийДокумент
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Документ.Номенклатура,
	               |	Документ.ЕдиницаИзмерения,
	               |	Документ.Цена,
	               |	Документ.Номенклатура.Код,
				   |	Документ.Номенклатура.Производитель
	               |УПОРЯДОЧИТЬ ПО
	               |	ПОДСТРОКА(Документ.Номенклатура.НаименованиеПолное, 1, 50)
				   |";
	

	ТЗТоваров = Запрос.Выполнить().Выгрузить();
	
	НомПП = 0;
	
	СтрокаСостава = ""; СтрокаСоставаМодели = "";
	ИтВесНетто = 0;
	Для Каждого Строка Из ТЗТоваров Цикл
		НомПП = НомПП+1;
		Модель = "";
		Если Строка.Производитель = Справочники.Производители.НайтиПоКоду("65") Тогда //LEGEARTIS
			Модель = "#LEGEARTIS";
		ИначеЕсли Найти(врег(Строка.Производитель.Наименование),"REPLICA")>0 тогда
			назв = сокрЛП( врег(Строка.Производитель.Наименование) );
			Модель =  СокрЛП( прав( назв, стрДлина(назв) - Найти(назв,"REPLICA") - 7) );
			если Модель = "TD" тогда Модель = "TOP DRIVER" КонецЕсли;
			Модель = "#" +Модель;
		// если отдельные производители - то это тоже Replica	
		ИначеЕсли врег(Строка.Производитель.Наименование)="TOP DRIVER"
			или врег(Строка.Производитель.Наименование)="CATWILD"
			или врег(Строка.Производитель.Наименование)="YST" тогда
			Модель = "#" +врег(Строка.Производитель.Наименование);
		Иначе // название производителя = Брэнд
			Модель = врег(Строка.Производитель.Наименование);
		КонецЕсли;	
		
		Если Строка.Номенклатура.ВидТовара = Перечисления.ВидыТоваров.Диски Тогда
			Если СтрокаСостава = "" Тогда
				СтрокаСостава = Модель;
			ИначеЕсли Найти(СтрокаСостава, Модель) = 0 Тогда
				СтрокаСостава = СтрокаСостава+", "+Модель;
			КонецЕсли;
		КонецЕсли;
		Если СтрокаСоставаМодели = "" Тогда
			СтрокаСоставаМодели = Модель;
		ИначеЕсли Найти(СтрокаСоставаМодели, Модель) = 0 Тогда
			СтрокаСоставаМодели = СтрокаСоставаМодели+", "+Модель;
		КонецЕсли;
		
		ОбластьСтрока.Параметры.НомПП = НомПП;
		ОбластьСтрока.Параметры.Код = Строка.Номенклатура.Код;
		ОбластьСтрока.Параметры.Номенклатура     = СтрЗаменить(Строка.Номенклатура.НаименованиеПолное,"Диск","Wheel");
		ОбластьСтрока.Параметры.Количество = Строка.Количество;
		ОбластьСтрока.Параметры.ЕдИзм = СокрЛП(Строка.ЕдиницаИзмерения); 
		ОбластьСтрока.Параметры.Цена       = Строка.Цена;
		ОбластьСтрока.Параметры.Стоимость  = Строка.Сумма;
		ОбластьСтрока.Параметры.ВесБрутто  = Строка.ВесБрутто;
		
		Если Строка.Номенклатура.ВидТовара = Перечисления.ВидыТоваров.Диски Тогда
			парам1   = Строка.Номенклатура.Типоразмер;
			ЭтоЛитойДиск = Строка.Номенклатура.ПринадлежитЭлементу(Справочники.Номенклатура.НайтиПоКоду("0001753"));
			ДваВОдном = Строка.КоличествоМест/Строка.Количество;
			//ВесНетто = Строка.ВесБрутто - ВесУпаковки(парам1, ЭтоЛитойДиск) * Строка.Количество * ?(ДваВОдном=0,1,ДваВОдном); 
			//не опнятно как рассчитывать вес, если кол.мест не равно 0
			ВесНетто = Строка.ВесБрутто - ВесУпаковки(парам1, ЭтоЛитойДиск) * Строка.Количество; 
		Иначе
			ВесНетто = Строка.ВесБрутто;
		КонецЕсли;
		ОбластьСтрока.Параметры.ВесНетто = ВесНетто;
		ИтВесНетто = ИтВесНетто+ВесНетто;
		
		ТабДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла; //по товарам
	
	//Итог
	ОбластьИтог.Параметры.ИтогКоличество = ТЗТоваров.Итог("Количество");
	ОбластьИтог.Параметры.ИтогСтоимость = ТЗТоваров.Итог("Сумма");
	ОбластьИтог.Параметры.ИтогВесБрутто = ТЗТоваров.Итог("ВесБрутто");
	ОбластьИтог.Параметры.ИтогВесНетто = ИтВесНетто;

	ТабДокумент.Вывести(ОбластьИтог);
	
	//Подвал
	Если ВалютаДок.Наименование = "EUR" Тогда
		ПарПрописиРус = "Евро, Евро, Евро, м, цент, цента, центов, м";
		ПарПрописиАнгл = "EUR, EUR, EUR, cent, cent, cent, 0";
		ПечВалютаПлатежа = "Евро";
		ПечВалютаПлатежаАнгл = "EUR";
	ИначеЕсли ВалютаДок.Наименование = "USD" Тогда
		ПарПрописиРус = "доллар США, доллара США, долларов США, м, цент, цента, центов, м";
		ПарПрописиАнгл = "USD, USD, USD, cents, cents, cents, 0";
		ПечВалютаПлатежа = "Доллар США";
		ПечВалютаПлатежаАнгл = "USD";
	Иначе  //это рубли
		ПарПрописиРус = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж";
		ПарПрописиАнгл = "ruble, rubles, rubles, penny, kopecks, kopecks, 0";
		ПечВалютаПлатежа = "Российский рубль";
		ПечВалютаПлатежаАнгл = "Russian rubles";
	КонецЕсли;	
	ОбластьПодвал.Параметры.СуммаРус = ЧислоПрописью(ТЗТоваров.Итог("Сумма"), "L=ru_RU", ПарПрописиРус);
	Если ДваЯзыка Тогда
		ОбластьПодвал.Параметры.СуммаАнгл = ЧислоПрописью(ТЗТоваров.Итог("Сумма"), "L=en_US", ПарПрописиАнгл);
	КонецЕсли;
	//ОбластьПодвал.Параметры.ТорговыеМарки = стрЗаменить(СтрокаСоставаМодели,"#", "");
	//ОбластьПодвал.Параметры.ПечВалютаПлатежа = ПечВалютаПлатежа;
	
	КомплектПоставки = "";
	КомплектПоставкиАнгл = "";
	пока СтрокаСостава<>"" цикл
		i=Найти(СтрокаСостава,",");
		Если i>0 тогда
			брэнд = сокрЛП( лев(СтрокаСостава,i-1) );
			СтрокаСостава = сокрЛП(прав(СтрокаСостава, стрДлина(СтрокаСостава) - i));
		иначе
			брэнд = сокрЛП(СтрокаСостава);
			СтрокаСостава = "";
		КонецЕсли;	
	//-------------------------------------------------------------------	
		Если брэнд = "TREBL" или брэнд="ARRIVO" Тогда //штамповка
			КомплектПоставки = КомплектПоставки + брэнд+": коробка, диск."+Символы.ПС;		
			КомплектПоставкиАнгл = КомплектПоставкиАнгл + брэнд+": wheel, carton box."+Символы.ПС;
	//-------------------------------------------------------------------	
		ИначеЕсли лев(брэнд,1)="#" Тогда            // наиболее полный комплект
			брэнд = прав(брэнд,стрДлина(брэнд)-1);
			КомплектПоставки = КомплектПоставки + брэнд+": коробка, диск, заглушка со стикером, болты или гайки, количество болтов или гаек указано в упаковочном листе."+Символы.ПС;		
			КомплектПоставкиАнгл = КомплектПоставкиАнгл + брэнд+": box, cap and sticker, bolts or nuts, quantity of bolts or nuts are indicated in packing list."+Символы.ПС;
	//-------------------------------------------------------------------	
		Иначе //Если Найти(СтрокаСостава, "NZ") Тогда	
			КомплектПоставки = КомплектПоставки + брэнд+": коробка, диск, заглушка со стикером."+Символы.ПС;		
			КомплектПоставкиАнгл = КомплектПоставкиАнгл + брэнд+": box, cap and sticker."+Символы.ПС;	
		КонецЕсли;
	КонецЦикла;
	
	ОбластьПодвал.Параметры.Перенос = Символы.ПС;
	ОбластьПодвал.Параметры.КомплектПоставки    = КомплектПоставки;
	Если ДваЯзыка Тогда
		ОбластьПодвал.Параметры.КомплектПоставкиАнгл = КомплектПоставкиАнгл;
		//ОбластьПодвал.Параметры.ПечВалютаПлатежаАнгл = ПечВалютаПлатежаАнгл;
	КонецЕсли;
	
	//грузополучатель
	Грузополучатель  = ?(ЗначениеЗаполнено(СсылкаНаОбъект.Грузополучатель), СсылкаНаОбъект.Грузополучатель,   СсылкаНаОбъект.Контрагент);
	СведенияОГрузополучателе     = СведенияОЮрФизЛице(Грузополучатель,       СсылкаНаОбъект.Дата);
	Если СокрЛП(СсылкаНаОбъект.АдресДоставки)= "" Тогда
		ФактАдресГП = ОписаниеОрганизации(СведенияОГрузополучателе, "ФактическийАдрес,");
		ФактАдресГП = ?(СокрЛП(ФактАдресГП)="", ОписаниеОрганизации(СведенияОГрузополучателе, "ЮридическийАдрес,"), СокрЛП(ФактАдресГП));
	Иначе
		ФактАдресГП = СокрЛП(СсылкаНаОбъект.АдресДоставки);
	КонецЕсли;
	ОбластьПодвал.Параметры.РеквизитыПокупателя = СведенияОГрузополучателе.ПолноеНаименование+", "+ФактАдресГП;
	Если ДваЯзыка Тогда
		//получаем юр.адрес на английском языке
		ВидАдресаФактАнгл = Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("38847");
		РегАдреса = РегистрыСведений.КонтактнаяИнформация.Получить(Новый Структура("Объект,Тип,Вид",Грузополучатель,Перечисления.ТипыКонтактнойИнформации.Адрес, ВидАдресаФактАнгл));
		ОбластьПодвал.Параметры.РеквизитыПокупателяАнгл = СведенияОГрузополучателе.ПолноеНаименование+", "+ФактАдресГП;
	КонецЕсли;
	
	//грузоотправитель
	НазваниеГО = "Закрытое акционерное общество Торговая компания ""Яршинторг"" 150044, Ярославская обл, Ярославль г, Базовая ул, дом № 3, стр.2";
	ОбластьПодвал.Параметры.РеквизитыОрганизации = НазваниеГО;
	Если ДваЯзыка Тогда
		НазваниеГОАнгл = "JSC TRADING COMPANY “YARSHINTORG”, YAROSLAVL 150044,RUSSIA, BAZOVAYA STR., 3,BUILDING.2";
		ОбластьПодвал.Параметры.РеквизитыОрганизацииАнгл = НазваниеГОАнгл;
	КонецЕсли;	
	
	ОбластьПодвал.Параметры.ДатаОплаты = Формат(СсылкаНаОбъект.ДатаОплаты,"ДФ=dd.MM.yyyy");
	ВидАдресаЮрАнгл = Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("38846");
	РегАдреса = РегистрыСведений.КонтактнаяИнформация.Получить(Новый Структура("Объект,Тип,Вид",Покупатель,Перечисления.ТипыКонтактнойИнформации.Адрес,ВидАдресаЮрАнгл));
    Города = РегАдреса.комментарий;  
	поз = Найти(Города,"/");
	ОбластьПодвал.Параметры.УсловиеПоставки =""+ СсылкаНаОбъект.УсловиеПоставкиНаЭкспорт+" "+Сред(Города,поз+1) ;
	попытка
	ОбластьПодвал.Параметры.УсловиеПоставкиАнгл =""+ СсылкаНаОбъект.УсловиеПоставкиНаЭкспорт+" "+ Лев(Города,поз-1);
	Исключение
    конецпопытки;
	ТабДокумент.Вывести(ОбластьПодвал);
	
//-------------------печати и подписи---------------------------------------
	ОбластьСтрока1 = Макет.ПолучитьОбласть("ПодвалШапка");
	//Если ДваЯзыка Тогда
	//	ОбластьСтрока1.Параметры.ПечПоставщик = "ShinTrade Yaroslavl Ltd / Общество с ограниченной ответственностью «ШинТрейд Ярославль»";
	//Иначе	
	//	ОбластьСтрока1.Параметры.ПечПоставщик = "Общество с ограниченной ответственностью «ШинТрейд Ярославль»";
	//КонецЕсли;
	//ОбластьСтрока1.Параметры.ПечПокупатель = СведенияОПокупателе.ПолноеНаименование;
	ТабДокумент.Вывести(ОбластьСтрока1);
		
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабДокумент;
				   
КонецФункции 	

Функция ВесУпаковки(типоразмер, ЭтоЛитойДиск = Ложь)
	
	индексД = ?(типоразмер.Диаметр="",0, число(типоразмер.Диаметр)-13);  
	
	Если индексД>=0 тогда
		Если ЭтоЛитойДиск Тогда
			масса = новый Массив;
			масса.Добавить(0.430); //13
			масса.Добавить(0.650); //14
			масса.Добавить(0.700); //15
			масса.Добавить(0.870); //16
			масса.Добавить(0.950); //17
			масса.Добавить(1.100);  //18
			масса.Добавить(1.200);  //19
			масса.Добавить(1.400);  //20
			масса.Добавить(1.550);  //21
			масса.Добавить(1.700); //22 
			m = масса[индексД];
		Иначе
			масса = новый Массив;
			масса.Добавить(0.300); //13
			масса.Добавить(0.400); //14
			масса.Добавить(0.500); //15
			масса.Добавить(0.600); //16
			масса.Добавить(0.700); //17
			m = масса[индексД];
		КонецЕсли;
	Иначе // это болты или гайки
		m = 0;
	КонецЕсли;
	возврат Окр(m,3);
КонецФункции	