
Процедура КнопкаВыполнитьНажатие(Кнопка)
	 ТабДок = ПоказатьОтчет();
	 ТабДок.Показать();
КонецПроцедуры

Процедура ЗаполнитьНажатие(Элемент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Значение
	|ПОМЕСТИТЬ Проверено
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Проверено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Значение
	|ПОМЕСТИТЬ Загружено
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Загружено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Значение
	|ПОМЕСТИТЬ КрепжПроверен
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &КрепежПроверен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КомплектующиеНоменклатуры.Номенклатура,
	|	КомплектующиеНоменклатуры.Комплектующая,
	|	КомплектующиеНоменклатуры.Количество
	|ПОМЕСТИТЬ комплектующие
	|ИЗ
	|	РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	|ГДЕ
	|	КомплектующиеНоменклатуры.Комплектующая В ИЕРАРХИИ(&Комплектующая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СезонныйАссортимент.Номенклатура,
	|	СезонныйАссортимент.Номенклатура.Модель КАК Модель,
	|	СезонныйАссортимент.Номенклатура.Типоразмер КАК Типоразмер,
	|	СезонныйАссортимент.Номенклатура.Типоразмер.Диаметр КАК Диаметр,
	//06.06.2017
	|	СезонныйАссортимент.Номенклатура.Типоразмер.Ширина КАК Ширина,
	|	СезонныйАссортимент.Номенклатура.Модель.Наименование + СезонныйАссортимент.Номенклатура.Типоразмер.Ширина + СезонныйАссортимент.Номенклатура.Типоразмер.Диаметр КАК МШД,
	
	|	СезонныйАссортимент.Номенклатура.Производитель КАК Производитель,
	|	Проверено.Значение КАК ПровереноНагрузка,
	|	Загружено.Значение КАК ЗагруженоНагрузка,
	|	СезонныйАссортимент.Номенклатура.Код КАК Код,
	|	комплектующие.Комплектующая,
	|	комплектующие.Количество,
	|	КрепжПроверен.Значение КАК КрепежПроверен,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Остаток
	|ИЗ
	|	РегистрСведений.СезонныйАссортимент КАК СезонныйАссортимент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Проверено КАК Проверено
	|		ПО СезонныйАссортимент.Номенклатура = Проверено.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ Загружено КАК Загружено
	|		ПО СезонныйАссортимент.Номенклатура = Загружено.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ КрепжПроверен КАК КрепжПроверен
	|		ПО СезонныйАссортимент.Номенклатура = КрепжПроверен.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ комплектующие КАК комплектующие
	|		ПО СезонныйАссортимент.Номенклатура = комплектующие.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	|		ПО СезонныйАссортимент.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|ГДЕ
	|	ИСТИНА  //условие ";
	
	Запрос.УстановитьПараметр("Проверено",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90157"));
	//Запрос.УстановитьПараметр("Загружено",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90157"));
	Запрос.УстановитьПараметр("Загружено",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90205"));
	Запрос.УстановитьПараметр("КрепежПроверен",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90206"));
	комплектующая= Новый СписокЗначений;
	комплектующая.Добавить(Справочники.Номенклатура.НайтиПоКоду("0000726"));//кольца
    Комплектующая.Добавить(Справочники.Номенклатура.НайтиПоКоду("0000713"));//гайки
	Комплектующая.Добавить(Справочники.Номенклатура.НайтиПоКоду("9190192"));//вентели
	Комплектующая.Добавить(Справочники.Номенклатура.НайтиПоКоду("0000702"));//болты
	
	Запрос.УстановитьПараметр("Комплектующая",комплектующая);
	
	ТекстУсловия= "";
	Если ЗначениеЗаполнено(Производитель) Тогда
		ТекстУсловия= ТекстУсловия+ " И СезонныйАссортимент.Номенклатура.Производитель = &Производитель";
	    Запрос.УстановитьПараметр("Производитель",Производитель);
	конецЕсли;
	Если ЗначениеЗаполнено(Модель) Тогда
		ТекстУсловия= ТекстУсловия+ " И СезонныйАссортимент.Номенклатура.Модель.Наименование подобно  ""%"+СокрЛП(Модель)+"%""";	 
		//Запрос.УстановитьПараметр("Модель",Модель);
	конецЕсли;
	Если ЗначениеЗаполнено(Типоразмер) Тогда
		ТекстУсловия= ТекстУсловия+ " И СезонныйАссортимент.Номенклатура.Типоразмер.Наименование подобно ""%"+СокрЛП(Типоразмер)+"%""";;	
		//Запрос.УстановитьПараметр("Типоразмер",Типоразмер);
	конецЕсли;
	Если ЗначениеЗаполнено(Диаметр) Тогда
		ТекстУсловия= ТекстУсловия+ " И СезонныйАссортимент.Номенклатура.Типоразмер.Диаметр = &Диаметр";
	    Запрос.УстановитьПараметр("Диаметр",Диаметр);
	конецЕсли;
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ТекстУсловия= ТекстУсловия+ " И СезонныйАссортимент.Номенклатура = &Номенклатура";
	    Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	конецЕсли;
	Если КрепежПроверен_ тогда
		ТекстУсловия= ТекстУсловия+ " И КрепжПроверен.Значение = Истина ";
	конецЕсли;	
	Если КрепежнеПроверен тогда
		ТекстУсловия= ТекстУсловия+ " И ЕстьNull(КрепжПроверен.Значение,ложь) = Ложь ";
	конецЕсли;	
	Если НагрузкаПроверен тогда
		ТекстУсловия= ТекстУсловия+ " И Проверено.Значение <> 0 ";
	конецЕсли;	
		Если НагрузкаНеПроверен тогда
		ТекстУсловия= ТекстУсловия+ " И  ЕстьNull(Проверено.Значение,0) = 0 ";
	конецЕсли;	

	 Запрос.Текст=СтрЗаменить(Запрос.Текст,"//условие",ТекстУсловия);
	 
//	Если ПервыеДва тогда //06.06.2017 
	Запрос.Текст= Запрос.Текст+"
	|
	|УПОРЯДОЧИТЬ ПО МШД
	|АВТОУПОРЯДОЧИВАНИЕ";
//	КонецЕсли;

	Результат = Запрос.Выполнить();

	Товары = Результат.Выгрузить();
	
	Уд=0;

	Если ПервыеДва тогда //06.06.2017 
		МШД0 = ""; k=0; i=0;  
		пока i<Товары.Количество() цикл
			
			стр1 = Товары[i];
			
			Если стр1.МШД<>МШД0 тогда
				МШД0 = стр1.МШД; 
				k=1; i=i+1;
				Продолжить;
			КонецЕсли;	
			
			Если стр1.МШД=МШД0 тогда
				k=k+1;
				Если k>МаксТов тогда
//					сообщить(ШД0+" - "+строка(k)+" : "+стр1.Код );
					Товары.Удалить( i );
					Уд=Уд+1;
				иначе
					i=i+1;
				КонецЕсли;	
			КонецЕсли;	
			
		КонецЦикла;
	КонецЕсли;
	
	Предупреждение("Получено "+строка( Товары.Количество())+" товаров" +?(Уд=0,"", "
					|Удалено из списка "+строка(Уд)+" товаров."), 15);
	
КонецПроцедуры

Процедура УстановитьНажатие(Элемент)
	
	Для каждого стр из товары Цикл
		Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		Запись.Объект = Стр.Номенклатура;
		Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90157");
		Запись.Значение = МаксНагрузка;
		Запись.Записать(Истина);
		стр.ПровереноНагрузка = МаксНагрузка;
	конецЦикла;
	
	
	КонецПроцедуры

	Процедура ТоварыПровереноНагрузкаПриИзменении(Элемент)
		текСтрока = ЭлементыФормы.Товары.ТекущиеДанные;
		Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		Запись.Объект = текСтрока.Номенклатура;
		Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90157");
		Запись.Значение = текСтрока.ПровереноНагрузка;
		Запись.Записать(Истина);
		
	КонецПроцедуры

	Процедура ТоварыКрепежПроверенПриИзменении(Элемент)
		текСтрока = ЭлементыФормы.Товары.ТекущиеДанные;
		Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		Запись.Объект = текСтрока.Номенклатура;
		Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90206");
		Запись.Значение = текСтрока.КрепежПроверен;
		Запись.Записать(Истина);
	КонецПроцедуры

	Процедура КрепежПроверенНажатие(Элемент)
	Для каждого стр из товары Цикл
		Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		Запись.Объект = стр.Номенклатура;
		Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90206"); //Крепеж проверен
		Запись.Значение = Истина;
		Запись.Записать(Истина);
		стр.КрепежПроверен = Истина;
	конецЦикла;
	КонецПроцедуры

	Процедура НагрузкаПроверенПриИзменении(Элемент)
		// Вставить содержимое обработчика.
	КонецПроцедуры

	Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
		
		МаксТов = 2;
		КрепежнеПроверен   = истина;
		НагрузкаНеПроверен = истина;

	КонецПроцедуры


	