
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
  СписокПодразделений = новый СписокЗначений;
  СписокПодразделений.Добавить(Справочники.Подразделения.НайтиПоКоду("00005"));
  СписокПодразделений.Добавить(Справочники.Подразделения.ПустаяСсылка());
  
  
  
  
  
  Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Отклонить"));
    Если Параметр <> Неопределено Тогда
        Параметр.Значение = Перечисления.СостоянияЗаявкиНаБрак.Отклонить;
        Параметр.Использование = Истина;
	КонецЕсли;

	
	
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокПодразделений"));
    Если Параметр <> Неопределено Тогда
        Параметр.Значение = СписокПодразделений;
        Параметр.Использование = Истина;
	КонецЕсли;

КонецПроцедуры
