Процедура ГлавнаяФорма() Экспорт
	
	Форма = ПолучитьФорму("Форма");
	Форма.Открыть();
	
КонецПроцедуры

Процедура ПерезаполнитьДокумент() Экспорт
	
	Объект = СсылкаНаОбъектОбщ.ПолучитьОбъект();
	Объект.Склад.Очистить();
	Объект.Поступления.Очистить();
	Объект.ПланПродаж.Очистить();
	объект.ПриходДенег.Очистить();
	Объект.ОплатаПоставщикам.Очистить();
	объект.ДДС.Очистить();
	объект.БалансПрибыль.Очистить();
	объект.Кредиты.Очистить();
	
	// Обработка формул
	Для каждого Стрх из Объект.СкладФормулы Цикл
		ОбработкаФормул("Склад",СтрХ,объект);
	КонеЦЦИкла;
	
	Для каждого Стрх из Объект.ПоступленияФормулы Цикл
		ОбработкаФормул("Поступления",СтрХ,объект);
	КонеЦЦИкла;
	
	Для каждого Стрх из Объект.ПланПродажФормулы Цикл
		ОбработкаФормул("ПланПродаж",СтрХ,объект);
	КонеЦЦИкла;
	
	Для каждого Стрх из Объект.ПриходДенегФормулы Цикл
		ОбработкаФормул("ПриходДенег",СтрХ,объект);
	КонеЦЦИкла;
	
	Для каждого Стрх из Объект.ДДСФормулы Цикл
		ОбработкаФормул("ДДС",СтрХ,объект);
	КонеЦЦИкла;
	
	Для каждого Стрх из Объект.КредитыФормулы Цикл
		ОбработкаФормул("Кредиты",СтрХ,объект);
	КонеЦЦИкла;
	
	Для каждого Стрх из Объект.ОплатаПоставщикамФормулы Цикл
		ОбработкаФормул("ОплатаПоставщикам",СтрХ,объект);
	КонеЦЦИкла;
	
	Для каждого Стрх из Объект.БалансПрибыльФормулы Цикл
		ОбработкаФормул("БалансПрибыль",СтрХ,объект);
	КонеЦЦИкла;
	
КонецПроцедуры                       

Функция ОбработкаФормул(ТЧ,СтрХ,объект)
	
	Если (ТЧ = "Склад")	Тогда 
		Номенклатурнаягруппа = СтрХ.Разрез1;	
		Производитель = СтрХ.Разрез2;
		Менеджер = СтрХ.Менеджер;
		
		СтрУ = Объект.склад.добавить();
		Для каждого Кол из Стрх.Колонки Цикл
			СтрУ[Кол.Наименование] = ВычислитьФормулу(СтрХ.Кол,НоменклатурнаяГруппа,Производитель,Менеджер);
		КонеЦЦикла;
		
	ИначеЕсли (ТЧ = "Поступления") Тогда 	
		Номенклатурнаягруппа = СтрХ.Разрез1;	
		Производитель = СтрХ.Разрез2;
		Менеджер = СтрХ.Менеджер;
		
		СтрУ = Объект.Поступления.добавить();
		Для каждого Кол из Стрх.Колонки Цикл
			СтрУ[Кол.Наименование] = ВычислитьФормулу(СтрХ.Кол,НоменклатурнаяГруппа,Производитель,Менеджер);
		КонеЦЦикла;
		
	ИначеЕсли (ТЧ = "ПланПродаж")	Тогда 		
		Номенклатурнаягруппа = СтрХ.Разрез1;	
		Производитель = СтрХ.Разрез2;
		Менеджер = СтрХ.Менеджер;
		
		СтрУ = Объект.ПланПродаж.добавить();
		Для каждого Кол из Стрх.Колонки Цикл
			СтрУ[Кол.Наименование] = ВычислитьФормулу(СтрХ.Кол,НоменклатурнаяГруппа,Производитель,Менеджер);
		КонеЦЦикла;
		
	ИначеЕсли (ТЧ = "ПриходДенег")	Тогда 		
		Номенклатурнаягруппа = СтрХ.Разрез1;	
		Производитель = СтрХ.Разрез2;
		Менеджер = СтрХ.Менеджер;
		
	ИначеЕсли (ТЧ = "ОплатаПоставщикам") Тогда
		Номенклатурнаягруппа = СтрХ.Разрез1;	
		Производитель = СтрХ.Разрез2;
		Менеджер = СтрХ.Менеджер;
		
	ИначеЕсли (ТЧ = "ДДС")	Тогда 			
		
	ИначеЕсли (ТЧ = "Кредиты")	Тогда 			
		
	ИначеЕсли (ТЧ = "БалансПрибыль") Тогда 			
		
	КонецЕсли;
	
	
КонецФункции

Функция ВычислитьФормулу(ТекстФормулы,НГ,Производитель,Менеджер)
	// Вычисление формулы производится рекурсивно !!!!
	//МассивЛексем = Парсинг(ТекстФормулы);		
	
КонецФункции

Функция Парсинг(ТекстФормулы)
// Функции одного документа
// 1. Данные из соответствующей вкладки и ячейки
// 2. Данные из соответствующей вкладки по ключу
// 3. Данные из ячейки по строке и колонке 

// Склад
// Склад(НГ,ПР,Мен)
// Склад(С,К) 

// Пост
// Пост(НГ,ПР,Мен)
// Пост(С,К) 

// Прод
// Прод(НГ,ПР,Мен)
// Прод(С,К) 

// ДеньгиПост
// ДеньгиПост(НГ,ПР,Мен)
// ДеньгиПост(С,К) 

// ДеньгиОпл
// ДеньгиОпл(НГ,ПР,Мен)
// ДеньгиОпл(С,К) 

// ДДС
// ДДС(Статья)
// ДДС(С,К) 

// БП
// БП(Статья)
// БП(С,К)

// Кредиты
// Кредиты(Статья)
// Кредиты(С,К)


// Функции разных документов
// с прибавлением "Д" - документ прошлого года того же периода
// с прибавлением "ДП" - документ прошлого периода в этом году
// ДН + параметр("ххх") - из документа, номер "ххх". 

// Функции из обработки. 
///////////////////////////////////
// Ф_СкладНаНачалоКоличество()
// Ф_СкладНаДатуКоличество(Дата)
// Ф_СкладНаНачалоСтоимость()
// Ф_СкладНаДатуСтоимость(Дата)
// Ф_ПродажиПериод()
// Ф_ПродажиПериодПрошлого()

	//ЛексемыСырые = новый Массив;

	//Разделители = новый ТаблицаЗначений;
	//Разделители.Колонки.Добавить("Разделитель","Позиция");
	//СтрХХ = Разделители.Добавить();
	//СтрХХ.Разделитель = "+";
	//СтрХХ.Разделитель = "-";
	//СтрХХ.Разделитель = "*";
	//СтрХХ.Разделитель = "/";
	//СтрХХ.Разделитель = "%";

	//Пока Истина Цикл
	//	Для каждого Эл из 
	//	 	Эл.Позиция = Найти(ТекстФормулы,Эл.Разделитель);
	//	КонецЦикла;
	//	Разделители.Сортировать("Позиция,Разделитель");
	//	Если (Разделители)
	//КонецЦикла;

	
КонецФункции