
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
список = Новый списокЗначений;
Список.Добавить(Справочники.СтатьиЗатрат.НайтиПоКоду("О0177"));//ндс
Список.Добавить(Справочники.СтатьиЗатрат.НайтиПоКоду("О0172"));//прибыль местный
Список.Добавить(Справочники.СтатьиЗатрат.НайтиПоКоду("О0174"));//прибыль федеральный	

ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтатьиНалогов"));
ПараметрСКД.Использование = Истина;
ПараметрСКД.Значение  =список;

ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Н"));
ПараметрСКД.Использование = истина ;
ПараметрСКД.Значение  =Добавитьмесяц(ПериодПланирования.ДатаНачала,-12);
	
ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("К"));
ПараметрСКД.Использование = Истина;
ПараметрСКД.Значение  =Добавитьмесяц(ПериодПланирования.ДатаКонца,-12);

ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Нач"));
ПараметрСКД.Использование = истина ;
ПараметрСКД.Значение  =ПериодПланирования.ДатаНачала;
	
ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Кон"));
ПараметрСКД.Использование = Истина;
ПараметрСКД.Значение  =конецДня(ПериодПланирования.ДатаКонца);

ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодПланирования"));
ПараметрСКД.Использование = Истина;
ПараметрСКД.Значение  = ПериодПланирования;




// Вставить содержимое обработчика.
КонецПроцедуры
