
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	попытка
	// Вставить содержимое обработчика.
	Если ВидОперации = Перечисления.ВидБюджета.Месяц и Не ЗначениеЗаполнено(ДокументОснование) Тогда 
		Сообщить("Необходимо чтобы документ был введен на основании общего бюджета на полугодие.",СтатусСообщения.Важное);
		Отказ = истина;
		Возврат;
	КонецЕсли;
	Подразделения = новый массив;
	//////////////////////////////////////////////////////////////////////
	Подразделения.Добавить(Справочники.Подразделения.НайтиПоКоду("00005"));
	Подразделения.Добавить(Справочники.Подразделения.НайтиПоКоду("00133"));
	Подразделения.Добавить(Справочники.Подразделения.НайтиПоКоду("00112"));
	Подразделения.Добавить(Справочники.Подразделения.НайтиПоКоду("00138"));
	Подразделения.Добавить(Справочники.Подразделения.НайтиПоКоду("00106"));
	
	УдалитьДвиженияДокумента(Движения);
	
	Множитель = ?(Полугодие=1,0,6);
	
	Если (Полугодие = 1) Тогда 
		НачПериода = НачалоГода(Дата(Формат(Год,"ЧГ=0")+"0630235959")); 
		КонПериода = Дата(Формат(Год,"ЧГ=0")+"0630235959");
	Иначе 
		НачПериода = Дата(Формат(Год,"ЧГ=0")+"0701000000"); 
		КонПериода = КонецГода(Дата(Формат(Год,"ЧГ=0")+"0701000000")); 			
	КонецЕсли;
		
	Если ВидОперации = Перечисления.ВидБюджета.Полугодие Тогда 
		Для каждого Стр из Затраты Цикл
			Если не ЗначениеЗаполнено(Стр.Статья) Тогда 
				Отказ = истина;
				Сообщить("В строке № " + Затраты.Индекс(Стр) + " не заполнена статья. Проведение невозможно.",СтатусСообщения.Важное);
			Конецесли;
			
		КонеЦЦИкла;
		
		Если не отказ Тогда
			Для каждого стр из Затраты Цикл
				////////////////////////////////////////////////////////
				Для й=1 по 6 Цикл
					ц=0;
					Для Каждого Подразделение из Подразделения Цикл
						ц=ц+1;
						СуммаПодразделения = Стр["Месяц"+й+"СуммаПодразделение"+ц];
						Если СуммаПодразделения<>0 Тогда 
							Движение = движения.БюджетРасходов.Добавить();
							Движение.Подразделение = подразделение; 
							Движение.Месяц = й;
							Движение.Период = НачПериода;
							Движение.Сумма = СуммаПодразделения;
							Движение.Состояние = Состояние;				
							Движение.Статья = Стр.Статья;				
							ЗаполнитьЗначенияСвойств(Движение,Стр);				
							Движения.БюджетРасходов.Записать();						
						КонецЕсли;
					КонеЦЦикла;
				КонеЦЦикла;
				
			КонецЦикла;
		КонецЕсли;
	Иначе 
		Для каждого Стр из ЗатратыМесяц Цикл
			Если не ЗначениеЗаполнено(Стр.Статья) Тогда 
				Отказ = истина;
				Сообщить("В строке № " + Затраты.Индекс(Стр) + " не заполнена статья. Проведение невозможно.",СтатусСообщения.Важное);
			Конецесли;
			
		КонеЦЦИкла;
		
		Если не отказ Тогда
			Для каждого стр из ЗатратыМесяц Цикл
				////////////////////////////////////////////////////////
				ц=0;
				//Если не(стр.ОтменитьМесяц) Тогда 
				Для Каждого Подразделение из Подразделения Цикл
					ц=ц+1;
					СуммаПодразделения = Стр["Месяц1"+"СуммаПодразделение"+ц];
					Если СуммаПодразделения<>0 Тогда 
						Движение = движения.БюджетРасходовМесячный.Добавить();
						Движение.Подразделение = подразделение; 
						Движение.Месяц = НомерМесяца;
						Движение.Период = НачПериода;
						Движение.Сумма = СуммаПодразделения;
						Движение.Состояние = Состояние;				
						Движение.Статья = Стр.Статья;				
						ЗаполнитьЗначенияСвойств(Движение,Стр);				
						Движения.БюджетРасходовМесячный.Записать();						
					КонецЕсли;
				КонеЦЦикла;
			КонецЦикла;
		КонецЕсли;		
	КонецЕсли;
	
	
	
	
	
	/////////////////////ДА
	
	 НаборДвижений = Движения.БюджетРасходыДМ;
	    ТаблицаДвижений = НаборДвижений.Выгрузить();
		ТаблицаДвижений.Очистить();

	    Если Полугодие = 1 тогда
			Месяц =0;
		Иначе
			Месяц =6;
		КонецЕсли;

		
		Если ВидОперации = Перечисления.ВидБюджета.Полугодие Тогда
		
	    Если не отказ Тогда
			Для каждого стр из Затраты Цикл
				////////////////////////////////////////////////////////
				Для й=1 по 6 Цикл
					ц=0;
					Для Каждого Подразделение из Подразделения Цикл
						ц=ц+1;
						СуммаПодразделения = Стр["Месяц"+й+"СуммаПодразделение"+ц];
						Если СуммаПодразделения<>0 Тогда 
							СтрокаДвижений = ТаблицаДвижений.Добавить();
							СтрокаДвижений.Подразделение = Подразделение; 
							СтрокаДвижений.Период = Дата(СтрЗаменить(Строка(Год),Символы.НПП,"")+ строка(Формат(Месяц +й,"ЧЦ=2; ЧВН="))+ "01000000");
							СтрокаДвижений.Менеджер = Ответственный;
							СтрокаДвижений.СуммаМесяц = СуммаПодразделения;		
							СтрокаДвижений.Статья = Стр.Статья;												
						КонецЕсли;
					КонеЦЦикла;
				КонеЦЦикла;
				
			КонецЦикла;
		КонецЕсли;
		
		
		
		Иначе 
		Для каждого Стр из ЗатратыМесяц Цикл
			Если не ЗначениеЗаполнено(Стр.Статья) Тогда 
				Отказ = истина;
				Сообщить("В строке № " + Затраты.Индекс(Стр) + " не заполнена статья. Проведение невозможно.",СтатусСообщения.Важное);
			Конецесли;
			
		КонеЦЦИкла;
		
		Если Полугодие = 1 тогда
			Месяц =0;
		Иначе
			Месяц =6;
		КонецЕсли;
		
		 Если не отказ Тогда
			Для каждого стр из ЗатратыМесяц Цикл
				////////////////////////////////////////////////////////
				//Для й=1 по 6 Цикл
					ц=0;
					Для Каждого Подразделение из Подразделения Цикл
						ц=ц+1;
						СуммаПодразделения = Стр["Месяц1"+"СуммаПодразделение"+ц];
						Если СуммаПодразделения<>0 Тогда 
							СтрокаДвижений = ТаблицаДвижений.Добавить();
							СтрокаДвижений.Подразделение = Подразделение; 
							СтрокаДвижений.Период = Дата(СтрЗаменить(Строка(Формат(ТекущаяДата(),"ДФ=yyyy")),Символы.НПП,"")+ строка(Формат(Месяц +НомерМесяца,"ЧЦ=2; ЧВН="))+ "01000000");
							СтрокаДвижений.Менеджер = Ответственный;
							СтрокаДвижений.СуммаМесяц = СуммаПодразделения;		
							СтрокаДвижений.Статья = Стр.Статья;												
						КонецЕсли;
					КонеЦЦикла;
				//КонеЦЦикла;
				
			КонецЦикла;
		КонецЕсли;

        КонецЕсли;
	Если ВидОперации = Перечисления.ВидБюджета.Месяц Тогда	
	Если Полугодие =1 Тогда
		Месяц = 0;
		
		//НаборДвижений = Движения.БюджетРасходыДМ;
		//Отбор = Новый Структура;
		//Отбор.Вставить("Период", Дата(СтрЗаменить(Строка(Год),Символы.НПП,"")+ строка(Формат(Месяц +НомерМесяца,"ЧЦ=2; ЧВН="))+ "01000000"));
		//Выб = ТаблицаДвижений.Скопировать(Отбор);
		
		НаборДвижений.мПериод            = Дата(СтрЗаменить(Строка(Формат(ТекущаяДата(),"ДФ=yyyy")),Символы.НПП,"")+ строка(Формат(Месяц +НомерМесяца,"ЧЦ=2; ЧВН="))+ "01000000");
	    НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	    НаборДвижений.Записывать = Истина;
	    НаборДвижений.ВыполнитьДвижения();
		Месяц = Месяц + 1;
		
	иначе
		Месяц = 6;
		
		//НаборДвижений = Движения.БюджетРасходыДМ;
		//Отбор = Новый Структура;
		//Отбор.Вставить("Период", Дата(СтрЗаменить(Строка(Год),Символы.НПП,"")+ строка(Формат(Месяц +НомерМесяца,"ЧЦ=2; ЧВН="))+ "01000000"));
		//Выб = ТаблицаДвижений.Скопировать(Отбор);
		
		НаборДвижений.мПериод            = Дата(СтрЗаменить(Строка(Формат(ТекущаяДата(),"ДФ=yyyy")),Символы.НПП,"")+ строка(Формат(Месяц +НомерМесяца,"ЧЦ=2; ЧВН="))+ "01000000");
	    НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	    НаборДвижений.Записывать = Истина;
	    НаборДвижений.ВыполнитьДвижения();
		Месяц = Месяц + 1;
		

	КонецЕсли;
Иначе
	Если Полугодие =1 Тогда
		Месяц = 1;
		Пока Месяц < 7 Цикл 
		НаборДвижений = Движения.БюджетРасходыДМ;
		Отбор = Новый Структура;
        Отбор.Вставить("Период", Дата(СтрЗаменить(Строка(Год),Символы.НПП,"")+ строка(Формат(Месяц,"ЧЦ=2; ЧВН="))+ "01000000"));
        Выб = ТаблицаДвижений.Скопировать(Отбор);
		
		НаборДвижений.мПериод            = Дата(СтрЗаменить(Строка(Год),Символы.НПП,"")+ строка(Формат(Месяц,"ЧЦ=2; ЧВН="))+ "01000000");
	    НаборДвижений.мТаблицаДвижений   = Выб;
	    НаборДвижений.Записывать = Истина;
	    НаборДвижений.ВыполнитьДвижения();
		Месяц = Месяц + 1;
		КонецЦикла;
	иначе
		Месяц = 7;
		Пока Месяц < 13 Цикл
		НаборДвижений = Движения.БюджетРасходыДМ;
		Отбор = Новый Структура;
        Отбор.Вставить("Период", Дата(СтрЗаменить(Строка(Год),Символы.НПП,"")+ строка(Формат(Месяц,"ЧЦ=2; ЧВН="))+ "01000000"));
        Выб = ТаблицаДвижений.Скопировать(Отбор);
		
		НаборДвижений.мПериод            = Дата(СтрЗаменить(Строка(Год),Символы.НПП,"")+ строка(Формат(Месяц,"ЧЦ=2; ЧВН="))+ "01000000");
	    НаборДвижений.мТаблицаДвижений   = Выб;
	    НаборДвижений.Записывать = Истина;
	    НаборДвижений.ВыполнитьДвижения();
		Месяц = Месяц + 1;
		КонецЦикла;

	КонецЕсли;
КонецЕсли;

Исключение

КонецПопытки;

  //10.11.2016
  
  Если ВидОперации = Перечисления.ВидБюджета.Полугодие Тогда
	  
	  ДвиженияПоРегистру();
	  
  КонецЕсли;
КонецПроцедуры

Процедура ДвиженияПоРегистру()
	
	Движения.Хозрасчетный.Очистить();
	Движения.Хозрасчетный.Записать();
	Движения.Хозрасчетный.Записывать = Истина;
	
	НаборДвижений = Движения.Хозрасчетный;
	
	Если Число(Формат(ПериодПланирования.ДатаНачала,"ДФ=yyyy")) = Число(Формат(ПериодПланирования.ДатаКонца,"ДФ=yyyy")) Тогда	
		КоличествоМесяцев = Число(Формат(ПериодПланирования.ДатаКонца,"ДФ=MM")) - Число(Формат(ПериодПланирования.ДатаНачала,"ДФ=MM")) +1;
	иначе
		КоличествоМесяцев = 12 - Число(Формат(ПериодПланирования.ДатаНачала,"ДФ=MM")) +1 + Число(Формат(ПериодПланирования.ДатаКонца,"ДФ=MM"));
	КонецЕсли;
	
	Для каждого стр из Затраты Цикл
		
		Датаии = ПериодПланирования.ДатаНачала;
		
		для ии = 1 по КоличествоМесяцев Цикл			
			СоздатьПроводку(ии,Датаии,стр,НаборДвижений,"СуммаПодразделение1",Справочники.Подразделения.НайтиПоКоду("00005"));
			СоздатьПроводку(ии,Датаии,стр,НаборДвижений,"СуммаПодразделение2",Справочники.Подразделения.НайтиПоКоду("00133"));
			СоздатьПроводку(ии,Датаии,стр,НаборДвижений,"СуммаПодразделение3",Справочники.Подразделения.НайтиПоКоду("00133"));
			СоздатьПроводку(ии,Датаии,стр,НаборДвижений,"СуммаПодразделение4",Справочники.Подразделения.НайтиПоКоду("00133"));
			СоздатьПроводку(ии,Датаии,стр,НаборДвижений,"СуммаПодразделение5",Справочники.Подразделения.НайтиПоКоду("00133"));
			Датаии = ДобавитьМесяц(Датаии,1);
		КонецЦикла;
	КонецЦикла;

	
КонецПроцедуры

Процедура СоздатьПроводку(ии,Датаии,стр,НаборДвижений,СтрокаПодразделение,Подразделение)
	
	СтрокаДвижений = НаборДвижений.Добавить();
	
	СтрокаДвижений.Период            = Датаии+5;
	
	СтрокаДвижений.ПериодПланирования = ПериодПланирования;
	СтрокаДвижений.Организация = Справочники.Организации.НайтиПоКоду("00001");
	
	СтрокаДвижений.Менеджер = Ответственный;
	
	СтрокаДвижений.СЧЕТДТ = ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы;
	
	УстановитьСубконто(СтрокаДвижений.СчетДт,СтрокаДвижений.СубконтоДт,"Подразделения",        Подразделение);
	УстановитьСубконто(СтрокаДвижений.СчетДт,СтрокаДвижений.СубконтоДт,"СтатьиЗатрат",        стр.статья);

	
	Если Найти(стр.статья.Наименование,"Амортизация")>0 тогда //амортизация
	СтрокаДвижений.СЧЕТКТ = ПланыСчетов.Хозрасчетный.ОСвОрганизации;
	
	иначе	
	СтрокаДвижений.СЧЕТКТ = ПланыСчетов.Хозрасчетный.РасчетныеСчета;
	
	
	УстановитьСубконто(СтрокаДвижений.СчетКт,СтрокаДвижений.СубконтоКт,"Подразделения",        Подразделение);
	УстановитьСубконто(СтрокаДвижений.СчетКт,СтрокаДвижений.СубконтоКт,"СтатьиДвиженияДенежныхСредств",       Справочники.СтатьиДвиженияДенежныхСредств.Затраты);
	УстановитьСубконто(СтрокаДвижений.СчетКт,СтрокаДвижений.СубконтоКт,"СтатьиЗатрат",        стр.статья);
    конецЕсли;	
	СтрокаДвижений.Сумма = стр["Месяц"+Строка(ии)+СтрокаПодразделение];
	
КонецПроцедуры

Процедура УстановитьСубконто(Счет, Субконто, ИмяСубконто, ЗначениеСубконто, Сообщать = Ложь, Заголовок = "", ВидыСубконтоСчета = Неопределено) Экспорт

	Если Счет = Неопределено ИЛИ Счет.Пустая() Тогда
		Возврат;
	КонецЕсли;

	Если ВидыСубконтоСчета = Неопределено Тогда
	     ВидыСубконтоСчета = Счет.ВидыСубконто;
	КонецЕсли; 
	
	Если ТипЗнч(ИмяСубконто) = Тип("Число") Тогда

		Если ИмяСубконто > ВидыСубконтоСчета.Количество() Тогда
			Возврат;
		КонецЕсли;

		ВидСубк = ВидыСубконтоСчета[ИмяСубконто - 1].ВидСубконто;

	Иначе

		ВидСубк = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные[ИмяСубконто];

		Если ВидыСубконтоСчета.Найти(ВидСубк) = Неопределено Тогда
			Возврат;
		КонецЕсли;

	КонецЕсли;

	Если ВидСубк.ТипЗначения.СодержитТип(ТипЗнч(ЗначениеСубконто)) Тогда
		Субконто.Вставить(ВидСубк, ЗначениеСубконто);
	КонецЕсли;

КонецПроцедуры // УстановитьСубконто()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ДокументОСнование = ДанныеЗаполнения;
	ВидОперации = Перечисления.ВидБюджета.Месяц;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодПланирования = Справочники.ПериодыПланирования.ПустаяСсылка();
	Состояние = Перечисления.СостоянияОбъектов.ПустаяСсылка();
КонецПроцедуры
