
Процедура КнопкаВыполнитьНажатие(Кнопка)
	ПустойКлиент = справочники.Контрагенты.ПустаяСсылка();
	РезервныйИМ  = справочники.Контрагенты.НайтиПоКоду("П004703");
	k=0;
	для каждого стр1 из ДеревоКлиентов.Строки цикл
		для каждого стр2 из стр1.Строки цикл
			Если не стр2.резервИМ тогда
				клиентОб = стр2.Клиент.ПолучитьОбъект();
				клиентОб.КонтрагентДляРезерваИМ = ПустойКлиент;
				попытка
					клиентОб.Записать();
					k = k+1;
					Сообщить(строка(k)+" выключен "+строка(стр2.Клиент), СтатусСообщения.Информация);
				Исключение
					Сообщить("Не удалось записать "+строка(стр2.Клиент)+" : "+ОписаниеОшибки(), СтатусСообщения.Важное);
				КонецПопытки;
			КонецЕсли;	
			
			Если стр2.резервИМ и стр2.Клиент.КонтрагентДляРезерваИМ = ПустойКлиент тогда
				клиентОб = стр2.Клиент.ПолучитьОбъект();
				клиентОб.КонтрагентДляРезерваИМ = РезервныйИМ;
				попытка
					клиентОб.Записать();
					k = k+1;
					Сообщить(строка(k)+" ВКЛючен "+строка(стр2.Клиент), СтатусСообщения.Информация);
				Исключение
					Сообщить("Не удалось записать "+строка(стр2.Клиент)+" : "+ОписаниеОшибки(), СтатусСообщения.Важное);
				КонецПопытки;
			КонецЕсли;	
			
		КонецЦикла;
	КонецЦикла;
Сообщить("Изменено "+строка(k)+" клиентов.");
КонецПроцедуры

Процедура ОсновныеДействияФормыОбновить(Кнопка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Родитель КАК Папка,
	               |	Контрагенты.Ссылка КАК Клиент,
	               |	ИСТИНА КАК РезервИМ
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.КонтрагентДляРезерваИМ = &РезервИМ
	               |	И Контрагенты.Ссылка <> &РезервИМ
				   |	И Контрагенты.Родитель<>Значение(справочник.Контрагенты.КлиентыИМ)
	               |ИТОГИ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Клиент),
	               |	МАКСИМУМ(РезервИМ)
	               |ПО
	               |	Папка";
	
	Запрос.УстановитьПараметр("РезервИМ", справочники.Контрагенты.НайтиПоКоду("П004703") );
	
	Результат = Запрос.Выполнить();
	выборка1 = Результат.выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	пока выборка1.Следующий() цикл
		стр1 = ДеревоКлиентов.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(стр1, выборка1);
		выборка2 = выборка1.выбрать();
		пока выборка2.Следующий() цикл
		стр2 = стр1.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(стр2, выборка2);
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

Процедура ПриОткрытии()
	ОсновныеДействияФормыОбновить(неопределено);
КонецПроцедуры

Процедура ДеревоКлиентовРезервИМПриИзменении(Элемент)
	стр1 = ЭлементыФормы.ДеревоКлиентов.ТекущиеДанные;
	Если стр1.строки.Количество()>0 тогда
		если вопрос("Изменить всех клиентов папки '"+строка(стр1.Папка)+"' ?", РежимДиалогаВопрос.ДаНет,0)=КодВозвратаДиалога.Да тогда
			для каждого стр2 из стр1.строки цикл
				стр2.резервИМ = стр1.резервИМ;
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Процедура ДеревоКлиентовПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если ТипЗнч(ДанныеСтроки.Клиент) = тип("СправочникСсылка.Контрагенты") тогда
		Если ДанныеСтроки.резервИМ и ДанныеСтроки.Клиент.КонтрагентДляРезерваИМ.Пустая() тогда
			ОформлениеСтроки.Шрифт = новый Шрифт(ОформлениеСтроки.Шрифт ,,,Истина);
		КонецЕсли;	
		Если НЕ ДанныеСтроки.резервИМ и ДанныеСтроки.Клиент.КонтрагентДляРезерваИМ=справочники.Контрагенты.НайтиПоКоду("П004703") тогда
			ОформлениеСтроки.Шрифт = новый Шрифт(ОформлениеСтроки.Шрифт ,,,Истина);
		КонецЕсли;	
	Иначе
		ОформлениеСтроки.ЦветФона = webЦвета.СветлоЖелтый;
	КонецЕсли;	
КонецПроцедуры
