
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		// Заполнение шапки
		ДатаДоставкиС = ДанныеЗаполнения.ДатаОтгрузки;
		ДатаДоставкиПо = ДанныеЗаполнения.ДатаОтгрузки;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Основание = ДанныеЗаполнения.Ссылка;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Сумма = ДанныеЗаполнения.СуммаДокумента;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда	
		//ДатаДоставкиС = ДанныеЗаполнения.ДатаОтгрузки;
		//ДатаДоставкиПо = ДанныеЗаполнения.ДатаОтгрузки;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Основание = ДанныеЗаполнения.Ссылка;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Сумма = ДанныеЗаполнения.СуммаДокумента;	
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗначениеНеЗаполнено(ДатаДоставкиС) 
		или ЗначениеНеЗаполнено(ДатаДоставкиПо) 
		или (ЗначениеНеЗаполнено(Объем) и ЗначениеНеЗаполнено(Штуки)) Тогда
		Отказ = Истина;
		Сообщить("Не все ОБЯЗАТЕЛЬНЫЕ поля заполнены!!!");
	КонецЕсли;
	Если Точки.Количество() = 0 Тогда
		Отказ = Истина;
		Сообщить("Дожна быть указана хотя бы одна точка маршрута!!!");
	КонецЕсли;
КонецПроцедуры
