
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	//Если не РольДоступна("ПолныеПрава") тогда
	ПолеОтбора1 = Новый ПолеКомпоновкиДанных("МенеджерПоДоговору");
	
	для i=0 по КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество()-1 цикл
		НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Получить(i);
		Если НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора1 тогда
			НовыйЭлементОтбора1 = НовыйЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если НовыйЭлементОтбора1 = неопределено тогда
	НовыйЭлементОтбора1 = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора1.ПравоеЗначение = ПолеОтбора1;
	КонецЕсли;
	
	НовыйЭлементОтбора1.ВидСравнения =ВидСравненияКомпоновкиДанных.ВСписке;
	
	СписокМенеджеров = ПолучитьСписокПользователейСвоейГруппы();
	
    НовыйЭлементОтбора1.ПравоеЗначение = СписокМенеджеров;
	НовыйЭлементОтбора1.Использование = истина;
	
	Флажок1 = ложь;
	
	ДатаНач = НачалоНедели( ТекущаяДата() ) - 7*86400;
	
	//КонецЕсли;	
КонецПроцедуры


Процедура ОбновлениеОтображения()
	
		//Если не РольДоступна("ПолныеПрава") тогда
	ПолеОтбора0 = Новый ПолеКомпоновкиДанных("МенеджерПоДоговору");
	ПолеОтбора1 = Новый ПолеКомпоновкиДанных("Контрагент");
	ПолеОтбора2 = Новый ПолеКомпоновкиДанных("ЗаказПокупателя.Статус");
	
	для i=0 по КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество()-1 цикл
		НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Получить(i);
		Если НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора0 тогда
			НовыйЭлементОтбора0 = НовыйЭлементОтбора;
		ИначеЕсли НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора1 тогда
			НовыйЭлементОтбора1 = НовыйЭлементОтбора;
		ИначеЕсли НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора2 тогда
			НовыйЭлементОтбора2 = НовыйЭлементОтбора;
		КонецЕсли;
	КонецЦикла;

 	Если НовыйЭлементОтбора0 = неопределено и СписокМенеджеров.Количество()>0 тогда
	НовыйЭлементОтбора0 = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора0.ПравоеЗначение = ПолеОтбора0;
	КонецЕсли;     
	НовыйЭлементОтбора0.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	НовыйЭлементОтбора0.ПравоеЗначение = СписокМенеджеров;
	НовыйЭлементОтбора0.Использование  = (СписокМенеджеров.Количество()>0);

	Если НовыйЭлементОтбора1 = неопределено и не КонтрагентОтбора.Пустая() тогда
		НовыйЭлементОтбора1 = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора1.ПравоеЗначение = ПолеОтбора1;
	КонецЕсли;
	НовыйЭлементОтбора1.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементОтбора1.ПравоеЗначение = КонтрагентОтбора;
	НовыйЭлементОтбора1.Использование = не КонтрагентОтбора.Пустая();
	
	Если НовыйЭлементОтбора2 = неопределено тогда
	НовыйЭлементОтбора2 = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора2.ПравоеЗначение = ПолеОтбора2;
	КонецЕсли;     
	
	если Флажок1 тогда //ТОЛЬКО доставленные
	НовыйЭлементОтбора2.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	иначе //только НЕ доставленные
 	НовыйЭлементОтбора2.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	КонецЕсли;
	НовыйЭлементОтбора2.Использование  = истина; //обратный флаг!
	
КонецПроцедуры


Процедура ДатаНачПриИзменении(Элемент)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Дата");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = ДатаНач;
КонецПроцедуры


Процедура ДатаНачРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ДатаНачПриИзменении(неопределено);
КонецПроцедуры


Процедура ПослеВосстановленияЗначений()
	
		//Если не РольДоступна("ПолныеПрава") тогда
	ПолеОтбора0 = Новый ПолеКомпоновкиДанных("МенеджерПоДоговору");
	ПолеОтбора1 = Новый ПолеКомпоновкиДанных("Контрагент");
	ПолеОтбора2 = Новый ПолеКомпоновкиДанных("ЗаказПокупателя.Статус");
	
	для i=0 по КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество()-1 цикл
		НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Получить(i);
		Если НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора0 тогда
			НовыйЭлементОтбора0 = НовыйЭлементОтбора;
		ИначеЕсли НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора1 тогда
			НовыйЭлементОтбора1 = НовыйЭлементОтбора;
		ИначеЕсли НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора2 тогда
			НовыйЭлементОтбора2 = НовыйЭлементОтбора;
		КонецЕсли;
	КонецЦикла;
	
	СписокМенеджеров = НовыйЭлементОтбора0.ПравоеЗначение;
	КонтрагентОтбора = НовыйЭлементОтбора1.ПравоеЗначение;
	Флажок1 = (НовыйЭлементОтбора2.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно);
	
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Дата");
   ДатаНач     = ПараметрСКД.Значение;
	
КонецПроцедуры



