
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	стандартнаяОбработка=Ложь;
	
	//получим среднее по деньгам в товарных группах	
	ТабНомН = Новый ТаблицаЗначений;
	
	текСхема = ПолучитьМакет("ДеньгиВТоварныхГруппах");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
   ПараметрСКД = текСхема.НастройкиПоУмолчанию.ПараметрыДанных.Элементы.найти("началоПериода");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = НачПериода;
   ПараметрСКД = текСхема.НастройкиПоУмолчанию.ПараметрыДанных.Элементы.найти("КонецПериода");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = КонецДНя(КонПериода);
	
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(текСхема,текСхема.НастройкиПоУмолчанию, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТабНомН);// выгружать в таблицу значений
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Ложь);
	
	
	
	
	
	
	
	
	
	
	
	
	
    //передадим таблицу в другую схему	
	СхемаКомпоновкиДанных = ПолучитьМакет("макет");
	Настройки = КомпоновщикНастроек.Настройки;
   	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = НачПериода;
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = КонецДня(КонПериода);

   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Ставка");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = ставка;

   
   ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ВнешнийНаборДанных = Новый Структура("ТабНомН", ТабНомН);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки,истина);
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	


КонецПроцедуры
