Функция Печать() Экспорт
	
	ТабДокумент = ПечатьПоЗаказуПокупателя();
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт; 
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
			
КонецФункции // Печать

Функция ПечатьПоЗаказуПокупателя()
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПровереннаяНагрузкаДисков.ПрошедшаяНагрузка,
		|	ПровереннаяНагрузкаДисков.Номенклатура,
		|	Типоразмеры.Ссылка
		|ПОМЕСТИТЬ НАгрузка
		|ИЗ
		|	РегистрСведений.ПровереннаяНагрузкаДисков КАК ПровереннаяНагрузкаДисков
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Типоразмеры КАК Типоразмеры
		|		ПО (Типоразмеры.Ссылка = ПровереннаяНагрузкаДисков.Номенклатура.Типоразмер)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Номенклатура.Код КАК Код,
		|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
		|	ПеремещениеТоваровТовары.Количество КАК Количество,
		|	ПеремещениеТоваровТовары.Номенклатура.Производитель КАК Производитель,
		|	ПеремещениеТоваровТовары.Номенклатура.Модель КАК Модель,
		|	НАгрузка.ПрошедшаяНагрузка КАК Нагрузка
		|ИЗ
		|	Документ."+?(ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ЗаказПокупателя"), "ЗаказПокупателя","ПеремещениеТоваров")+".Товары КАК ПеремещениеТоваровТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ НАгрузка КАК НАгрузка
		|		ПО ПеремещениеТоваровТовары.Номенклатура.Модель = НАгрузка.Номенклатура.Модель
		|			И ПеремещениеТоваровТовары.Номенклатура.Производитель = НАгрузка.Номенклатура.Производитель
		|			И ПеремещениеТоваровТовары.Номенклатура.Типоразмер.Диаметр = НАгрузка.Ссылка.Диаметр
		|			И ПеремещениеТоваровТовары.Номенклатура.Типоразмер.Ширина = НАгрузка.Ссылка.Ширина
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		|	И ПеремещениеТоваровТовары.Номенклатура.ВидТовара = &ВидТовара
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПеремещениеТоваровТовары.НомерСтроки";
		
		Запрос.УстановитьПараметр("ВидТовара", Перечисления.ВидыТоваров.Диски);
    Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);                                  
	Результат = Запрос.Выполнить();                                                                        

	ВыборкаДетальныеЗаписи = Результат.Выгрузить();
    Ном = Неопределено;
	Нагрузка = Неопределено;
	КоличествоИтого = 0;
	
	попытка
	НомерКонтейнера = СсылкаНаОбъект.ДокументОснование.сделка.НомерКонтейнера;
	поставщик = СсылкаНаОбъект.ДокументОснование.ДоговорКонтрагента.Поставщик;
	Заголовок = Макет.ПолучитьОбласть("Заголовок");
	Заголовок.параметры.поставщик = поставщик;
	Заголовок.параметры.НомерКонтейнера = НомерКонтейнера;
	ТабДокумент.Вывести(Заголовок);

исключение
	конецПопытки;
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДокумент.Вывести(Шапка);
	Областьстроки = Макет.ПолучитьОбласть("Строка");
	//ОбластьКартинка = Макет.ПолучитьОбласть("строка");
		
	Для каждого стр из ВыборкаДетальныеЗаписи Цикл
		Если Ном <> стр.Номенклатура Тогда
			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура", Стр.Номенклатура);
			НоменклатураЗамер = ВыборкаДетальныеЗаписи.НайтиСтроки(Отбор);
			
			Для каждого ст из НоменклатураЗамер цикл
				Нагрузка = "" +	ст.Нагрузка+ "; "  + Нагрузка ;
			КонецЦикла;
			
			
			//ЗаполнитьЗначенияСвойств(Областьстроки, ВыборкаДетальныеЗаписи); 
			Областьстроки.Параметры.Код = стр.Код;
			Областьстроки.Параметры.Номенклатура = стр.Номенклатура;
			Областьстроки.Параметры.Нагрузка = Нагрузка;
			Областьстроки.Параметры.количество = стр.количество;
			Нагрузка = Неопределено;
			КоличествоИтого = КоличествоИтого + стр.количество;
			
			ФайлПустаяКартинка=ПолучитьФайлССервера("http://photo.yst.ru/nopic_tyre_s.png");
			Областьстроки.Рисунки.Очистить();
			АдресКартинки = ПолучитьАдресКартинкиТовара(стр.Номенклатура);
			Картинка = неопределено;
			Если АдресКартинки<>"" и АдресКартинки <> неопределено тогда
				ФайлКартинки = ПолучитьФайлССервера(АдресКартинки);
				Если ФайлКартинки<>"" тогда				
					Картинка = неопределено;
					Если АдресКартинки<>"" и АдресКартинки <> неопределено тогда
						Картинка = Новый Картинка(ПолучитьФайлССервера(АдресКартинки));
						Если  Картинка = Неопределено Тогда
							Картинка = Новый Картинка(ФайлПустаяКартинка);
						КонецЕсли;	
						ФотоТовара = Областьстроки.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
						ФотоТовара.Верх = 0;
						ФотоТовара.Лево = 0;
						ФотоТовара.РазмерКартинки = РазмерКартинки.Пропорционально;
						ФотоТовара.Картинка = Картинка;
						ФотоТовара.Расположить(Областьстроки.Область(1, 2, 1, 1));
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			//ТабДокумент.Присоединить(ОбластьКартинка);
			ТабДокумент.Вывести(Областьстроки);
		    Ном = стр.Номенклатура;

		КонецЕсли;
		
		
	КонецЦикла;
    ОбластьИтог = Макет.ПолучитьОбласть("Итог");
    ОбластьИтог.Параметры.итогоколичество = КоличествоИтого;
	ТабДокумент.Вывести(ОбластьИтог);

Возврат ТабДокумент;	
	
КонецФункции