Функция ИзменитьКомментарий(НачальныйКомментарий) Экспорт
	Комментарий = НачальныйКомментарий;
	Возврат ОткрытьМодально();
КонецФункции

Процедура КнопкаВыполнитьНажатие(Кнопка)
	НажатОК=	Истина;
	Закрыть(Комментарий);
КонецПроцедуры

Процедура ИмяФайлаНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ДиалогСохраненияФайла=								Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогСохраненияФайла.МножественныйВыбор= 			Ложь;
	ДиалогСохраненияФайла.ПолноеИмяФайла=				Элемент.Значение;
	ДиалогСохраненияФайла.ПредварительныйПросмотр=		Ложь;
	ДиалогСохраненияФайла.ПроверятьСуществованиеФайла=	Ложь;

	ДиалогСохраненияФайла.Каталог=						Элемент.Значение;
	Если ДиалогСохраненияФайла.Выбрать() Тогда
		ИмяФайла=	ДиалогСохраненияФайла.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

Процедура ПриОткрытии()
	
	КартинкаЗаголовка= ЭДО_БиблиотекаКартинок().КартинкаЗаголовка;
	
	УстановитьРежимСверткиЭлементаУправления(ЭлементыФормы.ПанельВложения, ?(ВыборФайла, РежимСверткиЭлементаУправления.Нет, РежимСверткиЭлементаУправления.Низ));
	
КонецПроцедуры
