
Процедура ПередОткрытием()
	
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ТипДоговораПредоплата");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = Справочники.ТипыДоговоров.НайтиПоКоду("00001");
   
   НачПериода1 = НачалоМесяца( ТекущаяДата() - 14 * 86400);
   КонПериода1 =  КонецМесяца( ТекущаяДата() - 14 * 86400);
   
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачДата");
   ПараметрСКД.Значение = НачПериода1;
   
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонДата");
   ПараметрСКД.Значение = КонецДня(КонПериода1);
   
   флРук = (ГлТекущийПользователь.НаправлениеПродаж.Руководитель = ГлТекущийПользователь);
   
   //+++ 18.04.2016 - руководитель Подразделения - тоже все видит
   если ГлТекущийПользователь.ОсновноеПодразделение.Руководитель = ГлТекущийПользователь тогда
	   флРук = истина;
   КонецЕсли;
   
   если не ( РольДоступна("ПолныеПрава") 
		или Найти(глТекущийПользователь.Код, "Бондаренко")>0
			) тогда 
			для i=0 по КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество()-1 цикл
 			Отбор1 = КомпоновщикНастроек.Настройки.Отбор.Элементы[i];
			
			    если флРук и строка(Отбор1.ЛевоеЗначение) ="НаправлениеПродаж" тогда
					Отбор1.ВидСравнения	  = ВидСравненияКомпоновкиДанных.Равно;
		 			Отбор1.ПравоеЗначение = ГлТекущийПользователь.НаправлениеПродаж;
					Отбор1.Использование  =	Истина;
					прервать;
				ИначеЕсли НЕ флРук и строка(Отбор1.ЛевоеЗначение) ="Менеджер" тогда
					Отбор1.ВидСравнения	  = ВидСравненияКомпоновкиДанных.Равно;
		 			Отбор1.ПравоеЗначение = ГлТекущийПользователь;
					Отбор1.Использование  =	Истина;
					прервать;
				КонецЕсли;
				
			КонецЦикла;
	Иначе //---- для полных прав или Бондаренко-----------------------------------------------
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СписокИскл");
   		ПараметрСКД.Значение      = СписокИскл;
		
		ЭлементыФормы.СписокИскл.ТолькоПросмотр = ложь;
    КонецЕсли;
		
КонецПроцедуры
                                          
Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода1, ?(КонПериода1='0001-01-01', КонПериода1, КонецДня(КонПериода1)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода1 = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода1 = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
	
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачДата");
   ПараметрСКД.Значение = НачПериода1;
   
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонДата");
   ПараметрСКД.Значение = КонецДня(КонПериода1);
   ПредупреждениеБольшеМесяца()
КонецПроцедуры

Процедура НачПериода1ПриИзменении(Элемент)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачДата");
   ПараметрСКД.Значение = НачПериода1;
   ПредупреждениеБольшеМесяца()
КонецПроцедуры

Процедура КонПериода1ПриИзменении(Элемент)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонДата");
   ПараметрСКД.Значение = КонПериода1;
   ПредупреждениеБольшеМесяца()
КонецПроцедуры

Процедура ПредупреждениеБольшеМесяца()
	//год.месяц  как число
	дельта = Год(КонПериода1)+Месяц(КонПериода1)/100 - Год(НачПериода1) - Месяц(НачПериода1)/100;
	Если дельта < 0 тогда
		Предупреждение("Дата окончания должна быть больше даты начала!", 10);
	иначеЕсли дельта > 0 тогда
		Предупреждение("    При интервале более одного месяца
						|Планы продаж по клиенту - суммируются.", 30);
	КонецЕсли;
	
КонецПроцедуры

Процедура СписокИсклПриИзменении(Элемент)
	
	i=0;
	пока i<СписокИскл.Количество() цикл
		Если не СписокИскл[i].Значение.ЯШТТерминал  тогда 
			сообщить("Контрагент: "+строка(СписокИскл[i].Значение)+" - не включен флаг [ ] Терминал!");
			СписокИскл.Удалить( i );
		иначе
			i=i+1;
		КонецЕсли;	
	КонецЦикла;	
	
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СписокИскл");
   	ПараметрСКД.Значение      = СписокИскл;
	
КонецПроцедуры

