
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	 // по сезонным заказам покупателя
	//сравним остатки по записям из таб. части. Спишем наименьшее и остатка и кол-ва из таб части 
	//НаборДвижений =  Движения.ЗаказыПокупателейСезонные;
	//НаборДвижений.Очистить();
 	Запрос = Новый Запрос;
	Запрос.Текст = 
				   "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.ЗаказПокупателяСезонный,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.Контрагент,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.Номенклатура,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.Аналог,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.ЗаказПокупателя,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.ВРезерве,
				   |	СУММА(ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.Количество) КАК Количество
				   |ПОМЕСТИТЬ СезонныеЗаказы
				   |ИЗ
				   |	Документ.ЗакрытиеЗаказовПокупателейСезонных.ОстаткиПоЗаказам КАК ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам
				   |ГДЕ
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.Ссылка = &Ссылка
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.ЗаказПокупателяСезонный,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.Контрагент,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.Номенклатура,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.Аналог,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.ЗаказПокупателя,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.ВРезерве
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ЗаказыПокупателейСезонныеОстатки.Контрагент,
				   |	ЗаказыПокупателейСезонныеОстатки.ЗаказПокупателяСезонный,
				   |	ЗаказыПокупателейСезонныеОстатки.Номенклатура,
				   |	ЗаказыПокупателейСезонныеОстатки.Аналог,
				   |	ЗаказыПокупателейСезонныеОстатки.ЗаказПокупателя,
				   |	ЗаказыПокупателейСезонныеОстатки.ВРезерве,
				   |	ВЫБОР
				   |		КОГДА ЗаказыПокупателейСезонныеОстатки.ВРезерве
				   |			ТОГДА ЗаказыПокупателейСезонныеОстатки.КоличествоОстаток
				   |		ИНАЧЕ -ЗаказыПокупателейСезонныеОстатки.КоличествоОстаток
				   |	КОНЕЦ КАК Количество,
				   |	ЗаказыПокупателейСезонныеОстатки.Подразделение
				   |ПОМЕСТИТЬ Остатки
				   |ИЗ
				   |	РегистрНакопления.ЗаказыПокупателейСезонные.Остатки(
				   |			&МоментДокумента,
				   |			(ЗаказПокупателяСезонный, Контрагент, Номенклатура, Аналог, ЗаказПокупателя, ВРезерве) В
				   |				(ВЫБРАТЬ
				   |					СезонныеЗаказы.ЗаказПокупателяСезонный,
				   |					СезонныеЗаказы.Контрагент,
				   |					СезонныеЗаказы.Номенклатура,
				   |					СезонныеЗаказы.Аналог,
				   |					СезонныеЗаказы.ЗаказПокупателя,
				   |					СезонныеЗаказы.ВРезерве
				   |				ИЗ
				   |					СезонныеЗаказы КАК СезонныеЗаказы)) КАК ЗаказыПокупателейСезонныеОстатки
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	СезонныеЗаказы.ЗаказПокупателяСезонный,
				   |	СезонныеЗаказы.Контрагент,
				   |	СезонныеЗаказы.Номенклатура,
				   |	СезонныеЗаказы.Аналог,
				   |	СезонныеЗаказы.ЗаказПокупателя,
				   |	СезонныеЗаказы.ВРезерве,
				   |	ВЫБОР
				   |		КОГДА Остатки.Количество > СезонныеЗаказы.Количество
				   |			ТОГДА Остатки.Количество
				   |		ИНАЧЕ СезонныеЗаказы.Количество
				   |	КОНЕЦ КАК Количество,
				   |	ВЫБОР
				   |		КОГДА СезонныеЗаказы.ВРезерве
				   |			ТОГДА &Расход
				   |		ИНАЧЕ &Приход
				   |	КОНЕЦ КАК ВидДвижения,
				   |	Остатки.Подразделение
				   |ИЗ
				   |	Остатки КАК Остатки
				   |		ЛЕВОЕ СОЕДИНЕНИЕ СезонныеЗаказы КАК СезонныеЗаказы
				   |		ПО (СезонныеЗаказы.ЗаказПокупателяСезонный = Остатки.ЗаказПокупателяСезонный)
				   |			И (СезонныеЗаказы.Контрагент = Остатки.Контрагент)
				   |			И (СезонныеЗаказы.Номенклатура = Остатки.Номенклатура)
				   |			И (СезонныеЗаказы.Аналог = Остатки.Аналог)
				   |			И (СезонныеЗаказы.ЗаказПокупателя = Остатки.ЗаказПокупателя)
				   |			И (СезонныеЗаказы.ВРезерве = Остатки.ВРезерве)";
				   
				
	Запрос.УстановитьПараметр("МоментДокумента", ссылка.МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", ссылка);
	Запрос.УстановитьПараметр("Приход",ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Расход", ВидДвиженияНакопления.Расход);
	ТаблицаДвиженийПоЗаказам = Запрос.Выполнить().Выгрузить();

   	Если ТаблицаДвиженийПоЗаказам.Количество()>0 Тогда
		НаборДвижений = Движения.ЗаказыПокупателейСезонные;
		НаборДвижений.Очистить();
		НаборДвижений.Записывать = Истина;
		ТаблицаДвижений = НаборДвижений.Выгрузить();
		ТаблицаДвижений.Очистить();
		ЗагрузитьВТаблицуЗначений(ТаблицаДвиженийПоЗаказам, ТаблицаДвижений);
		ТаблицаДвижений.ЗаполнитьЗначения(МоментВремени(),"МоментВремени");
		ТаблицаДвижений.ЗаполнитьЗначения(Дата,"Период");
		ТаблицаДвижений.ЗаполнитьЗначения(Истина,"Активность");
		//НаборДвижений.мПериод = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Движения.ЗаказыПокупателейСезонные.ВыполнитьДвижения();

	КонецЕсли;





КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателяСезонный") Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказыПокупателейСезонныеОстатки.Номенклатура,
		|	ВЫБОР
		|		КОГДА ЗаказыПокупателейСезонныеОстатки.ВРезерве = ИСТИНА
		|			ТОГДА ЗаказыПокупателейСезонныеОстатки.КоличествоОстаток
		|		ИНАЧЕ -ЗаказыПокупателейСезонныеОстатки.КоличествоОстаток
		|	КОНЕЦ КАК Количество,
		|	ЗаказыПокупателейСезонныеОстатки.Контрагент,
		|	ЗаказыПокупателейСезонныеОстатки.ЗаказПокупателяСезонный,
		|	ЗаказыПокупателейСезонныеОстатки.ВРезерве,
		|	ЗаказыПокупателейСезонныеОстатки.Аналог,
		|	ЗаказыПокупателейСезонныеОстатки.ЗаказПокупателя
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателейСезонные.Остатки(, ЗаказПокупателяСезонный = &ссылка) КАК ЗаказыПокупателейСезонныеОстатки";

	Запрос.УстановитьПараметр("ссылка", ДанныеЗаполнения.ссылка);

	Результат = Запрос.Выполнить().Выгрузить();
     ОстаткиПоЗаказам.Загрузить(Результат);
	КонецЕсли;
КонецПроцедуры
