
Процедура НачДатаПриИзменении(Элемент)
	
	ПараметрДатаНачала = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачДата"));
		
	ПараметрДатаНачала.Значение = НачДата;
	
КонецПроцедуры

Процедура КонДатаПриИзменении(Элемент)
	
	ПараметрДатаКонца = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонДата"));
		
	ПараметрДатаКонца.Значение = КонецДня(КонДата)+1;
		
КонецПроцедуры
	
Процедура КнопкаНастройкаПериодаНажатие(Элемент)
	
	Если НП.Редактировать() Тогда
		
		НачДата = НП.ПолучитьДатуНачала();
		КонДата = НП.ПолучитьДатуОкончания();
		
		ПараметрДатаНачала = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачДата"));
		ПараметрДатаКонца = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонДата"));
		ПараметрДатаНачала.Значение = НачалоДня(НачДата);
		ПараметрДатаКонца.Значение = КонецДня(КонДата);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НастройкаОтбора()
	
	Если СписокОтбора.Количество() > 0 Тогда
		КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование = Отобрать;
		КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение = СписокОтбора;
	Иначе
		КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование = Ложь;
		КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение = Неопределено;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриОткрытии()
	СписокОтбораКонтрагентов = Новый СписокЗначений;
	СписокОтбораКонтрагентов.Добавить(Справочники.Контрагенты.НайтиПоКоду("92540"));
	СписокОтбораКонтрагентов.Добавить(Справочники.Контрагенты.НайтиПоКоду("91535"));
	СписокОтбораКонтрагентов.Добавить(Справочники.Контрагенты.НайтиПоКоду("П000715"));
	СписокОтбораКонтрагентов.Добавить(Справочники.Контрагенты.НайтиПоКоду("92160"));
	СписокОтбораКонтрагентов.Добавить(Справочники.Контрагенты.НайтиПоКоду("91834"));
	СписокОтбораКонтрагентов.Добавить(Справочники.Контрагенты.НайтиПоКоду("91735"));
	
	СписокОтбора = СписокОтбораКонтрагентов;
	НастройкаОтбора();
КонецПроцедуры

Процедура ОтобратьПриИзменении(Элемент)
	НастройкаОтбора();
КонецПроцедуры

Процедура СписокОтбораРегионовПриИзменении(Элемент)
	НастройкаОтбора();
КонецПроцедуры

Отобрать = Истина;