
	
	// Функция возвращает значение Неопределено при неверном вводе	
	
Функция ВернутьЧислоЧасовПереработки(Текст)  Экспорт
		Если СтрДлина(СокрЛП(Текст))=0 Тогда
			Возврат 0;
		КонецЕсли;	
	
	
	 ПозицияПробела=Найти(Текст," ");
		Если ПозицияПробела>0 Тогда
			СтрокаДляЧисла=Сред(Текст,ПозицияПробела+1,СтрДлина(Текст)-ПозицияПробела);
			Попытка
				Переработка = Число(СокрЛП(СтрокаДляЧисла));
				Возврат Переработка;
			Исключение	
				Возврат Неопределено;
			КонецПопытки		
			
		Иначе
			Попытка
				Переработка = Число(СокрЛП(Текст));
				Возврат Переработка;
			Исключение
				Возврат 0;
			КонецПопытки		
		КонецЕсли;	

	Возврат Неопределено;
	
	КонецФункции	

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	Если ЗначениеНеЗаполнено(ПериодРегистрации) Тогда
		СообщитьОбОшибке("Должен быть выбран период начисления") ;
		Отказ=Истина;
	КонецЕсли;	
	
	
	
	
	ГодПериода=Год(ПериодРегистрации);
	МесяцПериода=Месяц(ПериодРегистрации);
	Для счКол=1 по День(КонецМесяца(ПериодРегистрации) ) Цикл
		Для  счстр=0 по ДанныеТабеля.Количество()-1 Цикл
			
			Движение=Движения.ТабельРаботыКладовщиков.Добавить();
			Движение.Период = Дата(ГодПериода,МесяцПериода,счКол);
			Движение.Активность=Истина;
			Движение.Регистратор=ЭтотОбъект;
			Движение.ФизЛицо= ДанныеТабеля[счСтр].Сотрудник;
			
			Если счКол=1 Тогда
				Движение.Оклад1=ДанныеТабеля[счстр].Оклад1;
				Движение.Оклад2=ДанныеТабеля[счстр].Оклад2;
				Движение.Отпуск1=ДанныеТабеля[счстр].Отпуск1;
				Движение.Отпуск2=ДанныеТабеля[счстр].Отпуск2;
				Движение.Доплата=ДанныеТабеля[счстр].Доплата;
				Движение.Удержание=ДанныеТабеля[счстр].Удержание;
			Иначе
				Движение.Оклад1=0;
				Движение.Оклад2=0;
				Движение.Отпуск1=0;
				Движение.Отпуск2=0;
				Движение.Доплата=0;
				Движение.Удержание=0;
			КонецЕсли;
			
			Движение.ПереработкаЧасов=ВернутьЧислоЧасовПереработки(ДанныеТабеля[счСтр]["День"+счКол]);
			
		////+++ 24.10.2013	для учета отрицательных переработок - смягчено условие
		//	Если ДанныеТабеля[счСтр].ПереработкаСумма>0 И ДанныеТабеля[счСтр].ПереработкаЧасов>0 Тогда
			Если ДанныеТабеля[счСтр].ПереработкаСумма * ДанныеТабеля[счСтр].ПереработкаЧасов > 0 Тогда
			
				Движение.ПереработкаСумма=ДанныеТабеля[счСтр].ПереработкаСумма/ДанныеТабеля[счСтр].ПереработкаЧасов*Движение.ПереработкаЧасов;
				
		//+++ 24.10.2013 предупреждение если + часы и - сумма!
			ИначеЕсли ДанныеТабеля[счСтр].ПереработкаСумма * ДанныеТабеля[счСтр].ПереработкаЧасов<0 тогда
				Сообщить("Для сотрудника "+строка(Движение.ФизЛицо)+" нельзя назвачить переработку: "+строка(ДанныеТабеля[счСтр].ПереработкаЧасов)+"ч. с суммой "+строка(ДанныеТабеля[счСтр].ПереработкаСумма)+"р.",СтатусСообщения.Внимание);
				
			КонецЕсли;	
				
			//Движение.ПереработкаЧасов=ВернутьЧислоЧасовПереработки(ДанныеТабеля[счСтр]["День"+счКол]);
			
		КонецЦикла;		
	КонецЦикла;	
	
	Движения.ТабельРаботыКладовщиков.Записать(Истина);
	
КонецПроцедуры
