
Функция DownloadCalls(Employee,date1,date2)
	
	Дата1 = Дата(прав(date1,4)+Сред(date1,4,2)+Лев(date1,2)+"000000");
	Дата2 = Дата(прав(date2,4)+Сред(date2,4,2)+Лев(date2,2)+"235959");
	
	//Если Найти(Employee," ") > 0 Тогда
	//	
	//	Фамилия = прав(Employee,Найти(Employee," ")-1);
	//	Имя =  Лев(Employee,СтрДлина(Employee)-Найти(Employee," "));
	//	
	//иначе
	//	
	//	Фамилия = Employee;
	//	Имя = "";
	//	
	//КонецЕсли;
	
	ТЗИтог = Новый ТаблицаЗначений;
	
	ТЗИтог.Колонки.Добавить("Дата");
	ТЗИтог.Колонки.Добавить("Абонент");
	ТЗИтог.Колонки.Добавить("Продолжительность");
	ТЗИтог.Колонки.Добавить("Тип");
	ТЗИтог.Колонки.Добавить("Телефон");
	ТЗИтог.Колонки.Добавить("Ссылка");
	
	Запрос = Новый запрос;
	запрос.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(КонтактнаяИнформация.Объект) = ТИП(Справочник.КонтактныеЛица)
	|				И ТИПЗНАЧЕНИЯ(КонтактнаяИнформация.Объект.ОбъектВладелец) = ТИП(Справочник.Контрагенты)
	|			ТОГДА КонтактнаяИнформация.Объект.ОбъектВладелец
	|		ИНАЧЕ КонтактнаяИнформация.Объект
	|	КОНЕЦ КАК Объект,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Представление ПОДОБНО ""%___""";
	
	Телефоны = Запрос.Выполнить().Выгрузить();
	Обработать = Телефоны.Скопировать();
	
	
	
	КС = Новый КвалификаторыСтроки(6);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Телефоны.Колонки.Добавить("Поиск",ОписаниеТиповС);
	Телефоны.Очистить();
	Для каждого стр из Обработать Цикл
		Строка = Стр.Представление;
		Строка = СтрЗаменить(Строка,"(","");
		Строка = СтрЗаменить(Строка,")","");
		Строка = СтрЗаменить(Строка,"-","");
		Строка = СтрЗаменить(Строка,".",",");
		//Строка = СтрЗаменить(Строка,",","");
		Строка = СтрЗаменить(Строка," ","");
		Строка = СтрЗаменить(Строка,";",",");
		Строка = СтрЗаменить(Строка,":","");
		
		ТекущаяСтрока = СтрЗаменить(Строка, ",", Символы.ПС); 
		Для Счетчик = 1 По СтрЧислоСтрок(ТекущаяСтрока) Цикл
			Если СтрДлина(СтрПолучитьСтроку(ТекущаяСтрока, Счетчик)) > 2 Тогда
				Нов = Телефоны.Добавить();
				Нов.Объект = стр.Объект;
				Нов.Поиск = Прав(СтрПолучитьСтроку(ТекущаяСтрока, Счетчик),6);
			КонецЕсли;
		КонецЦикла;
		
		//стр.Поиск = Строка;
		
	КонецЦикла;
	
	
	
	ЗапросМобильные = Новый Запрос;
	ЗапросМобильные.УстановитьПараметр("Сотрудник","%"+Employee+"%");
	ЗапросМобильные.УстановитьПараметр("Телефоны",Телефоны);
	ЗапросМобильные.УстановитьПараметр("ДатаН",Дата1);
	ЗапросМобильные.УстановитьПараметр("ДатаК",Дата2);
	//ЗапросМобильные.УстановитьПараметр("Журнал",Журнал);	
	ЗапросМобильные.Текст = "ВЫБРАТЬ
	|	Журнал.Дата,
	|	Журнал.ПоискСотрудник КАК НомерСотрудника,
	|	Журнал.ПоискАбонент КАК НомерАбонента,
	|	Журнал.ДлительностьЗвонка,
	|	Журнал.Исход_Вход,
	|	Журнал.НомерСотрудника КАК НомерСотрудника1,
	|	Журнал.НомерАбонента КАК НомерАбонента1,
	|	Журнал.Ссылка
	|ПОМЕСТИТЬ Журнал
	|ИЗ
	|	РегистрСведений.ЖурналЗвонков КАК Журнал
	|ГДЕ
	|	Журнал.Дата МЕЖДУ &ДатаН И &ДатаК
	|	И Журнал.ДлительностьЗвонка > 0
	//|	И Журнал.ПоискАбонент ПОДОБНО ""______""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Телефоны.Объект,
	|	Телефоны.Поиск КАК Представление
	|ПОМЕСТИТЬ Телефоны
	|ИЗ
	|	&Телефоны КАК Телефоны
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Представление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Журнал.Дата,
	|	Журнал.НомерСотрудника,
	|	Журнал.НомерАбонента,
	|	Журнал.ДлительностьЗвонка,
	|	Журнал.Исход_Вход,
	|	МАКСИМУМ(Телефоны.Объект) КАК Сотрудник,
	|	МАКСИМУМ(Телефоны1.Объект) КАК Контрагент,
	|	Журнал.НомерСотрудника1,
	|	Журнал.НомерАбонента1,
	|	Журнал.Ссылка
	|ИЗ
	|	Журнал КАК Журнал
	|		ЛЕВОЕ СОЕДИНЕНИЕ Телефоны КАК Телефоны
	|		ПО Журнал.НомерСотрудника = Телефоны.Представление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Телефоны КАК Телефоны1
	|		ПО Журнал.НомерАбонента = Телефоны1.Представление
	|ГДЕ
	|	Телефоны.Объект.Наименование подобно &Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	Журнал.Дата,
	|	Журнал.НомерСотрудника,
	|	Журнал.НомерАбонента,
	|	Журнал.ДлительностьЗвонка,
	|	Журнал.Исход_Вход,
	|	Журнал.НомерСотрудника1,
	|	Журнал.НомерАбонента1,
	|	Журнал.Ссылка";
	Рез = ЗапросМобильные.Выполнить().Выгрузить();
	
	URL = "http://37.1.84.50:8080/Phone";	
	Звонки = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(URL, "ArrayOfPhones"));
	
	Для каждого стр из Рез Цикл
		ТелефонСотрудника =  стр.НомерСотрудника1;
		Запись = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(URL, "Phone"));
		
		Запись.date=Строка(Формат(стр.Дата,"ДФ=dd-MM-yyyy"));
		Запись.startDateTime=Строка(Формат(стр.Дата,"ДЛФ=T"));
		Запись.endDateTime=Строка(Формат(стр.Дата+стр.ДлительностьЗвонка,"ДЛФ=T"));
		Запись.caller= ?(ЗначениеЗаполнено(стр.Контрагент),стр.Контрагент.Наименование+"("+ стр.НомерАбонента1 +")",Строка(стр.НомерАбонента1));
		Запись.duration=Строка(стр.ДлительностьЗвонка);
		Запись.type=стр.Исход_Вход;
		Запись.phoneType=?(СтрДлина(стр.НомерСотрудника)<=3,"Рабочий","Мобильный");
		Запись.link=Строка(стр.Ссылка);
		
		Звонки.Phones.Добавить(Запись);
		
	КонецЦикла;
	
	//Ответ = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(URL, "Answer"));
	//
	//Запрос = Новый Запрос;
	//запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//			   |	ЖурналЗвонков.Дата КАК Дата,
	//			   |	ЖурналЗвонков.НомерСотрудника,
	//			   |	ЖурналЗвонков.НомерАбонента,
	//			   |	ЖурналЗвонков.ПоискСотрудник,
	//			   |	ЖурналЗвонков.ПоискАбонент,
	//			   |	ЖурналЗвонков.Сотудник,
	//			   |	ЖурналЗвонков.Контрагент,
	//			   |	ЖурналЗвонков.ДлительностьЗвонка,
	//			   |	ЖурналЗвонков.Исход_Вход,
	//			   |	ЖурналЗвонков.Ссылка
	//			   |ИЗ
	//			   |	РегистрСведений.ЖурналЗвонков КАК ЖурналЗвонков
	//			   |ГДЕ
	//			   |	ЖурналЗвонков.НомерСотрудника ПОДОБНО ""%_____""
	//			   |
	//			   |УПОРЯДОЧИТЬ ПО
	//			   |	Дата УБЫВ";
	//Рез = Запрос.Выполнить().Выгрузить();
	//
	//Если Рез.Количество()>0 Тогда
	//	
	//	ПоследняяДатаЗагрузки = Строка(Формат(Рез[0].Дата,"ДЛФ=T"));
	//	
	//Иначе
	//	
	//	ПоследняяДатаЗагрузки = "";
	//	
	//КонецЕсли;

	
	//ответ.employeePhone = ТелефонСотрудника;
	//ответ.uploadDate = ПоследняяДатаЗагрузки;
	//ответ.Array = Звонки;	
	
	Возврат Звонки;

КонецФункции
