

Функция НайтиПоступлениеДопРасходов(ЗаданиеНаТранспорт=ЛОЖЬ)
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ВЫБОР
	                |		КОГДА ПоступлениеДопРасходов.Комментарий подобно &ЯШТ
					|				И НЕ ПоступлениеДопРасходов.ПометкаУдаления 
	                |			ТОГДА ""Яршинторг""
	                |		ИНАЧЕ ""Другие покупатели""
	                |	КОНЕЦ КАК Организация,
	                |	ПоступлениеДопРасходов.СуммаДокумента КАК Сумма,
	                |	ПоступлениеДопРасходов.НомерВходящегоДокумента КАК НомерВхДок,
	                |	ПоступлениеДопРасходов.Ссылка КАК Счет,
					|	ПоступлениеДопРасходов.Комментарий
	                |ИЗ
	                |	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
	                |ГДЕ
	                |	ПоступлениеДопРасходов.Дата > &ДатаНач
	                |	И ПоступлениеДопРасходов.Комментарий ПОДОБНО &Комментарий
	                |//наЯШТ	И ( ПоступлениеДопРасходов.Комментарий подобно &ЯШТ) И НЕ ПоступлениеДопРасходов.ПометкаУдаления
 					|//НеЯШТ	И НЕ (ПоступлениеДопРасходов.Комментарий подобно &ЯШТ) И ПоступлениеДопРасходов.ПометкаУдаления
					|
	                |УПОРЯДОЧИТЬ ПО
	                |	ПоступлениеДопРасходов.Дата
	                |АВТОУПОРЯДОЧИВАНИЕ";

	//Если наЯШТ="Да" Тогда
	// Запрос.Текст =стрЗаменить( Запрос.Текст , "//наЯШТ","");
	//ИначеЕсли наЯШТ="Нет" Тогда 
	Запрос.Текст =стрЗаменить( Запрос.Текст , "//НеЯШТ","");
//	КонецЕсли;
	 Запрос.УстановитьПараметр("ЯШТ", "%Яршинторг%" );
	 Запрос.УстановитьПараметр("Комментарий", "%Задание "+?(ЗаданиеНаТранспорт,"на транспорт ","")+строка(СсылкаНаОбъект.Номер)+"%" );
	 Запрос.УстановитьПараметр("ДатаНач", НачалоДня(СсылкаНаОбъект.Дата) - 14*86400);
	 Результат = Запрос.Выполнить();
	 табл = Результат.Выгрузить();
	
	Возврат табл;
	
КонецФункции	

//Заказ по ОТХ - для операции Списание
Функция ПечатьЗаявки()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаОбратку";
	
	Макет = ПолучитьМакет("Заявка");
	
	Если ТипЗнч(СсылкаНаОбъект)=Тип("ДокументСсылка.ЗаданиеНаОтгрузку") тогда
		таблОбратки = СсылкаНаОбъект.Обратки;
		СуммаТР = СсылкаНаОбъект.СуммаОбратки;
		СуммаЯШТ = СсылкаНаОбъект.СуммаОбраткиЯШТ;
		Если СуммаТР = 0 и СуммаЯШТ =0 тогда
			Предупреждение("Сумма доставки обратного груза - не введена!
							|Печатать Заявку на ""обратку"" не нужно!", 10);
		КонецЕсли;
	 табл =  НайтиПоступлениеДопРасходов();//все обратки!
	 текстОтгр = "отгрузку";	
	
	иначе
		таблОбратки = СсылкаНаОбъект.таблЗаказы;
		СуммаТР  = СсылкаНаОбъект.СуммаДокумента;
		СуммаЯШТ = 0;
	 табл =  НайтиПоступлениеДопРасходов(Истина);//все обратки!
	 текстОтгр = "транспорт";
	КонецЕсли;
	
Если таблОбратки.Количество()=0 и СуммаТр>0 тогда
//Если СуммаТР>0 тогда	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	
//--------------документа на товар - их нет!------------------------------------------
	ДокументПрихода= "";//+++ надо получить документ доп.расходов по этому заданию (все на 1 задание!)
	НомерДопРасх   = ""; //+++ отделить номер(а)
	
	ОбластьМакета.Параметры.НомерДопРасх = НомерДопРасх;
	ОбластьМакета.Параметры.Номер = СсылкаНаОбъект.Номер;
	ОбластьМакета.Параметры.Дата = Формат(СсылкаНаОбъект.дата,"ДЛФ=DD");
	ОбластьМакета.Параметры.Отгрузка = текстОтгр;
	ТабДокумент.Вывести(ОбластьМакета);
		
//-------------------------------------------
 ОбластьМакета = Макет.ПолучитьОбласть("Тело");

	Маршрут = строка(СсылкаНаОбъект.Направление)+" - Ярославль";
	ОбластьМакета.Параметры.Маршрут=Маршрут;
	ОбластьМакета.Параметры.ОбъёмМашаны = СсылкаНаОбъект.ОбъемМакс;  //объём машины...
	
	//-------------t туда = t обратно - одинаковое время?-------------------
	КолСекДоПодачи = ( КонецДня(СсылкаНаОбъект.ВремяНапоминания) - КонецДня(ссылкаНаОбъект.Дата) )/ 2;
	СрокПодачи = ссылкаНаОбъект.Дата + КолСекДоПодачи;
	
	ОбластьМакета.Параметры.СрокПодачи = формат(СрокПодачи,"ДЛФ=D"); //дата создания первой попавшаяся реализации/перемещение
	
    ОбластьМакета.Параметры.МестоПодачи=  "Другие покупатели";
	
	//ОбластьМакета.Параметры.ДокументПрихода=  Строка(СсылкаНаОбъект.ДокументПоступления);
		
		
		МаркаИНомерМашины=""+СокрЛП(СсылкаНаОбъект.МаркаАвтомобиля)+" "+СокрЛП(СсылкаНаОбъект.ГосНомерАвтомобиля);
		СведенияОПеревозчике=""+СсылкаНаОбъект.Перевозчик+Символы.ПС+"водитель: "+СсылкаНаОбъект.Водитель;
		
		ОбластьМакета.Параметры.МаркаИНомерМашины=МаркаИНомерМашины;
		ОбластьМакета.Параметры.СведенияОПеревозчике=СведенияОПеревозчике;
		
		ОбластьМакета.Параметры.ДокументПрихода = Строка(СсылкаНаОбъект.ДокументПоступления);
		
	    ОбластьМакета.Параметры.Стоимость = Формат(СуммаТР,"ЧДЦ=2")+"р.";
		
				
		списокСчетовПеревозчика =  ПолучитьСписокВыставленныхСчетовОтПоставщикаУслуг();  //+++ 29.05.2015
		Если списокСчетовПеревозчика="" тогда
			ОбластьМакета.Параметры.ВыставленныеСчета = "нет счетов"+?(СуммаТР>0," на сумму "+ Формат(СуммаТР,"ЧДЦ=2")+"р.","");
        Иначе
		    ОбластьМакета.Параметры.ВыставленныеСчета = списокСчетовПеревозчика;
		КонецЕсли;
		
		ОбластьМакета.Параметры.Исполнитель = ПараметрыСеанса.Текущийпользователь;
			датаВремя1 = ТекущаяДата(); //СсылкаНаОбъект.ВремяНапоминания;
		ОбластьМакета.Параметры.СрокОформления	= формат(датаВремя1,"ДФ='dd.MM.yyyy hh:mm'");
        ОбластьМакета.Параметры.ОтвМенеджер = ""; //строка(ссылкаНаОбъект.ОтвМенеджер);
		ТабДокумент.Вывести(ОбластьМакета);
		
	Если СуммаЯШТ >0 тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;		
КонецЕсли;



Если таблОбратки.Количество()>0 тогда	
	
 сообщить("найдено "+строка(табл.Количество())+" документов Обраток");

для каждого стр1 из таблОбратки цикл
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	
	стрКомм = "обр.№"+строка(стр1.НомерСтроки);

 	док = неопределено;
	Для i=0 по табл.Количество()-1 Цикл // по таблице всех обраток - смотрим
		докСсылка = табл[i].Счет; 
		Если Найти(докСсылка.Комментарий, стрКомм)>0 тогда
		док = докСсылка; 
		прервать;
		КонецЕсли;
	КонецЦикла;
	
//--------------документа на товар - их нет!------------------------------------------
	если док = неопределено тогда
		ДокументПрихода= "";//+++ надо получить документ доп.расходов по этому заданию (все на 1 задание!)
		НомерДопРасх   = ""; //+++ отделить номер(а)
	иначе
		ДокументПрихода=док;
		НомерДопРасх   = док.НомерВходящегоДокумента;
		ДатаДопРасх    = док.ДатаВходящегоДокумента;
	КонецЕсли;	
	ОбластьМакета.Параметры.НомерДопРасх = НомерДопРасх;
	
	ОбластьМакета.Параметры.Номер = СсылкаНаОбъект.Номер;
	ОбластьМакета.Параметры.Дата = Формат(СсылкаНаОбъект.дата,"ДЛФ=DD");
	ОбластьМакета.Параметры.Отгрузка = текстОтгр;
	
	ТабДокумент.Вывести(ОбластьМакета);
		
//-------------------------------------------
 ОбластьМакета = Макет.ПолучитьОбласть("Тело");

	ОбластьМакета.Параметры.Маршрут=СокрЛП(стр1.Направление);
	ОбластьМакета.Параметры.ОбъёмМашаны = СсылкаНаОбъект.ОбъемМакс;  //объём машины...
	
	//-------------t туда = t обратно - одинаковое время?-------------------
	СрокПодачи = СсылкаНаОбъект.ВремяНапоминания;
	
	ОбластьМакета.Параметры.СрокПодачи = формат(СрокПодачи,"ДЛФ=D"); //дата создания первой попавшаяся реализации/перемещение
	
    ОбластьМакета.Параметры.МестоПодачи=?(сокрЛП(стр1.Контрагент)="", "", строка(стр1.Контрагент))
										+?(сокрЛП(стр1.Контрагент0)="", "", " (Отправитель: "+строка(стр1.Контрагент0)+")");
		
		
		МаркаИНомерМашины=""+СокрЛП(СсылкаНаОбъект.МаркаАвтомобиля)+" "+СокрЛП(СсылкаНаОбъект.ГосНомерАвтомобиля);
		СведенияОПеревозчике=""+СсылкаНаОбъект.Перевозчик+Символы.ПС+"водитель: "+СсылкаНаОбъект.Водитель;
		
		ОбластьМакета.Параметры.МаркаИНомерМашины=МаркаИНомерМашины;
		ОбластьМакета.Параметры.СведенияОПеревозчике=СведенияОПеревозчике;
		
		ОбластьМакета.Параметры.ДокументПрихода = Строка(СсылкаНаОбъект.ДокументПоступления);
		
	    ОбластьМакета.Параметры.Стоимость = Формат(стр1.Сумма,"ЧДЦ=2")+"р." +?(стр1.Пробег>0, " Пробег: "+строка(стр1.Пробег)+"км.", "");
		
		//списокСчетовПеревозчика =  ПолучитьСписокВыставленныхСчетовОтПоставщикаУслуг();  //+++ 29.05.2015
		//Если списокСчетовПеревозчика="" тогда
		//	ОбластьМакета.Параметры.ВыставленныеСчета = "нет счетов"+?(СуммаТР>0," на сумму "+ Формат(СуммаТР,"ЧДЦ=2")+"р.","");
		//Иначе
		
		Если НомерДопРасх="" тогда
			ОбластьМакета.Параметры.ВыставленныеСчета = "нет счетов"+?(стр1.Сумма>0," на сумму "+ Формат(стр1.Сумма,"ЧДЦ=2")+"р.","");
		Иначе
			ОбластьМакета.Параметры.ВыставленныеСчета = "Счет № "+НомерДопРасх+" от "+формат(ДатаДопРасх,"ДЛФ=D");
		КонецЕсли;
		
		ОбластьМакета.Параметры.Исполнитель = ПараметрыСеанса.Текущийпользователь;
			датаВремя1 = ТекущаяДата(); //СсылкаНаОбъект.ВремяНапоминания;
		ОбластьМакета.Параметры.СрокОформления	= формат(датаВремя1,"ДФ='dd.MM.yyyy hh:mm'");
        ОбластьМакета.Параметры.ОтвМенеджер = ""; //строка(ссылкаНаОбъект.ОтвМенеджер);
		ТабДокумент.Вывести(ОбластьМакета);
		
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
КонецЦикла;

КонецЕсли;

 
	//---------------------------------ЯШТ------------------------------------------------------------
	
	Если СуммаЯШТ >0 тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	
//--------------документа на товар - их нет!------------------------------------------
	ДокументПрихода= "";//+++ надо получить документ доп.расходов по этому заданию (все на 1 задание!)
	НомерДопРасх   = ""; //+++ отделить номер(а)
	
	ОбластьМакета.Параметры.НомерДопРасх = НомерДопРасх;
	ОбластьМакета.Параметры.Номер = СсылкаНаОбъект.Номер;
	ОбластьМакета.Параметры.Дата = Формат(СсылкаНаОбъект.дата,"ДЛФ=DD");
		
		ТабДокумент.Вывести(ОбластьМакета);
		
//-------------------------------------------
 ОбластьМакета = Макет.ПолучитьОбласть("Тело");

	Маршрут = строка(СсылкаНаОбъект.Направление)+" - Ярославль";
	ОбластьМакета.Параметры.Маршрут=Маршрут;
	ОбластьМакета.Параметры.ОбъёмМашаны = СсылкаНаОбъект.ОбъемМакс;  //объём машины...
	
	//-------------t туда = t обратно - одинаковое время?-------------------
	КолСекДоПодачи = ( КонецДня(СсылкаНаОбъект.ВремяНапоминания) - КонецДня(ссылкаНаОбъект.Дата) )/ 2;
	СрокПодачи = ссылкаНаОбъект.Дата + КолСекДоПодачи;
	
	ОбластьМакета.Параметры.СрокПодачи = формат(СрокПодачи,"ДЛФ=D"); //дата создания первой попавшаяся реализации/перемещение
	
    ОбластьМакета.Параметры.МестоПодачи=  "Яршинторг";
		
		
		МаркаИНомерМашины=""+СокрЛП(СсылкаНаОбъект.МаркаАвтомобиля)+" "+СокрЛП(СсылкаНаОбъект.ГосНомерАвтомобиля);
		СведенияОПеревозчике=""+СсылкаНаОбъект.Перевозчик+Символы.ПС+"водитель: "+СсылкаНаОбъект.Водитель;
		
		ОбластьМакета.Параметры.МаркаИНомерМашины=МаркаИНомерМашины;
		ОбластьМакета.Параметры.СведенияОПеревозчике=СведенияОПеревозчике;
		
		ОбластьМакета.Параметры.ДокументПрихода = Строка(СсылкаНаОбъект.ДокументПоступления);
		
		СуммаТР = СуммаЯШТ;//!!!
		ОбластьМакета.Параметры.Стоимость = Формат(СуммаТР,"ЧДЦ=2")+"р.";
		
				
		списокСчетовПеревозчика =  ПолучитьСписокВыставленныхСчетовОтПоставщикаУслуг(Истина);  //+++ 29.05.2015
		Если списокСчетовПеревозчика="" тогда
			ОбластьМакета.Параметры.ВыставленныеСчета = "нет счетов"+?(СуммаТР>0," на сумму "+ Формат(СуммаТР,"ЧДЦ=2")+"р.","");
        Иначе
		    ОбластьМакета.Параметры.ВыставленныеСчета = списокСчетовПеревозчика;
		КонецЕсли;
		
		ОбластьМакета.Параметры.Исполнитель = ПараметрыСеанса.Текущийпользователь;
		ОбластьМакета.Параметры.СрокОформления	= формат(СсылкаНаОбъект.ВремяНапоминания,"ДЛФ=D");
        ОбластьМакета.Параметры.ОтвМенеджер = ""; //строка(ссылкаНаОбъект.ОтвМенеджер);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;	

				
	Возврат ТабДокумент;
	
КонецФункции // ПечатьСчетаЗаказа()

// общая процедура печати
функция Печать() Экспорт
	ТабДокумент = неопределено;
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) тогда
		Предупреждение("Не выбран документ!", 30);		
		возврат Неопределено;
	КонецЕсли;
	
		ТабДокумент = ПечатьЗаявки();
			
	Возврат ТабДокумент;
	
КонецФункции



Функция ПолучитьСписокВыставленныхСчетовОтПоставщикаУслуг(флЯШТ=ложь)

	//---------------поиск уже сущ. самого "свежего" поступления-------------------
  Запрос = Новый Запрос;
  Запрос.Текст = "ВЫБРАТЬ
                 |	ПоступлениеДопРасходов.СуммаДокумента КАК Сумма,
                 |	ПоступлениеДопРасходов.Ссылка КАК Счет,
                 |	ПоступлениеДопРасходов.Контрагент КАК Перевозчик
                 |ИЗ
                 |	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
                 |ГДЕ
                 |	ПоступлениеДопРасходов.Дата >= &Дата0
                 |	И "+?(флЯШТ,"НЕ","")+" ПоступлениеДопРасходов.Ссылка.ПометкаУдаления
				 |	И ПоступлениеДопРасходов.Комментарий ПОДОБНО &Комментарий
                 |
                 |УПОРЯДОЧИТЬ ПО
                 |	ПоступлениеДопРасходов.Дата УБЫВ
                 |АВТОУПОРЯДОЧИВАНИЕ";
  
  Запрос.УстановитьПараметр("Дата0", НачалоДня(СсылкаНаОбъект.Дата) - 7 * 86400 );  // поступление не может быть раньше Задания на отгрузку!
  Запрос.УстановитьПараметр("Комментарий","%Задание "+СсылкаНаОбъект.Номер+"%");
  Результат = Запрос.Выполнить();
  суммаОрг = Результат.Выбрать();
   
  текстНакладных = "";
  пока суммаОрг.Следующий() цикл
	текстНакладных =  текстНакладных          //+++ номер счета Перевозчика!
	+?(СокрЛП(суммаОрг.Счет.НомерВходящегоДокумента)="", "Поступление доп.расходов "+суммаОрг.Счет.Номер, "Счет № "+СокрЛП(суммаОрг.Счет.НомерВходящегоДокумента) )
	+" от "+строка(суммаОрг.Перевозчик)+" ("+строка(суммаОрг.Сумма)+"р.), "; 
 КонецЦикла;	 
  текстНакладных = лев(текстНакладных, стрДлина(текстНакладных) - 2);
	
 возврат текстНакладных;
 
КонецФункции
