
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
  //
  //Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Производитель"));
  //  Если Параметр <> Неопределено Тогда
  //	  Параметр.Значение = Производитель;
  //	  Параметр.Использование = Истина;
  //  КонецЕсли;

  //  
  //  
  //  
  //  Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Скидка"));
  //  Если Параметр <> Неопределено Тогда
  //	  Параметр.Значение = Скидка;
  //	  Параметр.Использование = Истина;
  //  КонецЕсли;

КонецПроцедуры
