
Процедура ПриОткрытии()
	
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.
                                 Элементы.Найти("Пользователь");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = ПараметрыСеанса.ТекущийПользователь;
   
   
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.
                                 Элементы.Найти("КодСвойство");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = "90184";
   
   
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.
                                 Элементы.Найти("СвойствоКатегория");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90218");
   
   
   ЗначениеКатегория = новый СписокЗначений;
   ЗначениеКатегория.Добавить(Перечисления.КатегорииКонтрагентов.Работающие);
   ЗначениеКатегория.Добавить(Перечисления.КатегорииКонтрагентов.ВременноНеРаботаем);
   ЗначениеКатегория.Добавить(Перечисления.КатегорииКонтрагентов.ПерваяПродажа);
   ЗначениеКатегория.Добавить(Перечисления.КатегорииКонтрагентов.Разобраться);
   
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.
                                 Элементы.Найти("ЗначениеКатегория");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = ЗначениеКатегория;
   
   
КонецПроцедуры
