
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	ОтчетИнициализация();

КонецПроцедуры

Процедура ПриЗакрытии()

	СохранитьЗначение("НастройкаВнешниеОтчетыВсеДокументыПоТоваруОтчет_62ba182f-07dd-44f7-8cc6-e83282228581", ПостроительОтчетаОтчет.ПолучитьНастройки());

КонецПроцедуры

Процедура ДействияФормыОтчетНастройка(Кнопка)
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_НАСТРОЙКА(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Форма = ВнешнийОтчетОбъект.ПолучитьФорму("ОтчетНастройка");
	Форма.ПостроительОтчета = ПостроительОтчетаОтчет;
	Настройка = ПостроительОтчетаОтчет.ПолучитьНастройки();
	Если Форма.ОткрытьМодально() = Истина Тогда
		ОтчетВывести();
	Иначе
		ПостроительОтчетаОтчет.УстановитьНастройки(Настройка);
	КонецЕсли;

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_НАСТРОЙКА
КонецПроцедуры

Процедура ДействияФормыОтчетСформировать(Кнопка)
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	ОтчетВывести();

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА
КонецПроцедуры

Процедура ОтчетВывести()
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_ВЫПОЛНИТЬ(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	ЭлементыФормы.ПолеТабличногоДокумента.Очистить();

	ПостроительОтчетаОтчет.Параметры.Вставить("Дата", Дата);
	ПостроительОтчетаОтчет.Параметры.Вставить("Номенклатура", Номенклатура);

	ПостроительОтчетаОтчет.Выполнить();
	ПостроительОтчетаОтчет.РазмещениеИзмеренийВСтроках = ТипРазмещенияИзмерений.Вместе;
	ПостроительОтчетаОтчет.РазмещениеРеквизитовИзмеренийВСтроках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
	ПостроительОтчетаОтчет.РазмещениеРеквизитовИзмеренийВКолонках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
	ПостроительОтчетаОтчет.МакетОформления = ПолучитьМакетОформления(СтандартноеОформление.Классика);
	ПостроительОтчетаОтчет.Макет = ВнешнийОтчетОбъект.ПолучитьМакет("Отчет");
	ПостроительОтчетаОтчет.ОформитьМакет();
	ПостроительОтчетаОтчет.Вывести(ЭлементыФормы.ПолеТабличногоДокумента);

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_ВЫПОЛНИТЬ
КонецПроцедуры

Процедура ОтчетИнициализация()
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_ИНИЦИАЛИЗАЦИЯ(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	ПостроительОтчетаОтчет.Текст =
	"ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка.ПометкаУдаления КАК УДАЛЕН,
	|	""Заказ покупателя"" КАК ТипДокумента,
	|	ЗаказПокупателяТовары.Ссылка.Контрагент КАК Контрагент,
	|	ЗаказПокупателяТовары.Ссылка КАК Документ,
	|	ЗаказПокупателяТовары.Ссылка.Подразделение КАК Подразделение,
	|	ЗаказПокупателяТовары.Количество КАК Количество,
	|	ЗаказПокупателяТовары.Ссылка.Комментарий,
	|	ЗаказПокупателяТовары.Ссылка.ДоговорКонтрагента.ОтветственноеЛицо КАК Менеджер,
	|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяТовары.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка.Дата >= &Дата
	|	И ЗаказПокупателяТовары.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка.ПометкаУдаления,
	|	""Реализация товаров"",
	|	ЗаказПокупателяТовары.Ссылка.Контрагент,
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.Ссылка.Подразделение,
	|	ЗаказПокупателяТовары.Количество,
	|	ЗаказПокупателяТовары.Ссылка.Комментарий,
	|	ЗаказПокупателяТовары.Ссылка.ДоговорКонтрагента.ОтветственноеЛицо,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.Ссылка.Дата
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка.Дата >= &Дата
	|	И ЗаказПокупателяТовары.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка.ПометкаУдаления,
	|	""Возврат от покупателя"",
	|	ЗаказПокупателяТовары.Ссылка.Контрагент,
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.Ссылка.Подразделение,
	|	-ЗаказПокупателяТовары.Количество,
	|	ЗаказПокупателяТовары.Ссылка.Комментарий,
	|	ЗаказПокупателяТовары.Ссылка.ДоговорКонтрагента.ОтветственноеЛицо,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.Ссылка.Дата
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка.Дата >= &Дата
	|	И ЗаказПокупателяТовары.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка.ПометкаУдаления,
	|	""Поступление от поставщика"",
	|	ЗаказПокупателяТовары.Ссылка.Контрагент,
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.Ссылка.Подразделение,
	|	-ЗаказПокупателяТовары.Количество,
	|	ЗаказПокупателяТовары.Ссылка.Комментарий,
	|	ЗаказПокупателяТовары.Ссылка.ДоговорКонтрагента.ОтветственноеЛицо,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.Ссылка.Дата
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка.Дата >= &Дата
	|	И ЗаказПокупателяТовары.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка.ПометкаУдаления,
	|	""Возврат поставщику"",
	|	ЗаказПокупателяТовары.Ссылка.Контрагент,
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.Ссылка.Подразделение,
	|	ЗаказПокупателяТовары.Количество,
	|	ЗаказПокупателяТовары.Ссылка.Комментарий,
	|	ЗаказПокупателяТовары.Ссылка.ДоговорКонтрагента.ОтветственноеЛицо,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.Ссылка.Дата
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка.Дата >= &Дата
	|	И ЗаказПокупателяТовары.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка.ПометкаУдаления,
	|	""Перемещение товаров"",
	|	ЗаказПокупателяТовары.Ссылка.СкладОтправитель,
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.Ссылка.Подразделение,
	|	ЗаказПокупателяТовары.Количество,
	|	ЗаказПокупателяТовары.Ссылка.Комментарий,
	|	ЗаказПокупателяТовары.Ссылка.СкладПолучатель,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.Ссылка.Дата
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка.Дата >= &Дата
	|	И ЗаказПокупателяТовары.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка.ПометкаУдаления,
	|	""Оприходование товаров"",
	|	ЗаказПокупателяТовары.Склад,
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.Ссылка.Подразделение,
	|	-ЗаказПокупателяТовары.Количество,
	|	ЗаказПокупателяТовары.Ссылка.Комментарий,
	|	NULL,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.Ссылка.Дата
	|ИЗ
	|	Документ.ОприходованиеТоваров.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка.Дата >= &Дата
	|	И ЗаказПокупателяТовары.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка.ПометкаУдаления,
	|	""Поступление Товаров"",
	|	ЗаказПокупателяТовары.Склад,
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.Ссылка.Подразделение,
	|	-ЗаказПокупателяТовары.Количество,
	|	ЗаказПокупателяТовары.Ссылка.Комментарий,
	|	ЗаказПокупателяТовары.Ссылка.Контрагент,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.Ссылка.Дата
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка.Дата >= &Дата
	|	И ЗаказПокупателяТовары.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка.ПометкаУдаления,
	|	""Списание товаров"",
	|	ЗаказПокупателяТовары.Ссылка.Склад,
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.Ссылка.Подразделение,
	|	-ЗаказПокупателяТовары.Количество,
	|	ЗаказПокупателяТовары.Ссылка.Комментарий,
	|	NULL,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.Ссылка.Дата
	|ИЗ
	|	Документ.СписаниеТоваров.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка.Дата >= &Дата
	|	И ЗаказПокупателяТовары.Номенклатура = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ УДАЛЕН),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТипДокумента),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Контрагент),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Документ),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Подразделение),
	|	СУММА(Количество),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Менеджер)
	|ПО
	|	ОБЩИЕ
	|АВТОУПОРЯДОЧИВАНИЕ";
	ПостроительОтчетаОтчет.ЗаполнитьНастройки();
	ПостроительОтчетаОтчет.ЗаполнениеРасшифровки = ВидЗаполненияРасшифровкиПостроителяОтчета.ЗначенияГруппировок;
	ПостроительОтчетаОтчет.ТекстЗаголовка = "Отчет";
	Настройка = ВосстановитьЗначение("НастройкаВнешниеОтчетыВсеДокументыПоТоваруОтчет_62ba182f-07dd-44f7-8cc6-e83282228581");
	Если Настройка <> Неопределено Тогда
		ПостроительОтчетаОтчет.УстановитьНастройки(Настройка);
	КонецЕсли;

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_ИНИЦИАЛИЗАЦИЯ
КонецПроцедуры












