
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Если ЗначениеНеЗаполнено(Запись.Объект) Тогда
			Отказ = Истина;
			СтрокаОтказа = "Не заполнен объект.";
			Продолжить;
		КонецЕсли; 
		Если Запись.Объект.ЭтоГруппа Тогда
			Отказ = Истина;
			СтрокаОтказа = "Нельзя использовать в качестве объекта контактной информации - группу.";
			Прервать;
		КонецЕсли;
		Если ТипЗнч(Запись.Объект) = Тип("СправочникСсылка.КонтактныеЛица") Тогда
			Запись.КонтактноеЛицоДляОграниченияПравДоступа = Запись.Объект;
			Запись.КонтрагентДляОграниченияПравДоступа     = Справочники.Контрагенты.ПустаяСсылка();
		ИначеЕсли ТипЗнч(Запись.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
			Запись.КонтрагентДляОграниченияПравДоступа     = Запись.Объект;
			Запись.КонтактноеЛицоДляОграниченияПравДоступа = Справочники.КонтактныеЛица.ПустаяСсылка();
		Иначе
			Запись.КонтрагентДляОграниченияПравДоступа     = Справочники.Контрагенты.ПустаяСсылка();
			Запись.КонтактноеЛицоДляОграниченияПравДоступа = Справочники.КонтактныеЛица.ПустаяСсылка();
		КонецЕсли;
		Если Запись.Объект = Справочники.Контрагенты.НайтиПоКоду("П001549") тогда
			записьЖурнала = РегистрыСведений.ЖурналИзменений.СоздатьМенеджерЗаписи();
			записьЖурнала.НомерЗаписи  = 0;
		 	записьЖурнала.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		 	записьЖурнала.Компьютер    = ИмяКомпьютера();
		 	записьЖурнала.Объект	   = Запись.Объект;
		 	записьЖурнала.Период	   = ТекущаяДата();
		 	записьЖурнала.Событие	   = "Изменение Контактной Информации";
			записьЖурнала.Комментарий  = "Тип: " + Строка(Запись.Тип) +" Вид: "+ Строка(Запись.Вид);
		 	записьЖурнала.Записать(истина); //перезапись
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Сообщить(СтрокаОтказа);
	КонецЕсли; 
	
	//БАЛАНС (04.12.2007)                       
	//
	ЗарегистрироватьОбъект(ЭтотОбъект,Отказ,Истина); 
	
КонецПроцедуры
