Функция Печать(ПодготовкаНабора = Ложь) Экспорт
	
	//Если Не Метаданные.Имя = "УправлениеТорговлей" Тогда
	//	Сообщить("Печатная форма предназначена для использования в конфигурации ""Управление торговлей""", СтатусСообщения.Внимание);
	//КонецЕсли;
	
	Если ТекущаяДата() < Дата('20170912000000') Тогда //УДАЛИТЬ
		ПодготовкаНабора = Истина;
	КонецЕсли;
	
	
	Возврат ПечатьРеализации(ПодготовкаНабора);
	
КонецФункции // Печать


Функция ПечатьРеализации(ПодготовкаНабора = Ложь) Экспорт
	

ТабДок=Новый ТабличныйДокумент;
ТабДок.Очистить();

//проверим на ТК
ЕстьчерезТК=Ложь;
ЕстьДоставка = Ложь;
Для каждого стр из СсылкаНаОбъект.ЗаказыПокупателей Цикл
	Если ЗначениеЗаполнено(стр.ЗаказПокупателя.ТранспортнаяКомпания) и (Стр.ЗаказПокупателя.ТребуютсяКрышки или Стр.ЗаказПокупателя.СтарыеКрышки) тогда
		ЕстьчерезТК=Истина;
	иначеесли Стр.ЗаказПокупателя.ТребуютсяКрышки или Стр.ЗаказПокупателя.СтарыеКрышки тогда
		ЕстьДоставка = Истина;
	конецЕсли;
конецЦикла;

Макет = ПолучитьМакет("ОтчетРеализация");
    Если  ЕстьДоставка тогда
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Номер=СтрЗаменить(ссылкаНаОбъект.Номер,"ТК","");
	ОбластьШапка.Параметры.Дата= Формат(ссылкаНаОбъект.Дата,"ДЛФ=Д");
	ОбластьШапка.Параметры.Водитель = СсылкаНаОбъект.Водитель;
	//ОбластьШапка.Параметры.Автомобиль = СсылкаНаОбъект.МаркаАвтомобиля;
	//ОбластьШапка.Параметры.ГосНомер = СсылкаНаОбъект.ГосНомерАвтомобиля;
	ТабДок.Вывести(ОбластьШапка);
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	
	 Тз= СсылкаНаОбъект.Товары.Выгрузить();
	 
	
	 пп=0;
	 предКлиент = "";
	 предМенеджер = "";
	 Для каждого стр из СсылкаНаОбъект.ЗаказыПокупателей Цикл
		 Если (Стр.ЗаказПокупателя.ТребуютсяКрышки или стр.ЗаказПокупателя.СтарыеКрышки ) и не ЗначениеЗаполнено(стр.ЗаказПокупателя.ТранспортнаяКомпания) и ?(ПодготовкаНабора, Истина, ЗначениеЗаполнено(стр.Реализация)) Тогда
			 Если предКлиент <> стр.ЗаказПокупателя.Контрагент или предМенеджер <> стр.ЗаказПокупателя.ДоговорКонтрагента.ОтветственноеЛицо  Тогда
				 если пп<>0 Тогда	
					 ТабДок.Вывести(ОбластьСтрока);
				 конецЕсли;
				 пп=пп+1;
				 ОбластьСтрока.Параметры.пп=пп;
				 ОбластьСтрока.Параметры.Клиент = стр.ЗаказПокупателя.Контрагент;
				 ОбластьСтрока.Параметры.Менеджер = стр.ЗаказПокупателя.ДоговорКонтрагента.ОтветственноеЛицо;
				 
				 НомераЗаказов = ?(Стр.ЗаказПокупателя.ТребуютсяКрышки, СтрЗаменить(стр.ЗаказПокупателя.Номер,"ТК",""), "");
				 
				 Если стр.ЗаказПокупателя.СписокПредыдущихЗаказов.Количество() > 0 Тогда
					 Для каждого СтрокаВнутЗаказа из стр.ЗаказПокупателя.СписокПредыдущихЗаказов Цикл
						 НомераЗаказов = НомераЗаказов+"; "+ПолучитьНомерНаПечать(СтрокаВнутЗаказа.Заказ);
					 КонецЦикла;
				 КонецЕсли;
				 Если стр.ЗаказПокупателя.Заказы.Количество() > 0 Тогда
					 Для каждого СтрокаВнутЗаказа из стр.ЗаказПокупателя.Заказы Цикл
						 НомераЗаказов = НомераЗаказов+"; "+ПолучитьНомерНаПечать(СтрокаВнутЗаказа.ЗаказПокупателя);
					 КонецЦикла;
				 КонецЕсли;
				 
				 Областьстрока.Параметры.Заказ = НомераЗаказов + ?(стр.ЗаказПокупателя.СтарыеКрышки,"; "+СтрЗаменить(стр.ЗаказПокупателя.СтарыеЗаказыПоКрышкам,"ТК",""),"");
				 предКлиент = стр.ЗаказПокупателя.Контрагент;
				 предМенеджер = стр.ЗаказПокупателя.ДоговорКонтрагента.ОтветственноеЛицо;
				 

			 иначе
				 Областьстрока.Параметры.Заказ = Областьстрока.Параметры.Заказ+"; " +?(Стр.ЗаказПокупателя.ТребуютсяКрышки,СтрЗаменить(стр.ЗаказПокупателя.Номер,"ТК",""),"") + ?(стр.ЗаказПокупателя.СтарыеКрышки,"; "+СтрЗаменить(стр.ЗаказПокупателя.СтарыеЗаказыПоКрышкам,"ТК",""),"");
			 конецЕсли;
		 конецЕсли;
	 конецЦикла;
	 Если пп<>ОбластьСтрока.Параметры.пп Тогда
	     ТабДок.Вывести(ОбластьСтрока);
     конецЕсли;
	 
	 
	 
	 
	 
	 пп=0;
	 предКлиент = "";
	 предМенеджер = "";
	 Для каждого стр из СсылкаНаОбъект.ЗаказыПокупателей Цикл
		 Если (Стр.ЗаказПокупателя.ТребуютсяКрышки или стр.ЗаказПокупателя.СтарыеКрышки ) и ЗначениеЗаполнено(стр.ЗаказПокупателя.ТранспортнаяКомпания) и ?(ПодготовкаНабора, Истина, ЗначениеЗаполнено(стр.Реализация)) Тогда //и ЗначениеЗаполнено(стр.Реализация) 
			 Если предКлиент <> стр.ЗаказПокупателя.Контрагент или предМенеджер <> стр.ЗаказПокупателя.ДоговорКонтрагента.ОтветственноеЛицо  Тогда
				 если пп<>0 Тогда	
					 ТабДок.Вывести(ОбластьСтрока);
				 конецЕсли;
				 пп=пп+1;
				 ОбластьСтрока.Параметры.пп=пп;
				 ОбластьСтрока.Параметры.Клиент = стр.ЗаказПокупателя.Контрагент;
				 ОбластьСтрока.Параметры.Менеджер = стр.ЗаказПокупателя.ДоговорКонтрагента.ОтветственноеЛицо;
				 
				 НомераЗаказов = ?(Стр.ЗаказПокупателя.ТребуютсяКрышки, СтрЗаменить(стр.ЗаказПокупателя.Номер,"ТК",""), "");
				 
				 Если стр.ЗаказПокупателя.СписокПредыдущихЗаказов.Количество() > 0 Тогда
					 Для каждого СтрокаВнутЗаказа из стр.ЗаказПокупателя.СписокПредыдущихЗаказов Цикл
						 НомераЗаказов = НомераЗаказов+"; "+ПолучитьНомерНаПечать(СтрокаВнутЗаказа.Заказ);
					 КонецЦикла;
				 КонецЕсли;
				 Если стр.ЗаказПокупателя.Заказы.Количество() > 0 Тогда
					 Для каждого СтрокаВнутЗаказа из стр.ЗаказПокупателя.Заказы Цикл
						 НомераЗаказов = НомераЗаказов+"; "+ПолучитьНомерНаПечать(СтрокаВнутЗаказа.ЗаказПокупателя);
					 КонецЦикла;
				 КонецЕсли;
				 
				 Областьстрока.Параметры.Заказ = НомераЗаказов + ?(стр.ЗаказПокупателя.СтарыеКрышки,"; "+СтрЗаменить(стр.ЗаказПокупателя.СтарыеЗаказыПоКрышкам,"ТК",""),"");
				 предКлиент = стр.ЗаказПокупателя.Контрагент;
				 предМенеджер = стр.ЗаказПокупателя.ДоговорКонтрагента.ОтветственноеЛицо;

			 иначе
				 Областьстрока.Параметры.Заказ = Областьстрока.Параметры.Заказ+"; " + ?(Стр.ЗаказПокупателя.ТребуютсяКрышки,СтрЗаменить(стр.ЗаказПокупателя.Номер,"ТК",""),"") + ?(стр.ЗаказПокупателя.СтарыеКрышки,"; "+СтрЗаменить(стр.ЗаказПокупателя.СтарыеЗаказыПоКрышкам,"ТК",""),"");
			 конецЕсли;
		 конецЕсли;
	 конецЦикла;
	 Если пп<>ОбластьСтрока.Параметры.пп Тогда
	     ТабДок.Вывести(ОбластьСтрока);
     конецЕсли;
	 Если ЕстьчерезТК Тогда
		 ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	 конецЕсли;	
	КонецЕсли; 
    Если  ЕстьчерезТК тогда
	 ОбластьШапка = Макет.ПолучитьОбласть("Заголовок");
	 ОбластьШапка.Параметры.Номер=СтрЗаменить(ссылкаНаОбъект.Номер,"ТК","");
	 ОбластьШапка.Параметры.Дата= Формат(ссылкаНаОбъект.Дата,"ДЛФ=Д");
	 ТабДок.Вывести(ОбластьШапка);
	 
	 Заказы = СсылкаНаОбъект.ЗаказыПокупателей.Выгрузить();
	 Заказы.Колонки.Добавить("Транспортная");
	 сч=Заказы.Количество()-1;
	 пока сч >=0 цикл
		 Если  (ЗначениеЗаполнено(Заказы[сч].ЗаказПокупателя.ТранспортнаяКомпания) и (Заказы[сч].ЗаказПокупателя.ТребуютсяКрышки или Стр.ЗаказПокупателя.СтарыеКрышки)) Тогда
			 Заказы[сч].транспортная = Заказы[сч].ЗаказПокупателя.ТранспортнаяКомпания;
		 иначе
			 Заказы.Удалить(сч);
		 конецЕсли;
		 сч=сч-1;
	 конецЦикла;
	 
	 Заказы.Сортировать("Транспортная");
	 ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТК");
	 предТранспортная = "";
	 Для каждого стр из Заказы Цикл
		 Если предТранспортная <> стр.Транспортная Тогда
			 ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТК");
			 ОбластьШапка.Параметры.ТК = стр.Транспортная;
			 ТабДок.Вывести(ОбластьШапка);

			 пп=1;
		 конецЕсли;	
		 ОбластьСтрока.Параметры.пп=пп;
		 ОбластьСтрока.Параметры.Клиент = стр.ЗаказПокупателя.Контрагент.НаименованиеПолное;
		 ОбластьСтрока.Параметры.Менеджер = стр.ЗаказПокупателя.ДоговорКонтрагента.ОтветственноеЛицо;
		 Областьстрока.Параметры.Заказ = ?(Стр.ЗаказПокупателя.ТребуютсяКрышки,СтрЗаменить(стр.ЗаказПокупателя.Номер,"ТК",""),"") + ?(стр.ЗаказПокупателя.СтарыеКрышки,"; "+СтрЗаменить(стр.ЗаказПокупателя.СтарыеЗаказыПоКрышкам,"ТК",""),"");
		 Запрос = Новый Запрос;
		 Запрос.Текст = 
		 "ВЫБРАТЬ ПЕРВЫЕ 1
		 |	ИнформацияПоПроезду.Адрес
		 |ИЗ
		 |	РегистрСведений.ИнформацияПоПроезду КАК ИнформацияПоПроезду
		 |ГДЕ
		 |	ИнформацияПоПроезду.Задание = &Задание
		 |	И ИнформацияПоПроезду.Заказ = &Заказ";
		 
		 Запрос.УстановитьПараметр("Задание", СсылкаНаОбъект);
		 Запрос.УстановитьПараметр("Заказ", стр.ЗаказПокупателя);
		 
		 Результат = Запрос.Выполнить().Выбрать();
		 результат.Следующий();
		 
		 Областьстрока.Параметры.АдресДоставки = Результат.Адрес;
		 предТранспортная = стр.Транспортная;
		 пп=пп+1;
		 ТабДок.Вывести(ОбластьСтрока);
		 
	 конецЦикла;
	 
	 
 конецесли;

	 
	 
	 
	 
	 
	 
	 
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
        ТабДок.Вывести(ОбластьПодвал);
    Возврат ТабДок;
	КонецФункции