// функции для совместимости кода 
&НаКлиенте
Функция сбисПолучитьФорму(ИмяФормы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Попытка
			ЭтотОбъект="";
		Исключение
		КонецПопытки;
		Возврат ПолучитьФорму("ВнешняяОбработка.СБИС.Форма."+ИмяФормы);
	КонецЕсли;
	Возврат ЭтотОбъект.ПолучитьФорму(ИмяФормы);
КонецФункции
//------------------------------------------------------

&НаКлиенте
Процедура ОтправитьДокументы(Кэш,МассивСтрок) Экспорт
// Процедура формирует и отправляет пакеты документов по отмеченным строкам в реестре	
	// Удалить
	сбисСформироватьИни(Кэш);
	//
	СформироватьПотокиОтправки(Кэш);
	Для Каждого СтрокаСпискаДокументов Из МассивСтрок Цикл //Отправляемые пакеты
		СписокИдентификаторов = сбисПолучитьИдентификаторыДокументов1С(СтрокаСпискаДокументов.Значение.СоставПакета);
		Док = Новый Массив;
		Док.Добавить(СписокИдентификаторов[0].Значение);
		Док.Добавить(СписокИдентификаторов[0].Представление);
		СтруктураВложений = Новый Структура("_type,d,s","recordset", Новый Массив, Новый Массив);
		СтруктураВложений.s.Добавить(Новый Структура("n,t","Идентификатор","Строка"));
		Для Каждого Ид Из СписокИдентификаторов Цикл
			Вложение = Новый Массив;
			Вложение.Добавить(Ид.Значение);
			СтруктураВложений.d.Добавить(Вложение);
		КонецЦикла;
		Док.Добавить(СтруктураВложений);
		ОтправитьДокументВСвободныйПоток(Кэш, Док)		
	КонецЦикла;
	Ответы = СБИСПлагин_ПолучитьОтветы(Кэш, "sendDocument");
КонецПроцедуры
&НаКлиенте
Процедура ОтправитьДокументВСвободныйПоток(Кэш, Документ)
	ОтправилиДокумент = Ложь;
	Пока ОтправилиДокумент = Ложь Цикл
		Для Каждого Поток Из Кэш.СБИСПлагинПотоки Цикл
			Если Поток.Загруженность=0 Тогда
				СБИСПлагинВыполнить_WriteDocumentEx(Кэш, Поток, Документ);
				//СчетчикОтправленныхСообщений = СчетчикОтправленныхСообщений+1; //Логирование
				Поток.Загруженность = 1;
				ОтправилиДокумент = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ОтправилиДокумент = Ложь Тогда
			Ответы = СБИСПлагин_ПолучитьОтветы(Кэш, "sendDocument");
			//ОбработатьСообщенияПотоковОтправки(ПотокиОтправки);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьСообщенияПотоковОтправки(ПотокиОтправки, ТекущаяЗагруженность = Неопределено)
	//ОжиданиеОтвета = 30;
	//НачДата = ТекущаяДата();
	//ПолученныеДокументы = Новый Массив;
	//
	//КолСообщений = -1;
	//ЗанятыеПотоки = ПолучитьКоличествоЗанятыхПотоков(ПотокиОтправки);
	//
	//Пока КолСообщений < 0 И (ЗанятыеПотоки >= ПотокиОтправки.Количество() ИЛИ ЗанятыеПотоки >= ТекущаяЗагруженность) Цикл
	//	Если ТекущаяДата() - ОжиданиеОтвета < НачДата Тогда
	//		Сообщения = Кэш.СБИСПлагин.ReadAll();
	//		КолСообщений = Сообщения.GetUpperBound(0); 
	//		
	//		Если КолСообщений >= 0 Тогда
	//			Для нпп = Сообщения.GetLowerBound(0) По КолСообщений Цикл
	//				Сообщение = Сообщения.GetValue(нпп);
	//				Сообщить("Получили ответ: --->"+ Сообщение);
	//				Сообщение = сбисПрочитатьJSON(Сообщение);
	//				
	//				Если Сообщение.Свойство("event") И Сообщение.event <> "" Тогда
	//					Сообщение = сбисПрочитатьJSON(Сообщение.event);
	//					
	//					Если типЗнч(Сообщение) = тип("Структура") Тогда
	//						ИдентификаторКоманды = Сообщение.queryID;
	//						ВыполненнаяКоманда =  РазложитьСтрокуВМассивПодстрок(ИдентификаторКоманды,"@")[0];
	//					Иначе
	//						ИдентификаторКоманды = Сообщение["queryID"];
	//						ВыполненнаяКоманда = РазложитьСтрокуВМассивПодстрок(ИдентификаторКоманды,"@")[0];
	//					КонецЕсли;
	//					
	//					Если ВыполненнаяКоманда = "WriteDocumentEx" Тогда
	//						ПолученныеДокументы.Добавить(Сообщение);
	//					КонецЕсли;
	//					
	//					ИдентификаторПотока = РазложитьСтрокуВМассивПодстрок(ИдентификаторКоманды,"@")[1];
	//					Для Каждого Поток Из ПотокиОтправки Цикл
	//						Если Поток.objectID = ИдентификаторПотока Тогда
	//							Поток.Загруженность = 0;
	//						КонецЕсли;
	//					КонецЦикла;
	//					
	//				КонецЕсли;
	//				
	//			КонецЦикла;			
	//		КонецЕсли;
	//		ЗанятыеПотоки = ПолучитьКоличествоЗанятыхПотоков(ПотокиОтправки);
	//	Иначе
	//		Возврат;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//ОбработатьСообщение_getDocument(ПолученныеДокументы);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПотокиОтправки(Кэш)
	СБИСПлагин = Новый COMОбъект("Tensor.SbisPluginClientCOM");
	СБИСПлагин.Connect();
	ОжиданиеОтвета = 5;
	НачДата = ТекущаяДата();
	Статус = СБИСПлагин.State();
	
	Пока Статус = "Connecting" ИЛИ Статус =  "Closed"  Цикл
		Статус = СБИСПлагин.State();
		Сообщить(Статус);
		Если ТекущаяДата() - ОжиданиеОтвета > НачДата Тогда
			Сообщить("не сумели подключиться к сбис плагину за разумное время");
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Кэш.Вставить("СБИСПлагин", СБИСПлагин);
	Количество = Кэш.КоличествоПотоковОтправки;   
	Потоки = Новый Массив;
	счетчик = 0;
	Попытка
		Пока Количество > счетчик Цикл			
			счетчик = счетчик + 1;
			Поток = Новый Структура();
			Поток.Вставить("Название", Строка(счетчик) + "Поток отправки");
			СформироватьПотокОтправки(Поток, Кэш);
			Если Поток.Свойство("Загруженность") Тогда
				Потоки.Добавить(Поток);
				Сообщить("СФОРМИРОВАН ПОТОК ОТПРАВКИ С ИДЕНТИФИКАТОРОМ: " + Поток.objectID);	           
			Иначе
				Возврат;
			КонецЕсли;
		КонецЦикла;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Кэш.Вставить("СБИСПлагинПотоки", Потоки);
	Кэш.Вставить("СписокДокументовS", сбисСформироватьОписаниеСпискаДокументов());
КонецПроцедуры
&НаКлиенте
Функция СформироватьПотокОтправки(Поток, Кэш)
	СБИСПлагинВыполнить_getPlugin(Кэш, Поток);
	Ответы = СБИСПлагин_ПолучитьОтветы(Кэш, "getPlugin");
	Если Ответы.Количество() = 0 Тогда
		Возврат "Метод getPlugin отработал не корректно. Не получен ответ.";
	КонецЕсли;
	Если Ответы[0]["answer"].Получить("error")<>Неопределено Тогда
		Возврат Ответы[0]["answer"]["error"];
	КонецЕсли;
	Поток.Вставить("objectID", Ответы[0]["answer"]["objectID"]);
	
	СБИСПлагинВыполнить_getConnection(Кэш, Поток);
	Ответы = СБИСПлагин_ПолучитьОтветы(Кэш, "getConnection");
	Если Ответы.Количество() = 0 Тогда
		Возврат "Метод getConnection отработал не корректно. Не получен ответ.";
	КонецЕсли;
	Если Ответы[0]["answer"].Получить("error")<>Неопределено Тогда
		Возврат Ответы[0]["answer"]["error"];
	КонецЕсли;
	Поток.Вставить("objectID", Ответы[0]["answer"]["objectID"]);
	
	СБИСПлагинВыполнить_setConnectionInfo(Кэш, Поток);
	Ответы = СБИСПлагин_ПолучитьОтветы(Кэш, "setConnectionInfo");
	Если Ответы.Количество() = 0 Тогда
		Возврат "Метод setConnectionInfo отработал не корректно. Не получен ответ.";
	КонецЕсли;
	Если Ответы[0]["answer"].Получить("error")<>Неопределено Тогда
		Возврат Ответы[0]["answer"]["error"];
	КонецЕсли;
	
	СБИСПлагинВыполнить_login(Кэш, Поток);
	Ответы = СБИСПлагин_ПолучитьОтветы(Кэш, "login");
	Если Ответы.Количество() = 0 Тогда
		Возврат "Метод login отработал не корректно. Не получен ответ.";
	КонецЕсли;
	Если Ответы[0]["answer"].Получить("error")<>Неопределено Тогда
		Возврат Ответы[0]["answer"]["error"];
	КонецЕсли;
	
	СБИСПлагинВыполнить_setConnectionInfo(Кэш, Поток);
	Ответы = СБИСПлагин_ПолучитьОтветы(Кэш, "setConnectionInfo");
	Если Ответы.Количество() = 0 Тогда
		Возврат "Метод setConnectionInfo отработал не корректно. Не получен ответ.";
	КонецЕсли;
	Если Ответы[0]["answer"].Получить("error")<>Неопределено Тогда
		Возврат Ответы[0]["answer"]["error"];
	КонецЕсли;
	
	СБИСПлагинВыполнить_setSystemInfo(Кэш, Поток);
	Ответы = СБИСПлагин_ПолучитьОтветы(Кэш, "setSystemInfo");
	Если Ответы.Количество() = 0 Тогда
		Возврат "Метод setSystemInfo отработал не корректно. Не получен ответ.";
	КонецЕсли;
	Если Ответы[0]["answer"].Получить("error")<>Неопределено Тогда
		Возврат Ответы[0]["answer"]["error"];
	КонецЕсли;
	
	Поток.Вставить("Загруженность", 0);
КонецФункции
//Блок функций формирующих сообщения СБИС Плагину-----------------------------------------------
&НаКлиенте
Функция СБИСПлагинВыполнить_getPlugin(Кэш, Поток)
	Парам = Новый Массив;
	Парам.Добавить("ExtCom1C");
	Парам.Добавить("1.0.1.1");
	Парам.Добавить(NULL);
	
	СБИСПлагин_ВыполнитьМетод(Кэш, Поток, "getPlugin", Парам);
КонецФункции
&НаКлиенте
Функция СБИСПлагинВыполнить_getConnection(Кэш, Поток)
	Парам = Новый Массив;	
	Параметр = Новый Структура();
	Параметр.Вставить("url", СтрЗаменить(СтрЗаменить(СтрокаСоединенияИнформационнойБазы(),"\","\\"),"""","\"""));    //   "File="C:\\Bronfeld\\Базы 8.3\\Buh3_test";"
	Параметр.Вставить("type", "IntEngineCom1S83");
	Параметр.Вставить("id", Поток.Название);
	
	Парам.Добавить(Параметр);	
	СБИСПлагин_ВыполнитьМетод(Кэш, Поток, "getConnection", Парам);
КонецФункции
&НаКлиенте
Функция СБИСПлагинВыполнить_setConnectionInfo(Кэш, Поток)
	Парам = Новый Массив;
	Параметр = Новый Структура();
	Параметр.Вставить("url", СтрЗаменить(СтрЗаменить(СтрокаСоединенияИнформационнойБазы(),"\","\\"),"""","\"""));
	Параметр.Вставить("type", "IntEngineCom1S83");
	Параметр.Вставить("ini", Кэш.СБИСПлагинИни);
	Параметр.Вставить("AccountID",Лев(Кэш.Парам.ИдентификаторСессии,8)+"@"+СтрЗаменить(Кэш.СБИС.АдресСервера,"https://",""));  
	Параметр.Вставить("sid",Кэш.Парам.ИдентификаторСессии);
	Параметр.Вставить("host",Кэш.СБИС.АдресСервера);
	Парам.Добавить(Параметр);
	
	СБИСПлагин_ВыполнитьМетод(Кэш, Поток, "setConnectionInfo", Парам);
КонецФункции
&НаКлиенте
Функция СБИСПлагинВыполнить_login(Кэш, Поток)
	Парам = Новый Массив;
	Парам.Добавить(ИмяПользователя());
	Парам.Добавить(""); 
	
	СБИСПлагин_ВыполнитьМетод(Кэш, Поток, "login", Парам);
КонецФункции
&НаКлиенте
Функция СБИСПлагинВыполнить_setSystemInfo(Кэш, Поток)
	СБИСПлагин_ВыполнитьМетод(Кэш, Поток, "setSystemInfo");
КонецФункции
&НаКлиенте
Функция СБИСПлагинВыполнить_WriteDocumentEx(Кэш, Поток, Документ)
	Парам = Новый Массив;
	Парам.Добавить("РеализацияТоваровУслуг");            //
	СтруктураДокумента = Новый Структура();
	СтруктураДокумента.Вставить("s", Кэш.СписокДокументовS);	
	СтруктураДокумента.Вставить("d", Документ);
	Парам.Добавить(СтруктураДокумента);
	Парам.Добавить("true");
	СБИСПлагин_ВыполнитьМетод(Кэш, Поток, "sendDocument", Парам);	 
КонецФункции

&НаКлиенте
Функция СБИСПлагин_ВыполнитьМетод(Кэш, Поток, Метод, Парам=Неопределено, Идентификатор = "")
	Сообщение = Новый Структура;
	Сообщение.Вставить("type", "call");
	Сообщение.Вставить("method", Метод);
	Сообщение.Вставить("queryID", Метод +"@"+?(Поток.Свойство("objectID"),Поток.objectID,"")+"@"+Идентификатор);
	
	Если Поток.Свойство("objectID") Тогда
		Сообщение.Вставить("objectID", Поток.objectID);
	КонецЕсли;
	
	Если Парам<>Неопределено Тогда
		Сообщение.Вставить("Params",Парам);
	КонецЕсли;
		
	Сообщение = "{"+сбисЗаписатьПараметрыЗапроса(Сообщение)+"}";	
	Если Кэш.СБИСПлагин.State() = "Open" Тогда
		Кэш.СБИСПлагин.Send(Сообщение);
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция СБИСПлагин_ПолучитьОтветы(Кэш, Команда)
	ОжиданиеОтвета = 30;
	НачДата = ТекущаяДата();
	Результат = Новый Массив;
	ПредКолСообщений = -1;
	
	Пока ТекущаяДата() - ОжиданиеОтвета < НачДата Цикл
		Сообщения = Кэш.СБИСПлагин.ReadAll();
		КолСообщений = Сообщения.GetUpperBound(0);
		Если Результат.Количество()>0 и КолСообщений<0 Тогда    // в предыдущий проход получили ответы, а в текущий уже нет - прерываемся
			Прервать;	
		КонецЕсли;
		Первое = Сообщения.GetLowerBound(0);
		Если КолСообщений >= 0 Тогда
			Для нпп = Первое По КолСообщений Цикл
				Сообщение = Сообщения.GetValue(нпп);
				Сообщение = Кэш.РаботаСJSON.сбисПрочитатьJSON(Сообщение);
				
				Если Сообщение.Получить("event")<>Неопределено И Сообщение["event"] <> "" Тогда
					Сообщение = Кэш.РаботаСJSON.сбисПрочитатьJSON(Сообщение["event"]);
					ИдентификаторКоманды = Сообщение["queryID"];
					ВыполненнаяКоманда = РазложитьСтрокуВМассивПодстрок(ИдентификаторКоманды,"@")[0];
					
					Если ВыполненнаяКоманда = Команда Тогда
						Результат.Добавить(Сообщение);
					КонецЕсли;
					
				КонецЕсли	
			КонецЦикла;
		КонецЕсли;
		ПредКолСообщений = КолСообщений;
	КонецЦикла;
	Возврат Результат;
КонецФункции
&НаКлиенте
Функция сбисЗаписатьПараметрыЗапроса(СтруктураПараметровЗапроса) Экспорт
	ТекстЗапроса = "";
	Для Каждого Элемент Из СтруктураПараметровЗапроса Цикл
		Если ТипЗнч(Элемент.Значение) = Тип("Строка") ИЛИ ТипЗнч(Элемент.Значение) = Тип("Дата") Тогда
			ТекстЗапроса = ТекстЗапроса+""""+Элемент.Ключ+""":"""+?(Элемент.Ключ = "url",Элемент.Значение,СтрЗаменить(Элемент.Значение, """", "\"""))+""",";
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Число") Тогда
			ТекстЗапроса = ТекстЗапроса+""""+Элемент.Ключ+""":"""+строка(Элемент.Значение)+""",";
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Структура") или ТипЗнч(Элемент.Значение) = Тип("Соответствие") Тогда
			ТекстЗапроса = ТекстЗапроса+""""+Элемент.Ключ+""":{"+сбисЗаписатьПараметрыЗапроса(Элемент.Значение)+"},";
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда
			ТекстЗапроса = ТекстЗапроса+""""+Элемент.Ключ+""":[";
			Для Каждого ЭлементМассива Из Элемент.Значение Цикл
				Если ТипЗнч(ЭлементМассива) = Тип("Строка") ИЛИ ТипЗнч(ЭлементМассива) =  Тип("Дата") Тогда
					ТекстЗапроса = ТекстЗапроса+""""+СтрЗаменить(ЭлементМассива, """", "\""")+""",";
				ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("Null") Тогда
					ТекстЗапроса = ТекстЗапроса+"{}";
				ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("Массив") Тогда
					ТекстЗапроса = ТекстЗапроса+"[";
					Для Каждого Элемент Из ЭлементМассива Цикл
						Если ТипЗнч(Элемент) = Тип("Строка") ИЛИ ТипЗнч(Элемент) =  Тип("Дата") Тогда
							ТекстЗапроса = ТекстЗапроса+""""+СтрЗаменить(Элемент, """", "\""")+""",";
						ИначеЕсли ТипЗнч(Элемент) = Тип("Null") Тогда
							ТекстЗапроса = ТекстЗапроса+"{}";
						ИначеЕсли ТипЗнч(Элемент) = Тип("Массив") Тогда
							
						Иначе
							ТекстЗапроса = ТекстЗапроса+"{";
							ТекстЗапроса = ТекстЗапроса+сбисЗаписатьПараметрыЗапроса(Элемент);
							ТекстЗапроса = ТекстЗапроса+"},";
						КонецЕсли;
					КонецЦикла;
					Если Прав(ТекстЗапроса, 1) = "," Тогда
						ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса)-1);
					КонецЕсли;
					ТекстЗапроса = ТекстЗапроса+"],";
				Иначе
					ТекстЗапроса = ТекстЗапроса+"{";
					ТекстЗапроса = ТекстЗапроса+сбисЗаписатьПараметрыЗапроса(ЭлементМассива);
					ТекстЗапроса = ТекстЗапроса+"},";
				КонецЕсли;
			КонецЦикла;
			Если Прав(ТекстЗапроса, 1) = "," Тогда
				ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса)-1);
			КонецЕсли;
			ТекстЗапроса = ТекстЗапроса+"],";
		КонецЕсли;
	КонецЦикла;
	Если Прав(ТекстЗапроса, 1) = "," Тогда
		ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса)-1);
	КонецЕсли;
	Возврат ТекстЗапроса; 	
КонецФункции
&НаКлиенте
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",")
	МассивСтрок = Новый Массив();
	ДлинаРазделителя = СтрДлина(Разделитель);
	Пока 1=1 Цикл
		Поз = Найти(Стр,Разделитель);
		Если Поз=0 Тогда
			МассивСтрок.Добавить(Стр);
			Возврат МассивСтрок;
		КонецЕсли;
		МассивСтрок.Добавить(Лев(Стр,Поз-1));
		Стр = Сред(Стр,Поз+ДлинаРазделителя);
	КонецЦикла;
КонецФункции
&НаКлиенте
Функция сбисСформироватьОписаниеСпискаДокументов()
	СписокДокументовS = Новый Массив();
	СписокДокументовS.Добавить(Новый Структура("n,t","Идентификатор","Строка"));	
	СписокДокументовS.Добавить(Новый Структура("n,t","Название","Строка"));
	СписокДокументовS.Добавить(Новый Структура("n,t","Вложения","Выборка"));
	Возврат СписокДокументовS;
КонецФункции
Функция сбисПолучитьИдентификаторыДокументов1С(СоставПакета)
	СписокИдентификаторов = Новый СписокЗначений;
	Для Каждого Документ1С Из СоставПакета Цикл
		СписокИдентификаторов.Добавить(Документ1С.Значение.Метаданные().Имя+":"+строка(Документ1С.Значение.УникальныйИдентификатор()), строка(Документ1С.Значение));		
	КонецЦикла;
	Возврат СписокИдентификаторов;
КонецФункции
&НаКлиенте
Функция сбисСформироватьИни(Кэш)
	СБИСПлагинИни = "{""РеализацияТоваровУслуг"":{
|    ""Реестр1С_Тип"": {
|        ""Значение"": ""'РеализацияТоваровУслуг'""
|    },
|    ""Реестр1С_Название"": {
|        ""Значение"": ""'Реализация товаров и услуг'""
|    },
|    ""мФайл"": {
|        ""АктВР"": [
|            {
|                ""Значение"": ""'АктВР'"",
|                ""Имя"": ""Вложение_Тип""
|            },
|            {
|                ""Значение"": ""'1175006'"",
|                ""Имя"": ""Вложение_ПодТип""
|            },
|            {
|                ""Значение"": ""'5.01'"",
|                ""Имя"": ""Вложение_ВерсияФормата""
|            },
|            {
|                ""Значение"": ""'2015'"",
|                ""Имя"": ""Вложение_ПодВерсияФормата""
|            },
|            {
|                ""Значение"": ""'АктВР'"",
|                ""Имя"": ""Файл_Формат""
|            },
|            {
|                ""Значение"": ""'3.01'"",
|                ""Имя"": ""Файл_ВерсияФормата""
|            },
|            {
|                ""Значение"": ""'DP_IAKTPRM_'"",
|                ""Имя"": ""Файл_Имя""
|            },
|            {
|                ""Значение"": ""Документ.РеализацияТоваровУслуг"",
|                ""Имя"": ""Документ""
|            },
|            {
|                ""Значение"": ""'Отправитель'"",
|                ""Имя"": ""Отправитель_Роль""
|            },
|            {
|                ""Значение"": ""'Получатель'"",
|                ""Имя"": ""Получатель_Роль""
|            },
|            {
|                ""Значение"": ""'Акт выполненных работ'"",
|                ""Имя"": ""Документ_Название""
|            },
|            {
|                ""Значение"": ""[Документ].Дата"",
|                ""Формат"": ""ДФ=dd.MM.yyyy"",
|                ""Тип"": ""Дата"",
|                ""Имя"": ""Документ_Дата""
|            },
|            {
|                ""Значение"": ""[Документ].Дата"",
|                ""Формат"": ""ДФ=HH.mm.ss"",
|                ""Тип"": ""Дата"",
|                ""Имя"": ""Документ_Время""
|            },
|            {
|                ""Значение"": ""[Документ].Номер"",
|                ""Имя"": ""НомерДокумента""
|            },
|            {
|                ""Значение"": ""{ПолучитьНомерДокумента()}"",
|                ""Имя"": ""Документ_Номер""
|            },
|            {
|                ""Значение"": ""[Документ].Комментарий"",
|                ""Имя"": ""Документ_Примечание""
|            },
|            {
|                ""Значение"": ""'Мы, нижеподписавшиеся, представитель ИСПОЛНИТЕЛЯ, с одной стороны и представитель ЗАКАЗЧИКА\n            с другой стороны, составили настоящий акт в том, что ИСПОЛНИТЕЛЬ выполнил, а ЗАКАЗЧИК принял следующие\n            работы (услуги)'"",
|                ""Имя"": ""Документ_Заголовок""
|            },
|            {
|                ""Значение"": ""[Документ].СуммаВключаетНДС"",
|                ""Имя"": ""СуммаВключаетНДС""
|            },
|            {
|                ""Значение"": ""[Документ].Ответственный"",
|                ""Имя"": ""ОтветственныйПользователь""
|            },
|            {
|                ""Значение"": ""[ОтветственныйПользователь].ФизЛицо"",
|                ""Имя"": ""Ответственный""
|            },
|            {
|                ""Значение"": ""[Ответственный].Наименование"",
|                ""Имя"": ""Ответственный_ФИО""
|            },
|            {
|                ""Значение"": ""[Ответственный].УникальныйИдентификатор"",
|                ""Имя"": ""Ответственный_Идентификатор""
|            },
|            {
|                ""Отбор_Физлицо"": ""[Ответственный]"",
|                ""Имя"": ""Сотрудник"",
|                ""Значение"": ""Справочник.СотрудникиОрганизаций""
|            },
|            {
|                ""Значение"": ""[Сотрудник].ТекущееПодразделениеОрганизации"",
|                ""Имя"": ""Подразделение""
|            },
|            {
|                ""Значение"": ""[Подразделение].Наименование"",
|                ""Имя"": ""Подразделение_Название""
|            },
|            {
|                ""Значение"": ""'Реализация'"",
|                ""Имя"": ""Регламент_Название""
|            },
|            {
|                ""Значение"": ""[Документ].ДоговорКонтрагента"",
|                ""Имя"": ""Договор""
|            },
|            {
|                ""Значение"": {
|                    ""Договор"": [
|                        {
|                            ""Значение"": ""'ДоговорИсх'"",
|                            ""Имя"": ""ДокументОснование_Тип""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Номер"",
|                            ""Имя"": ""ДокументОснование_Номер""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Тип"": ""Дата"",
|                            ""Имя"": ""ДокументОснование_Дата""
|                        }
|                    ]
|                },
|                ""Имя"": ""мДокументОснование""
|            },
|            {
|                ""Значение"": {
|                    ""Договор"": [
|                        {
|                            ""Значение"": ""[Документ].ДоговорКонтрагента"",
|                            ""Имя"": ""Основание""
|                        },
|                        {
|                            ""Значение"": ""[Основание].Наименование"",
|                            ""Имя"": ""Основание_Название""
|                        },
|                        {
|                            ""Значение"": ""[Основание].Номер"",
|                            ""Имя"": ""Основание_Номер""
|                        },
|                        {
|                            ""Значение"": ""[Основание].Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Тип"": ""Дата"",
|                            ""Имя"": ""Основание_Дата""
|                        }
|                    ]
|                },
|                ""Имя"": ""мОснование""
|            },
|            {
|                ""Значение"": {
|                    ""СуммаВключаетНДС"": [
|                        {
|                            ""Значение"": ""'СуммаВключаетНДС'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Значение"": ""[Документ].СуммаВключаетНДС"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ],
|                    ""ДоговорДата"": [
|                        {
|                            ""Значение"": ""'ДоговорДата'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Тип"": ""Дата"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ],
|                    ""ДоговорНомер"": [
|                        {
|                            ""Значение"": ""'ДоговорНомер'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Номер"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ]
|                },
|                ""Имя"": ""мПараметр""
|            },
|            {
|                ""Значение"": {
|                    ""Получатель"": [
|                        {
|                            ""Значение"": ""[Документ].Контрагент"",
|                            ""Имя"": ""Сторона""
|                        },
|                        {
|                            ""Значение"": ""'Получатель'"",
|                            ""Имя"": ""Роль""
|                        },
|                        {
|                            ""Значение"": ""{сбисИдентификаторУчастника()}"",
|                            ""Имя"": ""Сторона_Идентификатор"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИНН"",
|                            ""Имя"": ""Сторона_ИНН""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КПП"",
|                            ""Имя"": ""Сторона_КПП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодПоОКПО"",
|                            ""Имя"": ""Код_ОКПО""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКОПФ""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКДП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].НаименованиеПолное"",
|                            ""Имя"": ""Сторона_Наименование""
|                        },
|                        {
|                            ""Значение"": ""Справочник.ВидыКонтактнойИнформации"",
|                            ""Имя"": ""ВидыКонтактнойИнформации""
|                        },
|                        {
|                            ""Значение"": ""Перечисление.ТипыКонтактнойИнформации"",
|                            ""Имя"": ""ТипыКонтактнойИнформации""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресКонтрагента"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Кэш"": ""Получатель"",
|                            ""Имя"": ""АдресЮЛ""
|                        },
|                        {
|                            ""Значение"": ""{сбисПолучитьАдрес()}"",
|                            ""Имя"": ""Сторона_Адрес"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ТелефонКонтрагента"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Кэш"": ""Получатель"",
|                            ""Имя"": ""Телефон""
|                        },
|                        {
|                            ""Значение"": ""[Телефон].Представление"",
|                            ""Имя"": ""Контакт_Телефон"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ОсновнойБанковскийСчет"",
|                            ""Имя"": ""БанкСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].Банк"",
|                            ""Имя"": ""Банк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Наименование"",
|                            ""Имя"": ""БанкРекв_НаимБанк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Код"",
|                            ""Имя"": ""БанкРекв_БИК""
|                        },
|                        {
|                            ""Значение"": ""[Банк].КоррСчет"",
|                            ""Имя"": ""БанкРекв_КСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].НомерСчета"",
|                            ""Имя"": ""БанкРекв_РСчет""
|                        }
|                    ],
|                    ""Отправитель"": [
|                        {
|                            ""Значение"": ""[Документ].Организация"",
|                            ""Имя"": ""Сторона""
|                        },
|                        {
|                            ""Значение"": ""'Отправитель'"",
|                            ""Имя"": ""Роль""
|                        },
|                        {
|                            ""Значение"": ""{сбисИдентификаторУчастника()}"",
|                            ""Имя"": ""Сторона_Идентификатор"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИНН"",
|                            ""Имя"": ""Сторона_ИНН""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КПП"",
|                            ""Имя"": ""Сторона_КПП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодПоОКПО"",
|                            ""Имя"": ""Код_ОКПО""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКОПФ"",
|                            ""Имя"": ""Код_ОКОПФ""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКФС"",
|                            ""Имя"": ""Код_ОКФС""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКВЭД"",
|                            ""Имя"": ""Код_ОКВЭД""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].НаименованиеПолное"",
|                            ""Имя"": ""Сторона_Наименование""
|                        },
|                        {
|                            ""Значение"": ""Перечисление.ТипыКонтактнойИнформации"",
|                            ""Имя"": ""ТипыКонтактнойИнформации""
|                        },
|                        {
|                            ""Значение"": ""Справочник.ВидыКонтактнойИнформации"",
|                            ""Имя"": ""ВидыКонтактнойИнформации""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресОрганизации"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Кэш"": ""Организация"",
|                            ""Имя"": ""АдресЮЛ""
|                        },
|                        {
|                            ""Отбор_Объект"": ""[Сторона].ИндивидуальныйПредприниматель"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресФизЛица"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Кэш"": ""Организация"",
|                            ""Имя"": ""АдресФЛ""
|                        },
|                        {
|                            ""Значение"": ""{сбисПолучитьАдрес()}"",
|                            ""Имя"": ""Сторона_Адрес"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ТелефонОрганизации"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Кэш"": ""Организация"",
|                            ""Имя"": ""Телефон""
|                        },
|                        {
|                            ""Значение"": ""[Телефон].Представление"",
|                            ""Имя"": ""Контакт_Телефон"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ФаксОрганизации"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Кэш"": ""Организация"",
|                            ""Имя"": ""Факс""
|                        },
|                        {
|                            ""Значение"": ""[Факс].Представление"",
|                            ""Имя"": ""Контакт_Факс"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].EmailОрганизации"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].АдресЭлектроннойПочты"",
|                            ""Кэш"": ""Организация"",
|                            ""Имя"": ""ЭлПочта""
|                        },
|                        {
|                            ""Значение"": ""[ЭлПочта].Представление"",
|                            ""Имя"": ""Контакт_EMAIL"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Отбор_Объект"": ""'Сторона'"",
|                            ""Значение"": ""'РегистрыСведений.КонтактнаяИнформация'"",
|                            ""Отбор_Тип"": ""'[ТипыКонтактнойИнформации].ВебСтраница'"",
|                            ""Отбор_Вид"": ""''"",
|                            ""Имя"": ""Интернет""
|                        },
|                        {
|                            ""Значение"": ""[Интернет].Представление"",
|                            ""Имя"": ""Контакт_Internet""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ОсновнойБанковскийСчет"",
|                            ""Имя"": ""БанкСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].Банк"",
|                            ""Имя"": ""Банк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Наименование"",
|                            ""Имя"": ""БанкРекв_НаимБанк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Код"",
|                            ""Имя"": ""БанкРекв_БИК""
|                        },
|                        {
|                            ""Значение"": ""[Банк].КоррСчет"",
|                            ""Имя"": ""БанкРекв_КСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].НомерСчета"",
|                            ""Имя"": ""БанкРекв_РСчет""
|                        },
|                        {
|                            ""Значение"": ""{сбисПодписант()}"",
|                            ""Имя"": ""Сертификат"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Значение"": {
|                                ""Ответственный"": [
|                                    {
|                                        ""Значение"": ""[Сертификат].Должность"",
|                                        ""Имя"": ""Должность""
|                                    },
|                                    {
|                                        ""Значение"": ""[Сертификат].ФИО"",
|                                        ""Имя"": ""ФИО""
|                                    },
|                                    {
|                                        ""Значение"": ""[Сертификат].ИНН"",
|                                        ""Имя"": ""ИНН""
|                                    }
|                                ]
|                            },
|                            ""Имя"": ""мПредставитель""
|                        }
|                    ]
|                },
|                ""Имя"": ""мСторона""
|            },
|            {
|                ""Значение"": {
|                    ""АгенстсиеУслуги"": [
|                        {
|                            ""Значение"": ""[Документ].АгентскиеУслуги"",
|                            ""Имя"": ""ТаблДок"",
|                            ""Тип"": ""ТабличнаяЧасть""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Номенклатура"",
|                            ""Имя"": ""Номенклатура""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].БазоваяЕдиницаИзмерения"",
|                            ""Имя"": ""ЕдИзм""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Содержание"",
|                            ""Имя"": ""Описание""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].Наименование"",
|                            ""Имя"": ""Название""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].Код"",
|                            ""Имя"": ""ТаблДок_Код""
|                        },
|                        {
|                            ""Значение"": ""{ПолучитьНаименованиеУслуги()}"",
|                            ""Имя"": ""ТаблДок_Название""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Содержание"",
|                            ""Имя"": ""ТаблДок_Описание""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Цена"",
|                            ""Имя"": ""Цена""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Количество"",
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.000"",
|                            ""Имя"": ""ТаблДок_Кол_во""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Сумма"",
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"",
|                            ""Имя"": ""ТаблДок_Сумма""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].СуммаНДС"",
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"",
|                            ""Имя"": ""СуммаНДС""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].СтавкаНДС"",
|                            ""Имя"": ""СтавкаНДС""
|                        },
|                        {
|                            ""Значение"": ""{сбисВычислитьЦену()}"",
|                            ""Имя"": ""ТаблДок_Цена""
|                        },
|                        {
|                            ""Значение"": {
|                                ""Цена1С"": [
|                                    {
|                                        ""Значение"": ""'Цена1С'"",
|                                        ""Имя"": ""Параметр_Имя""
|                                    },
|                                    {
|                                        ""Значение"": ""[ТаблДок].Цена"",
|                                        ""Формат"": ""ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"",
|                                        ""Имя"": ""Параметр_Значение""
|                                    }
|                                ]
|                            },
|                            ""Имя"": ""мПараметр""
|                        },
|                        {
|                            ""Значение"": ""[ЕдИзм].Наименование"",
|                            ""Имя"": ""ТаблДок_ЕдИзм""
|                        },
|                        {
|                            ""Значение"": ""[ЕдИзм].Код"",
|                            ""Имя"": ""ТаблДок_ОКЕИ""
|                        },
|                        {
|                            ""Значение"": ""'без акциза'"",
|                            ""Имя"": ""СуммаАкциз""
|                        },
|                        {
|                            ""Значение"": ""{ОпределитьИдентификаторНоменклатуры()}"",
|                            ""Имя"": ""ТаблДок_Идентификатор""
|                        }
|                    ],
|                    ""Услуги"": [
|                        {
|                            ""Значение"": ""[Документ].Услуги"",
|                            ""Имя"": ""ТаблДок"",
|                            ""Тип"": ""ТабличнаяЧасть""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Номенклатура"",
|                            ""Имя"": ""Номенклатура""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].БазоваяЕдиницаИзмерения"",
|                            ""Имя"": ""ЕдИзм""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Содержание"",
|                            ""Имя"": ""Описание""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].Наименование"",
|                            ""Имя"": ""Название""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].Код"",
|                            ""Имя"": ""ТаблДок_Код""
|                        },
|                        {
|                            ""Значение"": ""{ПолучитьНаименованиеУслуги()}"",
|                            ""Имя"": ""ТаблДок_Название""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Содержание"",
|                            ""Имя"": ""ТаблДок_Описание""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Цена"",
|                            ""Имя"": ""Цена""
|                        },
|                        {
|                            ""Значение"": {
|                                ""Цена1С"": [
|                                    {
|                                        ""Значение"": ""'Цена1С'"",
|                                        ""Имя"": ""Параметр_Имя""
|                                    },
|                                    {
|                                        ""Значение"": ""[ТаблДок].Цена"",
|                                        ""Формат"": ""ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"",
|                                        ""Имя"": ""Параметр_Значение""
|                                    }
|                                ]
|                            },
|                            ""Имя"": ""мПараметр""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Количество"",
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.000"",
|                            ""Имя"": ""ТаблДок_Кол_во""
|                        },
|                        {
|                            ""Значение"": ""[ЕдИзм].Наименование"",
|                            ""Имя"": ""ТаблДок_ЕдИзм""
|                        },
|                        {
|                            ""Значение"": ""[ЕдИзм].Код"",
|                            ""Имя"": ""ТаблДок_ОКЕИ""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Сумма"",
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"",
|                            ""Имя"": ""ТаблДок_Сумма""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].СуммаНДС"",
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"",
|                            ""Имя"": ""СуммаНДС""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].СтавкаНДС"",
|                            ""Имя"": ""СтавкаНДС""
|                        },
|                        {
|                            ""Значение"": ""{сбисВычислитьЦену()}"",
|                            ""Имя"": ""ТаблДок_Цена""
|                        },
|                        {
|                            ""Значение"": ""'без акциза'"",
|                            ""Имя"": ""СуммаАкциз""
|                        },
|                        {
|                            ""Значение"": ""{ОпределитьИдентификаторНоменклатуры()}"",
|                            ""Имя"": ""ТаблДок_Идентификатор""
|                        }
|                    ]
|                },
|                ""Имя"": ""мТаблДок""
|            }
|        ],
|        ""ЭДОНакл"": [
|            {
|                ""Значение"": ""'ЭДОНакл'"",
|                ""Имя"": ""Вложение_Тип""
|            },
|            {
|                ""Значение"": ""'1175004'"",
|                ""Имя"": ""Вложение_ПодТип""
|            },
|            {
|                ""Значение"": ""'5.01'"",
|                ""Имя"": ""Вложение_ВерсияФормата""
|            },
|            {
|                ""Значение"": ""'2015'"",
|                ""Имя"": ""Вложение_ПодВерсияФормата""
|            },
|            {
|                ""Значение"": ""'ЭДОНакл'"",
|                ""Имя"": ""Файл_Формат""
|            },
|            {
|                ""Значение"": ""'3.01'"",
|                ""Имя"": ""Файл_ВерсияФормата""
|            },
|            {
|                ""Значение"": ""'DP_OTORG12_'"",
|                ""Имя"": ""Файл_Имя""
|            },
|            {
|                ""Значение"": ""Документ.РеализацияТоваровУслуг"",
|                ""Имя"": ""Документ""
|            },
|            {
|                ""Значение"": ""'Отправитель'"",
|                ""Имя"": ""Отправитель_Роль""
|            },
|            {
|                ""Значение"": ""'Получатель'"",
|                ""Имя"": ""Получатель_Роль""
|            },
|            {
|                ""Значение"": ""'Накладная'"",
|                ""Имя"": ""Документ_Название""
|            },
|            {
|                ""Значение"": ""[Документ].Дата"",
|                ""Формат"": ""ДФ=dd.MM.yyyy"",
|                ""Тип"": ""Дата"",
|                ""Имя"": ""Документ_Дата""
|            },
|            {
|                ""Значение"": ""[Документ].Дата"",
|                ""Формат"": ""ДФ=HH.mm.ss"",
|                ""Тип"": ""Дата"",
|                ""Имя"": ""Документ_Время""
|            },
|            {
|                ""Значение"": ""[Документ].Номер"",
|                ""Имя"": ""НомерДокумента""
|            },
|            {
|                ""Значение"": ""{ПолучитьНомерДокумента()}"",
|                ""Имя"": ""Документ_Номер""
|            },
|            {
|                ""Значение"": ""[Документ].Комментарий"",
|                ""Имя"": ""Документ_Примечание""
|            },
|            {
|                ""Значение"": ""[Документ].СуммаВключаетНДС"",
|                ""Имя"": ""СуммаВключаетНДС""
|            },
|            {
|                ""Значение"": ""Константа.ВалютаРегламентированногоУчета"",
|                ""Имя"": ""ВалютаУчета""
|            },
|            {
|                ""Значение"": ""[Документ].ВалютаДокумента"",
|                ""Имя"": ""Валюта""
|            },
|            {
|                ""Значение"": ""'Истина'"",
|                ""Имя"": ""ПересчитатьВВалютеУчета""
|            },
|            {
|                ""Значение"": ""{сбисИтогСуммаПоРегиструБухгалтерииТовары()}"",
|                ""Имя"": ""ИтогСумма""
|            },
|            {
|                ""Значение"": ""'Истина'"",
|                ""Имя"": ""РасчетСуммыНДСПоСтавке""
|            },
|            {
|                ""Значение"": ""'Мы, нижеподписавшиеся, представитель ИСПОЛНИТЕЛЯ, с одной стороны и представитель ЗАКАЗЧИКА\n            с другой стороны, составили настоящий акт в том, что ИСПОЛНИТЕЛЬ выполнил, а ЗАКАЗЧИК принял следующие\n            работы (услуги)'"",
|                ""Имя"": ""Документ_Заголовок""
|            },
|            {
|                ""Значение"": ""[Документ].Ответственный"",
|                ""Имя"": ""ОтветственныйПользователь""
|            },
|            {
|                ""Значение"": ""[ОтветственныйПользователь].ФизЛицо"",
|                ""Имя"": ""Ответственный""
|            },
|            {
|                ""Значение"": ""[Ответственный].Наименование"",
|                ""Имя"": ""Ответственный_ФИО""
|            },
|            {
|                ""Значение"": ""[Ответственный].УникальныйИдентификатор"",
|                ""Имя"": ""Ответственный_Идентификатор""
|            },
|            {
|                ""Отбор_Физлицо"": ""[Ответственный]"",
|                ""Имя"": ""Сотрудник"",
|                ""Значение"": ""Справочник.СотрудникиОрганизаций""
|            },
|            {
|                ""Значение"": ""[Сотрудник].ТекущееПодразделениеОрганизации"",
|                ""Имя"": ""Подразделение""
|            },
|            {
|                ""Значение"": ""[Подразделение].Наименование"",
|                ""Имя"": ""Подразделение_Название""
|            },
|            {
|                ""Значение"": ""'Реализация'"",
|                ""Имя"": ""Регламент_Название""
|            },
|            {
|                ""Значение"": ""[Документ].ДоговорКонтрагента"",
|                ""Имя"": ""Договор""
|            },
|            {
|                ""Значение"": {
|                    ""Договор"": [
|                        {
|                            ""Значение"": ""'ДоговорИсх'"",
|                            ""Имя"": ""ДокументОснование_Тип""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Номер"",
|                            ""Имя"": ""ДокументОснование_Номер""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Тип"": ""Дата"",
|                            ""Имя"": ""ДокументОснование_Дата""
|                        }
|                    ]
|                },
|                ""Имя"": ""мДокументОснование""
|            },
|            {
|                ""Значение"": {
|                    ""ДоговорДата"": [
|                        {
|                            ""Значение"": ""'ДоговорДата'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Тип"": ""Дата"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ],
|                    ""ДоговорНомер"": [
|                        {
|                            ""Значение"": ""'ДоговорНомер'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Номер"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ]
|                },
|                ""Имя"": ""мПараметр""
|            },
|            {
|                ""Значение"": {
|                    ""Грузополучатель"": [
|                        {
|                            ""Значение"": ""[Документ].Грузополучатель"",
|                            ""Имя"": ""Сторона""
|                        },
|                        {
|                            ""Значение"": ""'Грузополучатель'"",
|                            ""Имя"": ""Роль""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИНН"",
|                            ""Имя"": ""Сторона_ИНН""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КПП"",
|                            ""Имя"": ""Сторона_КПП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодПоОКПО"",
|                            ""Имя"": ""Код_ОКПО""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКОПФ""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКДП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].НаименованиеПолное"",
|                            ""Имя"": ""Сторона_Наименование""
|                        },
|                        {
|                            ""Значение"": ""Справочник.ВидыКонтактнойИнформации"",
|                            ""Имя"": ""ВидыКонтактнойИнформации""
|                        },
|                        {
|                            ""Значение"": ""Перечисление.ТипыКонтактнойИнформации"",
|                            ""Имя"": ""ТипыКонтактнойИнформации""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресКонтрагента"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Кэш"": ""Грузополучатель"",
|                            ""Имя"": ""АдресЮЛ""
|                        },
|                        {
|                            ""Значение"": ""{сбисПолучитьАдрес()}"",
|                            ""Имя"": ""Сторона_Адрес"",
|                            ""Кэш"": ""Грузополучатель""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ТелефонКонтрагента"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Кэш"": ""Грузополучатель"",
|                            ""Имя"": ""Телефон""
|                        },
|                        {
|                            ""Значение"": ""[Телефон].Представление"",
|                            ""Имя"": ""Контакт_Телефон"",
|                            ""Кэш"": ""Грузополучатель""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ОсновнойБанковскийСчет"",
|                            ""Имя"": ""БанкСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].Банк"",
|                            ""Имя"": ""Банк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Наименование"",
|                            ""Имя"": ""БанкРекв_НаимБанк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Код"",
|                            ""Имя"": ""БанкРекв_БИК""
|                        },
|                        {
|                            ""Значение"": ""[Банк].КоррСчет"",
|                            ""Имя"": ""БанкРекв_КСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].НомерСчета"",
|                            ""Имя"": ""БанкРекв_РСчет""
|                        }
|                    ],
|                    ""Получатель"": [
|                        {
|                            ""Значение"": ""[Документ].Контрагент"",
|                            ""Имя"": ""Сторона""
|                        },
|                        {
|                            ""Значение"": ""'Получатель'"",
|                            ""Имя"": ""Роль""
|                        },
|                        {
|                            ""Значение"": ""{сбисИдентификаторУчастника()}"",
|                            ""Имя"": ""Сторона_Идентификатор"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИНН"",
|                            ""Имя"": ""Сторона_ИНН""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КПП"",
|                            ""Имя"": ""Сторона_КПП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодПоОКПО"",
|                            ""Имя"": ""Код_ОКПО""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКОПФ""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКДП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].НаименованиеПолное"",
|                            ""Имя"": ""Сторона_Наименование""
|                        },
|                        {
|                            ""Значение"": ""Справочник.ВидыКонтактнойИнформации"",
|                            ""Имя"": ""ВидыКонтактнойИнформации""
|                        },
|                        {
|                            ""Значение"": ""Перечисление.ТипыКонтактнойИнформации"",
|                            ""Имя"": ""ТипыКонтактнойИнформации""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресКонтрагента"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Кэш"": ""Получатель"",
|                            ""Имя"": ""АдресЮЛ""
|                        },
|                        {
|                            ""Значение"": ""{сбисПолучитьАдрес()}"",
|                            ""Имя"": ""Сторона_Адрес"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ТелефонКонтрагента"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Кэш"": ""Получатель"",
|                            ""Имя"": ""Телефон""
|                        },
|                        {
|                            ""Значение"": ""[Телефон].Представление"",
|                            ""Имя"": ""Контакт_Телефон"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ОсновнойБанковскийСчет"",
|                            ""Имя"": ""БанкСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].Банк"",
|                            ""Имя"": ""Банк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Наименование"",
|                            ""Имя"": ""БанкРекв_НаимБанк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Код"",
|                            ""Имя"": ""БанкРекв_БИК""
|                        },
|                        {
|                            ""Значение"": ""[Банк].КоррСчет"",
|                            ""Имя"": ""БанкРекв_КСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].НомерСчета"",
|                            ""Имя"": ""БанкРекв_РСчет""
|                        }
|                    ],
|                    ""Грузоотправитель"": [
|                        {
|                            ""Значение"": ""[Документ].Грузоотправитель"",
|                            ""Имя"": ""Сторона""
|                        },
|                        {
|                            ""Значение"": ""'Грузоотправитель'"",
|                            ""Имя"": ""Роль""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИНН"",
|                            ""Имя"": ""Сторона_ИНН""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КПП"",
|                            ""Имя"": ""Сторона_КПП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодПоОКПО"",
|                            ""Имя"": ""Код_ОКПО""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКОПФ""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКДП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].НаименованиеПолное"",
|                            ""Имя"": ""Сторона_Наименование""
|                        },
|                        {
|                            ""Значение"": ""Справочник.ВидыКонтактнойИнформации"",
|                            ""Имя"": ""ВидыКонтактнойИнформации""
|                        },
|                        {
|                            ""Значение"": ""Перечисление.ТипыКонтактнойИнформации"",
|                            ""Имя"": ""ТипыКонтактнойИнформации""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресКонтрагента"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Кэш"": ""Грузоотправитель"",
|                            ""Имя"": ""АдресЮЛ""
|                        },
|                        {
|                            ""Значение"": ""{сбисПолучитьАдрес()}"",
|                            ""Имя"": ""Сторона_Адрес"",
|                            ""Кэш"": ""Грузоотправитель""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ТелефонКонтрагента"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Кэш"": ""Грузоотправитель"",
|                            ""Имя"": ""Телефон""
|                        },
|                        {
|                            ""Значение"": ""[Телефон].Представление"",
|                            ""Имя"": ""Контакт_Телефон"",
|                            ""Кэш"": ""Грузоотправитель""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ОсновнойБанковскийСчет"",
|                            ""Имя"": ""БанкСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].Банк"",
|                            ""Имя"": ""Банк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Наименование"",
|                            ""Имя"": ""БанкРекв_НаимБанк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Код"",
|                            ""Имя"": ""БанкРекв_БИК""
|                        },
|                        {
|                            ""Значение"": ""[Банк].КоррСчет"",
|                            ""Имя"": ""БанкРекв_КСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].НомерСчета"",
|                            ""Имя"": ""БанкРекв_РСчет""
|                        }
|                    ],
|                    ""Отправитель"": [
|                        {
|                            ""Значение"": ""[Документ].Организация"",
|                            ""Имя"": ""Сторона""
|                        },
|                        {
|                            ""Значение"": ""'Отправитель'"",
|                            ""Имя"": ""Роль""
|                        },
|                        {
|                            ""Значение"": ""{сбисИдентификаторУчастника()}"",
|                            ""Имя"": ""Сторона_Идентификатор"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИНН"",
|                            ""Имя"": ""Сторона_ИНН""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КПП"",
|                            ""Имя"": ""Сторона_КПП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодПоОКПО"",
|                            ""Имя"": ""Код_ОКПО""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКОПФ"",
|                            ""Имя"": ""Код_ОКОПФ""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКФС"",
|                            ""Имя"": ""Код_ОКФС""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКВЭД"",
|                            ""Имя"": ""Код_ОКВЭД""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].НаименованиеПолное"",
|                            ""Имя"": ""Сторона_Наименование""
|                        },
|                        {
|                            ""Значение"": ""Перечисление.ТипыКонтактнойИнформации"",
|                            ""Имя"": ""ТипыКонтактнойИнформации""
|                        },
|                        {
|                            ""Значение"": ""Справочник.ВидыКонтактнойИнформации"",
|                            ""Имя"": ""ВидыКонтактнойИнформации""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресОрганизации"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Кэш"": ""Организация"",
|                            ""Имя"": ""АдресЮЛ""
|                        },
|                        {
|                            ""Отбор_Объект"": ""[Сторона].ИндивидуальныйПредприниматель"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресФизЛица"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Кэш"": ""Организация"",
|                            ""Имя"": ""АдресФЛ""
|                        },
|                        {
|                            ""Значение"": ""{сбисПолучитьАдрес()}"",
|                            ""Имя"": ""Сторона_Адрес"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ТелефонОрганизации"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Кэш"": ""Организация"",
|                            ""Имя"": ""Телефон""
|                        },
|                        {
|                            ""Значение"": ""[Телефон].Представление"",
|                            ""Имя"": ""Контакт_Телефон"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ФаксОрганизации"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Кэш"": ""Организация"",
|                            ""Имя"": ""Факс""
|                        },
|                        {
|                            ""Значение"": ""[Факс].Представление"",
|                            ""Имя"": ""Контакт_Факс"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].EmailОрганизации"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].АдресЭлектроннойПочты"",
|                            ""Кэш"": ""Организация"",
|                            ""Имя"": ""ЭлПочта""
|                        },
|                        {
|                            ""Значение"": ""[ЭлПочта].Представление"",
|                            ""Имя"": ""Контакт_EMAIL"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ОсновнойБанковскийСчет"",
|                            ""Имя"": ""БанкСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].Банк"",
|                            ""Имя"": ""Банк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Наименование"",
|                            ""Имя"": ""БанкРекв_НаимБанк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Код"",
|                            ""Имя"": ""БанкРекв_БИК""
|                        },
|                        {
|                            ""Значение"": ""[Банк].КоррСчет"",
|                            ""Имя"": ""БанкРекв_КСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].НомерСчета"",
|                            ""Имя"": ""БанкРекв_РСчет""
|                        },
|                        {
|                            ""Значение"": ""{сбисПодписант()}"",
|                            ""Имя"": ""Сертификат"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Значение"": {
|                                ""Ответственный"": [
|                                    {
|                                        ""Значение"": ""[Сертификат].Должность"",
|                                        ""Имя"": ""Должность""
|                                    },
|                                    {
|                                        ""Значение"": ""[Сертификат].ФИО"",
|                                        ""Имя"": ""ФИО""
|                                    },
|                                    {
|                                        ""Значение"": ""[Сертификат].ИНН"",
|                                        ""Имя"": ""ИНН""
|                                    }
|                                ]
|                            },
|                            ""Имя"": ""мПредставитель""
|                        }
|                    ]
|                },
|                ""Имя"": ""мСторона""
|            },
|            {
|                ""Значение"": {
|                    ""Договор"": [
|                        {
|                            ""Значение"": ""[Документ].ДоговорКонтрагента"",
|                            ""Имя"": ""Основание""
|                        },
|                        {
|                            ""Значение"": ""[Основание].Наименование"",
|                            ""Имя"": ""Основание_Название""
|                        },
|                        {
|                            ""Значение"": ""[Основание].Номер"",
|                            ""Имя"": ""Основание_Номер""
|                        },
|                        {
|                            ""Значение"": ""[Основание].Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Тип"": ""Дата"",
|                            ""Имя"": ""Основание_Дата""
|                        }
|                    ]
|                },
|                ""Имя"": ""мОснование""
|            },
|            {
|                ""Значение"": {
|                    ""Товары"": [
|                        {
|                            ""Значение"": ""[Документ].Товары"",
|                            ""Имя"": ""ТаблДок"",
|                            ""Тип"": ""ТабличнаяЧасть""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Номенклатура"",
|                            ""Имя"": ""Номенклатура""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].БазоваяЕдиницаИзмерения"",
|                            ""Имя"": ""ЕдИзм""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].НаименованиеПолное"",
|                            ""Имя"": ""ТаблДок_Название""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].Код"",
|                            ""Имя"": ""ТаблДок_Код""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].Артикул"",
|                            ""Имя"": ""ТаблДок_Артикул""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Цена"",
|                            ""Имя"": ""Цена""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Количество"",
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.000"",
|                            ""Имя"": ""ТаблДок_Кол_во""
|                        },
|                        {
|                            ""Значение"": ""[ЕдИзм].Наименование"",
|                            ""Имя"": ""ТаблДок_ЕдИзм""
|                        },
|                        {
|                            ""Значение"": ""[ЕдИзм].Код"",
|                            ""Имя"": ""ТаблДок_ОКЕИ""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Сумма"",
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"",
|                            ""Имя"": ""ТаблДок_Сумма""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].СуммаНДС"",
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"",
|                            ""Имя"": ""СуммаНДС""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].СтавкаНДС"",
|                            ""Имя"": ""СтавкаНДС""
|                        },
|                        {
|                            ""Значение"": ""{сбисВычислитьЦену()}"",
|                            ""Имя"": ""ТаблДок_Цена""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].НомерГТД"",
|                            ""Имя"": ""НомерГТД""
|                        },
|                        {
|                            ""Значение"": {
|                                ""НомерГТД"": [
|                                    {
|                                        ""Значение"": ""'НомерГТД'"",
|                                        ""Имя"": ""Параметр_Имя""
|                                    },
|                                    {
|                                        ""Значение"": ""[НомерГТД].Код"",
|                                        ""Имя"": ""Параметр_Значение""
|                                    }
|                                ]
|                            },
|                            ""Имя"": ""мПараметр""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].СтранаПроисхождения"",
|                            ""Имя"": ""СтранаПроисхождения""
|                        },
|                        {
|                            ""Значение"": ""[СтранаПроисхождения].Код"",
|                            ""Имя"": ""ТаблДок_Страна""
|                        },
|                        {
|                            ""Значение"": ""'без акциза'"",
|                            ""Имя"": ""СуммаАкциз""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].ЕдиницаИзмерения"",
|                            ""Имя"": ""ЕдИзмУпаковки""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Коэффициент"",
|                            ""Формат"": ""ЧЦ=12; ЧДЦ=0; ЧРД=.; ЧГ=0;"",
|                            ""Имя"": ""Упаковка_Вместимость""
|                        },
|                        {
|                            ""Значение"": ""[ЕдИзмУпаковки].Код"",
|                            ""Имя"": ""Упаковка_Код""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].КоличествоМест"",
|                            ""Формат"": ""ЧЦ=12; ЧДЦ=0; ЧРД=.; ЧГ=0;"",
|                            ""Имя"": ""Упаковка_КолМест""
|                        },
|                        {
|                            ""Значение"": ""[ЕдИзмУпаковки].Наименование"",
|                            ""Имя"": ""Упаковка_Название""
|                        },
|                        {
|                            ""Значение"": ""{ОпределитьИдентификаторНоменклатуры()}"",
|                            ""Имя"": ""ТаблДок_Идентификатор""
|                        }
|                    ]
|                },
|                ""Имя"": ""мТаблДок""
|            }
|        ]
|    },
|    ""ЗапросСпискаДокументов"": {
|        ""Значение"": ""'ВЫБРАТЬ РАЗРЕШЕННЫЕ\n        РеализацияТоваровУслуг.Ссылка,\n        РеализацияТоваровУслуг.Проведен,\n        РеализацияТоваровУслуг.ПометкаУдаления,\n        РеализацияТоваровУслуг.Дата,\n        РеализацияТоваровУслуг.Номер,\n        РеализацияТоваровУслуг.Контрагент.Наименование КАК Контрагент,\n        РеализацияТоваровУслуг.Организация.Наименование КАК Организация,\n        РеализацияТоваровУслуг.Ответственный.Наименование КАК Ответственный,\n        ВЫРАЗИТЬ(РеализацияТоваровУслуг.Комментарий КАК СТРОКА(1000)) КАК Комментарий,\n        РеализацияТоваровУслуг.Склад.Наименование КАК Склад,\n        РеализацияТоваровУслуг.СуммаДокумента,\n        РеализацияТоваровУслуг.ВалютаДокумента.Наименование КАК Валюта,\n        РеализацияТоваровУслуг.СчетНаОплатуПокупателю КАК Приложение,\n        РеализацияТоваровУслуг.СчетНаОплатуПокупателю.СуммаДокумента КАК СуммаПриложения,\n        РеализацияТоваровУслуг.СчетНаОплатуПокупателю.Дата КАК ДатаПриложения,\n        РеализацияТоваровУслуг.СчетНаОплатуПокупателю.Номер КАК НомерПриложения\n        ПОМЕСТИТЬ ВТ_Реализация\n        ИЗ\n        Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг\n        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов\n        ПО РеализацияТоваровУслуг.Контрагент = ЗначенияСвойствОбъектов.Объект И\n        ЗначенияСвойствОбъектов.Свойство.Наименование = \""СБИС_СпособДоставки\""\n        ГДЕ\n        ((РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон) ИЛИ (НЕ &ЗначениеДатаКонЗаполнено И\n        РеализацияТоваровУслуг.Дата > &ДатаНач))\n        И ((РеализацияТоваровУслуг.Контрагент = &Контрагент) ИЛИ (РеализацияТоваровУслуг.Контрагент В Иерархии(&Контрагент))\n        ИЛИ (НЕ &ЗначениеКонтрагентЗаполнено))\n        И ((РеализацияТоваровУслуг.Организация = &ТекущаяОрганизация) ИЛИ (НЕ &ЗначениеТекущаяОрганизацияЗаполнено))\n        И ((РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент) ИЛИ (НЕ &ЗначениеТекущийДокументЗаполнено))\n        И (&КонтрагентПодключен=\""\"" ИЛИ &КонтрагентПодключен=ЗначенияСвойствОбъектов.Значение.Наименование)\n        И (&Ответственный=Значение(Справочник.Пользователи.ПустаяСсылка) ИЛИ &Ответственный=РеализацияТоваровУслуг.Ответственный)\n        И НЕ РеализацияТоваровУслуг.ПометкаУдаления;\n        ВЫБРАТЬ\n        ВТ_Реализация.Ссылка КАК Документ,\n        ВТ_Реализация.Проведен КАК ДокументПроведен,\n        ВТ_Реализация.ПометкаУдаления КАК ДокументПометкаУдаления,\n        ВТ_Реализация.Дата КАК ДатаДокумента,\n        ВТ_Реализация.Номер КАК НомерДокумента,\n        ВТ_Реализация.Контрагент КАК Контрагент,\n        ВТ_Реализация.Организация КАК Организация,\n        ВТ_Реализация.Ответственный КАК Ответственный,\n        ВТ_Реализация.Комментарий КАК Комментарий,\n        ВТ_Реализация.Склад КАК Склад,\n        ВТ_Реализация.СуммаДокумента КАК СуммаДокумента,\n        ВТ_Реализация.Валюта КАК Валюта,\n        ВТ_Реализация.Приложение КАК Приложение,\n        ВТ_Реализация.СуммаПриложения КАК СуммаПриложения,\n        ВТ_Реализация.ДатаПриложения КАК ДатаПриложения,\n        ВТ_Реализация.НомерПриложения КАК НомерПриложения,\n        ЗначенияСвойствОбъектов.Значение КАК СтатусЭД\n        ИЗ\n        ВТ_Реализация\n        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов\n        ПО ВТ_Реализация.Ссылка = ЗначенияСвойствОбъектов.Объект И ЗначенияСвойствОбъектов.Свойство.Наименование =\n        \""ДокументСБИС_Статус\""\n        ГДЕ\n        НЕ ВТ_Реализация.Приложение = ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)\n\n        ОБЪЕДИНИТЬ\n        ВЫБРАТЬ\n        ВТ_Реализация.Ссылка КАК Документ,\n        ВТ_Реализация.Проведен КАК ДокументПроведен,\n        ВТ_Реализация.ПометкаУдаления КАК ДокументПометкаУдаления,\n        ВТ_Реализация.Дата КАК ДатаДокумента,\n        ВТ_Реализация.Номер КАК НомерДокумента,\n        ВТ_Реализация.Контрагент КАК Контрагент,\n        ВТ_Реализация.Организация КАК Организация,\n        ВТ_Реализация.Ответственный КАК Ответственный,\n        ВТ_Реализация.Комментарий КАК Комментарий,\n        ВТ_Реализация.Склад КАК Склад,\n        ВТ_Реализация.СуммаДокумента КАК СуммаДокумента,\n        ВТ_Реализация.Валюта КАК Валюта,\n        СвязьДокументов.Ссылка КАК Приложение,\n        СвязьДокументов.Ссылка.СуммаДокумента КАК СуммаПриложения,\n        СвязьДокументов.Ссылка.Дата КАК ДатаПриложения,\n        СвязьДокументов.Ссылка.Номер КАК НомерПриложения,\n        ЗначенияСвойствОбъектов.Значение КАК СтатусЭД\n        ИЗ\n        ВТ_Реализация\n        ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СвязьДокументов\n        ПО ВТ_Реализация.Ссылка = СвязьДокументов.ДокументОснование\n        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов\n        ПО ВТ_Реализация.Ссылка = ЗначенияСвойствОбъектов.Объект И ЗначенияСвойствОбъектов.Свойство.Наименование =\n        \""ДокументСБИС_Статус\""\n        УПОРЯДОЧИТЬ ПО\n        ДатаДокумента, НомерДокумента'""
|    },
|    ""РеестрСБИС_ИдМеню"": {
|        ""Значение"": ""'OutBoxReadДокОтгрИсх,OutBoxReadИсходящие'""
|    },
|    ""ДокументРаздел"": {
|        ""Значение"": ""'Продажа'""
|    },
|    ""Реестр1С_ВидимыеСтолбцы"": {
|        ""Значение"": ""'Отмечен,Проведен,Статус,Дата,Номер,Контрагент,Сумма,Организация,Комментарий,Склад'""
|    },
|    ""РеестрПоУмолчанию"": {
|        ""Значение"": ""'1'""
|    },
|    ""РеестрСБИС_Тип"": {
|        ""Значение"": ""'ДокОтгрИсх,Исходящие'""
|    }
|},
|""СчетФактураВыданный"":{
|    ""Реестр1С_Тип"": {
|        ""Значение"": ""'СчетФактураВыданный'""
|    },
|    ""Реестр1С_Название"": {
|        ""Значение"": ""'Счет-фактура выданный'""
|    },
|    ""мФайл"": {
|        ""СчФктр"": [
|            {
|                ""Значение"": ""Документ.СчетФактураВыданный"",
|                ""Имя"": ""Документ""
|            },
|            {
|                ""Значение"": ""[Документ].ВидСчетаФактуры"",
|                ""Имя"": ""ВидСчетаФактуры""
|            },
|            {
|                ""Значение"": ""{сбисФорматСФ()}"",
|                ""Имя"": ""Вложение_Тип""
|            },
|            {
|                ""Значение"": ""{сбисПодтипСФ()}"",
|                ""Имя"": ""Вложение_ПодТип""
|            },
|            {
|                ""Значение"": ""'5.02'"",
|                ""Имя"": ""Вложение_ВерсияФормата""
|            },
|            {
|                ""Значение"": ""{сбисФорматСФ()}"",
|                ""Имя"": ""Файл_Формат""
|            },
|            {
|                ""Значение"": ""'3.01'"",
|                ""Имя"": ""Файл_ВерсияФормата""
|            },
|            {
|                ""Значение"": ""{сбисИмяФайлаСФ()}"",
|                ""Имя"": ""Файл_Имя""
|            },
|            {
|                ""Значение"": ""'Отправитель'"",
|                ""Имя"": ""Отправитель_Роль""
|            },
|            {
|                ""Значение"": ""'Получатель'"",
|                ""Имя"": ""Получатель_Роль""
|            },
|            {
|                ""Значение"": ""'Счет-фактура'"",
|                ""Имя"": ""Документ_Название""
|            },
|            {
|                ""Значение"": ""[Документ].Дата"",
|                ""Формат"": ""ДФ=dd.MM.yyyy"",
|                ""Тип"": ""Дата"",
|                ""Имя"": ""Документ_Дата""
|            },
|            {
|                ""Значение"": ""[Документ].Дата"",
|                ""Формат"": ""ДФ=HH.mm.ss"",
|                ""Тип"": ""Дата"",
|                ""Имя"": ""Документ_Время""
|            },
|            {
|                ""Значение"": ""[Документ].Номер"",
|                ""Имя"": ""НомерДокумента""
|            },
|            {
|                ""Значение"": ""{ПолучитьНомерДокумента()}"",
|                ""Имя"": ""Документ_Номер""
|            },
|            {
|                ""Значение"": ""[Документ].Комментарий"",
|                ""Имя"": ""Документ_Примечание""
|            },
|            {
|                ""Значение"": ""[Документ].ДоговорКонтрагента"",
|                ""Имя"": ""Договор""
|            },
|            {
|                ""Значение"": ""[Договор].РасчетыВУсловныхЕдиницах"",
|                ""Имя"": ""ДоговорРасчетыУЕ""
|            },
|            {
|                ""Значение"": ""Константа.ВалютаРегламентированногоУчета"",
|                ""Имя"": ""ВалютаУчета""
|            },
|            {
|                ""Значение"": ""[ВалютаУчета].Код"",
|                ""Имя"": ""ВалютаУчета_КодОКВ""
|            },
|            {
|                ""Значение"": ""[Договор].ВалютаВзаиморасчетов"",
|                ""Имя"": ""Валюта""
|            },
|            {
|                ""Значение"": ""[Валюта].Код"",
|                ""Имя"": ""Валюта_КодОКВ""
|            },
|            {
|                ""Значение"": ""{сбисПересчитатьСФВВалютеУчета()}"",
|                ""Имя"": ""ПересчитатьВВалютеУчета""
|            },
|            {
|                ""Значение"": ""'Истина'"",
|                ""Имя"": ""ЗаполнятьДатуСпособВыставления""
|            },
|            {
|                ""Значение"": ""[Документ].ДатаВыставления"",
|                ""Имя"": ""ДатаВыставления""
|            },
|            {
|                ""Значение"": ""[Документ].КодСпособаВыставления"",
|                ""Вычислить"": ""2"",
|                ""Имя"": ""СпособВыставления""
|            },
|            {
|                ""Значение"": ""[Документ].Ответственный"",
|                ""Имя"": ""ОтветственныйПользователь""
|            },
|            {
|                ""Значение"": ""[ОтветственныйПользователь].ФизЛицо"",
|                ""Имя"": ""Ответственный""
|            },
|            {
|                ""Значение"": ""[Ответственный].Наименование"",
|                ""Имя"": ""Ответственный_ФИО""
|            },
|            {
|                ""Значение"": ""[Ответственный].УникальныйИдентификатор"",
|                ""Имя"": ""Ответственный_Идентификатор""
|            },
|            {
|                ""Отбор_Физлицо"": ""[Ответственный]"",
|                ""Имя"": ""Сотрудник"",
|                ""Значение"": ""Справочник.СотрудникиОрганизаций""
|            },
|            {
|                ""Значение"": ""[Сотрудник].ТекущееПодразделениеОрганизации"",
|                ""Имя"": ""Подразделение""
|            },
|            {
|                ""Значение"": ""[Подразделение].Наименование"",
|                ""Имя"": ""Подразделение_Название""
|            },
|            {
|                ""Отбор_НомерСтроки"": ""'0'"",
|                ""Значение"": ""[Документ].ДокументыОснования"",
|                ""Имя"": ""ПервоеОснование"",
|                ""Тип"": ""ТабличнаяЧасть""
|            },
|            {
|                ""Значение"": ""'Фактура'"",
|                ""Имя"": ""Регламент_Название""
|            },
|            {
|                ""Значение"": ""[Документ].ДокументОснование"",
|                ""Имя"": ""ДокОснование""
|            },
|            {
|                ""Значение"": {
|                    ""ОснованиеДата"": [
|                        {
|                            ""Значение"": ""'ОснованиеДата'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Значение"": ""[ДокОснование].Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Тип"": ""Дата"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ],
|                    ""ДоговорДата"": [
|                        {
|                            ""Значение"": ""'ДоговорДата'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Тип"": ""Дата"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ],
|                    ""ОснованиеНомер"": [
|                        {
|                            ""Значение"": ""'ОснованиеНомер'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Значение"": ""{сбисНомерОснованияНаПечать()}"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ],
|                    ""ДоговорНомер"": [
|                        {
|                            ""Значение"": ""'ДоговорНомер'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Номер"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ]
|                },
|                ""Имя"": ""мПараметр""
|            },
|            {
|                ""Значение"": {
|                    ""Договор"": [
|                        {
|                            ""Значение"": ""'ДоговорИсх'"",
|                            ""Имя"": ""ДокументОснование_Тип""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Номер"",
|                            ""Имя"": ""ДокументОснование_Номер""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Тип"": ""Дата"",
|                            ""Имя"": ""ДокументОснование_Дата""
|                        }
|                    ]
|                },
|                ""Имя"": ""мДокументОснование""
|            },
|            {
|                ""Значение"": {
|                    ""Получатель"": [
|                        {
|                            ""Значение"": ""[Документ].Контрагент"",
|                            ""Имя"": ""Сторона""
|                        },
|                        {
|                            ""Значение"": ""'Получатель'"",
|                            ""Имя"": ""Роль""
|                        },
|                        {
|                            ""Значение"": ""{сбисИдентификаторУчастника()}"",
|                            ""Имя"": ""Сторона_Идентификатор"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИНН"",
|                            ""Имя"": ""Сторона_ИНН""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КПП"",
|                            ""Имя"": ""Сторона_КПП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодПоОКПО"",
|                            ""Имя"": ""Код_ОКПО""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКОПФ""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКДП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].НаименованиеПолное"",
|                            ""Имя"": ""Сторона_Наименование""
|                        },
|                        {
|                            ""Значение"": ""Справочник.ВидыКонтактнойИнформации"",
|                            ""Имя"": ""ВидыКонтактнойИнформации""
|                        },
|                        {
|                            ""Значение"": ""Перечисление.ТипыКонтактнойИнформации"",
|                            ""Имя"": ""ТипыКонтактнойИнформации""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресКонтрагента"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Кэш"": ""Получатель"",
|                            ""Имя"": ""АдресЮЛ""
|                        },
|                        {
|                            ""Значение"": ""{сбисПолучитьАдрес()}"",
|                            ""Имя"": ""Сторона_Адрес"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ТелефонКонтрагента"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Кэш"": ""Получатель"",
|                            ""Имя"": ""Телефон""
|                        },
|                        {
|                            ""Значение"": ""[Телефон].Представление"",
|                            ""Имя"": ""Контакт_Телефон"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Отбор_Объект"": ""'Сторона'"",
|                            ""Отбор_Вид"": ""'[ВидыКонтактнойИнформации].ФаксОрганизации'"",
|                            ""Значение"": ""'РегистрыСведений.КонтактнаяИнформация'"",
|                            ""Отбор_Тип"": ""'[ТипыКонтактнойИнформации].Телефон'"",
|                            ""Кэш"": ""Получатель"",
|                            ""Имя"": ""Факс""
|                        },
|                        {
|                            ""Значение"": ""[Факс].Представление"",
|                            ""Имя"": ""Контакт_Факс"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Отбор_Объект"": ""'Сторона'"",
|                            ""Отбор_Вид"": ""'[ВидыКонтактнойИнформации].EmailОрганизации'"",
|                            ""Значение"": ""'РегистрыСведений.КонтактнаяИнформация'"",
|                            ""Отбор_Тип"": ""'[ТипыКонтактнойИнформации].АдресЭлектроннойПочты'"",
|                            ""Кэш"": ""Получатель"",
|                            ""Имя"": ""ЭлПочта""
|                        },
|                        {
|                            ""Значение"": ""[ЭлПочта].Представление"",
|                            ""Имя"": ""Контакт_EMAIL"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Отбор_Объект"": ""'Сторона'"",
|                            ""Отбор_Вид"": ""''"",
|                            ""Значение"": ""'РегистрыСведений.КонтактнаяИнформация'"",
|                            ""Отбор_Тип"": ""'[ТипыКонтактнойИнформации].ВебСтраница'"",
|                            ""Кэш"": ""Получатель"",
|                            ""Имя"": ""Интернет""
|                        },
|                        {
|                            ""Значение"": ""[Интернет].Представление"",
|                            ""Имя"": ""Контакт_Internet"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ОсновнойБанковскийСчет"",
|                            ""Имя"": ""БанкСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].Банк"",
|                            ""Имя"": ""Банк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Наименование"",
|                            ""Имя"": ""БанкРекв_НаимБанк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Код"",
|                            ""Имя"": ""БанкРекв_БИК""
|                        },
|                        {
|                            ""Значение"": ""[Банк].КоррСчет"",
|                            ""Имя"": ""БанкРекв_КСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].НомерСчета"",
|                            ""Имя"": ""БанкРекв_РСчет""
|                        }
|                    ],
|                    ""Отправитель"": [
|                        {
|                            ""Значение"": ""[Документ].Организация"",
|                            ""Имя"": ""Сторона""
|                        },
|                        {
|                            ""Значение"": ""'Отправитель'"",
|                            ""Имя"": ""Роль""
|                        },
|                        {
|                            ""Значение"": ""{сбисИдентификаторУчастника()}"",
|                            ""Имя"": ""Сторона_Идентификатор"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИНН"",
|                            ""Имя"": ""Сторона_ИНН""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КПП"",
|                            ""Имя"": ""Сторона_КПП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодПоОКПО"",
|                            ""Имя"": ""Код_ОКПО""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКОПФ"",
|                            ""Имя"": ""Код_ОКОПФ""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКФС"",
|                            ""Имя"": ""Код_ОКФС""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКВЭД"",
|                            ""Имя"": ""Код_ОКВЭД""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].НаименованиеПолное"",
|                            ""Имя"": ""Сторона_Наименование""
|                        },
|                        {
|                            ""Значение"": ""Перечисление.ТипыКонтактнойИнформации"",
|                            ""Имя"": ""ТипыКонтактнойИнформации""
|                        },
|                        {
|                            ""Значение"": ""Справочник.ВидыКонтактнойИнформации"",
|                            ""Имя"": ""ВидыКонтактнойИнформации""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресОрганизации"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Кэш"": ""Организация"",
|                            ""Имя"": ""АдресЮЛ""
|                        },
|                        {
|                            ""Отбор_Объект"": ""[Сторона].ИндивидуальныйПредприниматель"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресФизЛица"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Кэш"": ""Организация"",
|                            ""Имя"": ""АдресФЛ""
|                        },
|                        {
|                            ""Значение"": ""{сбисПолучитьАдрес()}"",
|                            ""Имя"": ""Сторона_Адрес"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ТелефонОрганизации"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Кэш"": ""Организация"",
|                            ""Имя"": ""Телефон""
|                        },
|                        {
|                            ""Значение"": ""[Телефон].Представление"",
|                            ""Имя"": ""Контакт_Телефон"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ФаксОрганизации"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Кэш"": ""Организация"",
|                            ""Имя"": ""Факс""
|                        },
|                        {
|                            ""Значение"": ""[Факс].Представление"",
|                            ""Имя"": ""Контакт_Факс"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Отбор_Объект"": ""Сторона"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].EmailОрганизации"",
|                            ""Значение"": ""РегистрыСведений.КонтактнаяИнформация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].АдресЭлектроннойПочты"",
|                            ""Кэш"": ""Организация"",
|                            ""Имя"": ""ЭлПочта""
|                        },
|                        {
|                            ""Значение"": ""[ЭлПочта].Представление"",
|                            ""Имя"": ""Контакт_EMAIL"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Отбор_Объект"": ""'Сторона'"",
|                            ""Отбор_Вид"": ""''"",
|                            ""Значение"": ""'РегистрыСведений.КонтактнаяИнформация'"",
|                            ""Отбор_Тип"": ""'[ТипыКонтактнойИнформации].ВебСтраница'"",
|                            ""Кэш"": ""Организация"",
|                            ""Имя"": ""Интернет""
|                        },
|                        {
|                            ""Значение"": ""[Интернет].Представление"",
|                            ""Имя"": ""Контакт_Internet"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ОсновнойБанковскийСчет"",
|                            ""Имя"": ""БанкСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].Банк"",
|                            ""Имя"": ""Банк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Наименование"",
|                            ""Имя"": ""БанкРекв_НаимБанк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Код"",
|                            ""Имя"": ""БанкРекв_БИК""
|                        },
|                        {
|                            ""Значение"": ""[Банк].КоррСчет"",
|                            ""Имя"": ""БанкРекв_КСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].НомерСчета"",
|                            ""Имя"": ""БанкРекв_РСчет""
|                        },
|                        {
|                            ""Значение"": ""{сбисПодписант()}"",
|                            ""Имя"": ""Сертификат"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Значение"": {
|                                ""Ответственный"": [
|                                    {
|                                        ""Значение"": ""[Сертификат].Должность"",
|                                        ""Имя"": ""Должность""
|                                    },
|                                    {
|                                        ""Значение"": ""[Сертификат].ФИО"",
|                                        ""Имя"": ""ФИО""
|                                    },
|                                    {
|                                        ""Значение"": ""[Сертификат].ИНН"",
|                                        ""Имя"": ""ИНН""
|                                    }
|                                ]
|                            },
|                            ""Имя"": ""мПредставитель""
|                        }
|                    ]
|                },
|                ""Имя"": ""мСторона""
|            },
|            {
|                ""Значение"": {
|                    ""ИсхСчФ"": [
|                        {
|                            ""Значение"": ""'ИсхСчФ'"",
|                            ""Имя"": ""Основание_Название""
|                        },
|                        {
|                            ""Значение"": ""[ПервоеОснование].НомерИсходногоДокумента"",
|                            ""Имя"": ""Основание_Номер""
|                        },
|                        {
|                            ""Значение"": ""[ПервоеОснование].ДатаИсходногоДокумента"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Тип"": ""Дата"",
|                            ""Имя"": ""Основание_Дата""
|                        }
|                    ],
|                    ""ИспрИсхСчФ"": [
|                        {
|                            ""Значение"": ""'ИспрИсхСчФ'"",
|                            ""Имя"": ""Основание_Название""
|                        },
|                        {
|                            ""Значение"": ""[ПервоеОснование].НомерИсправленияИсходногоДокумента"",
|                            ""Имя"": ""Основание_Номер""
|                        },
|                        {
|                            ""Значение"": ""[ПервоеОснование].ДатаИсправленияИсходногоДокумента"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Тип"": ""Дата"",
|                            ""Имя"": ""Основание_Дата""
|                        }
|                    ],
|                    ""КСчФ"": [
|                        {
|                            ""Значение"": ""'КСчФ'"",
|                            ""Имя"": ""Основание_Название""
|                        },
|                        {
|                            ""Значение"": ""[Документ].НомерИсправляемогоКорректировочногоДокумента"",
|                            ""Имя"": ""Основание_Номер""
|                        },
|                        {
|                            ""Значение"": ""[Документ].ДатаИсправляемогоКорректировочногоДокумента"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Тип"": ""Дата"",
|                            ""Имя"": ""Основание_Дата""
|                        }
|                    ],
|                    ""СчФ"": [
|                        {
|                            ""Значение"": ""'СчФ'"",
|                            ""Имя"": ""Основание_Название""
|                        },
|                        {
|                            ""Значение"": ""[Документ].НомерИсходногоДокумента"",
|                            ""Имя"": ""Основание_Номер""
|                        },
|                        {
|                            ""Значение"": ""[Документ].ДатаИсходногоДокумента"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Тип"": ""Дата"",
|                            ""Имя"": ""Основание_Дата""
|                        }
|                    ],
|                    ""ИспрСчФ"": [
|                        {
|                            ""Значение"": ""'ИспрСчФ'"",
|                            ""Имя"": ""Основание_Название""
|                        },
|                        {
|                            ""Значение"": ""[Документ].НомерИсправления"",
|                            ""Имя"": ""Основание_Номер""
|                        },
|                        {
|                            ""Значение"": ""[Документ].Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Тип"": ""Дата"",
|                            ""Имя"": ""Основание_Дата""
|                        }
|                    ],
|                    ""ПРД"": [
|                        {
|                            ""Значение"": ""[Документ].ДатаНомерДокументовОплаты"",
|                            ""Имя"": ""Основание"",
|                            ""Тип"": ""ТабличнаяЧасть""
|                        },
|                        {
|                            ""Значение"": ""'ПРД'"",
|                            ""Имя"": ""Основание_Название""
|                        },
|                        {
|                            ""Значение"": ""[Основание].НомерПлатежноРасчетногоДокумента"",
|                            ""Имя"": ""Основание_Номер""
|                        },
|                        {
|                            ""Значение"": ""[Основание].ДатаПлатежноРасчетногоДокумента"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Тип"": ""Дата"",
|                            ""Имя"": ""Основание_Дата""
|                        }
|                    ]
|                },
|                ""Имя"": ""мОснование""
|            },
|            {
|                ""Значение"": {
|                    ""СвязанныеДокументы"": [
|                        {
|                            ""Значение"": ""[Документ].ДокументыОснования"",
|                            ""Имя"": ""ТаблДок"",
|                            ""Тип"": ""ТабличнаяЧасть""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].ДокументОснование"",
|                            ""Имя"": ""ТаблДок_ДокументОснование""
|                        }
|                    ]
|                },
|                ""Имя"": ""мТаблДок""
|            }
|        ]
|    },
|    ""ЗапросСпискаДокументов"": {
|        ""Значение"": ""'ВЫБРАТЬ РАЗРЕШЕННЫЕ\n        СчетФактураВыданный.Ссылка,\n\tСчетФактураВыданный.Проведен,\n\tСчетФактураВыданный.ПометкаУдаления,\n        СчетФактураВыданный.Дата,\n        СчетФактураВыданный.Номер,\n        СчетФактураВыданный.Контрагент.Наименование КАК Контрагент,\n        СчетФактураВыданный.Организация.Наименование КАК Организация,\n\tСчетФактураВыданный.Ответственный.Наименование КАК Ответственный,\n        ВЫРАЗИТЬ(СчетФактураВыданный.Комментарий КАК СТРОКА(1000)) КАК Комментарий,\n        СчетФактураВыданный.СуммаДокумента,\n\tСчетФактураВыданный.ВалютаДокумента.Наименование КАК Валюта\n        ПОМЕСТИТЬ ВТ_Реализация\n        ИЗ\n        Документ.СчетФактураВыданный КАК СчетФактураВыданный\n\tЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов\n        ПО СчетФактураВыданный.Контрагент = ЗначенияСвойствОбъектов.Объект И ЗначенияСвойствОбъектов.Свойство.Наименование = \""СБИС_СпособДоставки\""\n        ГДЕ\n        ((СчетФактураВыданный.Дата МЕЖДУ &ДатаНач И &ДатаКон) ИЛИ (НЕ &ЗначениеДатаКонЗаполнено И СчетФактураВыданный.Дата > &ДатаНач))\n        И ((СчетФактураВыданный.Контрагент = &Контрагент) ИЛИ (СчетФактураВыданный.Контрагент В Иерархии(&Контрагент)) ИЛИ (НЕ &ЗначениеКонтрагентЗаполнено))\n        И ((СчетФактураВыданный.Организация = &ТекущаяОрганизация) ИЛИ (НЕ &ЗначениеТекущаяОрганизацияЗаполнено))\n\tИ ((СчетФактураВыданный.Ссылка = &ТекущийДокумент)  ИЛИ (НЕ &ЗначениеТекущийДокументЗаполнено))\n\tИ (НЕ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс))\n\tИ (&КонтрагентПодключен=\""\"" ИЛИ &КонтрагентПодключен=ЗначенияСвойствОбъектов.Значение.Наименование)\n\tИ (&Ответственный=Значение(Справочник.Пользователи.ПустаяСсылка) ИЛИ &Ответственный=СчетФактураВыданный.Ответственный)\n\tИ НЕ СчетФактураВыданный.ПометкаУдаления;\n        ВЫБРАТЬ\n        ВТ_Реализация.Ссылка КАК Документ,\n\tВТ_Реализация.Проведен КАК ДокументПроведен,\n\tВТ_Реализация.ПометкаУдаления КАК ДокументПометкаУдаления,\n        ВТ_Реализация.Дата КАК ДатаДокумента,\n        ВТ_Реализация.Номер КАК НомерДокумента,\n        ВТ_Реализация.Контрагент КАК Контрагент,\n        ВТ_Реализация.Организация КАК Организация,\n\tВТ_Реализация.Ответственный КАК Ответственный, \n        ВТ_Реализация.Комментарий КАК Комментарий,\n        NULL КАК Склад,\n        ВТ_Реализация.СуммаДокумента КАК СуммаДокумента,\n\tВТ_Реализация.Валюта КАК Валюта,\n        NULL КАК Приложение,\n        ЗначенияСвойствОбъектов.Значение КАК СтатусЭД\n        ИЗ\n        ВТ_Реализация\n        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов\n        ПО ВТ_Реализация.Ссылка = ЗначенияСвойствОбъектов.Объект И ЗначенияСвойствОбъектов.Свойство.Наименование = \""ДокументСБИС_Статус\""\n        УПОРЯДОЧИТЬ ПО\n        ДатаДокумента, НомерДокумента'""
|    },
|    ""РеестрСБИС_ИдМеню"": {
|        ""Значение"": ""'OutBoxReadФактураИсх,OutBoxReadДокОтгрИсх,OutBoxReadИсходящие'""
|    },
|    ""ДокументРаздел"": {
|        ""Значение"": ""'Продажа'""
|    },
|    ""Реестр1С_ВидимыеСтолбцы"": {
|        ""Значение"": ""'Отмечен,Проведен,Статус,Дата,Номер,Контрагент,Сумма,Организация,Комментарий'""
|    },
|    ""РеестрПоУмолчанию"": {
|        ""Значение"": ""'0'""
|    },
|    ""СбисФорматСпискаДокументов"": {
|        ""Значение"": ""'[{'title':'Дата', 'field':'Дата', 'width':'80px', 'fixedSize':'true'},\n        {'title':'Номер', 'field':'Номер', 'width':'80px', 'fixedSize':'true', 'textAlign':'right'},\n        {'title':'Организация', 'field':'Организация', 'width':'250px', 'fixedSize':'true'},\n        {'title':'Контрагент', 'field':'Контрагент', 'width':'268px', 'fixedSize':'true'},\n        {'title':'Сумма', 'field':'Сумма', 'width':'100px', 'fixedSize':'false', 'textAlign':'right'}]'""
|    },
|    ""РеестрСБИС_Тип"": {
|        ""Значение"": ""'ФактураИсх,ДокОтгрИсх,Исходящие'""
|    }
|}}";
	СБИСПлагинИни = Кэш.РаботаСJSON.сбисПрочитатьJSON(СБИСПлагинИни);
	Кэш.Вставить("СБИСПлагинИни", СБИСПлагинИни);
КонецФункции
