
Процедура КнопкаВыполнитьНажатие(Кнопка)
	ТЗПрессформ    = Новый ТаблицаЗначений; 
	//ТЗПрессформ.Колонки.Добавить("Прессформа",Справочники.ПрессФормы);
	//ТЗПрессформ.Колонки.Добавить("ПрессформаНаименование",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
	МВТ=новый менеджерВременныхТаблиц;
	Запрос=новый Запрос;
	Запрос.МенеджерВременныхТаблиц=мвт;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗаказПоПрессФормамПрессФормы.ПрессФорма,
	             |	ЗаказПоПрессФормамПрессФормы.Ссылка КАК ЗаказПоПрессФормам,
	             |	ЗаказПоПрессФормамПрессФормы.Ссылка.ДатаНачала,
	             |	ЗаказПоПрессФормамПрессФормы.Ссылка.ДатаКонца,
	             |	ЗаказПоПрессФормамПрессФормы.Ссылка.Контрагент,
	             |	ЗаказПоПрессФормамПрессФормы.Ссылка.ОбщееЧислоДисковДляЗачета,
	             |	ЗаказПоПрессФормамПрессФормы.Ссылка.ОбщееЧислоДисковДляЧастичногоЗачета,
	             |	ЗаказПоПрессФормамПрессФормы.Ссылка.ДоговорКонтрагента,
	             |	ВЫБОР
	             |		КОГДА ЗаказПоПрессФормамПрессФормы.Ссылка.ДоговорКонтрагента.Наименование ПОДОБНО ""%**%""
	             |			ТОГДА ИСТИНА
	             |		ИНАЧЕ ЛОЖЬ
	             |	КОНЕЦ КАК ДоговорСоЗвездочкой,
	             |	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОбороты.СуммаВзаиморасчетовРасход, 0) КАК СуммаОплачено
	             |ПОМЕСТИТЬ втЗаказыПоПрессФормам
	             |ИЗ
	             |	Документ.ЗаказПоПрессФормам.ПрессФормы КАК ЗаказПоПрессФормамПрессФормы
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты КАК ВзаиморасчетыСКонтрагентамиОбороты
	             |		ПО ЗаказПоПрессФормамПрессФормы.Ссылка.ДоговорКонтрагента = ВзаиморасчетыСКонтрагентамиОбороты.ДоговорКонтрагента
	             |			И ЗаказПоПрессФормамПрессФормы.Ссылка = ВзаиморасчетыСКонтрагентамиОбороты.Сделка
	             |ГДЕ
	             |	ЗаказПоПрессФормамПрессФормы.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК
	             |	И ЗаказПоПрессФормамПрессФормы.Ссылка.Проведен = ИСТИНА
	             |	И ЗаказПоПрессФормамПрессФормы.Ссылка.ПометкаУдаления = ЛОЖЬ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	втЗаказыПоПрессФормам.ПрессФорма.Ссылка КАК ПрессФорма,
	             |	втЗаказыПоПрессФормам.ПрессФорма.Наименование КАК Наименование,
	             |	втЗаказыПоПрессФормам.ПрессФорма.ВтороеНаименование КАК ВтороеНаименование
	             |ИЗ
	             |	втЗаказыПоПрессФормам КАК втЗаказыПоПрессФормам";
	Запрос.УстановитьПараметр("ДатаН",НачПериода);
	Запрос.УстановитьПараметр("Ссылка",Заказ);
	Запрос.УстановитьПараметр("ДатаК",КонецДня(КонПериода));
	Результат=Запрос.Выполнить();
	ТЗПрессформ=Результат.Выгрузить();
	тзПрессФорм.Очистить();
	Рез=Результат.Выбрать();
	пока Рез.Следующий() Цикл
		//второе наименование
		НаименованиеПрессформы = Рез.ВтороеНаименование;
		Если Найти(НаименованиеПрессформы, ",") = 0 Тогда //одна прессформа
			НоваяСтрока = ТЗПрессформ.Добавить();
			НоваяСтрока.Прессформа=Рез.Прессформа;
			//++20130123
			Если ВРег(Сред(НаименованиеПрессформы, 1, 3)) = "LA " Тогда
				ДлинаНаименования = СтрДлина(НаименованиеПрессформы);
				НаименованиеПрессформы = Прав(НаименованиеПрессформы, ДлинаНаименования - 3); 
			КонецЕсли;
			//--20130123
			НоваяСтрока.Наименование = НаименованиеПрессформы;
		Иначе //несколько прессформ
			МассивСтрокПробел = РазложитьСтрокуВМассивПодстрок(НаименованиеПрессформы, " ");
			КолМассивСтрок = МассивСтрокПробел.Количество();
			//++13.08.2013
			МассивРадиусаИШирины = РазложитьСтрокуВМассивПодстрок(Строка(МассивСтрокПробел[КолМассивСтрок-1]), "x");
			//--13.08.2013
			ШиринаДиска = Строка(МассивРадиусаИШирины[0]);
			Радиус = Строка(МассивРадиусаИШирины[1]);
			
			МассивСтрокЗапятая = РазложитьСтрокуВМассивПодстрок(НаименованиеПрессформы, ",");
			КолМассивСтрокЗапятая = МассивСтрокЗапятая.Количество();
			
			Флаг = 0;
			
			Для Каждого СтрокаМассива Из МассивСтрокЗапятая Цикл
				//++20130123
				Если ВРег(Сред(СтрокаМассива, 1, 3)) = "LA " Тогда
					ДлинаНаименования = СтрДлина(СтрокаМассива);
					СтрокаМассива = Прав(СтрокаМассива, ДлинаНаименования - 3); 
				КонецЕсли;
				//--20130123
				Флаг = Флаг + 1;
				НоваяСтрока = ТЗПрессформ.Добавить();
				НоваяСтрока.Прессформа=Рез.Прессформа;
				Если Флаг <> КолМассивСтрокЗапятая Тогда
					НоваяСтрока.Наименование = СтрокаМассива+" "+ШиринаДиска+"x"+Радиус; 
				Иначе
					НоваяСтрока.Наименование = СтрокаМассива;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		//первое наименование
		НаименованиеПрессформы = Рез.Наименование;
		Если Найти(НаименованиеПрессформы, ",") = 0 Тогда //одна прессформа
			НоваяСтрока = ТЗПрессформ.Добавить();
			НоваяСтрока.Прессформа=Рез.Прессформа;
			//++20130123
			Если ВРег(Сред(НаименованиеПрессформы, 1, 3)) = "LA " Тогда
				ДлинаНаименования = СтрДлина(НаименованиеПрессформы);
				НаименованиеПрессформы = Прав(НаименованиеПрессформы, ДлинаНаименования - 3); 
			КонецЕсли;
			//--20130123
			НоваяСтрока.Наименование = НаименованиеПрессформы;
		Иначе //несколько прессформ
			МассивСтрокПробел = РазложитьСтрокуВМассивПодстрок(НаименованиеПрессформы, " ");
			КолМассивСтрок = МассивСтрокПробел.Количество();
			
			ШиринаДиска = Строка(МассивСтрокПробел[3]);
			Радиус = Строка(МассивСтрокПробел[2]);
			
			МассивСтрокЗапятая = РазложитьСтрокуВМассивПодстрок(НаименованиеПрессформы, ",");
			КолМассивСтрокЗапятая = МассивСтрокЗапятая.Количество();
			
			Флаг = 0;
			
			Для Каждого СтрокаМассива Из МассивСтрокЗапятая Цикл
				//++20130123
				Если ВРег(Сред(СтрокаМассива, 1, 3)) = "LA " Тогда
					ДлинаНаименования = СтрДлина(СтрокаМассива);
					СтрокаМассива = Прав(СтрокаМассива, ДлинаНаименования - 3); 
				КонецЕсли;
				//--20130123
				Флаг = Флаг + 1;
				НоваяСтрока = ТЗПрессформ.Добавить();
				НоваяСтрока.Прессформа=Рез.Прессформа;
				Если Флаг <> КолМассивСтрокЗапятая Тогда
					НоваяСтрока.Наименование = СтрокаМассива+" "+Радиус+" "+ШиринаДиска; 
				Иначе
					НоваяСтрока.Наименование = СтрокаМассива;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
		
	начало=ТекущаяДата();
	Запрос.Текст = "ВЫБРАТЬ
	               |	""%"" + ПрессФормы.Наименование + ""%"" КАК Наименование,
	               |	ПрессФормы.ПрессФорма КАК ПрессФорма
	               |ПОМЕСТИТЬ втПрессФормы2
	               |ИЗ
	               |	&ПрессФормы КАК ПрессФормы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка,
	               |	Номенклатура.Наименование КАК Наименование
	               |ПОМЕСТИТЬ втДиски
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДиски.Ссылка КАК Номенклатура,
	               |	втПрессФормы2.ПрессФорма
	               |ПОМЕСТИТЬ втСоответствиеПрессФормИДисков
	               |ИЗ
	               |	втДиски КАК втДиски
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПрессФормы2 КАК втПрессФормы2
	               |		ПО (втДиски.Наименование ПОДОБНО втПрессФормы2.Наименование)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втЗаказыПоПрессФормам.ЗаказПоПрессФормам КАК ЗаказПоПрессФормам,
	               |	втЗаказыПоПрессФормам.ПрессФорма,
	               |	втЗаказыПоПрессФормам.Контрагент КАК Контрагент,
	               |	втЗаказыПоПрессФормам.ОбщееЧислоДисковДляЗачета,
	               |	втЗаказыПоПрессФормам.ОбщееЧислоДисковДляЧастичногоЗачета,
	               |	втЗаказыПоПрессФормам.ДатаНачала,
	               |	втЗаказыПоПрессФормам.ДатаКонца,
	               |	втСоответствиеПрессФормИДисков.Номенклатура,
	               |	втЗаказыПоПрессФормам.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	втЗаказыПоПрессФормам.ДоговорСоЗвездочкой КАК ДоговорСоЗвездочкой,
	               |	втЗаказыПоПрессФормам.СуммаОплачено КАК СуммаОплачено
	               |ИЗ
	               |	втЗаказыПоПрессФормам КАК втЗаказыПоПрессФормам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втСоответствиеПрессФормИДисков КАК втСоответствиеПрессФормИДисков
	               |		ПО втЗаказыПоПрессФормам.ПрессФорма = втСоответствиеПрессФормИДисков.ПрессФорма
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Контрагент,
	               |	ДоговорКонтрагента,
	               |	ЗаказПоПрессФормам
	               |ИТОГИ
	               |	МАКСИМУМ(СуммаОплачено)
	               |ПО
	               |	ДоговорСоЗвездочкой,
	               |	Контрагент,
	               |	ДоговорКонтрагента,
	               |	ЗаказПоПрессФормам";
				   Запрос.УстановитьПараметр("ПрессФормы",ТЗПрессформ);
				   //Сообщить(ТекущаяДата()-начало);
				   //ТЗПрессформ.ВыбратьСтроку();
				   ТабДокумент=Новый ТабличныйДокумент;
				   Макет = ПолучитьМакет("Макет");
				   СтрЗаказСерый=Макет.ПолучитьОбласть("СтрЗаказ");
				   СтрЗаказЗеленый=Макет.ПолучитьОбласть("СтрЗаказЗеленый");
				   СтрЗаказЖелтый=Макет.ПолучитьОбласть("СтрЗаказЖелтый");
				   СтрНоменклатура=Макет.ПолучитьОбласть("СтрНоменклатура");
				   СтрИтого=Макет.ПолучитьОбласть("СтрИтого");
				   
				   ТабДокумент.Вывести(Макет.ПолучитьОбласть("Шапка"));
				   //ТабДокумент.НачатьАвтогруппировкуСтрок();
				   
				   Рез=Запрос.Выполнить();
				  // тз=Рез.Выгрузить();
				   //тз.ВыбратьСтроку();
				   
				   ВыборкаДоговорСоЗвездочкой=Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				   Пока ВыборкаДоговорСоЗвездочкой.Следующий() цикл
					   ТабДокумент.НачатьАвтогруппировкуСтрок();
					   ВыборкаКонтрагент=ВыборкаДоговорСоЗвездочкой.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					   
					   ДисковДляЧастичногоЗачетаИтого=0;
					   ДисковДляЗачетаИтого=0;
					   КоличествоПоступилоИтого=0;
					   КоличествоВПутиИтого=0;
					   КоличествоСЗИтого=0;
					   Количество610Итого=0;
					   СтоимостьИтого=0;
					   СуммаОплаченоИтого=0;
					   Пока ВыборкаКонтрагент.Следующий() цикл
						   ДисковДляЧастичногоЗачетаКонтр=0;
						   ДисковДляЗачетаКонтр=0;
						   КоличествоПоступилоКонтр=0;
						   КоличествоВПутиКонтр=0;
						   КоличествоСЗКонтр=0;
						   Количество610Контр=0;
						   СтоимостьКонтр=0;
						   СуммаОплаченоКонтр=0;
						   
						   ОбластьКонтр=Макет.ПолучитьОбласть("СтрКонтрагент");
						   ОбластьКонтр.Параметры.Контрагент=ВыборкаКонтрагент.Контрагент;
						   ТабДокумент.Вывести(ОбластьКонтр,1);
						   ВысотаКонтрагент=ТабДокумент.ВысотаТаблицы;
						   ВыборкаДоговор=ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						   Пока ВыборкаДоговор.Следующий() цикл
							   ДисковДляЧастичногоЗачетаДоговор=0;
							   ДисковДляЗачетаДоговор=0;
							   КоличествоПоступилоДоговор=0;
							   КоличествоВПутиДоговор=0;
							   КоличествоСЗДоговор=0;
							   Количество610Договор=0;
							   СтоимостьДоговор=0;
							   СуммаОплаченоДоговор=0;
							   
							   ОбластьДоговор=Макет.ПолучитьОбласть("СтрДоговор");
							   ОбластьДоговор.Параметры.Договор=ВыборкаДоговор.ДоговорКонтрагента;
							   ТабДокумент.Вывести(ОбластьДоговор,2);
							   ВысотаДоговор=ТабДокумент.ВысотаТаблицы;
							   ВыборкаЗаказыПоПФ=ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
							   пока ВыборкаЗаказыПоПФ.Следующий() Цикл
								   
								   ВыборкаДетали=ВыборкаЗаказыПоПФ.Выбрать();
								   СписокНоменклатуры=Новый СписокЗначений;
								   Пока ВыборкаДетали.Следующий() цикл
									   СписокНоменклатуры.Добавить(ВыборкаДетали.Номенклатура);
									   ДатаНачала=ВыборкаДетали.ДатаНачала;
									   ДатаКонца=ВыборкаДетали.ДатаКонца;
									   Контрагент=ВыборкаДетали.Контрагент;
									   ОбщееЧислоДисковДляЗачета=ВыборкаДетали.ОбщееЧислоДисковДляЗачета;
									   ОбщееЧислоДисковДляЧастичногоЗачета=ВыборкаДетали.ОбщееЧислоДисковДляЧастичногоЗачета
								   КонецЦикла;
								   ЗапросПоступленияПоЗаказуПФ=новый запрос;
								   
								   //ЗапросПоступленияПоЗаказуПФ.Текст="ВЫБРАТЬ
								   //|	&ЗаказПоПФ КАК ЗаказПоПФ,
								   //|	&ДисковДляЗачета,
								   //|	ЕСТЬNULL(ЗакупкиОбороты.Номенклатура, ЗаказыПоставщикамОстатки.Номенклатура) КАК Номенклатура,
								   //|	СУММА(ЕСТЬNULL(ЗакупкиОбороты.КоличествоОборот, ЗаказыПоставщикамОстатки.КоличествоОстаток)) КАК КоличествоОборот
								   //|ИЗ
								   //|	РегистрНакопления.Закупки.Обороты(
								   //|			&ДатаНачала,";
								   //Если ДатаКонца = Дата("00010101000000") Тогда
								   //	ЗапросПоступленияПоЗаказуПФ.Текст = ЗапросПоступленияПоЗаказуПФ.Текст +
								   //	"
								   //	|			,";
								   //Иначе
								   //	ЗапросПоступленияПоЗаказуПФ.Текст = ЗапросПоступленияПоЗаказуПФ.Текст + 
								   //	"
								   //	|			&ДатаКонца,";	
								   //КонецЕсли;
								   //ЗапросПоступленияПоЗаказуПФ.Текст = ЗапросПоступленияПоЗаказуПФ.Текст +
								   //"
								   //|			Регистратор,
								   //|			ДокументЗакупки ССЫЛКА Документ.ПоступлениеТоваровУслуг
								   //|				И Номенклатура В (&СписокНоменклатуры)
								   //|				И ДоговорКонтрагента.Владелец = &Контрагент) КАК ЗакупкиОбороты
								   //|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки(
								   //|				,
								   //|				Номенклатура В (&СписокНоменклатуры)
								   //|					И ДоговорКонтрагента.Владелец = &Контрагент) КАК ЗаказыПоставщикамОстатки
								   //|		ПО ЗакупкиОбороты.Номенклатура = ЗаказыПоставщикамОстатки.Номенклатура
								   //|			И ЗакупкиОбороты.ДоговорКонтрагента = ЗаказыПоставщикамОстатки.ДоговорКонтрагента
								   //|
								   //|СГРУППИРОВАТЬ ПО
								   //|	ЕСТЬNULL(ЗакупкиОбороты.Номенклатура, ЗаказыПоставщикамОстатки.Номенклатура)
								   //|УПОРЯДОЧИТЬ ПО
								   //|	ЗаказПоПФ
								   //|ИТОГИ
								   //|	СУММА(КоличествоОборот)
								   //|ПО
								   //|	ОБЩИЕ";
								   
								   ЗапросПоступленияПоЗаказуПФ.Текст="ВЫБРАТЬ
								   |	&ЗаказПоПФ КАК ЗаказПоПФ,
								   |	&ДисковДляЗачета,
								   |	ЕСТЬNULL(ЗакупкиОбороты.Номенклатура, ЗаказыПоставщикамОстатки.Номенклатура) КАК Номенклатура,
								   |	СУММА(ЕСТЬNULL(ЕСТЬNULL(ЗакупкиОбороты.КоличествоОборот, ЗаказыПоставщикамОстатки.КоличествоОстаток), 0)) КАК КоличествоОборот
								   |ИЗ
								   |	РегистрНакопления.Закупки.Обороты(
								   |			&ДатаНачала,";
								   Если ДатаКонца = Дата("00010101000000") Тогда
									   ЗапросПоступленияПоЗаказуПФ.Текст = ЗапросПоступленияПоЗаказуПФ.Текст +
									   "
									   |			,";
								   Иначе
									   ЗапросПоступленияПоЗаказуПФ.Текст = ЗапросПоступленияПоЗаказуПФ.Текст + 
									   "
									   |			&ДатаКонца,";	
								   КонецЕсли;
								   ЗапросПоступленияПоЗаказуПФ.Текст = ЗапросПоступленияПоЗаказуПФ.Текст +
								   "
								   |			Регистратор,
								   |			ДокументЗакупки ССЫЛКА Документ.ПоступлениеТоваровУслуг
								   |				И Номенклатура В (&СписокНоменклатуры)
								   |				И ДоговорКонтрагента.Владелец = &Контрагент) КАК ЗакупкиОбороты
								   |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки(
								   |				,
								   |				Номенклатура В (&СписокНоменклатуры)
								   |					И ДоговорКонтрагента.Владелец = &Контрагент) КАК ЗаказыПоставщикамОстатки
								   |		ПО ЗакупкиОбороты.Номенклатура = ЗаказыПоставщикамОстатки.Номенклатура
								   |			И ЗакупкиОбороты.ДоговорКонтрагента = ЗаказыПоставщикамОстатки.ДоговорКонтрагента
								   |
								   |СГРУППИРОВАТЬ ПО
								   |	ЕСТЬNULL(ЗакупкиОбороты.Номенклатура, ЗаказыПоставщикамОстатки.Номенклатура)
								   |
								   |УПОРЯДОЧИТЬ ПО
								   |	ЗаказПоПФ
								   |ИТОГИ
								   |	СУММА(КоличествоОборот)
								   |ПО
								   |	ОБЩИЕ";
								   
								   ЗапросПоступленияПоЗаказуПФ.Текст="ВЫБРАТЬ
								   |	&ЗаказПоПФ КАК ЗаказПоПФ,
								   |	&ДисковДляЗачета,
								   |	б.Номенклатура,
								   |	ЕстьNULL(б.КоличествоОборотПоступило,0) КАК КоличествоОборотПоступило,
								   |	ЕстьNULL(б.ВПути,0) КАК ВПути,
								   |	ЕстьNULL(б.СезонныйЗаказ,0) КАК СезонныйЗаказ
								   |ИЗ
								   |	(ВЫБРАТЬ
								   |		а.Номенклатура КАК Номенклатура,
								   |		СУММА(а.КоличествоОборотПоступило) КАК КоличествоОборотПоступило,
								   |		СУММА(а.ВПути) КАК ВПути,
								   |		СУММА(а.СезонныйЗаказ) КАК СезонныйЗаказ
								   |	ИЗ
								   |		(ВЫБРАТЬ
								   |			ЗакупкиОбороты.Номенклатура КАК Номенклатура,
								   |			ЗакупкиОбороты.КоличествоОборот КАК КоличествоОборотПоступило,
								   |			0 КАК ВПути,
								   |			0 КАК СезонныйЗаказ
								   |		ИЗ
								   |	РегистрНакопления.Закупки.Обороты(
								   |			&ДатаНачала,";
								   Если ДатаКонца = Дата("00010101000000") Тогда
									   ЗапросПоступленияПоЗаказуПФ.Текст = ЗапросПоступленияПоЗаказуПФ.Текст +
									   "
									   |			,";
								   Иначе
									   ЗапросПоступленияПоЗаказуПФ.Текст = ЗапросПоступленияПоЗаказуПФ.Текст + 
									   "
									   |			&ДатаКонца,";	
								   КонецЕсли;
								   ЗапросПоступленияПоЗаказуПФ.Текст = ЗапросПоступленияПоЗаказуПФ.Текст +
								   "
								   
								   |					Регистратор,
								   |					ДокументЗакупки ССЫЛКА Документ.ПоступлениеТоваровУслуг
								   |						И Номенклатура В (&СписокНоменклатуры)
								   |						И ДоговорКонтрагента.Владелец = &Контрагент) КАК ЗакупкиОбороты
								   |		
								   |		ОБЪЕДИНИТЬ ВСЕ
								   |		
								   |		ВЫБРАТЬ
								   |			ЗаказыПоставщикамОстатки.Номенклатура,
								   |			0,
								   |			ЗаказыПоставщикамОстатки.КоличествоОстаток,
								   |			0
								   |		ИЗ
								   |			РегистрНакопления.ЗаказыПоставщикам.Остатки(
								   |					,
								   |					Номенклатура В (&СписокНоменклатуры)
								   |						И ДоговорКонтрагента.Владелец = &Контрагент) КАК ЗаказыПоставщикамОстатки
								   |		
								   |		ОБЪЕДИНИТЬ ВСЕ
								   |		
								   |		ВЫБРАТЬ
								   |			ЗаказыПоставщикамСезонныеОстатки.Номенклатура,
								   |			0,
								   |			0,
								   |			ЗаказыПоставщикамСезонныеОстатки.КоличествоОстаток
								   |		ИЗ
								   |			РегистрНакопления.ЗаказыПоставщикамСезонные.Остатки(
								   |					,
								   |					Номенклатура В (&СписокНоменклатуры)
								   |						И ЗаказПоставщикуСезонный.Контрагент = &Контрагент
								   |						И ЗаказПоставщикуСезонный.ДатаДействияПо >= &ДатаК) КАК ЗаказыПоставщикамСезонныеОстатки) КАК а
								   |	
								   |	СГРУППИРОВАТЬ ПО
								   |		а.Номенклатура) КАК б
								   |ИТОГИ
								   |	СУММА(КоличествоОборотПоступило),
								   |	СУММА(ВПути),
								   |	СУММА(СезонныйЗаказ)
								   |ПО
								   |	ОБЩИЕ";

								   
								   ЗапросПоступленияПоЗаказуПФ.УстановитьПараметр("ДатаНачала",?(ВыборкаЗаказыПоПФ.ЗаказПоПрессФормам.ДатаНачала = Дата("00010101000000"),ВыборкаЗаказыПоПФ.ЗаказПоПрессФормам.Дата,ВыборкаЗаказыПоПФ.ЗаказПоПрессФормам.ДатаНачала));
								   ЗапросПоступленияПоЗаказуПФ.УстановитьПараметр("ДатаКонца",КонецДня(ДатаКонца)+1);
								   ЗапросПоступленияПоЗаказуПФ.УстановитьПараметр("ДатаК",КонецДня(КонПериода));
								   ЗапросПоступленияПоЗаказуПФ.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
								   ЗапросПоступленияПоЗаказуПФ.УстановитьПараметр("Контрагент", Контрагент);
								   ЗапросПоступленияПоЗаказуПФ.УстановитьПараметр("ЗаказПоПФ", ВыборкаЗаказыПоПФ.ЗаказПоПрессФормам);
								   ЗапросПоступленияПоЗаказуПФ.УстановитьПараметр("ДисковДляЗачета", ОбщееЧислоДисковДляЗачета);
								   ЗапросПоступленияПоЗаказуПФ.УстановитьПараметр("ДисковДляЧастичногоЗачета", ОбщееЧислоДисковДляЧастичногоЗачета);
								   //ВыборкаНоменклатура=ЗапросПоступленияПоЗаказуПФ.Выполнить().Выбрать();
								   Резт= ЗапросПоступленияПоЗаказуПФ.Выполнить();
								   //тз=Резт.Выгрузить();
								   //тз.ВыбратьСтроку();
								   ВыборкаИтог=Резт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								   ВыборкаИтог.Следующий();
								   ДисковПришло=ВыборкаИтог.КоличествоОборотПоступило;
								   ДисковВПути=ВыборкаИтог.ВПути;
								   ДисковСезонныйЗаказ=ВыборкаИтог.СезонныйЗаказ;
								   ВыборкаНоменклатура=ВыборкаИтог.Выбрать();
								   СтрЗаказ=СтрЗаказСерый;
								   Кол610=0;
								   Если ДисковПришло<>Неопределено тогда   //цвета надо пересмотреть
									   Если ДисковПришло+ДисковВПути+ДисковСезонныйЗаказ>=ОбщееЧислоДисковДляЧастичногоЗачета и ОбщееЧислоДисковДляЧастичногоЗачета <>0 тогда
										   СтрЗаказ=СтрЗаказЖелтый;
									   КонецЕсли;
									   Если ДисковПришло+ДисковВПути+ДисковСезонныйЗаказ>=ОбщееЧислоДисковДляЗачета и ОбщееЧислоДисковДляЗачета <>0 тогда
										   СтрЗаказ=СтрЗаказЗеленый;
									   КонецЕсли;
								   КонецЕсли;
								   Если СтрЗаказ=СтрЗаказСерый тогда//итоги считаем только по незачтенным заказам
									   ДисковДляЧастичногоЗачетаДоговор=ДисковДляЧастичногоЗачетаДоговор+ОбщееЧислоДисковДляЧастичногоЗачета; 
									   ДисковДляЗачетаДоговор=ДисковДляЗачетаДоговор+ОбщееЧислоДисковДляЗачета;
									   КоличествоПоступилоДоговор=КоличествоПоступилоДоговор+?(ДисковПришло=неопределено,0,ДисковПришло);
									   КоличествоВПутиДоговор=КоличествоВПутиДоговор+?(ДисковВПути=неопределено,0,ДисковВПути);
									   КоличествоСЗДоговор=КоличествоСЗДоговор+?(ДисковСезонныйЗаказ=неопределено,0,ДисковСезонныйЗаказ);
									   Кол610=ДисковДляЗачетаДоговор-(КоличествоПоступилоДоговор+КоличествоВПутиДоговор+КоличествоСЗДоговор);
									   Кол610=?(Кол610<0,0,Кол610);
									   Количество610Договор=Кол610;
									   СтоимостьДоговор=СтоимостьДоговор+ВыборкаЗаказыПоПФ.ЗаказПоПрессФормам.СуммаДокумента;
									   СуммаОплаченоДоговор=СуммаОплаченоДоговор+ВыборкаЗаказыПоПФ.СуммаОплачено;
								   КонецЕсли;	   
								   СтрЗаказ.Параметры.Контрагент=ВыборкаЗаказыПоПФ.Контрагент;
								   СтрЗаказ.Параметры.Дата=?(ВыборкаЗаказыПоПФ.ЗаказПоПрессФормам.ДатаНачала = Дата("00010101000000"),ВыборкаЗаказыПоПФ.ЗаказПоПрессФормам.Дата,ВыборкаЗаказыПоПФ.ЗаказПоПрессФормам.ДатаНачала);
								   СтрЗаказ.Параметры.Номер=ВыборкаЗаказыПоПФ.ЗаказПоПрессФормам.Номер;
								   СтрЗаказ.Параметры.Договор=ВыборкаЗаказыПоПФ.ДоговорКонтрагента;
								   СтрЗаказ.Параметры.ЗаказПоПФ=ВыборкаЗаказыПоПФ.ЗаказПоПрессФормам;
								   СтрЗаказ.Параметры.Стоимость=ВыборкаЗаказыПоПФ.ЗаказПоПрессФормам.СуммаДокумента;
								   
								   СтрЗаказ.Параметры.ДисковДляЗачета=ОбщееЧислоДисковДляЗачета;
								   СтрЗаказ.Параметры.ДисковДляЧастичногоЗачета=ОбщееЧислоДисковДляЧастичногоЗачета;
								   СтрЗаказ.Параметры.ДисковПришло=ДисковПришло;
								   СтрЗаказ.Параметры.ДисковВПути=ДисковВПути;
								   СтрЗаказ.Параметры.ДисковСезонныйЗаказ=ДисковСезонныйЗаказ;
								   СтрЗаказ.Параметры.Колонки789=?(ДисковПришло=неопределено,0,ДисковПришло)+?(ДисковВПути=неопределено,0,ДисковВПути)+?(ДисковСезонныйЗаказ=неопределено,0,ДисковСезонныйЗаказ);
								   Колонки610=?(ОбщееЧислоДисковДляЗачета=неопределено,0,ОбщееЧислоДисковДляЗачета)-(?(ДисковПришло=неопределено,0,ДисковПришло)+?(ДисковВПути=неопределено,0,ДисковВПути)+?(ДисковСезонныйЗаказ=неопределено,0,ДисковСезонныйЗаказ));
								   Колонки610=?(Колонки610<0,0,Колонки610);
								  // Количество610Договор=Количество610Договор+Кол610;

								   СтрЗаказ.Параметры.Колонки610=Колонки610;
								   СтрЗаказ.Параметры.Задолженность=ВыборкаЗаказыПоПФ.ЗаказПоПрессФормам.СуммаДокумента-ВыборкаЗаказыПоПФ.СуммаОплачено;
								   //
								   Если ДисковПришло<>неопределено или ДисковВПути<>неопределено тогда
									  ///////////// УстановитьСтатус(ВыборкаЗаказыПоПФ.ЗаказПоПрессФормам,ОбщееЧислоДисковДляЗачета,ОбщееЧислоДисковДляЧастичногоЗачета,ДисковПришло+ДисковВПути);
								   КонецЕсли;
								   //
								   ТабДокумент.Вывести(СтрЗаказ,3);
								   
								   Пока ВыборкаНоменклатура.Следующий() Цикл
									   СтрНоменклатура.Параметры.Номенклатура=ВыборкаНоменклатура.Номенклатура;
									   СтрНоменклатура.Параметры.КоличествоПоступило=ВыборкаНоменклатура.КоличествоОборотПоступило;
									   СтрНоменклатура.Параметры.КоличествоВПути=ВыборкаНоменклатура.ВПути;
									   СтрНоменклатура.Параметры.КоличествоСезонныйЗаказ=ВыборкаНоменклатура.СезонныйЗаказ;
									   СтрНоменклатура.Параметры.Количество789=ВыборкаНоменклатура.КоличествоОборотПоступило+
									   										   ВыборкаНоменклатура.ВПути+
									   										   ВыборкаНоменклатура.СезонныйЗаказ;
									   ТабДокумент.Вывести(СтрНоменклатура,4);
								   КонецЦикла;	   
							   КонецЦикла;//заказ пф
							   //вставит итоги по договору
							   ТабДокумент.Область(ВысотаДоговор,5,ВысотаДоговор,5).Текст=ДисковДляЧастичногоЗачетаДоговор;
							   ТабДокумент.Область(ВысотаДоговор,6,ВысотаДоговор,6).Текст=ДисковДляЗачетаДоговор;
							   ТабДокумент.Область(ВысотаДоговор,7,ВысотаДоговор,7).Текст=КоличествоПоступилоДоговор;
							   ТабДокумент.Область(ВысотаДоговор,8,ВысотаДоговор,8).Текст=КоличествоВПутиДоговор;
							   ТабДокумент.Область(ВысотаДоговор,9,ВысотаДоговор,9).Текст=КоличествоСЗДоговор;
							   ТабДокумент.Область(ВысотаДоговор,10,ВысотаДоговор,10).Текст=КоличествоПоступилоДоговор+КоличествоВПутиДоговор+КоличествоСЗДоговор;
							   ТабДокумент.Область(ВысотаДоговор,11,ВысотаДоговор,11).Текст=Количество610Договор;
							   ТабДокумент.Область(ВысотаДоговор,12,ВысотаДоговор,12).Текст=СтоимостьДоговор;
							   ТабДокумент.Область(ВысотаДоговор,13,ВысотаДоговор,13).Текст=СтоимостьДоговор-СуммаОплаченоДоговор;
							   
							   ДисковДляЧастичногоЗачетаКонтр=ДисковДляЧастичногоЗачетаКонтр+ДисковДляЧастичногоЗачетаДоговор;
							   ДисковДляЗачетаКонтр=ДисковДляЗачетаКонтр+ДисковДляЗачетаДоговор;
							   КоличествоПоступилоКонтр=КоличествоПоступилоКонтр+КоличествоПоступилоДоговор;
							   КоличествоВПутиКонтр=КоличествоВПутиКонтр+КоличествоВПутиДоговор;
							   КоличествоСЗКонтр=КоличествоСЗКонтр+КоличествоСЗДоговор;
							   Количество610Контр=Количество610Контр+Количество610Договор;

							   СтоимостьКонтр=СтоимостьКонтр+СтоимостьДоговор;
							   СуммаОплаченоКонтр=СуммаОплаченоКонтр+СуммаОплаченоДоговор;

						   КонецЦикла;//договор
						   //вставить итоги по контрагенту
						   ТабДокумент.Область(ВысотаКонтрагент,5,ВысотаКонтрагент,5).Текст=ДисковДляЧастичногоЗачетаКонтр;
						   ТабДокумент.Область(ВысотаКонтрагент,6,ВысотаКонтрагент,6).Текст=ДисковДляЗачетаКонтр;
						   ТабДокумент.Область(ВысотаКонтрагент,7,ВысотаКонтрагент,7).Текст=КоличествоПоступилоКонтр;
						   ТабДокумент.Область(ВысотаКонтрагент,8,ВысотаКонтрагент,8).Текст=КоличествоВПутиКонтр;
						   ТабДокумент.Область(ВысотаКонтрагент,9,ВысотаКонтрагент,9).Текст=КоличествоСЗКонтр;
						   ТабДокумент.Область(ВысотаКонтрагент,10,ВысотаКонтрагент,10).Текст=КоличествоПоступилоКонтр+КоличествоВПутиКонтр+КоличествоСЗКонтр;
						   ТабДокумент.Область(ВысотаКонтрагент,11,ВысотаКонтрагент,11).Текст=Количество610Контр;
						   ТабДокумент.Область(ВысотаКонтрагент,12,ВысотаКонтрагент,12).Текст=СтоимостьКонтр;
						   ТабДокумент.Область(ВысотаКонтрагент,13,ВысотаКонтрагент,13).Текст=СтоимостьКонтр-СуммаОплаченоКонтр;
						   
						   ДисковДляЧастичногоЗачетаИтого=ДисковДляЧастичногоЗачетаИтого+ДисковДляЧастичногоЗачетаКонтр;
						   ДисковДляЗачетаИтого=ДисковДляЗачетаИтого+ДисковДляЗачетаКонтр;
						   КоличествоПоступилоИтого=КоличествоПоступилоИтого+КоличествоПоступилоКонтр;
						   КоличествоВПутиИтого=КоличествоВПутиИтого+КоличествоВПутиКонтр;
						   КоличествоСЗИтого=КоличествоСЗИтого+КоличествоСЗКонтр;
						   Количество610Итого=Количество610Итого+Количество610Контр;

						   СтоимостьИтого=СтоимостьИтого+СтоимостьКонтр;
						   СуммаОплаченоИтого=СуммаОплаченоИтого+СуммаОплаченоКонтр;
					   КонецЦикла;//контрагент 
					   ТабДокумент.ЗакончитьАвтогруппировкуСтрок();
					   СтрИтого.Параметры.ДисковДляЧастичногоЗачетаИтого=ДисковДляЧастичногоЗачетаИтого;
					   СтрИтого.Параметры.ДисковДляЗачетаИтого=ДисковДляЗачетаИтого;
					   СтрИтого.Параметры.КоличествоПоступилоИтого=КоличествоПоступилоИтого;
					   СтрИтого.Параметры.КоличествоВПутиИтого=КоличествоВПутиИтого;
					   СтрИтого.Параметры.КоличествоСЗИтого=КоличествоСЗИтого;
					   СтрИтого.Параметры.Количество789Итого=КоличествоПоступилоИтого+КоличествоВПутиИтого+КоличествоСЗИтого;
					   СтрИтого.Параметры.Количество610Итого=Количество610Итого;
					   

					   СтрИтого.Параметры.СтоимостьИтого=СтоимостьИтого;
					   СтрИтого.Параметры.Задолженность=СтоимостьИтого-СуммаОплаченоИтого;
					   ТабДокумент.ЗакончитьАвтогруппировкуСтрок();
					   ТабДокумент.Вывести(СтрИтого);
					   
					   ТабДокумент.Вывести(Макет.ПолучитьОбласть("Разделитель"));
				   КонецЦикла;//со звездочкой
				   ТабДокумент.ТолькоПросмотр=Истина;
				   ТабДокумент.Показать();
	КонецПроцедуры

	
процедура УстановитьСтатус(ЗаказПФ,ДисковДляЗачета,ДисковДляЧастичногоЗачета,ДисковПришло)
		Статус=Неопределено;
		Если ДисковПришло>=ДисковДляЧастичногоЗачета и ДисковДляЧастичногоЗачета <>0 тогда
			Статус=Перечисления.СтатусыЗаказовПоПрессформам.ЧастичноЗачтен;
		КонецЕсли;
		Если ДисковПришло>=ДисковДляЗачета и ДисковДляЗачета <>0 тогда
			Статус=Перечисления.СтатусыЗаказовПоПрессформам.ПолностьюЗачтен;
		КонецЕсли;	
		Если Статус<>неопределено тогда
			ДокОб=ЗаказПФ.ПолучитьОбъект();
			ДокОб.Статус=Статус;
			Если ДокОб.ДатаОплаты=Дата(1,1,1)  тогда
				ДокОб.ДатаОплаты=ТекущаяДата();
			КонецЕсли;	
			ДокОб.Записать();
		КонецЕсли;	
	конецпроцедуры
	
Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры
