
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ID				= Параметры.ID;
	Включен			= Параметры.Включен;
	Наименование	= Параметры.Наименование;
	Описание		= Параметры.Описание;
	КодМаркера		= Параметры.КодМаркера;
	Категория		= Параметры.Категория;
	
	Если НЕ ЗначениеЗаполнено(ID) Тогда
		ID = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СтруктураМаркера = Новый Структура;
	СтруктураМаркера.Вставить("ID", ID);
	СтруктураМаркера.Вставить("Наименование", Наименование);
	СтруктураМаркера.Вставить("Включен",Включен);
	СтруктураМаркера.Вставить("Описание", Описание);
	СтруктураМаркера.Вставить("Категория", Категория);
	СтруктураМаркера.Вставить("КодМаркера", КодМаркера);
	
	Оповестить("Фокус_ИзмененМаркер",СтруктураМаркера);
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
