
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	РезультатПодключения = ВыполнитьПодключениеКИБПриемнику();
	
	Если РезультатПодключения = Неопределено Тогда
		Предупреждение("Возникли ошибки при подключении к информационной базе-приемнику.");
		Возврат
	КонецЕсли;
	
	Если ЭлементыФормы.Переключатель1.Значение = 0 Тогда
		Покупатели = Истина;
	Иначе
		Покупатели = Ложь;
	КонецЕсли;
	
    ТЧРезультат = ПолучитьДеревоОтличий(Покупатели);
	
	ТабДокумент = ЭлементыФормы.ПолеТабличногоДокумента1;
	ТабДокумент.Очистить();
	
	макет = ПолучитьМакет("Макет");
	
	Область = макет.ПолучитьОбласть("Шапка");
	
	ТабДокумент.вывести(Область);
	
	Для каждого стр из ТЧРезультат Цикл
		Область = макет.ПолучитьОбласть("строка");
		Область.Параметры.Код = стр.Код;
		Область.Параметры.Контрагент = стр.Контрагент;
		Область.Параметры.УТ_НачальныйОстаток = стр.УТ_НачальныйОстаток;
		Область.Параметры.УТ_Приход = стр.УТ_Приход;
		Область.Параметры.УТ_Расход = стр.УТ_Расход;
		Область.Параметры.УТ_КонечныйОстаток = стр.УТ_КонечныйОстаток;
		Область.Параметры.БП_НачальныйОстаток = стр.БП_НачальныйОстаток;
		Область.Параметры.БП_Приход = стр.БП_Приход;
		Область.Параметры.БП_Расход = стр.БП_Расход;
		Область.Параметры.БП_КонечныйОстаток = стр.БП_КонечныйОстаток;
		ОбластьОформления = ТабДокумент.Вывести(Область);
		Если стр.УТ_НачальныйОстаток <> стр.БП_НачальныйОстаток
			или стр.УТ_Приход <> стр.БП_Приход
			или стр.УТ_Расход <> стр.БП_Расход
			или стр.УТ_КонечныйОстаток <> стр.БП_КонечныйОстаток Тогда
		ТабДокумент.Область(ОбластьОформления.Верх, 1, ОбластьОформления.Низ, 11).ЦветФона = WebЦвета.Розовый;
		КонецЕсли;
    КонецЦикла;
	
КонецПроцедуры

Процедура КнопкаВыбораПериодаНажатие(Элемент)
	
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.УстановитьПериод(ДатаНачала, ?(ДатаКонца='0001-01-01', ДатаКонца, КонецДня(ДатаКонца)));
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	Если НастройкаПериода.Редактировать() Тогда
		ДатаНачала = НастройкаПериода.ПолучитьДатуНачала();
		ДатаКонца = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
	
КонецПроцедуры




