
Процедура ПолучитьНажатие(Элемент)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL 
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Флаг,
	               |	ЗаказПокупателя.Ссылка КАК ЗаказПокупателя,
	               |	ЗаказПокупателя.НомерВходящегоДокумента КАК НомерПорт,
	               |	ЗаказПокупателя.Комментарий,
	               |	ВЫБОР
	               |		КОГДА ЗаказПокупателя.Комментарий ПОДОБНО ""%ПЕРЕМЕЩЕНИЕ ИЗ ЯРОСЛАВЛЯ%""
	               |			ТОГДА ""Яршинторг (Ярославль)""
	               |		ИНАЧЕ ""Яршинторг (Шинтрейд)""
	               |	КОНЕЦ КАК Поставщик,
	               |	РеализацияТоваровУслуг.Ссылка КАК Реализация
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ЗаказПокупателя.Ссылка = РеализацияТоваровУслуг.Сделка
	               |ГДЕ
	               |	ЗаказПокупателя.Контрагент = &Контрагент
	               |	И ЗаказПокупателя.Дата МЕЖДУ &НачПериода И &КонПериода
	               |	И ЗаказПокупателя.Комментарий ПОДОБНО &Комментарий
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаказПокупателя.Дата
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("НачПериода",НачПериода);
	Запрос.УстановитьПараметр("КонПериода",КонПериода);
	Запрос.УстановитьПараметр("Комментарий","%"+Комментарий+"%");
	рез = Запрос.Выполнить();
    ТабличноеПоле1 = рез.Выгрузить();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Контрагент = справочники.Контрагенты.НайтиПоКоду("93273"); //Евротранс
	
	Если РольДоступна("ПолныеПрава") тогда
	ЭлементыФормы.Контрагент.ТолькоПросмотр = ложь;
	КонецЕсли;
	
	ЭлементыФормы.Комментарий.СписокВыбора.Добавить("Архангельск");
	ЭлементыФормы.Комментарий.СписокВыбора.Добавить("Вологда");
	ЭлементыФормы.Комментарий.СписокВыбора.Добавить("Котлас");
	ЭлементыФормы.Комментарий.СписокВыбора.Добавить("Мурманск");
	ЭлементыФормы.Комментарий.СписокВыбора.Добавить("Новгород");
	ЭлементыФормы.Комментарий.СписокВыбора.Добавить("Петрозаводск");
	ЭлементыФормы.Комментарий.СписокВыбора.Добавить("Череповец");
	ЭлементыФормы.Комментарий.СписокВыбора.Добавить("ПЕРЕМЕЩЕНИЕ ИЗ ЯРОСЛАВЛЯ");

	НачПериода = НачалоДня(ТекущаяДата());
	КонПериода = КонецДня(ТекущаяДата()); 
	
	
	ТабличноеПоле2.Очистить();
	стр1 = ТабличноеПоле2.Добавить();
	стр1.Флаг = истина;
	стр1.ПечатнаяФорма = "Счет на оплату (с учетом корректировок)";
	стр1.ИмяМакета = "Счет";
	стр1.КолЭкз = 1;
	стр1.ТипДокумента = "ЗаказПокупателя";
		 
	стр1 = ТабличноеПоле2.Добавить();
	стр1.Флаг = истина;
	стр1.ПечатнаяФорма = "Заказ покупателя Евротранс";
	стр1.ИмяМакета = Справочники.ДополнительныеПечатныеФормы.НайтиПоНаименованию("Заказ покупателя Евротранс");
	стр1.КолЭкз = 4;
	стр1.ТипДокумента = "";   // из Этой обработки!!!
	
	стр1 = ТабличноеПоле2.Добавить();
	стр1.Флаг = ложь;
	стр1.ПечатнаяФорма = "Спецификация - новая форма";
	стр1.ИмяМакета = Справочники.ДополнительныеПечатныеФормы.НайтиПоНаименованию("Спецификация - новая форма");
	стр1.КолЭкз = 1;
	стр1.ТипДокумента = "Спецификация";
	
	стр1 = ТабличноеПоле2.Добавить();
	стр1.Флаг = ложь;
	стр1.ПечатнаяФорма = "ТОРГ-12 (Яршинторг).";
	стр1.ИмяМакета = Справочники.ДополнительныеПечатныеФормы.НайтиПоНаименованию("ТОРГ-12 (Яршинторг).");
	стр1.КолЭкз = 2;
	стр1.ТипДокумента = "Реализация";
	
КонецПроцедуры


Процедура КнопкаВыполнитьНажатие(Кнопка)
	Печать();	
КонецПроцедуры



//==================================================================
Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры
  

//==================================================================
Процедура Отметки(число1, вар=1)
	
	Если вар=1 тогда
		табл = ТабличноеПоле1;
	иначе
		табл = ТабличноеПоле2;
	КонецЕсли;
	
	Для каждого стр1 из табл Цикл
		 стр1.Флаг = ?(число1=1, TRUE, ?(число1=0, FALSE,  НЕ стр1.Флаг) );
		 Если стр1.Флаг и НЕ стр1.ЗаказПокупателя.Проверен тогда  //отмечен непроделенный заказ!
			Сообщить("Нельзя отмечать непроделенный заказ! "+строка(стр1.ЗаказПокупателя)+" - выключен!", СтатусСообщения.Внимание);
			стр1.Флаг = ЛОЖЬ;
		 КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

Процедура КоманднаяПанель2ВыбратьВсе(Кнопка)
	Отметки(1);
КонецПроцедуры

Процедура КоманднаяПанель2ОтменитьВсе(Кнопка)
	Отметки(0);
КонецПроцедуры

Процедура КоманднаяПанель2ИзменитьВсе(Кнопка)
	Отметки(-1); //наоборот
КонецПроцедуры


Процедура КоманднаяПанель3ВыбратьВсе(Кнопка)
	Отметки(1, "ТабличноеПоле2");
КонецПроцедуры

Процедура КоманднаяПанель3ОтменитьВсе(Кнопка)
	Отметки(0, "ТабличноеПоле2");
КонецПроцедуры

Процедура КоманднаяПанель3ИзменитьВсе(Кнопка)
	Отметки(-1,"ТабличноеПоле2");
КонецПроцедуры

Процедура ТабличноеПоле1ПриПолученииДанных(Элемент, ОформленияСтрок)
	
	для каждого строка из ОформленияСтрок цикл
	 	инд= 3;
		Если Не ЗначениеНеЗаполнено(Строка.ДанныеСтроки.ЗаказПокупателя) Тогда
			Строка.Ячейки.КартинкаЗаказа.ОтображатьКартинку = Истина;
			Если Строка.ДанныеСтроки.ЗаказПокупателя.пометкаУдаления Тогда
				инд = 1;
			ИначеЕсли Строка.ДанныеСтроки.ЗаказПокупателя.проведен Тогда
				инд = 0;
			ИначеЕсли НЕ Строка.ДанныеСтроки.ЗаказПокупателя.проведен Тогда
				инд = 2;
			КонецЕсли;	
			Строка.Ячейки.КартинкаЗаказа.ОтображатьКартинку = Истина;
			Строка.Ячейки.КартинкаЗаказа.ИндексКартинки = инд;
		КонецЕсли;	
		
	 	инд= 3;
		Если Не ЗначениеНеЗаполнено(Строка.ДанныеСтроки.Реализация) Тогда
			Строка.Ячейки.КартинкаРеализации.ОтображатьКартинку = Истина;
			Если Строка.ДанныеСтроки.Реализация.пометкаУдаления Тогда
				инд = 1;
			ИначеЕсли Строка.ДанныеСтроки.Реализация.проведен Тогда
				инд = 0;
			ИначеЕсли НЕ Строка.ДанныеСтроки.Реализация.проведен Тогда
				инд = 2;
			КонецЕсли;	
			Строка.Ячейки.КартинкаРеализации.ОтображатьКартинку = Истина;
			Строка.Ячейки.КартинкаРеализации.ИндексКартинки = инд;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры
