
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.
		Элементы.Найти("НачалоП");
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение  = НачПериода;
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.
		Элементы.Найти("КонецП");
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение  = КонецДня(КонПериода);

КонецПроцедуры

//***для веб-сервиса
Функция РезультатКомпоновкиВТЗ() Экспорт
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек[1].Настройки);
		
	ПараметрДанныхНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоП");
	ПараметрДанныхНачалоПериода.Значение = НачПериода;
	ПараметрДанныхНачалоПериода.Использование = Истина;
	
	ПараметрДанныхНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецП");
	ПараметрДанныхНачалоПериода.Значение = КонецДня(КонПериода);
	ПараметрДанныхНачалоПериода.Использование = Истина;
	
	ПараметрДанныхДискиКрышкиБрак = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДискиКрышкиБрак");
	ПараметрДанныхДискиКрышкиБрак.Использование = Истина;
	ПараметрДанныхДискиКрышкиБрак.Значение  = Справочники.Контрагенты.НайтиПоКоду("92296");

	
	ПараметрАвтоПозицияРезурсов = КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("АвтоПозицияРесурсов");
	ПараметрАвтоПозицияРезурсов.Использование = Истина;
	ПараметрАвтоПозицияРезурсов.Значение = АвтоПозицияРесурсовКомпоновкиДанных.ПослеВсехПолей;
		
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"), КомпоновщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,,Истина);	
	
    ТаблицаРезультат = Новый ТаблицаЗначений;
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;

    ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

    Возврат ТаблицаРезультат;

КонецФункции
