
Функция ПоказатьСообщениеОбОшибке(Ошибка, Подробности, Параметр = Неопределено) Экспорт
	
	СохранитьИнформациюДляТПВоВременныйКаталог(Ошибка+": "+Подробности);
	
	Если Ошибка = "ОшибкаПодключенияВнешнейКомпоненты" Тогда
		
		Получитьформу("Модуль_СообщенияДляПользователей_Форма_ВыводОшибки").ПоказатьОшибку(
			"Ошибка подключения внешней компоненты.",
			"Ошибка подключения внешней компоненты. Работа в модуле невозможна.",
			Подробности);
			
	ИначеЕсли Ошибка = "ОшибкаСозданияОбъектаВнешнейКомпоненты" Тогда
		Получитьформу("Модуль_СообщенияДляПользователей_Форма_ВыводОшибки").ПоказатьОшибку(
			"Ошибка загрузки внешней компоненты",
			"Ошибка при создании COM-объекта AddIn.DiadocInvoiceAPI",
			Подробности);
	ИначеЕсли Ошибка = "ОшибкаРаботыВнешнейКомпоненты" Тогда
		стРасшифровкаОшибки = РаботаССерверомДиадок_ПолучитьСтруктуруОшибкиВнешнейКомпоненты(Подробности);
		Получитьформу("Модуль_СообщенияДляПользователей_Форма_ВыводОшибки").ПоказатьОшибку(
			стРасшифровкаОшибки.Заголовок,
			стРасшифровкаОшибки.Текст,
			стРасшифровкаОшибки.Подробности);
	ИначеЕсли Ошибка = "ОшибкаИДиагностикаИнтернета" Тогда
		форма = Получитьформу("Модуль_СообщенияДляПользователей_Форма_ВыводОшибкиИнтернет");
		форма.ПоказатьОшибку(
			"Ошибка подключения к серверу "+НаименованиеСистемы,
			"Не удалось подключиться к серверу "+НаименованиеСистемы+".
			|1. Проверьте, что вы имеете доступ в интернет.
			|2. Проверьте, что вы можете зайти на сайт "+ТочкаВходаВеб+"
			|3. Укажите параметры подключения к прокси-серверу.
			|
			|При затруднениях обратитесь к вашему системному администратору.",
			Подробности);
		Возврат форма.результат;
	
	ИначеЕсли Ошибка = "ОшибкаИнициализацииПодключаемогоМодуля" Тогда
		Получитьформу("Модуль_СообщенияДляПользователей_Форма_ВыводОшибки").ПоказатьОшибку(
			"Ошибка инициализации подключаемого модуля",
			"При инициализации подключаемого модуля произошла ошибка.",
			Подробности);
			
	ИначеЕсли Ошибка = "ОшибкаОтправкиФайлов" Тогда
		
		ТекстОшибки = ПолучитьМодульПрог("Модуль_Логика_ПоведениеФорм").СформироватьТекстОшибкиДиадок(Подробности);
		
		Получитьформу("Модуль_СообщенияДляПользователей_Форма_ВыводОшибки").ПоказатьОшибку(
		"Ошибка отправки файлов", ТекстОшибки);
			
	Иначе
		
		Получитьформу("Модуль_СообщенияДляПользователей_Форма_ВыводОшибки").ПоказатьОшибку(Ошибка, Подробности);
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
