
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Об = Документ.ПолучитьОбъект();
	Эксель =  Новый COMОбъект("Excel.Application");
    Книга = Эксель.WorkBooks.Open(ПутьКФайлу);
    Лист = Книга.WorkSheets(1);

    ВсегоКолонок = Лист.Cells(1,1).SpecialCells(11).Column;
    ВсегоСтрок = Лист.Cells(1,1).SpecialCells(11).Row;

    для Строка = Первая по ВсегоСтрок цикл
		Если ЗначениеЗаполнено(Производитель) тогда
			Номенклатура = НайтиПоАртикулуиПроизводителю(СокрЛП(СтрЗаменить(Лист.Cells(Строка,Артикул).Value,Символы.НПП,"")),Производитель);
		Иначе	
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СокрЛП(СтрЗаменить(Лист.Cells(Строка,Артикул).Value,Символы.НПП,"")));
		КонецЕсли;
	   Если ЗначениеЗаполнено(Номенклатура) и СокрЛП(СтрЗаменить(Лист.Cells(Строка,Артикул).Value,Символы.НПП,"")) <> "" Тогда
		   НовСтр = Об.Товары.Добавить();
		   Новстр.Номенклатура = Номенклатура;
		   НовСтр.СпособОпределенияЗначенияТочкиЗаказа = Перечисления.СпособыОпределенияЗначенияТочкиЗаказа.Фиксированная;
	   КонецЕсли;
    КонецЦикла;
    Форма = Об.ПолучитьФорму("ФормаДокумента");
	Форма.Открыть();
   
    Эксель.Application.Quit();
КонецПроцедуры

Процедура ПутьКФайлуНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
    если Не ВыбратьФайл(ПутьКФайлу, РежимДиалогаВыбораФайла.Открытие, "Выбор файла данных", "*.dbf") тогда
        Сообщить("Не удалось выбрать файл!");
    КонецЕсли;
КонецПроцедуры

Функция ВыбратьФайл(ПолноеИмяФайла, Режим, Заголовок, Фильтр)

    Диалог = Новый ДиалогВыбораФайла(Режим);
    Диалог.Заголовок                 = Заголовок;
    Диалог.ПредварительныйПросмотр     = Ложь;
    Диалог.Фильтр                   = Фильтр;

    Если ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
        Диалог.ПолноеИмяФайла= ПолноеИмяФайла;
    КонецЕсли;

    Если Диалог.Выбрать() Тогда
        ПолноеИмяФайла= Диалог.ПолноеИмяФайла;
        Возврат Истина;
    Иначе
        Возврат Ложь;
    КонецЕсли;

КонецФункции

Функция НайтиПоАртикулуиПроизводителю(Арт,Произв)
	Ном = Справочники.Номенклатура.ПустаяСсылка();
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	Номенклатура.Ссылка КАК Ссылка
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	Номенклатура.Артикул = &Артикул
	             |	И Номенклатура.Производитель = &Производитель
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Ссылка
	             |АВТОУПОРЯДОЧИВАНИЕ";
				 Запрос.УстановитьПараметр("Артикул",Арт);
				 Запрос.УстановитьПараметр("Производитель",Произв);
				 Рез = Запрос.Выполнить().Выбрать();
				 Пока Рез.Следующий() Цикл
					 Возврат Рез.Ссылка;
				 КонецЦикла;
				 Возврат Ном;
КонецФункции
