
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура СоздатьНажатие(Элемент)
	
	Если (Реализация <> Документы.РеализацияТоваровУслуг.ПустаяСсылка()) Тогда 
		
		НовыйСчет = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
		НовыйСчет.Дата = ТекущаяДата();
		НовыйСчет.Организация = Реализация.Организация;
		НовыйСчет.Контрагент = Реализация.Контрагент;
		НовыйСчет.ДоговорКонтрагента = Реализация.ДоговорКонтрагента;
		НовыйСчет.ДоговорКонтрагента = Реализация.ДоговорКонтрагента;
		НовыйСчет.УчитыватьНДС = Реализация.УчитыватьНДС;
		НовыйСчет.СуммаВключаетНДС = Реализация.Ссылка;
		НовыйСчет.СуммаДокумента = Реализация.СуммаДокумента;
		НовыйСчет.Склад = Реализация.Склад;
		НовыйСчет.ЗаказПокупателя = Реализация.Сделка;
		ЗаполнитьТЧ(НовыйСчет.Товары,Реализация);
		ЗаполнитьПлановуюСебестоимостьНаОсновании(НовыйСчет, Реализация, Константы.ВалютаРегламентированногоУчета.Получить());
		Форма = НовыйСчет.ПолучитьФорму("ФормаДокумента");
		Форма.ОткрытьМодально();
	Иначе 
		Сообщить("Выберите реализацию");
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьТЧ(ТЧ,Реализация)
	
	Для Каждого СтрРеал из Реализация.Товары Цикл
		Стр = ТЧ.Добавить();		
		Стр.Номенклатура = СтрРеал.Номенклатура;
		Стр.ЕдиницаИзмерения = СтрРеал.ЕдиницаИзмерения;
		Стр.ЕдиницаИзмеренияМест = СтрРеал.ЕдиницаИзмеренияМест;
		Стр.Цена = Стрреал.Цена;
		Стр.Сумма = СтрРеал.Сумма;
		Стр.СтавкаНДС = СтрРеал.СтавкаНДС;
		Стр.СуммаНДС = СтрРеал.СуммаНДС;
		Стр.ХарактеристикаНоменклатуры = СтрРеал.ХарактеристикаНоменклатуры;
		Стр.Коэффициент = СтрРеал.Коэффициент;
		Стр.Количество = СтрРеал.Количество;
		Стр.ПроцентСкидкиНаценки = СтрРеал.ПроцентСкидкиНаценки;
		Стр.КоличествоМест = СтрРеал.КоличествоМест;
		Стр.ПроцентАвтоматическихСкидок = СтрРеал.ПроцентАвтоматическихСкидок;
		Стр.УсловиеАвтоматическойСкидки = СтрРеал.УсловиеАвтоматическойСкидки;
		Стр.ЗначениеУсловияАвтоматическойСкидки = СтрРеал.ЗначениеУсловияАвтоматическойСкидки;
		
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьЗаказПокупателя(Реализация)
	
	
	
Конецфункции
