
Процедура КнопкаВыполнитьНажатие(Кнопка)
запрос = новый Запрос;	
запрос.Текст = "ВЫБРАТЬ
               |	ПродажиОбороты.ЗаказПокупателя.ДоговорКонтрагента КАК ДоговорКонтрагента,
               |	ПродажиОбороты.ЗаказПокупателя КАК Сделка,
               |	ПродажиОбороты.Номенклатура,
               |	ПродажиОбороты.СтоимостьОборот КАК СуммаПродажи,
               |	ПродажиСебестоимостьОбороты.СтоимостьОборот КАК Себестоимость,
               |	ПродажиОбороты.СтоимостьОборот - ЕСТЬNULL(ПродажиСебестоимостьОбороты.СтоимостьОборот, 0) КАК Прибыль
               |ИЗ
               |	РегистрНакопления.Продажи.Обороты(&НачПериода, &КонПериода, , Номенклатура.ВидТовара = ЗНАЧЕНИЕ(перечисление.ВидыТоваров.Аксессуары)) КАК ПродажиОбороты
               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиСебестоимость.Обороты(&НачПериода, &КонПериода, , Номенклатура.ВидТовара = ЗНАЧЕНИЕ(перечисление.ВидыТоваров.Аксессуары)) КАК ПродажиСебестоимостьОбороты
               |		ПО ПродажиОбороты.ЗаказПокупателя = ПродажиСебестоимостьОбороты.ЗаказПокупателя
               |			И ПродажиОбороты.Номенклатура = ПродажиСебестоимостьОбороты.Номенклатура
               |ГДЕ
               |	ПродажиОбороты.ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя
               |ИТОГИ
               |	СУММА(СуммаПродажи),
               |	СУММА(Себестоимость),
               |	СУММА(Прибыль)
               |ПО
               |	ОБЩИЕ"; 
 запрос.УстановитьПараметр("НачПериода", НачПериода);
 запрос.УстановитьПараметр("КонПериода", КонецДня(КонПериода) );
 рез = запрос.Выполнить();
 выборка = рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
 Если выборка.Следующий() тогда
	 СуммаПроц = выборка.Прибыль * (ПроцентЗаНаценкуАксессуары/100) /1000;
 Иначе
	 СуммаПроц = 0;
 КонецЕсли;	 
	 
	 СуммаПроц1 = СуммаПроц*ПроцентВедМен/100;
	 СуммаПроц2 = СуммаПроц*ПроцентРукНап/100;
	 СуммаПроц3 = СуммаПроц*ПроцентТоргПред/100;
	 СуммаПроц4 = СуммаПроц*ПроцентМен/100;
 
КонецПроцедуры

Процедура ПриОткрытии()
	
	ПроцентЗаНаценкуАксессуары = 10;
	
	ПроцентВедМен   = 20;
	ПроцентРукНап   = 15;
	ПроцентТоргПред = 15;
	
	ПроцентМен = 50;
	
	
	НачПериода = ДобавитьМесяц( НачалоМесяца( ТекущаяДата() ), -1);
	КонПериода = КонецМесяца(НачПериода);
	
КонецПроцедуры


Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры
