Перем мВалютаРегламентированногоУчетаОрганизаций Экспорт;
Перем мВалютаУправленческогоУчета Экспорт;

Перем мВалютаРегламентированногоУчета Экспорт;

// Для обеспечения работы глоб. процедур и функций.
Перем ВалютаДокумента Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьДокумента()

	Если ЗначениеНеЗаполнено(ЗаказПокупателя) Тогда
		Сообщить("Не указан заказ покупателя");
		Возврат Неопределено;
	КонецЕсли;

	Если ЗначениеНеЗаполнено(ЗаказПокупателя.Организация) Тогда
		Сообщить("В документе основании не указана орагнизация");
		Возврат Неопределено;
	КонецЕсли;

	ЕстьКонтрагент = Истина;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Номер,
	|	Дата,
	|	ЗаказПокупателя,
	|	ЗаказПокупателя.Представление КАК ПредставлениеЗаказа,";

	Если ЕстьКонтрагент Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	ЗаказПокупателя.Контрагент    КАК Получатель,";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|	ЗаказПокупателя.Склад КАК Получатель,
		|	ЗаказПокупателя.Склад.Представление КАК ПредставлениеПолучателя,";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|	ЗаказПокупателя.Организация     КАК Поставщик,
	|	ЗаказПокупателя.Организация     КАК Организация,
	|	СуммаДокумента,
	|	ЗаказПокупателя.ВалютаДокумента КАК ВалютаДокумента,
	|	УчитыватьНДС,
	|	СуммаВключаетНДС,
	|	Товары.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Номенклатура.НаименованиеПолное КАК Товар,
	|		Номенклатура.Код                КАК Код,
	|		Номенклатура.Артикул            КАК Артикул,
	|		Количество,
	|		ЕдиницаИзмерения.Представление  КАК ЕдиницаИзмерения,
	|		ПроцентСкидкиНаценки
	|		+ ПроцентАвтоматическихСкидок   КАК Скидка,
	|		Цена,
	|		Сумма,
	|		СуммаНДС,
	|		ХарактеристикаНоменклатуры КАК Характеристика,
	|		NULL КАК Серия
	|	),
	|	Услуги.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Номенклатура.НаименованиеПолное КАК Товар,
	|		Номенклатура.Код                КАК Код,
	|		Номенклатура.Артикул            КАК Артикул,
	|		Количество,
	|		""""   КАК ЕдиницаИзмерения,
	|		""""   КАК Скидка,
	|		Цена,
	|		Сумма,
	|		СуммаНДС,
	|		""""   КАК Характеристика,
	|		NULL КАК Серия
	|	)
	|ИЗ
	|	Документ.КорректировкаЗаказаПокупателя КАК КорректировкаЗаказаПокупателя
	|
	|ГДЕ
	|	КорректировкаЗаказаПокупателя.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки,
	|	Услуги.НомерСтроки
	|";

	Запрос.Текст = ТекстЗапроса;
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КорректировкаЗаказаПокупателя_КорректировкаЗаказа";

	Макет = ПолучитьМакет("КорректировкаЗаказа");

	// Выводим шапку накладной

	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка      = СформироватьЗаголовокДокумента(Шапка, "Корректировка заказа покупателя");
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ОписаниеОрганизации(СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ПолноеНаименование,");
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	Если ЕстьКонтрагент Тогда
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ОписаниеОрганизации(СведенияОЮрФизЛице(Шапка.ЗаказПокупателя.Контрагент, Шапка.Дата), "ПолноеНаименование,");
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Заказ");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	Если НЕ ЗначениеНеЗаполнено(Шапка.ЗаказПокупателя) Тогда
		ОбластьМакета.Параметры.ПредставлениеЗаказа = СформироватьЗаголовокДокумента(Шапка.ЗаказПокупателя, Шапка.ЗаказПокупателя.Метаданные().Представление());
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);

	ЕстьСтроки = Ложь;

	ЕстьСкидки = Ложь;
	ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
	Пока ВыборкаСтрокТовары.Следующий() Цикл
		Если ВыборкаСтрокТовары.Скидка <> 0 Тогда
			ЕстьСкидки = Истина;
		КонецЕсли; 
	КонецЦикла;
	
	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ВыводитьКоды = Истина;
		Колонка = "Артикул";
	ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ВыводитьКоды = Истина;
		Колонка = "Код";
	Иначе
		ВыводитьКоды = Ложь;
	КонецЕсли;
	
	НомерПоПорядку = 0;
	Всего    = 0;
	Сумма    = 0;
	СуммаНДС = 0;
	ВсегоСкидок    = 0;
	ВсегоБезСкидок = 0;
	ШиринаУжеУвеличина = Ложь;

	ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
	Пока ВыборкаСтрокТовары.Следующий() Цикл

		Если ЗначениеНеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		Если ВыборкаСтрокТовары.Количество > 0 Тогда

			Если НЕ ЕстьСтроки Тогда
				ОбластьСекции = Макет.ПолучитьОбласть("ЗаголовокВПлюс");
				ТабДокумент.Вывести(ОбластьСекции);

				ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
				ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
				ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
				ОбластьСкидок = Макет.ПолучитьОбласть("ШапкаТаблицы|Скидка");
				ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");

				ТабДокумент.Вывести(ОбластьНомера);
				Если ВыводитьКоды Тогда
					ОбластьКодов.Параметры.ИмяКолонкиКодов = Колонка;
					ТабДокумент.Присоединить(ОбластьКодов);
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьДанных);
				Если ЕстьСкидки Тогда
					ТабДокумент.Присоединить(ОбластьСкидок);
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьСуммы);

				ОбластьКолонкаТовар = Макет.Область("Товар");
				Если Не ВыводитьКоды Тогда
					ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки + 
														Макет.Область("КолонкаКодов").ШиринаКолонки;
				КонецЕсли;
				Если НЕ ЕстьСкидки Тогда
					ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки + 
														Макет.Область("СуммаБезСкидки").ШиринаКолонки +
														Макет.Область("СуммаСкидки").ШиринаКолонки;
				КонецЕсли;
				ШиринаУжеУвеличина = Истина;
				ЕстьСтроки = Истина;

			КонецЕсли;

			ОбластьНомера = Макет.ПолучитьОбласть("Строка|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("Строка|КолонкаКодов");
			ОбластьДанных = Макет.ПолучитьОбласть("Строка|Данные");
			ОбластьСкидок = Макет.ПолучитьОбласть("Строка|Скидка");
			ОбластьСуммы  = Макет.ПолучитьОбласть("Строка|Сумма");
			
			НомерПоПорядку = НомерПоПорядку + 1;
			ОбластьНомера.Параметры.НомерПоПорядку = НомерПоПорядку;
			ТабДокумент.Вывести(ОбластьНомера);

			Если ВыводитьКоды Тогда
				Если Колонка = "Артикул" Тогда
					ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Артикул;
				Иначе
					ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Код;
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;

			ОбластьДанных.Параметры.Заполнить(ВыборкаСтрокТовары);
			ОбластьДанных.Параметры.Товар       = ВыборкаСтрокТовары.Товар + ПредставлениеСерий(ВыборкаСтрокТовары);
			ТабДокумент.Присоединить(ОбластьДанных);

			Скидка = ВыборкаСтрокТовары.Сумма  / (100 - ВыборкаСтрокТовары.Скидка) * ВыборкаСтрокТовары.Скидка;
			Если ЕстьСкидки Тогда
				ОбластьСкидок.Параметры.Скидка         = Скидка;
				ОбластьСкидок.Параметры.СуммаБезСкидки = ВыборкаСтрокТовары.Сумма + Скидка;
				ТабДокумент.Присоединить(ОбластьСкидок);
			КонецЕсли;

			ОбластьСуммы.Параметры.Заполнить(ВыборкаСтрокТовары);
			ТабДокумент.Присоединить(ОбластьСуммы);
			Сумма          = Сумма       + ВыборкаСтрокТовары.Сумма;
			СуммаНДС       = СуммаНДС    + ВыборкаСтрокТовары.СуммаНДС;
			ВсегоСкидок    = ВсегоСкидок + Скидка;
			ВсегоБезСкидок = Сумма       + ВсегоСкидок;

		КонецЕсли;
	КонецЦикла;

	ВыборкаСтрокУслуги = Шапка.Услуги.Выбрать();
	Пока ВыборкаСтрокУслуги.Следующий() Цикл

		Если ЗначениеНеЗаполнено(ВыборкаСтрокУслуги.Номенклатура) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		Если ВыборкаСтрокУслуги.Количество > 0 Тогда

			Если НЕ ЕстьСтроки Тогда
				ОбластьСекции = Макет.ПолучитьОбласть("ЗаголовокВПлюс");
				ТабДокумент.Вывести(ОбластьСекции);

				ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
				ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
				ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
				ОбластьСкидок = Макет.ПолучитьОбласть("ШапкаТаблицы|Скидка");
				ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");

				ТабДокумент.Вывести(ОбластьНомера);
				Если ВыводитьКоды Тогда
					ОбластьКодов.Параметры.ИмяКолонкиКодов = Колонка;
					ТабДокумент.Присоединить(ОбластьКодов);
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьДанных);
				Если ЕстьСкидки Тогда
					ТабДокумент.Присоединить(ОбластьСкидок);
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьСуммы);

				ОбластьКолонкаТовар = Макет.Область("Товар");
				Если Не ВыводитьКоды Тогда
					ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки + 
														Макет.Область("КолонкаКодов").ШиринаКолонки;
				КонецЕсли;
				Если НЕ ЕстьСкидки Тогда
					ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки + 
														Макет.Область("СуммаБезСкидки").ШиринаКолонки +
														Макет.Область("СуммаСкидки").ШиринаКолонки;
				КонецЕсли;
				ШиринаУжеУвеличина = Истина;
				ЕстьСтроки = Истина;

			КонецЕсли;

			ОбластьНомера = Макет.ПолучитьОбласть("Строка|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("Строка|КолонкаКодов");
			ОбластьДанных = Макет.ПолучитьОбласть("Строка|Данные");
			ОбластьСкидок = Макет.ПолучитьОбласть("Строка|Скидка");
			ОбластьСуммы  = Макет.ПолучитьОбласть("Строка|Сумма");
			
			НомерПоПорядку = НомерПоПорядку + 1;
			ОбластьНомера.Параметры.НомерПоПорядку = НомерПоПорядку;
			ТабДокумент.Вывести(ОбластьНомера);

			Если ВыводитьКоды Тогда
				Если Колонка = "Артикул" Тогда
					ОбластьКодов.Параметры.Артикул = ВыборкаСтрокУслуги.Артикул;
				Иначе
					ОбластьКодов.Параметры.Артикул = ВыборкаСтрокУслуги.Код;
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;

			ОбластьДанных.Параметры.Заполнить(ВыборкаСтрокУслуги);
			ОбластьДанных.Параметры.Товар       = ВыборкаСтрокУслуги.Товар;
			ТабДокумент.Присоединить(ОбластьДанных);

			Скидка = 0;
			Если ЕстьСкидки Тогда
				ОбластьСкидок.Параметры.Скидка         = Скидка;
				ОбластьСкидок.Параметры.СуммаБезСкидки = ВыборкаСтрокУслуги.Сумма + Скидка;
				ТабДокумент.Присоединить(ОбластьСкидок);
			КонецЕсли;

			ОбластьСуммы.Параметры.Заполнить(ВыборкаСтрокУслуги);
			ТабДокумент.Присоединить(ОбластьСуммы);
			Сумма          = Сумма       + ВыборкаСтрокУслуги.Сумма;
			СуммаНДС       = СуммаНДС    + ВыборкаСтрокУслуги.СуммаНДС;
			ВсегоСкидок    = ВсегоСкидок + Скидка;
			ВсегоБезСкидок = Сумма       + ВсегоСкидок;

		КонецЕсли;
	КонецЦикла;
	Если ЕстьСтроки Тогда
		ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицы|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицы|Данные");
		ОбластьСкидок = Макет.ПолучитьОбласть("ПодвалТаблицы|Скидка");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ПодвалТаблицы|Сумма");
		ТабДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьДанных);
		Если ЕстьСкидки Тогда
			ТабДокумент.Присоединить(ОбластьСкидок);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьСуммы);

		ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("Итого|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть("Итого|Данные");
		ОбластьСкидок = Макет.ПолучитьОбласть("Итого|Скидка");
		ОбластьСуммы  = Макет.ПолучитьОбласть("Итого|Сумма");

		ТабДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ОбластьДанных.Параметры.ТекстИтого = "Итого по разделу";
		ТабДокумент.Присоединить(ОбластьДанных);
		Если ЕстьСкидки Тогда
			ОбластьСкидок.Параметры.ВсегоСкидок    = ВсегоСкидок;
			ОбластьСкидок.Параметры.ВсегоБезСкидок = ВсегоБезСкидок;
			ТабДокумент.Присоединить(ОбластьСкидок);
		КонецЕсли;
		ОбластьСуммы.Параметры.Всего = ФорматСумм(Сумма);
		ТабДокумент.Присоединить(ОбластьСуммы);
	КонецЕсли;

	НомерПоПорядку = 0;
	ЕстьСтроки  = Ложь;
	ВсегоВМинус = 0;
	СуммаНДС    = 0;
	ВсегоСкидок    = 0;
	ВсегоБезСкидок = 0;
	
	ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
	Пока ВыборкаСтрокТовары.Следующий() Цикл

		Если ЗначениеНеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		Если ВыборкаСтрокТовары.Количество < 0 Тогда

			Если НЕ ЕстьСтроки Тогда
				ОбластьСекции = Макет.ПолучитьОбласть("ЗаголовокВМинус");
				ТабДокумент.Вывести(ОбластьСекции);

				ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
				ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
				ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
				ОбластьСкидок = Макет.ПолучитьОбласть("ШапкаТаблицы|Скидка");
				ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");

				ТабДокумент.Вывести(ОбластьНомера);
				Если ВыводитьКоды Тогда
					ОбластьКодов.Параметры.ИмяКолонкиКодов = Колонка;
					ТабДокумент.Присоединить(ОбластьКодов);
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьДанных);
				Если ЕстьСкидки Тогда
					ТабДокумент.Присоединить(ОбластьСкидок);
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьСуммы);

				Если НЕ ШиринаУжеУвеличина Тогда
					ОбластьКолонкаТовар = Макет.Область("Товар");
					Если Не ВыводитьКоды Тогда
						ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки + 
															Макет.Область("КолонкаКодов").ШиринаКолонки;
					КонецЕсли;
					Если НЕ ЕстьСкидки Тогда
						ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки + 
															Макет.Область("СуммаБезСкидки").ШиринаКолонки +
															Макет.Область("СуммаСкидки").ШиринаКолонки;
					КонецЕсли;
				КонецЕсли;

				ЕстьСтроки = Истина;

			КонецЕсли;

			ОбластьНомера = Макет.ПолучитьОбласть("Строка|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("Строка|КолонкаКодов");
			ОбластьДанных = Макет.ПолучитьОбласть("Строка|Данные");
			ОбластьСкидок = Макет.ПолучитьОбласть("Строка|Скидка");
			ОбластьСуммы  = Макет.ПолучитьОбласть("Строка|Сумма");
			
			НомерПоПорядку = НомерПоПорядку + 1;
			ОбластьНомера.Параметры.НомерПоПорядку = НомерПоПорядку;
			ТабДокумент.Вывести(ОбластьНомера);

			Если ВыводитьКоды Тогда
				Если Колонка = "Артикул" Тогда
					ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Артикул;
				Иначе
					ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Код;
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;

			ОбластьДанных.Параметры.Заполнить(ВыборкаСтрокТовары);
			ОбластьДанных.Параметры.Товар      = ВыборкаСтрокТовары.Товар + ПредставлениеСерий(ВыборкаСтрокТовары);
			ОбластьДанных.Параметры.Количество = -ВыборкаСтрокТовары.Количество;
			ТабДокумент.Присоединить(ОбластьДанных);

			Скидка = ВыборкаСтрокТовары.Сумма  / (100 - ВыборкаСтрокТовары.Скидка) * ВыборкаСтрокТовары.Скидка;
			Если ЕстьСкидки Тогда
				ОбластьСкидок.Параметры.Скидка         = Скидка;
				ОбластьСкидок.Параметры.СуммаБезСкидки = ВыборкаСтрокТовары.Сумма + Скидка;
				ТабДокумент.Присоединить(ОбластьСкидок);
			КонецЕсли;

			ОбластьСуммы.Параметры.Заполнить(ВыборкаСтрокТовары);
			ОбластьСуммы.Параметры.Сумма = -ВыборкаСтрокТовары.Сумма;
			ТабДокумент.Присоединить(ОбластьСуммы);

			ВсегоВМинус    = ВсегоВМинус + ВыборкаСтрокТовары.Сумма;
			СуммаНДС       = СуммаНДС    + ВыборкаСтрокТовары.СуммаНДС;
			ВсегоСкидок    = ВсегоСкидок + Скидка;
			ВсегоБезСкидок = ВсегоВМинус + ВсегоСкидок;

		КонецЕсли;
	КонецЦикла;

	ВыборкаСтрокУслуги = Шапка.Услуги.Выбрать();
	Пока ВыборкаСтрокУслуги.Следующий() Цикл

		Если ЗначениеНеЗаполнено(ВыборкаСтрокУслуги.Номенклатура) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		Если ВыборкаСтрокУслуги.Количество < 0 Тогда

			Если НЕ ЕстьСтроки Тогда
				ОбластьСекции = Макет.ПолучитьОбласть("ЗаголовокВМинус");
				ТабДокумент.Вывести(ОбластьСекции);

				ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
				ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
				ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
				ОбластьСкидок = Макет.ПолучитьОбласть("ШапкаТаблицы|Скидка");
				ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");

				ТабДокумент.Вывести(ОбластьНомера);
				Если ВыводитьКоды Тогда
					ОбластьКодов.Параметры.ИмяКолонкиКодов = Колонка;
					ТабДокумент.Присоединить(ОбластьКодов);
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьДанных);
				Если ЕстьСкидки Тогда
					ТабДокумент.Присоединить(ОбластьСкидок);
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьСуммы);

				Если НЕ ШиринаУжеУвеличина Тогда
					ОбластьКолонкаТовар = Макет.Область("Товар");
					Если Не ВыводитьКоды Тогда
						ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки + 
															Макет.Область("КолонкаКодов").ШиринаКолонки;
					КонецЕсли;
					Если НЕ ЕстьСкидки Тогда
						ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки + 
															Макет.Область("СуммаБезСкидки").ШиринаКолонки +
															Макет.Область("СуммаСкидки").ШиринаКолонки;
					КонецЕсли;
				КонецЕсли;

				ЕстьСтроки = Истина;

			КонецЕсли;

			ОбластьНомера = Макет.ПолучитьОбласть("Строка|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("Строка|КолонкаКодов");
			ОбластьДанных = Макет.ПолучитьОбласть("Строка|Данные");
			ОбластьСкидок = Макет.ПолучитьОбласть("Строка|Скидка");
			ОбластьСуммы  = Макет.ПолучитьОбласть("Строка|Сумма");
			
			НомерПоПорядку = НомерПоПорядку + 1;
			ОбластьНомера.Параметры.НомерПоПорядку = НомерПоПорядку;
			ТабДокумент.Вывести(ОбластьНомера);

			Если ВыводитьКоды Тогда
				Если Колонка = "Артикул" Тогда
					ОбластьКодов.Параметры.Артикул = ВыборкаСтрокУслуги.Артикул;
				Иначе
					ОбластьКодов.Параметры.Артикул = ВыборкаСтрокУслуги.Код;
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;

			ОбластьДанных.Параметры.Заполнить(ВыборкаСтрокУслуги);
			ОбластьДанных.Параметры.Товар      = ВыборкаСтрокУслуги.Товар + ПредставлениеСерий(ВыборкаСтрокУслуги);
			ОбластьДанных.Параметры.Количество = -ВыборкаСтрокУслуги.Количество;
			ТабДокумент.Присоединить(ОбластьДанных);

			Скидка = 0;
			Если ЕстьСкидки Тогда
				ОбластьСкидок.Параметры.Скидка         = Скидка;
				ОбластьСкидок.Параметры.СуммаБезСкидки = ВыборкаСтрокУслуги.Сумма + Скидка;
				ТабДокумент.Присоединить(ОбластьСкидок);
			КонецЕсли;

			ОбластьСуммы.Параметры.Заполнить(ВыборкаСтрокУслуги);
			ОбластьСуммы.Параметры.Сумма = -ВыборкаСтрокУслуги.Сумма;
			ТабДокумент.Присоединить(ОбластьСуммы);

			ВсегоВМинус    = ВсегоВМинус + ВыборкаСтрокУслуги.Сумма;
			СуммаНДС       = СуммаНДС    + ВыборкаСтрокУслуги.СуммаНДС;
			ВсегоСкидок    = ВсегоСкидок + Скидка;
			ВсегоБезСкидок = ВсегоВМинус + ВсегоСкидок;

		КонецЕсли;
	КонецЦикла;

	Если ЕстьСтроки Тогда
		ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицы|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицы|Данные");
		ОбластьСкидок = Макет.ПолучитьОбласть("ПодвалТаблицы|Скидка");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ПодвалТаблицы|Сумма");
		ТабДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьДанных);
		Если ЕстьСкидки Тогда
			ТабДокумент.Присоединить(ОбластьСкидок);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьСуммы);

		ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("Итого|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть("Итого|Данные");
		ОбластьСкидок = Макет.ПолучитьОбласть("Итого|Скидка");
		ОбластьСуммы  = Макет.ПолучитьОбласть("Итого|Сумма");

		ТабДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ОбластьДанных.Параметры.ТекстИтого = "Итого по разделу";
		ТабДокумент.Присоединить(ОбластьДанных);
		Если ЕстьСкидки Тогда
			ОбластьСкидок.Параметры.ВсегоСкидок    = ВсегоСкидок;
			ОбластьСкидок.Параметры.ВсегоБезСкидок = ВсегоБезСкидок;
			ТабДокумент.Присоединить(ОбластьСкидок);
		КонецЕсли;
		ОбластьСуммы.Параметры.Всего = ФорматСумм(-ВсегоВМинус);
		ТабДокумент.Присоединить(ОбластьСуммы);
	КонецЕсли;

	ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
	ОбластьКодов  = Макет.ПолучитьОбласть("Итого|КолонкаКодов");
	ОбластьДанных = Макет.ПолучитьОбласть("Итого|Данные");
	ОбластьСкидок = Макет.ПолучитьОбласть("Итого|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("Итого|Сумма");
	ТабДокумент.Вывести(ОбластьНомера);
	Если ВыводитьКоды Тогда
		ТабДокумент.Присоединить(ОбластьКодов);
	КонецЕсли;
	ОбластьДанных.Параметры.ТекстИтого = "Итоговая сумма изменения заказа:";
	ТабДокумент.Присоединить(ОбластьДанных);
	Если ЕстьСкидки Тогда
		ТабДокумент.Присоединить(ОбластьСкидок);
	КонецЕсли;
	ОбластьСуммы.Параметры.Всего = ФорматСумм(Сумма + ВсегоВМинус);
	ТабДокумент.Присоединить(ОбластьСуммы);

	Если Шапка.УчитыватьНДС Тогда
		ОбластьНомера = Макет.ПолучитьОбласть("ИтогоНДС|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("ИтогоНДС|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть("ИтогоНДС|Данные");
		ОбластьСкидок = Макет.ПолучитьОбласть("ИтогоНДС|Скидка");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ИтогоНДС|Сумма");
		ТабДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ОбластьДанных.Параметры.НДС = ?(Шапка.СуммаВключаетНДС, "В том числе НДС:", "Сумма НДС:");
		ТабДокумент.Присоединить(ОбластьДанных);
		Если ЕстьСкидки Тогда
			ТабДокумент.Присоединить(ОбластьСкидок);
		КонецЕсли;
		ОбластьСуммы.Параметры.ВсегоНДС = ФорматСумм(Товары.Итог("СуммаНДС"));
		ТабДокумент.Присоединить(ОбластьСуммы);
	КонецЕсли;

	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	СуммаКПрописи = (Сумма + ВсегоВМинус)+ ?(Шапка.СуммаВключаетНДС, 0, Товары.Итог("СуммаНДС"));
	ОбластьМакета.Параметры.ИтоговаяСтрока ="Всего наименований " + ВыборкаСтрокТовары.Количество()
		+ ", на сумму " + ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента);
	ОбластьМакета.Параметры.СуммаПрописью = "Итоговая сумма изменения заказа: " + 
		СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента);
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьДокумента()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;

	Если Не ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ИмяМакета = "КорректировкаЗаказа" Тогда
    	// Получить экземпляр документа на печать
		ТабДокумент = ПечатьДокумента();
		
	ИначеЕсли ТипЗнч(ИмяМакета) = Тип("СправочникСсылка.ДополнительныеПечатныеФормы") Тогда
		
		ИмяФайла = КаталогВременныхФайлов()+"PrnForm.tmp";
		ОбъектВнешнейФормы = ИмяМакета.ПолучитьОбъект();
		Если ОбъектВнешнейФормы = Неопределено Тогда
			Сообщить("Ошибка получения внешней формы документа. Возможно форма была удалена", СтатусСообщения.Важное);
			Возврат;
		КонецЕсли;
		
		ДвоичныеДанные = ОбъектВнешнейФормы.ХранилищеВнешнейОбработки.Получить();
		ДвоичныеДанные.Записать(ИмяФайла);
		Обработка = ВнешниеОбработки.Создать(ИмяФайла);
		Обработка.СсылкаНаОбъект = Ссылка;
		ТабДокумент = Обработка.Печать();
	
	КонецЕсли;

	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()));

КонецПроцедуры // Печать

// Процедура проверяет необходимость пересчета скидок и пересчитывает их.
//
// Параметры:
//  Проверка - булево, признак только проверки необходимости пересчета скидок.
//
Процедура ПересчитатьСкидки(РезультатПроверки = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	Запрос.УстановитьПараметр("ТекущаяКорректировка", Ссылка);

	Запрос.Текст = "ВЫБРАТЬ
	               |	Объединение.Номенклатура,
	               |	Объединение.ХарактеристикаНоменклатуры,
	               |	Объединение.Цена,
	               |	Объединение.ПроцентСкидкиНаценки,
	               |	СУММА(Объединение.Количество) КАК Количество
	               |ИЗ (
	               |	ВЫБРАТЬ
	               |		ЗаказыПокупателей.Номенклатура КАК Номенклатура,
	               |		ЗаказыПокупателей.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |		СУММА(ЗаказыПокупателей.Количество) КАК Количество,
	               |		ЗаказыПокупателей.Цена КАК Цена,
	               |		ЗаказыПокупателей.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки
	               |	ИЗ
	               |		РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
	               |	
	               |	ГДЕ
	               |		ЗаказыПокупателей.Регистратор = &ЗаказПокупателя
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ЗаказыПокупателей.Номенклатура,
	               |		ЗаказыПокупателей.ХарактеристикаНоменклатуры,
	               |		ЗаказыПокупателей.Цена,
	               |		ЗаказыПокупателей.ПроцентСкидкиНаценки
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЗаказыПокупателей.Номенклатура,
	               |		ЗаказыПокупателей.ХарактеристикаНоменклатуры,
	               |		СУММА(ЗаказыПокупателей.Количество)КАК Количество,
	               |		ЗаказыПокупателей.Цена,
	               |		ЗаказыПокупателей.ПроцентСкидкиНаценки
	               |	ИЗ
	               |		РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
	               |	
	               |	ГДЕ
	               |		(ЗаказыПокупателей.Регистратор ССЫЛКА Документ.КорректировкаЗаказаПокупателя) И
	               |		ЗаказыПокупателей.ЗаказПокупателя = &ЗаказПокупателя И
	               |		ЗаказыПокупателей.Регистратор <> &ТекущаяКорректировка
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ЗаказыПокупателей.Номенклатура,
	               |		ЗаказыПокупателей.ХарактеристикаНоменклатуры,
	               |		ЗаказыПокупателей.Цена,
	               |		ЗаказыПокупателей.ПроцентСкидкиНаценки
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		КорректировкаЗаказаПокупателяТовары.Номенклатура,
	               |		КорректировкаЗаказаПокупателяТовары.ХарактеристикаНоменклатуры,
	               |		СУММА(КорректировкаЗаказаПокупателяТовары.Количество) КАК Количество,
	               |		КорректировкаЗаказаПокупателяТовары.Цена,
	               |		КорректировкаЗаказаПокупателяТовары.ПроцентСкидкиНаценки
	               |	ИЗ
	               |		Документ.КорректировкаЗаказаПокупателя.Товары КАК КорректировкаЗаказаПокупателяТовары
	               |	
	               |	ГДЕ
	               |		КорректировкаЗаказаПокупателяТовары.Ссылка = &ТекущаяКорректировка
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		КорректировкаЗаказаПокупателяТовары.Номенклатура,
	               |		КорректировкаЗаказаПокупателяТовары.ХарактеристикаНоменклатуры,
	               |		КорректировкаЗаказаПокупателяТовары.Цена,
	               |		КорректировкаЗаказаПокупателяТовары.ПроцентСкидкиНаценки
	               |) КАК Объединение
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Объединение.Номенклатура,
	               |	Объединение.ХарактеристикаНоменклатуры,
	               |	Объединение.Цена,
	               |	Объединение.ПроцентСкидкиНаценки";

	ТаблицаЗаказа = Запрос.Выполнить().Выгрузить();

	СуммаЗаказаБезСкидок = 0;
	Для каждого CтрокаТаблицыЗаказа из ТаблицаЗаказа Цикл
		СуммаЗаказаБезСкидок = СуммаЗаказаБезСкидок + CтрокаТаблицыЗаказа.Цена * CтрокаТаблицыЗаказа.Количество;
	КонецЦикла;

	Если СуммаЗаказаБезСкидок = 0 Тогда
		Возврат;
	КонецЕсли;

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидРеализации",                        Перечисления.ВидыСкидок.Оптовая);
	СтруктураПараметров.Вставить("СуммаДокумента",                       СуммаЗаказаБезСкидок);
	СтруктураПараметров.Вставить("Карта",                                ДисконтнаяКарта);
	СтруктураПараметров.Вставить("УчитыватьНДС",                         ложь);
	СтруктураПараметров.Вставить("СуммаВключаетНДС",                     ложь);
	СтруктураПараметров.Вставить("ДатаСкидок",                           Дата);
	СтруктураПараметров.Вставить("ВалютаРегламентированногоУчета",       мВалютаРегламентированногоУчета);

	КвалификаторЧисла = Новый КвалификаторыЧисла(10,2);
	ТаблицаЗаказа.Колонки.Добавить("ПроцентАвтоматическихСкидок",Новый ОписаниеТипов("Число",КвалификаторЧисла));
	ТаблицаЗаказа.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число",КвалификаторЧисла));
	ТаблицаЗаказа.Колонки.Добавить("УсловиеАвтоматическойСкидки");
	ТаблицаЗаказа.Колонки.Добавить("ЗначениеУсловияАвтоматическойСкидки");
	
	мМинимальныеЦены = Новый ТаблицаЗначений;
	мМинимальныеЦены.Колонки.Добавить("Номенклатура");
	мМинимальныеЦены.Колонки.Добавить("ХарактеристикаНоменклатуры");
	мМинимальныеЦены.Колонки.Добавить("Цена");

	мСписокФильтров = ПолучитьЗначениеПраваПользователя(
					ПланыВидовХарактеристик.ПраваПользователей.НеОтпускатьТоварСЦенойНижеОпределенногоТипа,
					Неопределено);
	//Получим таблицу заказа с рассчитанными скидками.
	РассчитатьСкидкиПриПродаже(ЗаказПокупателя, ТаблицаЗаказа, СтруктураПараметров, мМинимальныеЦены, мСписокФильтров);

	ОстаткиПоЗаказу = Товары.Выгрузить();
	ОстаткиПоЗаказу.Очистить();

	ОстаткиПоЗаказу = ОстаткиТоваровПоЗаказуПокупателя( ЗаказПокупателя, ЗаказПокупателя.ДоговорКонтрагента, Дата - 1);

	//Сформируем табличную часть для корректировки остатков по скидкам.
	СтараяТабличнаяЧасть = Товары;
	ТаблицаДляЦикла = Новый ТаблицаЗначений;
	ТаблицаДляЦикла.Колонки.Добавить("Номенклатура");
	ТаблицаДляЦикла.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаДляЦикла.Колонки.Добавить("Цена");
	ТаблицаДляЦикла.Колонки.Добавить("ПроцентСкидкиНаценки");

	Для каждого СтрокаОстатковПоЗаказу из ОстаткиПоЗаказу Цикл
		СтрокаТаблицыДляЦикла = ТаблицаДляЦикла.Добавить();
		СтрокаТаблицыДляЦикла.Номенклатура = СтрокаОстатковПоЗаказу.Номенклатура;
		СтрокаТаблицыДляЦикла.ХарактеристикаНоменклатуры = СтрокаОстатковПоЗаказу.ХарактеристикаНоменклатуры;
		СтрокаТаблицыДляЦикла.Цена = СтрокаОстатковПоЗаказу.Цена;
		СтрокаТаблицыДляЦикла.ПроцентСкидкиНаценки = СтрокаОстатковПоЗаказу.ПроцентСкидкиНаценки;
	КонецЦикла;

	Для каждого СтрокаТабличнойЧасти из СтараяТабличнаяЧасть Цикл
		СтрокаТаблицыДляЦикла = ТаблицаДляЦикла.Добавить();
		СтрокаТаблицыДляЦикла.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		СтрокаТаблицыДляЦикла.ХарактеристикаНоменклатуры = СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры;
		СтрокаТаблицыДляЦикла.Цена = СтрокаТабличнойЧасти.Цена;
		СтрокаТаблицыДляЦикла.ПроцентСкидкиНаценки = СтрокаТабличнойЧасти.ПроцентСкидкиНаценки;
	КонецЦикла;
	ТаблицаДляЦикла.Свернуть("Номенклатура, ХарактеристикаНоменклатуры,Цена,ПроцентСкидкиНаценки");

	Сворачивать = Ложь;
	НоваяТабличнаяЧасть = Товары.Выгрузить();
	НоваяТабличнаяЧасть.Очистить();

	Для каждого СтрокаТаблицыДляЦикла Из ТаблицаДляЦикла Цикл 
		СтрокаСкидок = ТаблицаЗаказа.НайтиСтроки(Новый Структура ("Номенклатура, ХарактеристикаНоменклатуры, Цена, ПроцентСкидкиНаценки",
		                          СтрокаТаблицыДляЦикла.Номенклатура, СтрокаТаблицыДляЦикла.ХарактеристикаНоменклатуры,
		                          СтрокаТаблицыДляЦикла.Цена,СтрокаТаблицыДляЦикла.ПроцентСкидкиНаценки));

		СтрокиСтаройТабличнойЧасти = СтараяТабличнаяЧасть.НайтиСтроки(Новый Структура ("Номенклатура, ХарактеристикаНоменклатуры, Цена, ПроцентСкидкиНаценки",
		                          СтрокаТаблицыДляЦикла.Номенклатура, СтрокаТаблицыДляЦикла.ХарактеристикаНоменклатуры,
		                          СтрокаТаблицыДляЦикла.Цена,СтрокаТаблицыДляЦикла.ПроцентСкидкиНаценки));
		
		СтрокиОстатков = ОстаткиПоЗаказу.НайтиСтроки(Новый Структура ("Номенклатура, ХарактеристикаНоменклатуры, Цена,ПроцентСкидкиНаценки",
		                          СтрокаТаблицыДляЦикла.Номенклатура, СтрокаТаблицыДляЦикла.ХарактеристикаНоменклатуры,
		                          СтрокаТаблицыДляЦикла.Цена,СтрокаТаблицыДляЦикла.ПроцентСкидкиНаценки));

		ТаблицаСтрокКПересчету = Новый ТаблицаЗначений;
		ТаблицаСтрокКПересчету.Колонки.Добавить("СсылкаСтроки");
		Для Сч = 0 По СтрокиСтаройТабличнойЧасти.Количество() - 1 Цикл
			СтрокаКПересчету = ТаблицаСтрокКПересчету.Добавить();
			СтрокаКПересчету.СсылкаСтроки = СтрокиСтаройТабличнойЧасти[Сч];
		КонецЦикла;

		СтрокаОстатков = Неопределено;
		Если СтрокиОстатков.Количество() > 0 Тогда
			СтрокаОстатков = СтрокиОстатков[0];
		КонецЕсли;

		ТекПроцент = 0;
		ТекУсловиеАвтоматическойСкидки = Неопределено;
		ТекЗначениеУсловияАвтоматическойСкидки = Неопределено;
		Если СтрокаСкидок.Количество() > 0 Тогда
			ТекСкидка = СтрокаСкидок[0];
			ТекПроцент = ТекСкидка.ПроцентАвтоматическихСкидок;
			ТекУсловиеАвтоматическойСкидки = ТекСкидка.УсловиеАвтоматическойСкидки;
			ТекЗначениеУсловияАвтоматическойСкидки = ТекСкидка.ЗначениеУсловияАвтоматическойСкидки;
		КонецЕсли;

		Пересчет = Ложь;
		Если СтрокаОстатков <> Неопределено Тогда
			Если СтрокаОстатков.ПроцентАвтоматическихСкидок <> ТекПроцент Тогда //Процент изменился.
				ОбщееКоличествоПоПроцентуОстаткаВТЧ = 0;
				Для каждого СтрокаСтаройТабличнойЧасти Из СтрокиСтаройТабличнойЧасти Цикл
					Если СтрокаСтаройТабличнойЧасти.ПроцентАвтоматическихСкидок = СтрокаОстатков.ПроцентАвтоматическихСкидок Тогда
						ОбщееКоличествоПоПроцентуОстаткаВТЧ = ОбщееКоличествоПоПроцентуОстаткаВТЧ + СтрокаСтаройТабличнойЧасти.Количество;
						СтрокаКУдалению = ТаблицаСтрокКПересчету.Найти(СтрокаСтаройТабличнойЧасти);
						Если СтрокаКУдалению <> Неопределено Тогда
							ТаблицаСтрокКПересчету.Удалить(СтрокаКУдалению);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если - ОбщееКоличествоПоПроцентуОстаткаВТЧ <> СтрокаОстатков.КолОстаток Тогда
					Пересчет = Истина;
					Сворачивать = Истина;
				КонецЕсли;
			ИначеЕсли СтрокиСтаройТабличнойЧасти.Количество()>1 Тогда //Процент не изменился
				Для каждого СтрокаСтаройТабличнойЧасти Из СтрокиСтаройТабличнойЧасти Цикл
					Если СтрокаСтаройТабличнойЧасти.ПроцентАвтоматическихСкидок <> СтрокаОстатков.ПроцентАвтоматическихСкидок Тогда
						Пересчет = Истина;
						Сворачивать = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Для каждого СтрокаСтаройТабличнойЧасти Из СтрокиСтаройТабличнойЧасти Цикл
				Если СтрокаСтаройТабличнойЧасти.ПроцентАвтоматическихСкидок <> ТекПроцент Тогда
					Пересчет = Истина;
					Сворачивать = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		Если РезультатПроверки = "Проверить" Тогда
			Если Пересчет Тогда
				РезультатПроверки = Истина;
				Возврат;
			Иначе 
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		Если Пересчет Тогда
			Для каждого СтрокаОстатков Из СтрокиОстатков Цикл

				Если ТекПроцент = СтрокаОстатков.ПроцентАвтоматическихСкидок Тогда
					Для каждого СтрокаСтаройТабличнойЧасти Из СтрокиСтаройТабличнойЧасти Цикл
						СтрокаСтаройТабличнойЧасти.ПроцентАвтоматическихСкидок         = ТекПроцент;
						СтрокаСтаройТабличнойЧасти.УсловиеАвтоматическойСкидки         = ТекУсловиеАвтоматическойСкидки;
						СтрокаСтаройТабличнойЧасти.ЗначениеУсловияАвтоматическойСкидки = ТекЗначениеУсловияАвтоматическойСкидки;
						СтрокаКУдалению                                                = ТаблицаСтрокКПересчету.Найти(СтрокаСтаройТабличнойЧасти);
						Если СтрокаКУдалению <> Неопределено Тогда
							ТаблицаСтрокКПересчету.Удалить(СтрокаКУдалению);
						КонецЕсли;
					КонецЦикла;
				Иначе
					КолСписать = СтрокаОстатков.КолОстаток;
					Для каждого СтрокаСтаройТабличнойЧасти Из СтрокиСтаройТабличнойЧасти Цикл
						Размещение = СтрокаСтаройТабличнойЧасти.Размещение;
						Если СтрокаСтаройТабличнойЧасти.ПроцентАвтоматическихСкидок = СтрокаОстатков.ПроцентАвтоматическихСкидок
						   И СтрокаСтаройТабличнойЧасти.Количество < 0 Тогда
							КолСписать = КолСписать + СтрокаСтаройТабличнойЧасти.Количество;
						Иначе
							СтарыйПроцент                             = СтрокаСтаройТабличнойЧасти.ПроцентАвтоматическихСкидок;
							СтароеУсловиеАвтоматическойСкидки         = СтрокаСтаройТабличнойЧасти.УсловиеАвтоматическойСкидки;
							СтароеЗначениеУсловияАвтоматическойСкидки = СтрокаСтаройТабличнойЧасти.ЗначениеУсловияАвтоматическойСкидки;
							СтрокаСтаройТабличнойЧасти.ПроцентАвтоматическихСкидок         = ТекПроцент;
							СтрокаСтаройТабличнойЧасти.УсловиеАвтоматическойСкидки         = ТекУсловиеАвтоматическойСкидки;
							СтрокаСтаройТабличнойЧасти.ЗначениеУсловияАвтоматическойСкидки = ТекЗначениеУсловияАвтоматическойСкидки;
						КонецЕсли;
						СтрокаКУдалению = ТаблицаСтрокКПересчету.Найти(СтрокаСтаройТабличнойЧасти);
						Если СтрокаКУдалению <> Неопределено Тогда
							ТаблицаСтрокКПересчету.Удалить(СтрокаКУдалению);
						КонецЕсли;
					КонецЦикла;
					Если КолСписать <> 0 Тогда
						НоваяСтрока                                     = СтараяТабличнаяЧасть.Добавить();
						НоваяСтрока.Номенклатура                        = СтрокаТаблицыДляЦикла.Номенклатура;
						НоваяСтрока.ХарактеристикаНоменклатуры          = СтрокаТаблицыДляЦикла.ХарактеристикаНоменклатуры;
						НоваяСтрока.Цена                                = СтрокаТаблицыДляЦикла.Цена;
						НоваяСтрока.Количество                          = -КолСписать;
						НоваяСтрока.ЕдиницаИзмерения                    = СтрокаОстатков.ЕдиницаИзмерения;
						НоваяСтрока.Коэффициент                         = СтрокаОстатков.Коэффициент;
						НоваяСтрока.УсловиеАвтоматическойСкидки         = СтрокаОстатков.УсловиеАвтоматическойСкидки;
						НоваяСтрока.ЗначениеУсловияАвтоматическойСкидки = СтрокаОстатков.ЗначениеУсловияАвтоматическойСкидки;
						НоваяСтрока.СтавкаНДС                           = СтрокаОстатков.СтавкаНДС;
						НоваяСтрока.ПроцентСкидкиНаценки                = СтрокаОстатков.ПроцентСкидкиНаценки;
						НоваяСтрока.ПроцентАвтоматическихСкидок         = СтрокаОстатков.ПроцентАвтоматическихСкидок;
						НоваяСтрока.Размещение                          = Размещение;
						// Рассчитать реквизиты табличной части.
						РассчитатьКоличествоМестТабЧасти(НоваяСтрока, ЭтотОбъект);
						РассчитатьСуммуТабЧасти(НоваяСтрока, ЭтотОбъект);
						РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ЭтотОбъект);
					КонецЕсли;
					Если КолСписать <> 0 Тогда
						НоваяСтрока = СтараяТабличнаяЧасть.Добавить();
						НоваяСтрока.Номенклатура               = СтрокаТаблицыДляЦикла.Номенклатура;
						НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаТаблицыДляЦикла.ХарактеристикаНоменклатуры;
						НоваяСтрока.Цена                       = СтрокаТаблицыДляЦикла.Цена;
						НоваяСтрока.Количество                 = КолСписать;
						НоваяСтрока.ЕдиницаИзмерения           = СтрокаОстатков.ЕдиницаИзмерения;
						НоваяСтрока.Коэффициент                = СтрокаОстатков.Коэффициент;
						НоваяСтрока.СтавкаНДС                  = СтрокаОстатков.СтавкаНДС;
						Если ТекПроцент = СтрокаОстатков.ПроцентАвтоматическихСкидок Тогда
							НоваяСтрока.ПроцентАвтоматическихСкидок         = СтарыйПроцент;
							НоваяСтрока.ЗначениеУсловияАвтоматическойСкидки = СтароеЗначениеУсловияАвтоматическойСкидки;
							НоваяСтрока.УсловиеАвтоматическойСкидки         = СтароеУсловиеАвтоматическойСкидки;
						Иначе
							НоваяСтрока.ПроцентАвтоматическихСкидок         = ТекПроцент;
							НоваяСтрока.ЗначениеУсловияАвтоматическойСкидки = ТекЗначениеУсловияАвтоматическойСкидки;
							НоваяСтрока.УсловиеАвтоматическойСкидки         = ТекУсловиеАвтоматическойСкидки;
						КонецЕсли;
						НоваяСтрока.ПроцентСкидкиНаценки = СтрокаТаблицыДляЦикла.ПроцентСкидкиНаценки;
						НоваяСтрока.Размещение = Размещение;
						// Рассчитать реквизиты табличной части.
						РассчитатьКоличествоМестТабЧасти(НоваяСтрока, ЭтотОбъект);
						РассчитатьСуммуТабЧасти(НоваяСтрока, ЭтотОбъект);
						РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ЭтотОбъект);
					КонецЕсли;

				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ТаблицаСтрокКПересчету.Количество() > 0 Тогда //Пересчитаем остальные строки на новый процент.
			Для каждого СтрокаКПересчету из ТаблицаСтрокКПересчету Цикл
				СсылкаСтроки = СтрокаКПересчету.СсылкаСтроки;
				Если СсылкаСтроки.ПроцентАвтоматическихСкидок <> ТекПроцент Тогда
					СсылкаСтроки.ПроцентАвтоматическихСкидок         = ТекПроцент;
					РассчитатьСуммуТабЧасти(СсылкаСтроки, ЭтотОбъект);
					РассчитатьСуммуНДСТабЧасти(СсылкаСтроки, ЭтотОбъект);
					СсылкаСтроки.УсловиеАвтоматическойСкидки         = ТекУсловиеАвтоматическойСкидки;
					СсылкаСтроки.ЗначениеУсловияАвтоматическойСкидки = ТекЗначениеУсловияАвтоматическойСкидки;
				ИначеЕсли СсылкаСтроки.УсловиеАвтоматическойСкидки <> ТекУсловиеАвтоматическойСкидки Тогда
					СсылкаСтроки.УсловиеАвтоматическойСкидки         = ТекУсловиеАвтоматическойСкидки;
					СсылкаСтроки.ЗначениеУсловияАвтоматическойСкидки = ТекЗначениеУсловияАвтоматическойСкидки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Если РезультатПроверки = "Проверить" Тогда 
		РезультатПроверки = Ложь;
		Возврат;
	Иначе
		Если Сворачивать Тогда
			СтараяТабличнаяЧасть.Свернуть("ЕдиницаИзмерения,"
										  +"ЕдиницаИзмеренияМест,"
										  +"ЗначениеУсловияАвтоматическойСкидки,"
										  +"УсловиеАвтоматическойСкидки,"
										  +"Коэффициент,"
										  +"Номенклатура,"
										  +"ХарактеристикаНоменклатуры,"
										  +"ПроцентАвтоматическихСкидок,"
										  +"ПроцентСкидкиНаценки,"
										  +"Размещение,"
										  +"СтавкаНДС,"
										  +"Цена,"
										  +"ПлановаяСебестоимость",
										  "Количество,"
										  +"КоличествоМест,"
										  +"Сумма,"
										  +"СуммаНДС");

			КоличествоСтрок = Товары.Количество();
			Для Сч = 1 По КоличествоСтрок Цикл
				СтрокаТовара = Товары[КоличествоСтрок - Сч];
				Если СтрокаТовара.Количество = 0 Тогда
					Товары.Удалить(СтрокаТовара);
				Иначе
					// Рассчитать реквизиты табличной части.
					РассчитатьКоличествоМестТабЧасти(СтрокаТовара, ЭтотОбъект);
					РассчитатьСуммуТабЧасти(СтрокаТовара, ЭтотОбъект);
					РассчитатьСуммуНДСТабЧасти(СтрокаТовара, ЭтотОбъект);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСписокПечатныхФорм() Экспорт

	СписокМакетов = Новый СписокЗначений;

	СписокМакетов.Добавить("КорректировкаЗаказа", "Корректировка заказа покупателя");

	ДобавитьВСписокДополнительныеФормы(СписокМакетов, Метаданные());
	Возврат СписокМакетов;

КонецФункции // ПолучитьСписокПечатныхФорм()

#КонецЕсли

// Процедура выполняет добавление строки в табличную часть.
//
// Параметры:
//  ТабличнаяЧасть - табличная часть в которую добавляется строка;
//  Выборка        - запрос, спозиционированный на строке;
//  Количество     - количество в добавляемой строке;
//	Режим          - режим размещения: "Резерв" - по складу, "Заказ" - по заказу, "" - без размещения
//
Процедура ДобавитьСтрокуТабличнойЧасти(ТабличнаяЧасть, Выборка, Количество, Размещение = Неопределено)

	Если Количество = 0 Тогда
		Возврат;
	КонецЕсли;

	Если ТабличнаяЧасть = Товары Тогда

		СтрокаТабличнойЧасти = ТабличнаяЧасть.Добавить();

		СтрокаТабличнойЧасти.Номенклатура         = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.Количество           = - Количество;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения     = Выборка.Единица;
		СтрокаТабличнойЧасти.Коэффициент          = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		Если ТипЗнч(ЗаказПокупателя) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			СтрокаТабличнойЧасти.СтавкаНДС            = Выборка.СтавкаНДС;
			СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = Выборка.ПроцентСкидкиНаценки;
			СтрокаТабличнойЧасти.ПроцентАвтоматическихСкидок = Выборка.ПроцентАвтоматическихСкидок;
			СтрокаТабличнойЧасти.УсловиеАвтоматическойСкидки = Выборка.УсловиеАвтоматическойСкидки;
			СтрокаТабличнойЧасти.ЗначениеУсловияАвтоматическойСкидки = Выборка.ЗначениеУсловияАвтоматическойСкидки;
			СтрокаТабличнойЧасти.Цена =  ПересчитатьЦенуПриИзмененииФлаговНалогов(Выборка.Цена,
											Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов,
											ЗаказПокупателя.СуммаВключаетНДС,
											УчитыватьНДС,
											СуммаВключаетНДС,
											ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
		Иначе
			СтрокаТабличнойЧасти.Цена = Выборка.Цена;								
		КонецЕсли;

		РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);

		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		
		СтрокаТабличнойЧасти.Размещение                 = Размещение;

	Иначе // ТабличнаяЧасть = ВозвратнаяТара

		СтрокаТабличнойЧасти = ТабличнаяЧасть.Добавить();

		СтрокаТабличнойЧасти.Номенклатура     = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.Количество       = - Количество;

		СтрокаТабличнойЧасти.Цена = Выборка.Цена;
		РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		
		СтрокаТабличнойЧасти.Размещение       = Размещение;

	КонецЕсли;

КонецПроцедуры // ДобавитьСтрокуТабличнойЧасти()

// Заполняет табличную часть ТАРА по остаткам
//
// Параметры:
//  ТабличнаяЧасть - табличная часть.
//
Процедура ЗаполнитьТаруПоОстаткам() Экспорт

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	РегЗаказы.Номенклатура,
	|	РегЗаказы.ЕдиницаИзмерения КАК Единица,
	|	РегЗаказы.КоличествоОстаток КАК КолОстаток,
	|	РегЗаказы.СуммаУпрОстаток КАК СуммаУпр,
	|	РегЗаказы.Цена
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(&КонДата, ДоговорКонтрагента = &Договор И СтатусПартии = &Статус И ЗаказПокупателя = &Заказ) КАК РегЗаказы
	|
	|ГДЕ
	|	НЕ РегЗаказы.Номенклатура.Услуга И
	|	РегЗаказы.КоличествоОстаток > 0";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр( "КонДата", Дата);
	Запрос.УстановитьПараметр( "Заказ",   ЗаказПокупателя);
	Запрос.УстановитьПараметр( "Договор", ЗаказПокупателя.ДоговорКонтрагента);
	Запрос.УстановитьПараметр( "Статус",  Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);
	
	ЗапросРазмещения = Новый Запрос;
	ЗапросРазмещения.УстановитьПараметр("ТоварТара"      , Перечисления.ТоварТара.Тара);
	ЗапросРазмещения.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	
	ЗапросРазмещения.Текст = "
	|ВЫБРАТЬ 
	|	РазмещениеЗаказовПокупателейОстатки.Номенклатура               КАК Номенклатура,
	|	РазмещениеЗаказовПокупателейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПоставщику            КАК Размещение,
	|	РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток          КАК КоличествоОстатокПоРазмещению
	|ИЗ
	|   РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(, ЗаказПокупателя = &ЗаказПокупателя 
	|                                                          И ТоварТара = &ТоварТара) КАК РазмещениеЗаказовПокупателейОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура                    КАК Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры      КАК ХарактеристикаНоменклатуры,
	|	ТоварыВРезервеНаСкладахОстатки.Склад                           КАК Размещение,
	|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток               КАК КоличествоОстатокПоРазмещению
	|ИЗ
	|   РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ДокументРезерва = &ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|";
	
	ТаблицаРазмещений = ЗапросРазмещения.Выполнить().Выгрузить();
	СтруктураПоиска  = Новый Структура;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		КолвоПоЗаказу = Выборка.КолОстаток;
		
		СтруктураПоиска.Вставить( "Номенклатура", Выборка.Номенклатура);
		
		НайденныеСтроки = ТаблицаРазмещений.НайтиСтроки(СтруктураПоиска);
		
		Для каждого СтрокаРазмещения ИЗ НайденныеСтроки Цикл
			КолвоСпис = Мин(КолвоПоЗаказу, СтрокаРазмещения.КоличествоОстатокПоРазмещению);
			Если КолвоСпис >= 0 Тогда
				КолвоПоЗаказу = КолвоПоЗаказу - КолвоСпис;
				ДобавитьСтрокуТабличнойЧасти( ВозвратнаяТара, Выборка, КолвоСпис, СтрокаРазмещения.Размещение);
				СтрокаРазмещения.КоличествоОстатокПоРазмещению = СтрокаРазмещения.КоличествоОстатокПоРазмещению - КолвоСпис;
			КонецЕсли;
			Если КолвоПоЗаказу = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если КолвоПоЗаказу <> 0 Тогда
			ДобавитьСтрокуТабличнойЧасти( ВозвратнаяТара, Выборка, КолвоПоЗаказу);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ЗаполнитьТаруПоОстаткам()

// Заполняет табличную часть "Товары" по остаткам
//
// Параметры:
//  Нет.
//
Процедура ЗаполнитьТоварыПоОстаткам() Экспорт

	ТоварТара = Перечисления.ТоварТара.Товар;
	ТабличнаяЧастьСтрока = "Товары";
	
	ТабОстатки = ОстаткиТоваровПоЗаказуПокупателя(ЗаказПокупателя, ЗаказПокупателя.ДоговорКонтрагента, Дата);
	ТабОстатки.Колонки.Добавить("Единица");
	
	ЗапросРазмещения = Новый Запрос;
	ЗапросРазмещения.УстановитьПараметр("ТоварТара"      , Перечисления.ТоварТара.Товар);
	ЗапросРазмещения.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	
	ЗапросРазмещения.Текст = "
	|ВЫБРАТЬ 
	|	РазмещениеЗаказовПокупателейОстатки.Номенклатура               КАК Номенклатура,
	|	РазмещениеЗаказовПокупателейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПоставщику            КАК Размещение,
	|	РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток          КАК КоличествоОстатокПоРазмещению
	|ИЗ
	|   РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(, ЗаказПокупателя = &ЗаказПокупателя 
	|                                                          И ТоварТара = &ТоварТара 
	|                                                          И Не Номенклатура.Услуга) КАК РазмещениеЗаказовПокупателейОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура                    КАК Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры      КАК ХарактеристикаНоменклатуры,
	|	ТоварыВРезервеНаСкладахОстатки.Склад                           КАК Размещение,
	|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток               КАК КоличествоОстатокПоРазмещению
	|ИЗ
	|   РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ДокументРезерва = &ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|";
	
	ТаблицаРазмещений = ЗапросРазмещения.Выполнить().Выгрузить();
	СтруктураПоиска  = Новый Структура;
	
	Для Каждого Выборка Из ТабОстатки Цикл
		
		КолвоПоЗаказу = Выборка.КолОстаток;
		Выборка.Единица = Выборка.Номенклатура.ЕдиницаХраненияОстатков;
		
		СтруктураПоиска.Вставить("Номенклатура",               Выборка.Номенклатура);
		СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", Выборка.ХарактеристикаНоменклатуры);
		
		НайденныеСтроки = ТаблицаРазмещений.НайтиСтроки(СтруктураПоиска);
		
		Для каждого СтрокаРазмещения ИЗ НайденныеСтроки Цикл
			КолвоСпис = Мин(КолвоПоЗаказу, СтрокаРазмещения.КоличествоОстатокПоРазмещению);
			Если КолвоСпис >= 0 Тогда
				КолвоПоЗаказу = КолвоПоЗаказу - КолвоСпис;
				ДобавитьСтрокуТабличнойЧасти(Товары, Выборка, КолвоСпис, СтрокаРазмещения.Размещение);
				СтрокаРазмещения.КоличествоОстатокПоРазмещению = СтрокаРазмещения.КоличествоОстатокПоРазмещению - КолвоСпис;
			КонецЕсли;
			Если КолвоПоЗаказу = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если КолвоПоЗаказу <> 0 Тогда
			ДобавитьСтрокуТабличнойЧасти(Товары, Выборка, КолвоПоЗаказу);
		КонецЕсли;

	КонецЦикла;
	
	ЗаполнитьПлановуюСебестоимостьНаОсновании(ЭтотОбъект, ЗаказПокупателя, мВалютаРегламентированногоУчета);

КонецПроцедуры // ЗаполнитьТоварыПоОстаткам()

// Заполняет табличную часть "ВозвратнаяТара" по остаткам
//
// Параметры:
//  Нет.
//
Процедура ЗаполнитьУслугиПоОстаткам() Экспорт

	ДопПараметры = Новый Структура("ЗнакКоличества", (-1));
	ЗаполнитьТабЧастьУслугиПоЗаказу( ЭтотОбъект, Услуги, ОстаткиУслугПоЗаказуПокупателя( ЗаказПокупателя, ЗаказПокупателя.ДоговорКонтрагента, Дата), ДопПараметры);
	
КонецПроцедуры // ЗаполнитьУслугиПоОстаткам()

// Здесь надо написать текст - описание процедуры
//
// Параметры:
//  Нет.
//
Процедура СкопироватьТовары() Экспорт

	Если ТипЗнч(ЗаказПокупателя) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ВидДокумента = "ЗаказПокупателя";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяТовары.ЕдиницаИзмерения,
	|	ЗаказПокупателяТовары.ЕдиницаИзмеренияМест,
	|	ЗаказПокупателяТовары.Количество,
	|	ЗаказПокупателяТовары.Коэффициент,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.Размещение,
	|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры,
	|	ЗаказПокупателяТовары.Цена,
	|	ЗаказПокупателяТовары.Ссылка.ВалютаДокумента КАК ВалютаДокумента,";

	Если ВидДокумента = "ЗаказПокупателя" тогда 
		Запрос.Текст = Запрос.Текст + Символы.ПС + 
		"	ВЫБОР КОГДА ЗаказПокупателяТовары.Ссылка.ВалютаДокумента = ЗаказПокупателяТовары.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
		|		ЗаказПокупателяТовары.Ссылка.КурсВзаиморасчетов
		|	ИНАЧЕ
		|		1
		|	КОНЕЦ                                           КАК КурсДокумента,
		|	ВЫБОР КОГДА ЗаказПокупателяТовары.Ссылка.ВалютаДокумента = ЗаказПокупателяТовары.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
		|		ЗаказПокупателяТовары.Ссылка.КратностьВзаиморасчетов
		|	ИНАЧЕ
		|		1
		|	КОНЕЦ                                           КАК КратностьДокумента,
		|	ЗаказПокупателяТовары.Сумма,
		|	ЗаказПокупателяТовары.СтавкаНДС,
		|	ЗаказПокупателяТовары.СуммаНДС,
		|	ЗаказПокупателяТовары.Ссылка.СуммаВключаетНДС	КАК СуммаВключаетНДС,
		|	ЗаказПокупателяТовары.Ссылка.УчитыватьНДС		КАК УчитыватьНДС";
	Иначе
		Запрос.Текст = Запрос.Текст + Символы.ПС + 
		"  ЗаказПокупателяТовары.Ссылка.КурсДокумента      КАК КурсДокумента,
		|  ЗаказПокупателяТовары.Ссылка.КратностьДокумента КАК КратностьДокумента";
	КонецЕсли;

	Запрос.Текст = Запрос.Текст + Символы.ПС + 
	"ИЗ
	|	Документ."+ВидДокумента+".Товары КАК ЗаказПокупателяТовары
	|
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка.Ссылка = &ЗаказПокупателя";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура               = Выборка.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		НоваяСтрока.ЕдиницаИзмерения           = Выборка.ЕдиницаИзмерения;
		НоваяСтрока.ЕдиницаИзмеренияМест       = Выборка.ЕдиницаИзмеренияМест;
		НоваяСтрока.Коэффициент                = Выборка.Коэффициент;
		НоваяСтрока.Количество                 = -Выборка.Количество;
		НоваяСтрока.Размещение                 = Выборка.Размещение;

		Если ВидДокумента = "ЗаказПокупателя" Тогда
			НоваяСтрока.СтавкаНДС = Выборка.СтавкаНДС;

			НоваяСтрока.Сумма = ПересчитатьЦенуПриИзмененииФлаговНалогов(-Выборка.Сумма,
				Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
				Выборка.СуммаВключаетНДС,
				УчитыватьНДС,
				СуммаВключаетНДС,
				ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
			ПриИзмененииСуммыТабЧасти(НоваяСтрока, ЭтотОбъект, глТекущийПользователь);
			РассчитатьКоличествоМестТабЧасти(НоваяСтрока, ЭтотОбъект);
			РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ЭтотОбъект);
		Иначе
			НоваяСтрока.Цена  = Выборка.Цена;
		КонецЕсли;

	КонецЦикла;

	ЗаполнитьПлановуюСебестоимостьНаОсновании(ЭтотОбъект, ЗаказПокупателя, мВалютаРегламентированногоУчета);

КонецПроцедуры // СкопироватьТовары()

// Здесь надо написать текст - описание процедуры
//
// Параметры:
//  Нет.
//
Процедура СкопироватьУслуги() Экспорт

	Если Не ТипЗнч(ЗаказПокупателя) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяУслуги.Количество,
	|	ЗаказПокупателяУслуги.Номенклатура,
	|	ЗаказПокупателяУслуги.Цена,                  
	|	ЗаказПокупателяУслуги.Ссылка.ВалютаДокумента  КАК ВалютаДокумента,
	|	ВЫБОР КОГДА ЗаказПокупателяУслуги.Ссылка.ВалютаДокумента = ЗаказПокупателяУслуги.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		ЗаказПокупателяУслуги.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ КАК КурсДокумента,
	|	ВЫБОР КОГДА ЗаказПокупателяУслуги.Ссылка.ВалютаДокумента = ЗаказПокупателяУслуги.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		ЗаказПокупателяУслуги.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ КАК КратностьДокумента,
	|	ЗаказПокупателяУслуги.Сумма,
	|	ЗаказПокупателяУслуги.СтавкаНДС,
	|	ЗаказПокупателяУслуги.Содержание,
	|	ЗаказПокупателяУслуги.СуммаНДС,
	|	ЗаказПокупателяУслуги.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ЗаказПокупателяУслуги.Ссылка.УчитыватьНДС	  КАК УчитыватьНДС
	|ИЗ
	|	Документ.ЗаказПокупателя.Услуги КАК ЗаказПокупателяУслуги
	|
	|ГДЕ
	|	ЗаказПокупателяУслуги.Ссылка.Ссылка = &ЗаказПокупателя";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Услуги.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		НоваяСтрока.СтавкаНДС    = Выборка.СтавкаНДС;
		НоваяСтрока.Содержание   = Выборка.Содержание;
		НоваяСтрока.Количество   = -Выборка.Количество;

		НоваяСтрока.Сумма = ПересчитатьЦенуПриИзмененииФлаговНалогов(-Выборка.Сумма,
			Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
			Выборка.СуммаВключаетНДС,
			УчитыватьНДС,
			СуммаВключаетНДС,
			ПолучитьСтавкуНДС( НоваяСтрока.СтавкаНДС));
			
		ПриИзмененииСуммыТабЧасти ( НоваяСтрока, ЭтотОбъект, глТекущийПользователь);
		РассчитатьСуммуНДСТабЧасти( НоваяСтрока, ЭтотОбъект);

	КонецЦикла;

КонецПроцедуры // СкопироватьУслуги()

// Здесь надо написать текст - описание процедуры
//
// Параметры:
//  Нет.
//
Процедура СкопироватьВозвратнуюТару() Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяВозвратнаяТара.Количество,
	|	ЗаказПокупателяВозвратнаяТара.Номенклатура,
	|	ЗаказПокупателяВозвратнаяТара.Размещение,
	|	ЗаказПокупателяВозвратнаяТара.Сумма,
	|	ЗаказПокупателяВозвратнаяТара.Цена,
	|	ЗаказПокупателяВозвратнаяТара.Ссылка.ВалютаДокумента	КАК ВалютаДокумента,
	|	ВЫБОР КОГДА ЗаказПокупателяВозвратнаяТара.Ссылка.ВалютаДокумента = ЗаказПокупателяВозвратнаяТара.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		ЗаказПокупателяВозвратнаяТара.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КурсДокумента,
	|	ВЫБОР КОГДА ЗаказПокупателяВозвратнаяТара.Ссылка.ВалютаДокумента = ЗаказПокупателяВозвратнаяТара.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		ЗаказПокупателяВозвратнаяТара.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КратностьДокумента
	|ИЗ
	|	Документ.ЗаказПокупателя.ВозвратнаяТара КАК ЗаказПокупателяВозвратнаяТара
	|
	|ГДЕ
	|	ЗаказПокупателяВозвратнаяТара.Ссылка.Ссылка = &ЗаказПокупателя";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		НоваяСтрока = ВозвратнаяТара.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		НоваяСтрока.Количество = -Выборка.Количество;
		НоваяСтрока.Размещение = Выборка.Размещение;
		НоваяСтрока.Цена  = Выборка.Цена;
		РассчитатьСуммуТабЧасти(НоваяСтрока, ЭтотОбъект);
	КонецЦикла;

КонецПроцедуры // СкопироватьВозвратнуюТару()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// По виду операции определяет статус партии товаров (не возвратная тара!)
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Значение перечисления "Статусы партии товаров".
//
Функция ОпределитьСтатусПартии() 

	Возврат Перечисления.СтатусыПартийТоваров.Купленный;

КонецФункции // ОпределитьСтатусПартииПрихода()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента)

	ТаблицаТоваров = РезультатЗапросаПоТоварам.Выгрузить();

	// Надо добавить колонки "СуммаБезНДС"
	ТаблицаТоваров.Колонки.Добавить("СуммаБезНДС", ПолучитьОписаниеТиповЧисла(15,2));

	// Надо заполнить новые колонки.
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма - 
		                          ?(УчитыватьНДС И СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);
	КонецЦикла;

	// Вызываем отдельные процедуры подготовки для упр. учета
	ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента);
	
	Возврат ТаблицаТоваров;

КонецФункции // ПодготовитьТаблицуТоваров()

// Добавляет в таблицу колонки, необходимые для упр. проведения.
//
Процедура ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента)

	// Надо добавить колонки.
	ТаблицаТоваров.Колонки.Добавить("СуммаВзаиморасчетов", ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаУпр",            ПолучитьОписаниеТиповЧисла(15,2));

	// Надо заполнить новые колонки.
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл

		// Суммы пересчитаем в валюту упр. учета
		СтрокаТаблицы.СуммаБезНДС = ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаБезНДС, СтруктураШапкиДокумента.ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КурсДокумента,
		                                 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КратностьДокумента,
		                                 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

		СтрокаТаблицы.НДС = ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.НДС, СтруктураШапкиДокумента.ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КурсДокумента,
		                                 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КратностьДокумента,
		                                 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
										 
		СуммаСНДС = СтрокаТаблицы.Сумма + ?(УчитыватьНДС И Не СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);

		СтрокаТаблицы.СуммаВзаиморасчетов = ПересчитатьИзВалютыВВалюту(СуммаСНДС, СтруктураШапкиДокумента.ВалютаДокумента, 
														СтруктураШапкиДокумента.ВалютаВзаиморасчетов,
		                        					    СтруктураШапкиДокумента.КурсДокумента,
		        				                        КурсВзаиморасчетов, 
						                                СтруктураШапкиДокумента.КратностьДокумента,
		                                 				КратностьВзаиморасчетов);

		СтрокаТаблицы.СуммаУпр = ПересчитатьИзВалютыВВалюту(СуммаСНДС, СтруктураШапкиДокумента.ВалютаДокумента, 
		                           			      	СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 			СтруктураШапкиДокумента.КурсДокумента,
		                                 			СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
						                 			СтруктураШапкиДокумента.КратностьДокумента,
		                                 			СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

	КонецЦикла;

КонецПроцедуры // ПодготовитьТаблицуТоваровУпр()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоУслугам - результат запроса по табличной части "Услуги",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуУслуг(РезультатЗапросаПоУслугам, СтруктураШапкиДокумента)

	ТаблицаУслуг = РезультатЗапросаПоУслугам.Выгрузить();

	// Надо добавить колонки "СуммаБезНДС".
	ТаблицаУслуг.Колонки.Добавить("СуммаБезНДС", ПолучитьОписаниеТиповЧисла(15,2));

	// Надо заполнить новые колонки.
	Для каждого СтрокаТаблицы Из ТаблицаУслуг Цикл
		СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма - 
		                          ?(УчитыватьНДС И СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);
	КонецЦикла;

	// Вызываем отдельные процедуры подготовки для упр. учета
	ПодготовитьТаблицуУслугУпр(ТаблицаУслуг, СтруктураШапкиДокумента);
	
	Возврат ТаблицаУслуг;

КонецФункции // ПодготовитьТаблицуУслуг()

// Добавляет в таблицу колонки, необходимые для упр. проведения.
//
Процедура ПодготовитьТаблицуУслугУпр(ТаблицаУслуг, СтруктураШапкиДокумента)

	// Надо добавить колонки.
	ТаблицаУслуг.Колонки.Добавить("СуммаВзаиморасчетов", ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаУслуг.Колонки.Добавить("СуммаУпр",            ПолучитьОписаниеТиповЧисла(15,2));

	// Надо заполнить новые колонки.
	Для каждого СтрокаТаблицы Из ТаблицаУслуг Цикл
		
		// Суммы пересчитаем в валюту упр. учета
		СтрокаТаблицы.СуммаБезНДС = ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаБезНДС, СтруктураШапкиДокумента.ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КурсДокумента,
		                                 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КратностьДокумента,
		                                 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

		СтрокаТаблицы.НДС = ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.НДС, СтруктураШапкиДокумента.ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КурсДокумента,
		                                 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КратностьДокумента,
		                                 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
										 
		СуммаСНДС = СтрокаТаблицы.Сумма + ?(УчитыватьНДС И Не СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);

		СтрокаТаблицы.СуммаВзаиморасчетов = ПересчитатьИзВалютыВВалюту(СуммаСНДС, СтруктураШапкиДокумента.ВалютаДокумента, 
														СтруктураШапкиДокумента.ВалютаВзаиморасчетов,
		                        					    СтруктураШапкиДокумента.КурсДокумента,
		        				                        КурсВзаиморасчетов, 
						                                СтруктураШапкиДокумента.КратностьДокумента,
		                                 				КратностьВзаиморасчетов);

		СтрокаТаблицы.СуммаУпр = ПересчитатьИзВалютыВВалюту(СуммаСНДС, СтруктураШапкиДокумента.ВалютаДокумента, 
		                           			      	СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 			СтруктураШапкиДокумента.КурсДокумента,
		                                 			СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
						                 			СтруктураШапкиДокумента.КратностьДокумента,
		                                 			СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

	КонецЦикла;

КонецПроцедуры // ПодготовитьТаблицуУслугУпр()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТаре  - результат запроса по табличной части "ВозвратнаяТара",
//  СтруктураШапкиДокумента - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента)

	ТаблицаТары = РезультатЗапросаПоТаре.Выгрузить();

	// Надо добавить колонки.
	ТаблицаТары.Колонки.Добавить("СуммаБезНДС",                ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТары.Колонки.Добавить("НДС",                        ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТары.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаТары.Колонки.Добавить("СерияНоменклатуры",          Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));

	// Надо заполнить новые колонки.
	Для каждого СтрокаТаблицы Из ТаблицаТары Цикл
		СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма; // Сумма по таре всегда с НДС в валюте взаиморасчетов
	КонецЦикла;

	// Вызываем отдельные процедуры подготовки для упр. учета
	ПодготовитьТаблицуТарыУпр(ТаблицаТары, СтруктураШапкиДокумента);
	
	Возврат ТаблицаТары;

КонецФункции // ПодготовитьТаблицуТары()

// Добавляет в таблицу колонки, необходимые для упр. проведения.
//
Процедура ПодготовитьТаблицуТарыУпр(ТаблицаТары, СтруктураШапкиДокумента)

	// Надо добавить колонки.
	ТаблицаТары.Колонки.Добавить("СуммаВзаиморасчетов", ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТары.Колонки.Добавить("СуммаУпр",            ПолучитьОписаниеТиповЧисла(15,2));

	// Надо заполнить новые колонки.
	Для каждого СтрокаТаблицы Из ТаблицаТары Цикл

		// Суммы пересчитаем в валюту упр. учета
		СтрокаТаблицы.СуммаБезНДС = ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаБезНДС, СтруктураШапкиДокумента.ВалютаДокумента,
		                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КурсДокумента,
		                                 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                 СтруктураШапкиДокумента.КратностьДокумента,
		                                 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

		СтрокаТаблицы.НДС = 0;
		
		СтрокаТаблицы.СуммаВзаиморасчетов = ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Сумма, СтруктураШапкиДокумента.ВалютаДокумента, 
														СтруктураШапкиДокумента.ВалютаВзаиморасчетов,
		                        					    СтруктураШапкиДокумента.КурсДокумента,
		        				                        КурсВзаиморасчетов, 
						                                СтруктураШапкиДокумента.КратностьДокумента,
		                                 				КратностьВзаиморасчетов);

		СтрокаТаблицы.СуммаУпр = ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Сумма, СтруктураШапкиДокумента.ВалютаДокумента, 
		                           			      	СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		                                 			СтруктураШапкиДокумента.КурсДокумента,
		                                 			СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
						                 			СтруктураШапкиДокумента.КратностьДокумента,
		                                 			СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

	КонецЦикла;

КонецПроцедуры // ПодготовитьТаблицуТарыУпр()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = 
	Новый Структура("ЗаказПокупателя");
					

	// Теперь позовем общую процедуру проверки.
	ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

	ПроверитьЗаполнениеШапкиУпр(СтруктураШапкиДокумента, Отказ, Заголовок);

	//Организация в документе должна совпадать с организацией, указанной в договоре взаиморасчетов.
	ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(ЗаказПокупателя.Организация, ЗаказПокупателя.ДоговорКонтрагента, СтруктураШапкиДокумента.ДоговорОрганизация, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения упр. реквизитов шапки
//
Процедура ПроверитьЗаполнениеШапкиУпр(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.НеавтоматизированнаяТорговаяТочка Тогда
		ОшибкаПриПроведении("Документ не может осуществлять заказ с неавтоматизированной торговой точки!", Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапкиУпр()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = 
	Новый Структура("Номенклатура, Количество, Сумма");

	Если УчитыватьНДС Тогда
		СтруктураОбязательныхПолей.Вставить("СтавкаНДС");
	КонецЕсли;

	ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Здесь услуг быть не должно.
	ПроверитьЧтоНетУслуг(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	ПроверитьЧтоНетНаборов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

	// Здесь не должно быть размещений по НТТ
	ПроверитьЧтоСкладНеНТТ(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// Проверяет правильность заполнения строк табличной части "Услуги".
//
// Параметры:
// Параметры: 
//  ТаблицаПоУслугам        - таблица значений, содержащая данные для проведения и проверки ТЧ Услуги
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиУслуги(ТаблицаПоУслугам, СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = 
	Новый Структура("Номенклатура, Количество, Сумма");

	Если УчитыватьНДС Тогда
		СтруктураОбязательныхПолей.Вставить("СтавкаНДС");
	КонецЕсли;

	ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Услуги", СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Здесь товаров быть не должно.
	ПроверитьЧтоНетТоваров(ЭтотОбъект, "Услуги", ТаблицаПоУслугам, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	ПроверитьЧтоНетНаборов(ЭтотОбъект, "Услуги", ТаблицаПоУслугам, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиУслуги()

// Проверяет правильность заполнения строк табличной части "Возвратная тара".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТаре           - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара(ТаблицаПоТаре, СтруктураШапкиДокумента, 
	                                                      Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Количество, Сумма");

	ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ВозвратнаяТара", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Здесь услуг быть не должно.
	ПроверитьЧтоНетУслуг(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	ПроверитьЧтоНетНаборов(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);

	// Здесь не должно быть размещений по НТТ
	ПроверитьЧтоСкладНеНТТ(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);

	// По возвратной таре не должен вестись учет по характеристикам.
	ПроверитьЧтоНетНоменклатурыСХарактеристиками(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, 
	                          ТаблицаПоТоварам, ТаблицаПоУслугам, ТаблицаПоТаре,
	                          Отказ, Заголовок);

	ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоУслугам, 
							ТаблицаПоТаре, Отказ, Заголовок);
							  
	Если СтруктураШапкиДокумента.ОбособленныйУчетТоваровПоЗаказамПокупателей Тогда
								  
		ДвиженияПоРегиструСписанныеТовары(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоУслугам, 
											ТаблицаПоТаре, Отказ, Заголовок);
		
		УчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата);
		
		Если УчетнаяПолитика.СписыватьПартииПриПроведенииДокументов Тогда
			
			ДвижениеПартийТоваров(Ссылка, Движения.СписанныеТовары.Выгрузить());
			
			ЗаписьРегистрации = ПринадлежностьПоследовательностям.ПартионныйУчет.Добавить();
			ЗаписьРегистрации.Период = Дата;
			ЗаписьРегистрации.Регистратор = Ссылка;
			
		Иначе
			
			// В неоперативном режиме границы последовательностей сдвигаются назад, если они позже документа.
			Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
				СдвигГраницыПоследовательностиПартионногоУчетаНазад(Дата, Ссылка, ЗаказПокупателя.Организация, Истина, ЗаказПокупателя.ОтражатьВБухгалтерскомУчете, ЗаказПокупателя.ОтражатьВНалоговомУчете)
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры // ДвиженияПоРегистрам()

// Процедура контролирует превышение объема заказа
//
Процедура КонтрольОстатковПоЗаказу(ИмяТабЧасти, ОТказ, Заголовок)
	
	ЕстьХарактеристика = ЕстьРеквизитТабЧастиДокумента("ХарактеристикаНоменклатуры", Метаданные(), ИмяТабЧасти);
	
	// Текст вложенного запроса, ограничивающего номенклатуру при получении остатков
	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр( "ТекДок", Ссылка);
	Запрос.УстановитьПараметр( "Заказ",  ЗаказПокупателя);
	Запрос.УстановитьПараметр( "СтатусПартии",       Перечисления.СтатусыПартийТоваров.Купленный);
	Запрос.УстановитьПараметр( "МассивНоменклатуры", Ссылка[ИмяТабЧасти].ВыгрузитьКолонку("Номенклатура"));

	Запрос.Текст = "
	|ВЫБРАТЬ // Запрос, контролирующий остатки на складах
	|	Док.Номенклатура.Представление                         КАК НоменклатураПредставление,
	|	Док.Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаХраненияОстатковПредставление,"
	+ ?(ЕстьХарактеристика, "
	|	Док.ХарактеристикаНоменклатуры.Представление           КАК ХарактеристикаНоменклатурыПредставление,"
	,"") + "
	|	СУММА(Док.Количество )                                 КАК ДокументКоличество, 
	|	МАКСИМУМ(ВЫБОР КОГДА Остатки.КоличествоОстаток ЕСТЬ NULL ТОГДА
	|		0
	|	ИНАЧЕ
	|		Остатки.КоличествоОстаток
	|	КОНЕЦ) КАК ОстатокКоличество
	|ИЗ 
	|	Документ.КорректировкаЗаказаПокупателя." + ИмяТабЧасти + " КАК Док
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(, Номенклатура В (&МассивНоменклатуры)
	|												И ЗаказПокупателя = &Заказ
	|												И СтатусПартии    = &СтатусПартии) КАК Остатки
	|ПО 
	|	Док.Номенклатура = Остатки.Номенклатура"
	+ ?(ЕстьХарактеристика, "
	| И Док.ХарактеристикаНоменклатуры  = Остатки.ХарактеристикаНоменклатуры"
	,"") + "
	|
	|ГДЕ
	|	Док.Ссылка  =  &ТекДок
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	Док.Номенклатура"
	+ ?(ЕстьХарактеристика, "
	|	, Док.ХарактеристикаНоменклатуры "
	,"") + "
	|
	|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ЗаказыПокупателей.Остатки // Блокирующие чтение таблицы остатков регистра для разрешения коллизий многопользовательской работы
	|";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		ОстатокКоличество = ?(Выборка.ОстатокКоличество = NULL, 0, Выборка.ОстатокКоличество);

		Если ОстатокКоличество + Выборка.ДокументКоличество < 0 Тогда

			СтрокаСообщения = "Остатка " + 
			ПредставлениеНоменклатуры(Выборка.НоменклатураПредставление, ?(ЕстьХарактеристика, Выборка.ХарактеристикаНоменклатурыПредставление, "")) +
				", заказанного по документу " + (ЗаказПокупателя) + " недостаточно.";

			ОшибкаНетОстатка(
				СтрокаСообщения,
				Выборка.ОстатокКоличество,
				- Выборка.ДокументКоличество,
				Выборка.ЕдиницаХраненияОстатковПредставление,
				Отказ,
				Заголовок);

		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры // КонтрольОстатковПоЗаказу()

// Формируем движения по упр. регистрам.
//
Процедура ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, 
	                          ТаблицаПоТоварам, ТаблицаПоУслугам, ТаблицаПоТаре,
	                          Отказ, Заголовок);

	Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоРасчетнымДокументам Тогда
		
		// Движения по документу.

		НаборДвижений = Движения.РасчетыСКонтрагентами;

		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.Выгрузить();

		// Заполним таблицу движений.
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		СтрокаДвижений.РасчетыВозврат        = Перечисления.РасчетыВозврат.Расчеты;
		СтрокаДвижений.ДоговорКонтрагента = ЗаказПокупателя.ДоговорКонтрагента;
		СтрокаДвижений.Сделка                = ЗаказПокупателя; 
		
		СтрокаДвижений.СуммаВзаиморасчетов   = ПересчитатьИзВалютыВВалюту(СуммаДокумента, СтруктураШапкиДокумента.ВалютаДокумента,
												СтруктураШапкиДокумента.ВалютаВзаиморасчетов,
												СтруктураШапкиДокумента.КурсДокумента, КурсВзаиморасчетов,
												СтруктураШапкиДокумента.КратностьДокумента, КратностьВзаиморасчетов);
		СтрокаДвижений.СуммаУпр              = ПересчитатьИзВалютыВВалюту(СуммаДокумента, СтруктураШапкиДокумента.ВалютаДокумента,
												СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
												СтруктураШапкиДокумента.КурсДокумента, 
												СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
												СтруктураШапкиДокумента.КратностьДокумента, 
												СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.РасчетыСКонтрагентами.ВыполнитьПриход();
		КонецЕсли;
		
	КонецЕсли;

	НаборДвижений = Движения.ЗаказыПокупателей;
	
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		КонтрольОстатковПоЗаказу("Товары", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.Выгрузить();

		// Заполним таблицу движений.
		ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);

		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(ЗаказПокупателя,"ЗаказПокупателя");
		ТаблицаДвижений.ЗаполнитьЗначения(ЗаказПокупателя.ДоговорКонтрагента,"ДоговорКонтрагента");
		ТаблицаДвижений.ЗаполнитьЗначения(ОпределитьСтатусПартии(), "СтатусПартии");

		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		НаборДвижений.мПериод            = Дата;
		Движения.ЗаказыПокупателей.ВыполнитьПриход();

		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.Выгрузить();
		ТаблицаДвижений.Очистить();

		// Заполним таблицу движений.
		ЗагрузитьВТаблицуЗначений(ТаблицаПоУслугам, ТаблицаДвижений);

		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(ЗаказПокупателя,"ЗаказПокупателя");
		ТаблицаДвижений.ЗаполнитьЗначения(ЗаказПокупателя.ДоговорКонтрагента,"ДоговорКонтрагента");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Купленный, "СтатусПартии");

		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		НаборДвижений.мПериод            = Дата;
		Движения.ЗаказыПокупателей.ВыполнитьПриход();

		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.Выгрузить();
		ТаблицаДвижений.Очистить();

		// Заполним таблицу движений.
		ЗагрузитьВТаблицуЗначений(ТаблицаПоТаре, ТаблицаДвижений);

		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(Дата,"Период");
		ТаблицаДвижений.ЗаполнитьЗначения(Истина,"Активность");
		ТаблицаДвижений.ЗаполнитьЗначения(ЗаказПокупателя.ДоговорКонтрагента,"ДоговорКонтрагента");
		ТаблицаДвижений.ЗаполнитьЗначения(ЗаказПокупателя,"ЗаказПокупателя");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ВозвратнаяТара, "СтатусПартии");

		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		НаборДвижений.мПериод            = Дата;
		Движения.ЗаказыПокупателей.ВыполнитьПриход();
		
		ТаблицаПоТоварамРазмещение = ТаблицаПоТоварам.Скопировать();
		Сч = 0;
		Пока Сч < ТаблицаПоТоварамРазмещение.Количество() Цикл
			СтрокаТаблицы = ТаблицаПоТоварамРазмещение.Получить(Сч);
			Если ЗначениеНеЗаполнено(СтрокаТаблицы.Размещение) 
			 или ТипЗнч(СтрокаТаблицы.Размещение) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				 ТаблицаПоТоварамРазмещение.Удалить(СтрокаТаблицы);
			Иначе 
				Сч = Сч + 1;
			КонецЕсли; 
		КонецЦикла;
		
		Если ТаблицаПоТоварамРазмещение.Количество() > 0 Тогда
			
			ТаблицаПоТоварамРазмещение.Колонки.Размещение.Имя = "ЗаказПоставщику";
			
			// По регистру РазмещениеЗаказовПокупателей
			НаборДвижений = Движения.РазмещениеЗаказовПокупателей;
			
			ТаблицаДвижений = НаборДвижений.Выгрузить();
			
			// Заполним таблицу движений.
			ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамРазмещение, ТаблицаДвижений);
			
			ТаблицаДвижений.ЗаполнитьЗначения(ЗаказПокупателя,"ЗаказПокупателя");
			ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.ТоварТара.Товар, "ТоварТара");
			
			
			НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
			НаборДвижений.мПериод            = Дата;
			Движения.РазмещениеЗаказовПокупателей.ВыполнитьПриход();
		
		КонецЕсли;
		
		ТаблицаПоТареРазмещение = ТаблицаПоТаре.Скопировать();
		Сч = 0;
		Пока Сч < ТаблицаПоТареРазмещение.Количество() Цикл
			СтрокаТаблицы = ТаблицаПоТареРазмещение.Получить(Сч);
			Если ЗначениеНеЗаполнено(СтрокаТаблицы.Размещение) 
			 или ТипЗнч(СтрокаТаблицы.Размещение) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				 ТаблицаПоТареРазмещение.Удалить(СтрокаТаблицы);
			Иначе 
				Сч = Сч + 1;
			КонецЕсли; 
		КонецЦикла;
		
		Если ТаблицаПоТареРазмещение.Количество() > 0 Тогда
			
			ТаблицаПоТареРазмещение.Колонки.Размещение.Имя = "ЗаказПоставщику";
			
			// Сначала спишем свободные остатки с по заказу
			// По регистру РазмещениеЗаказовПокупателей
			НаборДвижений = Движения.РазмещениеЗаказовПокупателей;
			
			ТаблицаДвижений = НаборДвижений.Выгрузить();
			
			// Заполним таблицу движений.
			ЗагрузитьВТаблицуЗначений(ТаблицаПоТареРазмещение, ТаблицаДвижений);
			
			ТаблицаДвижений.ЗаполнитьЗначения(ЗаказПокупателя,"ЗаказПокупателя");
			ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.ТоварТара.Товар, "ТоварТара");
			
			
			НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
			НаборДвижений.мПериод            = Дата;
			Движения.РазмещениеЗаказовПокупателей.ВыполнитьПриход();
			
		КонецЕсли;
		
		
		ТаблицаПоТоварамРезервирование = ТаблицаПоТоварам.Скопировать();
		Сч = 0;
		Пока Сч < ТаблицаПоТоварамРезервирование.Количество() Цикл
			СтрокаТаблицы = ТаблицаПоТоварамРезервирование.Получить(Сч);
			Если ЗначениеНеЗаполнено(СтрокаТаблицы.Размещение) 
			 или ТипЗнч(СтрокаТаблицы.Размещение) <> Тип("СправочникСсылка.Склады") Тогда
				 ТаблицаПоТоварамРезервирование.Удалить(СтрокаТаблицы);
			Иначе 
				Сч = Сч + 1;
			КонецЕсли; 
		КонецЦикла;
		
		Инд = 0;
		
		Если ТаблицаПоТоварамРезервирование.Количество() > 0 Тогда
			ТаблицаПоТоварамРезервирование.Колонки.Размещение.Имя = "Склад";
			
			НаборДвижений = Движения.ТоварыВРезервеНаСкладах;
			
			// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
			ТаблицаДвижений = НаборДвижений.Выгрузить();
			
			ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамРезервирование, ТаблицаДвижений);
			ТаблицаДвижений.ЗаполнитьЗначения(ЗаказПокупателя,"ДокументРезерва");

			НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
			НаборДвижений.мПериод            = Дата;
			
			// Проверка осатков при оперативном проведении.
			Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
				НаборДвижений.КонтрольСвободныхОстатков(ЭтотОбъект, "Товары", СтруктураШапкиДокумента, Отказ, Заголовок);
			КонецЕсли;
			
			Движения.ТоварыВРезервеНаСкладах.ВыполнитьПриход();
			
		КонецЕсли;
		
		ТаблицаПоТареРезервирование = ТаблицаПоТаре.Скопировать();
		Сч = 0;
		Пока Сч < ТаблицаПоТареРезервирование.Количество() Цикл
			СтрокаТаблицы = ТаблицаПоТареРезервирование.Получить(Сч);
			Если ЗначениеНеЗаполнено(СтрокаТаблицы.Размещение) 
			 или ТипЗнч(СтрокаТаблицы.Размещение) <> Тип("СправочникСсылка.Склады") Тогда
				 ТаблицаПоТареРезервирование.Удалить(СтрокаТаблицы);
			Иначе 
				Сч = Сч + 1;
			КонецЕсли; 
		КонецЦикла;
		
		Если ТаблицаПоТареРезервирование.Количество() > 0 Тогда
			ТаблицаПоТареРезервирование.Колонки.Размещение.Имя = "Склад";
			
			НаборДвижений = Движения.ТоварыВРезервеНаСкладах;
			
			// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
			ТаблицаДвижений = НаборДвижений.Выгрузить();
			ТаблицаДвижений.Очистить();
			
			ЗагрузитьВТаблицуЗначений(ТаблицаПоТареРезервирование, ТаблицаДвижений);
			ТаблицаДвижений.ЗаполнитьЗначения(ЗаказПокупателя,"ДокументРезерва");

			НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
			НаборДвижений.мПериод            = Дата;
			
			// Проверка осатков при оперативном проведении.
			Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
				НаборДвижений.КонтрольСвободныхОстатков(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок);
			КонецЕсли;
			
			Движения.ТоварыВРезервеНаСкладах.ВыполнитьПриход();
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегистрамУпр()

// Заполняет колонки значениями, нужными для упр. учета
//
Процедура ЗаполнитьКолонкиРегистраСписанныеТоварыПоТоварамУпр(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПоТаре)
	
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Купленный,"ДопустимыйСтатус1");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.НаКомиссию,"ДопустимыйСтатус2");
	ТаблицаДвижений.ЗаполнитьЗначения(ЗаказПокупателя.Подразделение,"Подразделение");
	
	ТаблицаДвижений.ЗаполнитьЗначения(Истина,"ОтражатьВУправленческомУчете");

КонецПроцедуры // ЗаполнитьКолонкиРегистраСписанныеТоварыПоТоварамУпр() 

// Заполняет колонки значениями, нужными для упр. учета
//
Процедура ЗаполнитьКолонкиРегистраСписанныеТоварыПоВозвратнойТареУпр(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПоТаре)
	
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.ВозвратнаяТара,"ДопустимыйСтатус1");
	ТаблицаДвижений.ЗаполнитьЗначения(ЗаказПокупателя.Подразделение,"Подразделение");
	
	ТаблицаДвижений.ЗаполнитьЗначения(Истина,"ОтражатьВУправленческомУчете");
			
КонецПроцедуры // ЗаполнитьКолонкиРегистраСписанныеТоварыПоВозвратнойТареУпр() 

// Формируем движения по регистру СписанныеТовары
//
Процедура ДвиженияПоРегиструСписанныеТовары(РежимПроведения, СтруктураШапкиДокумента, 
				                          ТаблицаПоТоварам, ТаблицаПоУслугам, ТаблицаПоТаре,
											Отказ, Заголовок)
											
	ТаблицаПоТоварамРезервирование = ТаблицаПоТоварам.Скопировать();
	Сч = 0;
	Пока Сч < ТаблицаПоТоварамРезервирование.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТоварамРезервирование.Получить(Сч);
		Если ЗначениеНеЗаполнено(СтрокаТаблицы.Размещение) 
		 или ТипЗнч(СтрокаТаблицы.Размещение) <> Тип("СправочникСсылка.Склады") Тогда
			 ТаблицаПоТоварамРезервирование.Удалить(СтрокаТаблицы);
		Иначе 
			Сч = Сч + 1;
		КонецЕсли; 
	КонецЦикла;
	
	Инд = 0;
			
	Если ТаблицаПоТоварамРезервирование.Количество() > 0 Тогда
		ТаблицаПоТоварамРезервирование.Колонки.Размещение.Имя = "Склад";
		
		// ТОВАРЫ ПО РЕГИСТРУ СписанныеТовары
		Если СтруктураШапкиДокумента.ОбособленныйУчетТоваровПоЗаказамПокупателей Тогда
			
			НаборДвижений = Движения.СписанныеТовары;
			
			// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
			ТаблицаДвижений = НаборДвижений.Выгрузить();
			ТаблицаДвижений.Очистить();
			
			// Заполним таблицу движений.
			ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамРезервирование, ТаблицаДвижений);
			
			// Недостающие поля.
			Инд = 0;
			Для каждого Строка Из ТаблицаДвижений Цикл
				Инд = Инд+1;
				Строка.НомерСтрокиДокумента = Инд;
			КонецЦикла;

			ТаблицаДвижений.ЗаполнитьЗначения(Дата,"Период");
			ТаблицаДвижений.ЗаполнитьЗначения(Истина,"Активность");

			ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.РезервированиеПодЗаказ,"КодОперацииПартииТоваров");

			// Списывать партии можно только по заказу (измерение Заказ - пустое).
			ТаблицаДвижений.ЗаполнитьЗначения(Истина,"СписыватьТолькоПоЗаказу");

			// Заказ, на который списывать партию.
			ТаблицаДвижений.ЗаполнитьЗначения(ЗаказПокупателя,"ЗаказСписания");

			ЗаполнитьКолонкиРегистраСписанныеТоварыПоТоварамУпр(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПоТоварам);

			НаборДвижений.мПериод            = Дата;
			НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

			Если Не Отказ Тогда
				Движения.СписанныеТовары.ВыполнитьДвижения();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаПоТареРезервирование = ТаблицаПоТаре.Скопировать();
	Сч = 0;
	Пока Сч < ТаблицаПоТареРезервирование.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТареРезервирование.Получить(Сч);
		Если ЗначениеНеЗаполнено(СтрокаТаблицы.Размещение) 
		 или ТипЗнч(СтрокаТаблицы.Размещение) <> Тип("СправочникСсылка.Склады") Тогда
			 ТаблицаПоТареРезервирование.Удалить(СтрокаТаблицы);
		Иначе 
			Сч = Сч + 1;
		КонецЕсли; 
	КонецЦикла;
	
	Если ТаблицаПоТареРезервирование.Количество() > 0 Тогда
		ТаблицаПоТареРезервирование.Колонки.Размещение.Имя = "Склад";
				
		// ТАРА ПО РЕГИСТРУ СписанныеТовары.
		Если СтруктураШапкиДокумента.ОбособленныйУчетТоваровПоЗаказамПокупателей Тогда
			
			НаборДвижений = Движения.СписанныеТовары;
			
			// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
			ТаблицаДвижений = НаборДвижений.Выгрузить();
			ТаблицаДвижений.Очистить();
			
			// Заполним таблицу движений.
			ЗагрузитьВТаблицуЗначений(ТаблицаПоТареРезервирование, ТаблицаДвижений);
			
			// Недостающие поля.
			Для каждого Строка Из ТаблицаДвижений Цикл
				Инд = Инд+1;
				Строка.НомерСтрокиДокумента = Инд;
			КонецЦикла;
			
			ТаблицаДвижений.ЗаполнитьЗначения(Дата,"Период");
			ТаблицаДвижений.ЗаполнитьЗначения(Истина,"Активность");
			
			ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.РезервированиеПодЗаказ,"КодОперацииПартииТоваров");
			
			ТаблицаДвижений.ЗаполнитьЗначения(Истина,"СписыватьТолькоПоЗаказу");
			
			ЗаполнитьКолонкиРегистраСписанныеТоварыПоВозвратнойТареУпр(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПоТоварам);
													
			НаборДвижений.мПериод            = Дата;
			НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
			
			Если Не Отказ Тогда
				Движения.СписанныеТовары.ВыполнитьДвижения();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегиструСписанныеТовары()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда

		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);

		ЗаказПокупателя = Основание;

		//+++ 09.04.2013
		Если яштРезервыПоТоварам.ЕстьРезервПоЗаказу(ЗаказПокупателя) тогда
			СообщитьОбОшибке("По заказу: "+строка(ЗаказПокупателя)+" - ведется отгрузка! Корректировка заказа невозможна!");
			возврат;
		КонецЕсли;
		
		СтруктурнаяЕдиница      = Основание.СтруктурнаяЕдиница;
		КурсВзаиморасчетов      = Основание.КурсВзаиморасчетов;
		КратностьВзаиморасчетов = Основание.КратностьВзаиморасчетов;
		
		Если Основание.Проведен Тогда

			// Заполним табличные части неотгруженными товарами по заказу покупателя.
			ЗаполнитьТоварыПоОстаткам();
			ЗаполнитьТаруПоОстаткам();
			ЗаполнитьУслугиПоОстаткам();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
//+++( 16.10.2013 не дадим записать вообще!
	Если не РольДоступна("ПолныеПрава") тогда 
		Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения тогда
			Сообщить("У Вас недостаточно прав для удаления или отмены проведения документа Закрытие заказа!", СтатусСообщения.Внимание);
			Отказ = истина;
		ИначеЕсли РежимЗаписи=РежимЗаписиДокумента.Проведение
			и не (глТекущийПользователь=ЗаказПокупателя.ДоговорКонтрагента.ОтветственноеЛицо
				или глТекущийПользователь=ЗаказПокупателя.Контрагент.ОсновнойМенеджерКонтрагента) тогда
			Сообщить("Вы не должны закрывать чужой Заказ покупателя!", СтатусСообщения.Внимание);
			Отказ = истина;
		КонецЕсли;
	КонецЕсли;
	Если Отказ тогда 
		Возврат;
	КонецЕсли;		
//+++)

	Контрагент = ЗаказПокупателя.Контрагент;
	
	// Если договор с комиссионером, то надо почистить закладку "Услуги".
	Если Услуги.Количество() > 0
	   И ЗаказПокупателя.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда

		Услуги.Очистить();

	КонецЕсли;

	// Проверка заполнения единицы измерения мест и количества мест
	ПриЗаписиПроверитьЕдиницуИзмеренияМест(Товары);

	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = ПолучитьСуммуДокументаСНДС(ЭтотОбъект);

	// Посчитать итоговую сумму плановой себестоимости документа и записать ее в соответствующий реквизит шапки
	ИтогПлановаяСебестоимость = ИтогПлановаяСебестоимость(ЭтотОбъект);

	//+++ 09.04.2013
	Если яштРезервыПоТоварам.ЕстьРезервПоЗаказу(ЗаказПокупателя) тогда
		СообщитьОбОшибке("По заказу: "+строка(ЗаказПокупателя)+" - ведется отгрузка! Корректировка заказа невозможна!");
		Отказ = истина;
	КонецЕсли;

	//+++ 03.10.2013 контроль "-" списания
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение тогда	
		тзТовары = Товары.Выгрузить();
		тзТовары.Свернуть("Номенклатура", "Количество");
		Отказ1 = не ЕстьЗаказанныйТоварПоЗаказу(ЗаказПокупателя, тзТовары, истина);  //корректировки проводятся из формы
		Если не РольДоступна("ПолныеПрава") тогда
			Отказ = Отказ1;
		КонецЕсли;	
	КонецЕсли;   
	
	Если НЕ Отказ Тогда
		обЗаписатьПротоколИзменений(ЭтотОбъект);
	КонецЕсли; 

КонецПроцедуры // ПередЗаписью()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";

	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЗаказПокупателя);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке      = СформироватьДеревоПолейЗапросаПоШапке();
	ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"             , "ВалютаУправленческогоУчета", "ВалютаУправленческогоУчета");
	ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"             , "КурсВалютыУправленческогоУчета"    , "КурсВалютыУправленческогоУчета");
	ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВедениеВзаиморасчетов"             , "ВедениеВзаиморасчетов");
	ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВалютаВзаиморасчетов"              , "ВалютаВзаиморасчетов");
	ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Организация"                       , "ДоговорОрганизация");
	ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"       , "ВестиПартионныйУчетПоСкладам"      , "ВестиПартионныйУчетПоСкладам");
	ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ОбособленныйУчетТоваровПоЗаказамПокупателей", "ОбособленныйУчетТоваровПоЗаказамПокупателей");
	ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Склад"                 , "ВидСклада"                         , "ВидСклада");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = СформироватьЗапросПоДеревуПолей(ЗаказПокупателя, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);

	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Проверим допустимость для пользователя цен документа
	
	//+++ 21.05.2013 - проверяем, но разрешаем проведение по ценам ниже минимальных!
	отказ0 =отказ;
	ПроверитьДопустимостьЦенОтпуска(ЭтотОбъект, "Товары", Отказ);
  	Если ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "РазрешитьЦеныНижеМинимальноРазрешенных") тогда
		отказ=отказ0;
	КонецЕсли;
			
	// Получим необходимые данные для проведения и проверки заполенения данные по табличной части "Товары".
	СтруктураПолей = Новый Структура();
	СтруктураПолей.Вставить("Номенклатура"              , "Номенклатура");
	СтруктураПолей.Вставить("Услуга"                    , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"                     , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Количество"                , "Количество * Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент");
	СтруктураПолей.Вставить("Цена"                      , "Цена");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"          , "ЕдиницаИзмерения");
	СтруктураПолей.Вставить("ПроцентСкидкиНаценки"      , "ПроцентСкидкиНаценки");
	СтруктураПолей.Вставить("ПроцентАвтоматическихСкидок", "ПроцентАвтоматическихСкидок");
	СтруктураПолей.Вставить("УсловиеАвтоматическойСкидки", "УсловиеАвтоматическойСкидки");
	СтруктураПолей.Вставить("ЗначениеУсловияАвтоматическойСкидки", "ЗначениеУсловияАвтоматическойСкидки");
	СтруктураПолей.Вставить("Сумма"                     , "Сумма");
	СтруктураПолей.Вставить("СтавкаНДС"                 , "СтавкаНДС");
	СтруктураПолей.Вставить("НДС"                       , "СуммаНДС");
	СтруктураПолей.Вставить("НомерСтроки"               , "НомерСтроки");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("Размещение"                , "Размещение");
	СтруктураПолей.Вставить("ВидСкладаРазмещения"       , "Размещение.ВидСклада");

	РезультатЗапросаПоТоварам = СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей);

	// Подготовим таблицу товаров для проведения.
	ТаблицаПоТоварам = ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента);

	// Проверим допустимость для пользователя цен документа
	ПроверитьДопустимостьЦенОтпуска(ЭтотОбъект, "Услуги", Отказ);

	// Получим необходимые данные для проведения и проверки заполенения данные по табличной части "Услуги".
	СтруктураПолей = Новый Структура();
	СтруктураПолей.Вставить("Номенклатура"              , "Номенклатура");
	СтруктураПолей.Вставить("Услуга"                    , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"                     , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Количество"                , "Количество");
	СтруктураПолей.Вставить("Цена"                      , "Цена");
	СтруктураПолей.Вставить("ПроцентСкидкиНаценки"      , "ПроцентСкидкиНаценки");
	СтруктураПолей.Вставить("Сумма"                     , "Сумма");
	СтруктураПолей.Вставить("СтавкаНДС"                 , "СтавкаНДС");
	СтруктураПолей.Вставить("НДС"                       , "СуммаНДС");
	СтруктураПолей.Вставить("НомерСтроки"               , "НомерСтроки");

	РезультатЗапросаПоУслугам = СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Услуги", СтруктураПолей);

	// Подготовим таблицу товаров для проведения.
	ТаблицаПоУслугам = ПодготовитьТаблицуУслуг(РезультатЗапросаПоУслугам, СтруктураШапкиДокумента);

	// Получим необходимые данные для проведения и проверки заполенения данные 
	// по табличной части "Возвратная тара".
	СтруктураПолей = Новый Структура();
	СтруктураПолей.Вставить("Номенклатура"              , "Номенклатура");
	СтруктураПолей.Вставить("Услуга"                    , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"                     , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Количество"                , "Количество");
	СтруктураПолей.Вставить("Цена"                      , "Цена");
	СтруктураПолей.Вставить("Сумма"                     , "Сумма");
	СтруктураПолей.Вставить("НомерСтроки"               , "НомерСтроки");
	СтруктураПолей.Вставить("ВестиУчетПоХарактеристикам", "Номенклатура.ВестиУчетПоХарактеристикам");
	СтруктураПолей.Вставить("Размещение"                , "Размещение");
	СтруктураПолей.Вставить("ВидСкладаРазмещения"       , "Размещение.ВидСклада");

	РезультатЗапросаПоТаре = СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ВозвратнаяТара", СтруктураПолей);

	// Подготовим таблицу тары для проведения.
	ТаблицаПоТаре = ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента);

	// Проверить заполнение ТЧ "Товары" и "Возвратная тара".
	ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиУслуги(ТаблицаПоУслугам, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара(ТаблицаПоТаре, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// проверить количество в + после дележки
	
	Если ЗаказПокупателя.Проверен и не РольДоступна("ПолныеПрава")  Тогда
		Запрос=Новый Запрос;
		
		Запрос.Текст="ВЫБРАТЬ Номенклатура,СУММА(Количество) Количество
		|ИЗ 	Документ.КорректировкаЗаказаПокупателя.Товары
		|ГДЕ Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО Номенклатура
		|ИМЕЮЩИЕ СУММА(Количество)>0";
		
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			Сообщить("По номенклатуре " +  Выборка.Номенклатура.Наименование +" Вы  добавили позиции, которые могут оказаться дефицитными. При этом заказ надо будет проделить заново.",СтатусСообщения.Важное);
			Отказ=Истина;
		КонецЕсли;	
	КонецЕсли;

	
	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоУслугам, 
		                    ТаблицаПоТаре, Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события "ПриЗаписи"
//
Процедура ПриЗаписи(Отказ)
	
	// Удаление записей регистрации из всех последовательностей
	Для Каждого НаборЗаписейРегистрацииВПоследовательности Из ПринадлежностьПоследовательностям Цикл
		НаборЗаписейРегистрацииВПоследовательности.Очистить();
	КонецЦикла;
	
КонецПроцедуры

мВалютаРегламентированногоУчета   = Константы.ВалютаРегламентированногоУчета.Получить();
ВалютаДокумента                   = ЗаказПокупателя.ВалютаДокумента;
