Перем ШрифтЖирный,ЦветНоменклатуры,ШрифтНаклонный;

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	РезультатПодключения = ВыполнитьПодключениеКИБПриемнику();
	
	Если РезультатПодключения = Неопределено Тогда
		Предупреждение("Возникли ошибки при подключении к информационной базе-приемнику.");
		Возврат
	КонецЕсли;
	
	ДеревоОтличий = ПолучитьДеревоОтличий();
	НастроитьОтображение(ДеревоОтличий);
КонецПроцедуры

Процедура КоманднаяПанель1НастройкаПодключения(Кнопка)
	ФормаНастройкиПодключения = ПолучитьФорму("ФормаНастройкиПодключения");
	ФормаНастройкиПодключения.Открыть();
КонецПроцедуры

Процедура ПриЗакрытии()
	СтруктураПодключения = Новый Структура;
	
	Для каждого Реквизит Из Метаданные().Реквизиты Цикл
		
		СтруктураПодключения.Вставить(Реквизит.Имя,ЭтотОбъект[Реквизит.Имя]);
	
	КонецЦикла; 
	
	СохранитьЗначение("СтруктураНастройкиПодключения_БП",СтруктураПодключения);
КонецПроцедуры

Процедура ПриОткрытии()
	СтруктураПодключения = ВосстановитьЗначение("СтруктураНастройкиПодключения_БП");
	Если типЗнч(СтруктураПодключения) = Тип("Структура") Тогда
		Для каждого Эл Из СтруктураПодключения Цикл
		
			ЭтотОбъект[Эл.Ключ] = Эл.Значение;
		
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура НастроитьОтображение(Данные)

	ЭлементыФормы.ТабличноеПолеОтличий.Значение = Данные;

КонецПроцедуры

Процедура ТабличноеПолеОтличийПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	ОформлениеСтроки.Ячейки.БП.Видимость = Ложь;
	ОформлениеСтроки.Ячейки.УТ.Видимость = Ложь;
	
	Если ДанныеСтроки.Родитель = Неопределено Тогда
		ОформлениеСтроки.Шрифт = ШрифтЖирный;
		//ОформлениеСтроки.ЦветФона = ЦветНоменклатуры;
	Иначе
		//ОформлениеСтроки.Шрифт = ШрифтНаклонный;
			
	КонецЕсли; 
	
КонецПроцедуры
 
ШрифтЖирный = Новый Шрифт(,,Истина);
ШрифтНаклонный= Новый Шрифт(,,,Истина);
ЦветНоменклатуры = WebЦвета.СветлоЖелтыйЗолотистый;