
Процедура ПриОткрытии()
	Направление = глТекущийПользователь.НаправлениеПродаж; 
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НаправлениеПродаж");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = Направление;

КонецПроцедуры

Процедура НаправлениеПриИзменении(Элемент)
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НаправлениеПродаж");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = Направление;

КонецПроцедуры

Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
