
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Таблица = Новый ТаблицаЗначений;
	
	Для Каждого Колонка Из Результат.Колонки Цикл
		Таблица.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Для Каждого СтрокаДерева Из Результат.Строки Цикл
		Для каждого стр11 из СтрокаДерева.Строки Цикл
			Если стр11.Изменен Тогда
				ЗаполнитьЗначенияСвойств(Таблица.Добавить(), стр11);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТабДокументов = Таблица.Скопировать();
    ТабДокументов.Свернуть("Документ");
	
	Для каждого стр из ТабДокументов цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Документ",стр.Документ);
		
		ПоГрузчикам = Таблица.Скопировать(Отбор);
		
		докментОбъект = Стр.документ.получитьОбъект();
		
		для каждого стр11 из ПоГрузчикам Цикл
			докментОбъект.ДанныеПоПогрузке[стр11.НомерСтроки-1].Вес = стр11.Вес;	
		КонецЦикла;
		
		докментОбъект.Комментарий = докментОбъект.Комментарий + "    // 542 обр. " + Строка(ТекущаяДата()) + ";" +  глТекущийПользователь.Наименование;
		
		докментОбъект.Записать(,РежимПроведенияДокумента.Неоперативный);
	
	КонецЦикла;
	
	Для Каждого СтрокаДерева Из Результат.Строки Цикл
		Для каждого стр11 из СтрокаДерева.Строки Цикл
			Если стр11.Изменен Тогда
				стр11.изменен = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

    
КонецПроцедуры

Процедура КоманднаяПанель1Сформировать(Кнопка)
	если ЗначениеНеЗаполнено(Начало) или ЗначениеНеЗаполнено(Конец) Тогда
		Сообщить("Запоните период!!!");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Начало",НачалоДня(Начало));
	Запрос.УстановитьПараметр("Конец",КонецДня(Конец));
	Запрос.УстановитьПараметр("Подразделение",?(ЗначениеЗаполнено(глТекущийПользователь.ОсновноеПодразделение),глТекущийПользователь.ОсновноеПодразделение,Справочники.Подразделения.НайтиПоКоду("00005")));
		Запрос.Текст = "ВЫБРАТЬ
		               |	РеализацияТоваровУслугДанныеПоПогрузке.Ссылка КАК Документ,
		               |	РеализацияТоваровУслугДанныеПоПогрузке.НомерСтроки,
		               |	РеализацияТоваровУслугДанныеПоПогрузке.Грузчик,
		               |	РеализацияТоваровУслугДанныеПоПогрузке.Вес,
		               |	РеализацияТоваровУслугДанныеПоПогрузке.Ссылка.Дата КАК Дата,
		               |	РеализацияТоваровУслугДанныеПоПогрузке.Ссылка.ОбщийВес,
		               |	ЛОЖЬ КАК Изменен
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг.ДанныеПоПогрузке КАК РеализацияТоваровУслугДанныеПоПогрузке
		               |ГДЕ
		               |	РеализацияТоваровУслугДанныеПоПогрузке.Ссылка.Дата МЕЖДУ &Начало И &Конец
		               |	И РеализацияТоваровУслугДанныеПоПогрузке.Ссылка.Подразделение = &Подразделение
		               |	И РеализацияТоваровУслугДанныеПоПогрузке.Ссылка.Проведен = ИСТИНА
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПоступлениеТоваровУслугДанныеПоПогрузке.Ссылка,
		               |	ПоступлениеТоваровУслугДанныеПоПогрузке.НомерСтроки,
		               |	ПоступлениеТоваровУслугДанныеПоПогрузке.Грузчик,
		               |	ПоступлениеТоваровУслугДанныеПоПогрузке.Вес,
		               |	ПоступлениеТоваровУслугДанныеПоПогрузке.Ссылка.Дата,
		               |	ПоступлениеТоваровУслугДанныеПоПогрузке.Ссылка.ОбщийВес,
		               |	ЛОЖЬ
		               |ИЗ
		               |	Документ.ПоступлениеТоваровУслуг.ДанныеПоПогрузке КАК ПоступлениеТоваровУслугДанныеПоПогрузке
		               |ГДЕ
		               |	ПоступлениеТоваровУслугДанныеПоПогрузке.Ссылка.Дата МЕЖДУ &Начало И &Конец
		               |	И ПоступлениеТоваровУслугДанныеПоПогрузке.Ссылка.Подразделение = &Подразделение
		               |	И ПоступлениеТоваровУслугДанныеПоПогрузке.Ссылка.Проведен = ИСТИНА
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПеремещениеТоваровДанныеПоПогрузке.Ссылка,
		               |	ПеремещениеТоваровДанныеПоПогрузке.НомерСтроки,
		               |	ПеремещениеТоваровДанныеПоПогрузке.Грузчик,
		               |	ПеремещениеТоваровДанныеПоПогрузке.Вес,
		               |	ПеремещениеТоваровДанныеПоПогрузке.Ссылка.Дата,
		               |	ПеремещениеТоваровДанныеПоПогрузке.Ссылка.ОбщийВес,
		               |	ЛОЖЬ
		               |ИЗ
		               |	Документ.ПеремещениеТоваров.ДанныеПоПогрузке КАК ПеремещениеТоваровДанныеПоПогрузке
		               |ГДЕ
		               |	ПеремещениеТоваровДанныеПоПогрузке.Ссылка.Дата МЕЖДУ &Начало И &Конец
		               |	И ПеремещениеТоваровДанныеПоПогрузке.Ссылка.Подразделение = &Подразделение
		               |	И ПеремещениеТоваровДанныеПоПогрузке.Ссылка.Проведен = ИСТИНА
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата
		               |ИТОГИ ПО
		               |	Документ";
				   
  СтруктураКолонокРезультата = Новый Структура();
	Для каждого Колонка Из ЭлементыФормы.Результат.Колонки Цикл
		СтруктураКолонокРезультата.Вставить(Колонка.Имя, Колонка);
	КонецЦикла;				   
				   
  Результат.Строки.Очистить();
  Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
  Итератор = 0;
	Пока Итератор < ЭлементыФормы.Результат.Колонки.Количество() Цикл
		КолонкаДляИзмененияСвойств = ЭлементыФормы.Результат.Колонки.Получить(Итератор);
		Колонка = Неопределено;
		Если СтруктураКолонокРезультата.Свойство(КолонкаДляИзмененияСвойств.Имя, Колонка) Тогда
			ЗаполнитьЗначенияСвойств(КолонкаДляИзмененияСвойств, Колонка);
		Иначе
			ЭлементыФормы.Результат.Колонки.Удалить(КолонкаДляИзмененияСвойств);
			Итератор = Итератор - 1;
		КонецЕсли;
		Итератор = Итератор + 1;
    КонецЦикла;
КонецПроцедуры

Процедура ПриОткрытии()
	Начало = ТекущаяДата();
	Конец = ТекущаяДата();
КонецПроцедуры

Процедура РезультатВесПриИзменении(Элемент)
	ЭлементыФормы.результат.текущиеданные.Изменен  =Истина;
КонецПроцедуры


Процедура РезультатПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	оформлениеСтроки.Ячейки.Изменен.ОтображатьТекст = Ложь;

	Если ДанныеСтроки.Строки.Количество() > 0 Тогда
	
		ОформлениеСтроки.ЦветФона = Новый Цвет(205, 209, 197);
		ОформлениеСтроки.Ячейки.Изменен.ОтображатьФлажок = Ложь;
		ОформлениеСтроки.Ячейки.Изменен.Флажок = Ложь;
	Иначе
		ОформлениеСтроки.Ячейки.Изменен.ОтображатьФлажок = Истина;
		ОформлениеСтроки.Ячейки.Изменен.Флажок = ДанныеСтроки.Изменен;
	КонецЕсли;
КонецПроцедуры


Процедура Кнопка1Нажатие(Элемент)
	Если (НачалоДня(ТекущаяДата()) - НачалоДня(Начало)) > 24*60*60*3 Тогда
		Возврат;
	Иначе
	    Начало = Начало-60*60*24;
	    Конец = Конец-60*60*24;
    КонецЕсли;
КонецПроцедуры


Процедура Кнопка2Нажатие(Элемент)
	Начало = Начало+60*60*24;
	Конец = Конец+60*60*24;
КонецПроцедуры

