
Процедура КнопкаВыполнитьНажатие(Кнопка)

		ТабДок = ПолучитьФорму().ЭлементыФормы.ПолеТабличногоДокумента1;
	Макет = ПолучитьМакет("Макет");
	ОбластьЗаголовок				 			   = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы					           = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока							 	   = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Очистить();
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ОбластьЗаголовок.Параметры.Заголовок = "Реестр заказов для передачи в DPD ";// + Строка(Лев(ТекущаяДата(),10));
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);

	
	
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Документ,
		|	ЗаказПокупателя.Контрагент,
		|	ЗаказПокупателя.ДоговорКонтрагента,
		|	ЗаказПокупателя.СуммаДокумента,
		|	ЗаказПокупателя.СтатусДПД,
		|	ЗаказПокупателя.Комментарий,
		|	ЗаказПокупателя.ДоговорКонтрагента.ОтветственноеЛицо КАК Менеджер
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И ЗаказПокупателя.TerminalОтгрузкаТранспортнойКомпанией = ИСТИНА";

	Запрос.УстановитьПараметр("ДатаКон", КонецДня(КонПериода));
	Запрос.УстановитьПараметр("ДатаНач", НачПериода);
	Если не рольдоступна("ПолныеПрава") Тогда
		Запрос.Текст=Запрос.Текст+" И ЗаказПокупателя.ДоговорКонтрагента.ОтветственноеЛицо В(&Список)";	
		группа = ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ГруппаПользователейДляРаспределенияЗаказов");
		СписокПользователей = новый СписокЗначений;
		Если группа<>неопределено и группа<>справочники.ГруппыПользователей.ПустаяСсылка() тогда
			для каждого стр1 из группа.ПользователиГруппы цикл
				СписокПользователей.Добавить(стр1.Пользователь);
			КонецЦикла;
		Иначе //только по себе!
			СписокПользователей.Добавить(ПараметрыСеанса.ТекущийПользователь);
		КонецЕсли;
		Запрос.УстановитьПараметр("Список", СписокПользователей);
	Конецесли;

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		    ОбластьСтрока.Параметры.Заполнить(Выборка);	
            Областьстрока.Параметры.Сканы ="нет вложений";
		 	НТТР = Новый HTTPСоединение("terminal.yst.ru");
           	ПутьКСканам = "/DocumentImagesShow/GetImagesByDocGuid?guid=" +строка(Выборка.Документ.УникальныйИдентификатор() ); ;
			HTTPЗапрос = Новый HTTPЗапрос(ПутьКСканам);
				
				Попытка
					НТТРОтвет = НТТР.Получить(HTTPЗапрос);
					Если НТТРОтвет.КодСостояния = 200 Тогда
                      Областьстрока.Параметры.Сканы = "http://terminal.yst.ru/DocumentImagesShow/GetImagesByDocGuid?guid=" +строка(Выборка.Документ.УникальныйИдентификатор() );
					конецЕсли;
				исключение
				конецПопытки;	
		
		   	ТабДок.Вывести(ОбластьСтрока);

	КонецЦикла;
     	ЭлементыФормы.ПолеТабличногоДокумента1.ТолькоПросмотр = Истина;

	
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

Процедура ПолеТабличногоДокумента1ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	стандартнаяОбработка = Ложь;
	если Расшифровка<> "нет вложений" тогда
	ЗапуститьПриложение(Расшифровка);
	конецЕсли;
КонецПроцедуры

Процедура ПриОткрытии()
	НачПериода =  НачалоДня(ДобавитьМесяц(ТекущаяДата(),-1));
	конПериода =  ТекущаяДата();
	КнопкаВыполнитьНажатие(Истина);
КонецПроцедуры
