
функция НайтиРеализацию(док) // последнюю реализацию по Заказу
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	               |	РеализацияТоваровУслуг.Ссылка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Сделка = &Сделка
	               |	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
	               |	И РеализацияТоваровУслуг.Проведен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеализацияТоваровУслуг.Дата УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Сделка", док);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() тогда
		 рез = выборка.Ссылка;
	 иначе
		 рез = документы.РеализацияТоваровУслуг.ПустаяСсылка();
	КонецЕсли;
	
	возврат рез;
	
КонецФункции	



функция НайтиСпецификацию(док)
		Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	               |	Спецификация.Ссылка
	               |ИЗ
	               |	Документ.Спецификация КАК Спецификация
	               |ГДЕ
	               |	Спецификация.ДокументОснование = &Сделка
	               |	И НЕ Спецификация.ПометкаУдаления
	             //  |	И Спецификация.Проведен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Спецификация.Дата УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Сделка", док);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() тогда
		 рез = выборка.Ссылка;
	 иначе
		 рез = документы.Спецификация.ПустаяСсылка();
	КонецЕсли;
	
	возврат рез;
КонецФункции	


Процедура ПриОткрытии()
		
	ТабличноеПоле2.Очистить();
	стр1 = ТабличноеПоле2.Добавить();
	стр1.Флаг = истина;
	стр1.ПечатнаяФорма = "Счет на оплату";
	стр1.ИмяМакета = "Счет";
	стр1.КолЭкз = 1;
	стр1.Документ = СсылкаНаОбъект;
		 
	стр1 = ТабличноеПоле2.Добавить();
	стр1.Флаг = истина;
	стр1.ПечатнаяФорма = "Заказ покупателя Евротранс";
	стр1.ИмяМакета = Справочники.ДополнительныеПечатныеФормы.НайтиПоНаименованию(стр1.ПечатнаяФорма);
	стр1.КолЭкз = 4;
	стр1.документ = СсылкаНаОбъект;   // из Этой обработки!!!
	
	стр1 = ТабличноеПоле2.Добавить();
	стр1.Флаг = истина;
	стр1.ПечатнаяФорма = "Заказ покупателя Евротранс Объединенный";
	стр1.ИмяМакета = Справочники.ДополнительныеПечатныеФормы.НайтиПоНаименованию(стр1.ПечатнаяФорма);
	стр1.КолЭкз = 1;
	стр1.документ = СсылкаНаОбъект;   
	
	
	стр1 = ТабличноеПоле2.Добавить();
	стр1.ПечатнаяФорма = "ТОРГ-12 (Яршинторг).";
	стр1.ИмяМакета = Справочники.ДополнительныеПечатныеФормы.НайтиПоНаименованию(стр1.ПечатнаяФорма);
	стр1.КолЭкз = 2;
	РеализацияПоОбъекту = НайтиРеализацию(СсылкаНаОбъект);
	стр1.Флаг = НЕ РеализацияПоОбъекту.пустая();
	стр1.Документ = РеализацияПоОбъекту;
	
	стр1 = ТабличноеПоле2.Добавить();
	стр1.ПечатнаяФорма = "Спецификация - новая форма";
	стр1.ИмяМакета = Справочники.ДополнительныеПечатныеФормы.НайтиПоНаименованию(стр1.ПечатнаяФорма);
	стр1.КолЭкз = 1;
	СпецификацияПоОбъекту = НайтиСпецификацию(РеализацияПоОбъекту);
	стр1.Флаг = НЕ СпецификацияПоОбъекту.пустая();
	стр1.Документ = СпецификацияПоОбъекту;

КонецПроцедуры

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Если не СсылкаНаОбъект.Пустая() тогда
		обЗаказ = СсылкаНаОбъект.ПолучитьОбъект();
		для каждого стр1 из ТабличноеПоле2 цикл
			если стр1.Флаг тогда
				если стр1.Документ.Пустая() тогда
					сообщить("Нет Реализации, поэтому нельзя напечатать "+строка(стр1.КолЭкз)+"экз. '"+стр1.ПечатнаяФорма+"' без документа!", СтатусСообщения.Внимание);
				иначе	 
					обДок = стр1.Документ.ПолучитьОбъект();	 
					обДок.Печать(стр1.ИмяМакета, стр1.КолЭкз, СразуНаПринтер);
					сообщить(?(СразуНаПринтер, "Отправлена на принтер","Сформировано")+" "+строка(стр1.КолЭкз)+"экз. '"+стр1.ПечатнаяФорма+"'", СтатусСообщения.Информация);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	 
	КонецЕсли;
	
КонецПроцедуры

  

//==================================================================
Процедура Отметки(число1, вар=2)
	
	табл = ТабличноеПоле2;
	
	Для каждого стр1 из табл Цикл
		 стр1.Флаг = ?(число1=1, TRUE, ?(число1=0, FALSE,  НЕ стр1.Флаг) );
		 Если стр1.Флаг и НЕ стр1.ЗаказПокупателя.Проверен тогда  //отмечен непроделенный заказ!
			Сообщить("Нельзя отмечать непроделенный заказ! "+строка(стр1.ЗаказПокупателя)+" - выключен!", СтатусСообщения.Внимание);
			стр1.Флаг = ЛОЖЬ;
		 КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

Процедура КоманднаяПанель2ВыбратьВсе(Кнопка)
	Отметки(1);
КонецПроцедуры

Процедура КоманднаяПанель2ОтменитьВсе(Кнопка)
	Отметки(0);
КонецПроцедуры

Процедура КоманднаяПанель2ИзменитьВсе(Кнопка)
	Отметки(-1); //наоборот
КонецПроцедуры


Процедура КоманднаяПанель3ВыбратьВсе(Кнопка)
	Отметки(1, "ТабличноеПоле2");
КонецПроцедуры

Процедура КоманднаяПанель3ОтменитьВсе(Кнопка)
	Отметки(0, "ТабличноеПоле2");
КонецПроцедуры

Процедура КоманднаяПанель3ИзменитьВсе(Кнопка)
	Отметки(-1,"ТабличноеПоле2");
КонецПроцедуры
