
Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
	
	ДатаНачала = НачПериода;
	ДатаОкончания = КонецДня(КонПериода);
	
КонецПроцедуры

Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура РезультатВыбор(Элемент, Область, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура НачПериодаПриИзменении(Элемент)
	ДатаНачала = НачПериода;
КонецПроцедуры

Процедура КонПериодаПриИзменении(Элемент)
	ДатаОкончания = КонецДня(КонПериода);
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если  СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код) = "Марешева И.Г."            Или 
		СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код) = "Серков"                     Или
		СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код) = "Лигута А.С.(руководитель)"  Или
		СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код) = "Лигута А.С."                Или
		СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код) = "Красюк Н.В.(руководитель)"  Или
		СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код) = "Бармин В.В. (Руководитель)" Или
		СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код) = "Марешева (Новый)"           Или
		
		СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код) = "Адиянов А."    Тогда 
		Отказ = Ложь;
	Иначе 
		Отказ = Истина;
	КонецЕсли;	
		

КонецПроцедуры


Процедура СуммаРыночнаяПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

