
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	соответствие = Новый Соответствие;
	соответствие.Вставить(Справочники.Подразделения.НайтиПоКоду("00112"),"Филиал ЗАО ТК ""Яршинторг"" г.Санкт-Петербург"); //Питер
	соответствие.Вставить(Справочники.Подразделения.НайтиПоКоду("00138"),"Обособленное подразд. ЗАО ТК ""ЯШТ"" г. Екатеринбург");   //Екат
	//соответствие.Вставить(Справочники.Подразделения.НайтиПоКоду("00133"),Справочники.Контрагенты.НайтиПоКоду("93870"));   //МСК
	соответствие.Вставить(Справочники.Подразделения.НайтиПоКоду("00106"),"Филиал ЗАО ТК ""Яршинторг"" г. Ростов-на-Дону");   //РОстов	
	
	соответствие2 = Новый Соответствие;
	соответствие2.Вставить(Справочники.Подразделения.НайтиПоКоду("00112"),"%Петербург%"); //Питер
	соответствие2.Вставить(Справочники.Подразделения.НайтиПоКоду("00138"),"%Екатеринбург%;");   //Екат
	//соответствие.Вставить(Справочники.Подразделения.НайтиПоКоду("00133"),Справочники.Контрагенты.НайтиПоКоду("93870"));   //МСК
	соответствие2.Вставить(Справочники.Подразделения.НайтиПоКоду("00106"),"%Ростов на Дону%;");   //РОстов	
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Контрагент1"));
    Если Параметр <> Неопределено Тогда
  	  Параметр.Значение = соответствие.Получить(Подразделение);
  	  Параметр.Использование = Истина;
    КонецЕсли;
  
    Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Контрагент2"));
    Если Параметр <> Неопределено Тогда
  	  Параметр.Значение = соответствие2.Получить(Подразделение);
  	  Параметр.Использование = Истина;
    КонецЕсли;

    
    
    
    Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Дата1"));
    Если Параметр <> Неопределено Тогда
  	  Параметр.Значение = ДатаС;
  	  Параметр.Использование = Истина;
    КонецЕсли;
  
   Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Дата2"));
    Если Параметр <> Неопределено Тогда
  	  Параметр.Значение = ДатаПо;
  	  Параметр.Использование = Истина;
    КонецЕсли;

КонецПроцедуры
