
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Константы.КурсUSD.Установить(ПолеВвода1);
	
	Константы.Фрахт.Установить(ФРАХТ);

	Предупреждение("Установлен новый курс USD: "+строка( ПолеВвода1 )+"
				   |Установлен новая сумма ФРАХТ: "+строка(ФРАХТ) );
	
КонецПроцедуры

Процедура ПриОткрытии()
	ПолеВвода1 = константы.КурсUSD.Получить();
	
	    ВалютаДокумента = справочники.Валюты.НайтиПоКоду("840");
		СтруктураВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("Валюта", ВалютаДокумента));
		ПолеВвода2      = СтруктураВалюты.Курс;
		
	ФРАХТ = Константы.Фрахт.Получить();
КонецПроцедуры

Процедура ПолеВвода1Регулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ПолеВвода1 = ПолеВвода1 + Направление*0.0001;
КонецПроцедуры
