Перем ТекущиеДанные;

Функция СоздатьСтруктуру()
	Тест = Новый Структура;
	Тест.Вставить("Описание", ЭлементыФормы.ОписаниеТеста.ПолучитьТекст());
	Тест.Вставить("ПередЗаполнением", ЭлементыФормы.ПТДПередЗаполнением.ПолучитьТекст());
	Тест.Вставить("ПередЗаписью", ЭлементыФормы.ПТДПередЗаписью.ПолучитьТекст());
	Тест.Вставить("ПослеЗаписи", ЭлементыФормы.ПТДПослеЗаписи.ПолучитьТекст());
	Тест.Вставить("Объект", Документ);
	Тест.Вставить("Форма", ФормаДляЗаполнения);
	Тест.Вставить("Реквизиты", Реквизиты);
	Тест.Вставить("ТабличныеЧасти", ТабличныеЧасти);
	Тест.Вставить("ОшибкаЕслиЗаписан", ОшибкаЕслиЗаписан);
	Тест.Вставить("Параметры", Параметры);
	Тест.Вставить("ФормаРедактирования", "Документ_Запись");
	Возврат Тест;
КонецФункции

Процедура ЗаполнитьИзСтруктуры(Тест) Экспорт 
	Если Тест.Свойство("Описание") Тогда
		ЭлементыФормы.ОписаниеТеста.УстановитьТекст(Тест.Описание);
	КонецЕсли;
	
	Если Тест.Свойство("Объект") Тогда
		Документ = Тест.Объект;
		ДокументПриИзменении(ЭлементыФормы.Документ);
	КонецЕсли;
	
	Если Тест.Свойство("Форма") Тогда
		СписокВыбора = ЭлементыФормы.ФормаДляЗаполнения.СписокВыбора;
		СписокВыбора.Очистить();
		МД = Документ.ПривестиЗначение().Метаданные();
		Для Каждого МФорма ИЗ МД.Формы Цикл
			СписокВыбора.Добавить(МФорма.Имя, МФорма.Синоним);
		КонецЦикла;
		
		ФормаДляЗаполнения = Тест.Форма;
	КонецЕсли;
	
	Если Тест.Свойство("Реквизиты") Тогда
		Реквизиты = Тест.Реквизиты;
	КонецЕсли;
	
	Если Тест.Свойство("ТабличныеЧасти") Тогда
		ТабличныеЧасти = Тест.ТабличныеЧасти;
	КонецЕсли;
	
	Если Тест.Свойство("Параметры") Тогда
		Параметры = Тест.Параметры;
	КонецЕсли;
	
	Если Тест.Свойство("ПередЗаполнением") Тогда
		ЭлементыФормы.ПТДПередЗаполнением.УстановитьТекст(Тест.ПередЗаполнением);
	КонецЕсли;
	
	Если Тест.Свойство("ПослеЗаписи") Тогда
		ЭлементыФормы.ПТДПослеЗаписи.УстановитьТекст(Тест.ПослеЗаписи);
	КонецЕсли;
	
	Если Тест.Свойство("ПередЗаписью") Тогда
		ЭлементыФормы.ПТДПередЗаписью.УстановитьТекст(Тест.ПередЗаписью);
	КонецЕсли;
	
	Если Тест.Свойство("ОшибкаЕслиЗаписан") Тогда
		ОшибкаЕслиЗаписан = Тест.ОшибкаЕслиЗаписан;
	КонецЕсли;
КонецПроцедуры
	
Процедура ДокументНачалоВыбора(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	СписокЗначений = Новый СписокЗначений;
	Для Каждого МДокумент Из Метаданные.Документы Цикл
		СписокЗначений.Добавить(МДокумент.Имя, МДокумент.Синоним);
	КонецЦикла;
	ВыбЭлемент =  СписокЗначений.ВыбратьЭлемент();
	Если ВыбЭлемент <> Неопределено Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("ДокументСсылка." + ВыбЭлемент.Значение));
		Документ = Новый ОписаниеТипов(Массив);
		ДокументПриИзменении(Элемент);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДокументПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ЭлементыФормы.НадписьФорма.Видимость = ЗначениеЗаполнено(Документ);
	ЭлементыФормы.ФормаДляЗаполнения.Видимость = ЭлементыФормы.НадписьФорма.Видимость;
	Реквизиты.Очистить();
	МД = Документ.ПривестиЗначение().Метаданные();
	Для Каждого Реквизит Из МД.СтандартныеРеквизиты Цикл
		Строка = Реквизиты.Добавить();
		Строка.Имя = Реквизит.Имя;
		Строка.Синоним = ?(ПустаяСтрока(Реквизит.Синоним),Реквизит.Имя,Реквизит.Синоним);
		Строка.Тип = Реквизит.Тип;
		Строка.Вычислять = Ложь;
		Строка.Значение = Реквизит.Тип.ПривестиЗначение();
	КонецЦикла;
	
	Для Каждого Реквизит Из МД.Реквизиты Цикл
		Строка = Реквизиты.Добавить();
		Строка.Имя = Реквизит.Имя;
		Строка.Синоним = ?(ПустаяСтрока(Реквизит.Синоним),Реквизит.Имя,Реквизит.Синоним);
		Строка.Тип = Реквизит.Тип;
		Строка.Вычислять = Ложь;
		Строка.Значение = Реквизит.Тип.ПривестиЗначение();
	КонецЦикла;
	
	ТабличныеЧасти.Строки.Очистить();
	
	Для Каждого ТЧ Из МД.ТабличныеЧасти Цикл
		СтрокаТЧ = ТабличныеЧасти.Строки.Добавить();
		СтрокаТЧ.Имя = ТЧ.Имя;
		СтрокаТЧ.Синоним = ?(ПустаяСтрока(ТЧ.Синоним),ТЧ.Имя,ТЧ.Синоним);

		//Строка.Тип = Реквизит.Тип;
		СтрокаТЧ.Вычислять = Ложь;
		//Строка.Значение = Реквизит.Тип.ПривестиЗначение();
		Для Каждого Реквизит Из ТЧ.Реквизиты Цикл
			Строка = СтрокаТЧ.Строки.Добавить();
			Строка.Имя = Реквизит.Имя;
			Строка.Синоним = ?(ПустаяСтрока(Реквизит.Синоним),Реквизит.Имя,Реквизит.Синоним);
			Строка.Тип = Реквизит.Тип;
			Строка.Вычислять = Ложь;
			Строка.Значение = Реквизит.Тип.ПривестиЗначение();
		КонецЦикла;
		СоздатьТаблицуДляЗаполнения(СтрокаТЧ);
	КонецЦикла;
КонецПроцедуры

Процедура ФормаДляЗаполненияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Элемент.СписокВыбора.Очистить();
	МД = Документ.ПривестиЗначение().Метаданные();
	Для Каждого МФорма ИЗ МД.Формы Цикл
		Элемент.СписокВыбора.Добавить(МФорма.Имя, МФорма.Синоним);
	КонецЦикла;
КонецПроцедуры

Процедура ТабличныеЧастиПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
	ТекСтрока = Элемент.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Если ТекущиеДанные = Неопределено Тогда
			ТекущиеДанные = ТекСтрока;
		КонецЕсли;
		Если ТекущиеДанные <> ТекСтрока Тогда 
			Если ТекущиеДанные <> Неопределено Тогда
				Если ТекущиеДанные.Родитель = Неопределено Тогда
					Если ТекущиеДанные.Вычислять Тогда
						ТекущиеДанные.Значение = ЭлементыФормы.Запрос.ПолучитьТекст();
					Иначе
						ТекущиеДанные.Значение = ЗначениеВСтрокуВнутр(Таблица);
					КонецЕсли;
				Иначе 
					Если ТекущиеДанные.Родитель.Вычислять Тогда
						ТекущиеДанные.Родитель.Значение = ЭлементыФормы.Запрос.ПолучитьТекст();
					Иначе
						ТекущиеДанные.Родитель.Значение = ЗначениеВСтрокуВнутр(Таблица);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ТекущиеДанные = ТекСтрока;
			
			Если ТекущиеДанные <> Неопределено Тогда
				Если ТекущиеДанные.Родитель = Неопределено Тогда
					Если ТекущиеДанные.Вычислять Тогда
						ЭлементыФормы.Запрос.УстановитьТекст(ТекущиеДанные.Значение);
					Иначе
						Таблица = ЗначениеИзСтрокиВнутр(ТекущиеДанные.Значение);
						ЭлементыФормы.Таблица.СоздатьКолонки();
					КонецЕсли;
				Иначе 
					Если ТекущиеДанные.Родитель.Вычислять Тогда
						ЭлементыФормы.Запрос.УстановитьТекст(ТекущиеДанные.Родитель.Значение);
					Иначе
						Таблица = ЗначениеИзСтрокиВнутр(ТекущиеДанные.Родитель.Значение);
						ЭлементыФормы.Таблица.СоздатьКолонки();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Вычислять = ?(ТекущиеДанные.Родитель = Неопределено, ТекущиеДанные.Вычислять,ТекущиеДанные.Родитель.Вычислять); 
		
		ЭлементыФормы.Таблица.Видимость = Не Вычислять;
		ЭлементыФормы.КоманднаяПанель3.Видимость = Не Вычислять;
		ЭлементыФормы.Запрос.Видимость = Вычислять;
		ЭлементыФормы.КоманднаяПанельЗапрос.Видимость = Вычислять;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура КоманднаяПанельЗапросКонструкторЗапроса(Кнопка)
	// Вставить содержимое обработчика.
	КонструкторЗапроса = Новый КонструкторЗапроса;
	КонструкторЗапроса.Текст = ЭлементыФормы.Запрос.ВыделенныйТекст;
	Если КонструкторЗапроса.ОткрытьМодально() Тогда
		ЭлементыФормы.Запрос.ВыделенныйТекст = КонструкторЗапроса.Текст;
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьТаблицуДляЗаполнения(ТекСтрока)
	Если ТекСтрока.Родитель = Неопределено Тогда
		Если Не ТекСтрока.Вычислять Тогда
			Таблица.Очистить();
			Таблица.Колонки.Очистить();
		КонецЕсли;
		Для Каждого Строка Из ТекСтрока.Строки Цикл 
			Строка.Вычислять = ТекСтрока.Вычислять;
			Если Не ТекСтрока.Вычислять Тогда
				Таблица.Колонки.Добавить(Строка.Имя, Строка.Тип, Строка.Синоним);
			КонецЕсли;
		КонецЦикла;
		Если Не ТекСтрока.Вычислять Тогда
			ТекСтрока.Значение = ЗначениеВСтрокуВнутр(Таблица);
			ЭлементыФормы.Таблица.СоздатьКолонки();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ТабличныеЧастиВыражениеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ТекСтрока = ЭлементыФормы.ТабличныеЧасти.ТекущиеДанные;
	СоздатьТаблицуДляЗаполнения(ТекСтрока);
	ТабличныеЧастиПриАктивизацииСтроки(ЭлементыФормы.ТабличныеЧасти)
КонецПроцедуры

Процедура ПараметрыТипПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ТекСтрока = ЭлементыФормы.Параметры.ТекущиеДанные;
	ТекСтрока.Значение = Элемент.Значение.ПривестиЗначение(ТекСтрока.Значение);
КонецПроцедуры

Процедура РеквизитыВыражениеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ТекСтрока = ЭлементыФормы.Реквизиты.ТекущиеДанные;
	Если Элемент.Значение Тогда
		ТекСтрока.Значение = "";
	Иначе
		ТекСтрока.Значение = ТекСтрока.Тип.ПривестиЗначение();
	КонецЕсли;
КонецПроцедуры

Процедура РеквизитыЗначениеНачалоВыбора(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ТекСтрока = ЭлементыФормы.Реквизиты.ТекущиеДанные;
	Если ТекСтрока.Вычислять Тогда
		СтандартнаяОбработка = Ложь;
		Форма = ПолучитьФорму("Другое_ФормаВвода");
		Форма.Параметры = Параметры;
		Форма.ПараметрыТестов = ПараметрыТестов;
		Если Форма.Открыта() Тогда
			Форма.Закрыть();
		КонецЕсли;
		Описание = ПолучитьМакет("Макет_ВырожениеЗначения").ПолучитьТекст();
		Форма.ЭлементыФормы.Описание.УстановитьТекст(Описание);
		Форма.ЭлементыФормы.Код.УстановитьТекст(Элемент.Значение);
		Результат = Форма.ОткрытьМодально();
		Если Результат <> Неопределено Тогда
			Элемент.Значение = Результат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОсновныеДействияФормыСохранитьИЗакрыть(Кнопка)
	// Вставить содержимое обработчика.
	ТабличныеЧастиПриАктивизацииСтроки(ЭлементыФормы.ТабличныеЧасти);
	СтруктураТеста = СоздатьСтруктуру();
	Если МодальныйРежим Тогда 
		Закрыть(СтруктураТеста);
	Иначе
		СтрокаТеста.Описание = СтруктураТеста.Описание;
		СтрокаТеста.Тест = ЗначениеВСтрокуВнутр(СтруктураТеста);
		Закрыть(СтруктураТеста);
	КонецЕсли;
	
КонецПроцедуры

Процедура КоманднаяПанель7ДобавитьВГлобальныеПараметры(Кнопка)
	// Вставить содержимое обработчика.
	Имя = "<Введите имя>";
	ВвестиСтроку(Имя);
	ЭлементыФормы.ПТДПослеЗаписи.ВыделенныйТекст = "ГлобальныеПараметры.Вставить(""" + Имя +""", Объект.Ссылка);";
	ЭлементыФормы.ОписаниеТеста.ДобавитьСтроку("После записи объект будет доступен как:");
	ЭлементыФормы.ОписаниеТеста.ДобавитьСтроку(Символы.Таб + "ГлобальныеПараметры." + Имя);
	Строка = ПараметрыТестов.Добавить();
	Строка.Имя = Имя;
	Строка.Тип = Документ;
	Строка.Значение = Документ.ПривестиЗначение();
КонецПроцедуры

Процедура КоманднаяПанель5НайтиПоНомеру(Кнопка)
	ЭлементыФормы.ПТДПередЗаполнением.ВыделенныйТекст = "Ссылка = Документы." + Документ.ПривестиЗначение().Метаданные().Имя + ".НайтиПоНомеру(<НомерДокумента>, <ДатаИнтервала>);"
КонецПроцедуры

Процедура КоманднаяПанель5НайтипоРеквизиту(Кнопка)
	ЭлементыФормы.ПТДПередЗаполнением.ВыделенныйТекст = "Ссылка = Документы." + Документ.ПривестиЗначение().Метаданные().Имя + ".НайтиПоРеквизиту(<ИмяРеквизита>, <ЗначениеРеквизита>);"
КонецПроцедуры

Процедура ТаблицаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	// Вставить содержимое обработчика.
	ТекущиеДанные = ЭлементыФормы.ТабличныеЧасти.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Значение = ЗначениеВСтрокуВнутр(Таблица);
	КонецЕсли;
КонецПроцедуры

