
Процедура ВыбПериодНажатие(Элемент)
	
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = НачПериода;
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = КонецДня(КонПериода);
	
КонецПроцедуры

Процедура НачПериодаПриИзменении(Элемент)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = НачПериода;
КонецПроцедуры

Процедура КонПериодаПриИзменении(Элемент)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = КонецДня(КонПериода);
КонецПроцедуры

Процедура ПриОткрытии()
	Подразделение = глТекущийПользователь.ОсновноеПодразделение;
	Яр = справочники.Подразделения.НайтиПоКоду("00005");
	
	Если не Подразделение.ОбособленноеПодразделение тогда
		Подразделение = Яр;
	КонецЕсли;
	
	Параметр0 = КомпоновщикНастроек.Настройки.Отбор.Элементы[0];
	Параметр0.ПравоеЗначение = Подразделение;	
	
	элементыФормы.Подразделение.СписокВыбора.Добавить( Яр );
	
	масФ = получитьСписФилиалов();
	для i=0 по масФ.Количество()-1 цикл
		элементыФормы.Подразделение.СписокВыбора.Добавить( масФ[i] );
	КонецЦикла;	
	
	
//+++ 15.05.2018 --- нач.установка ------------------------------------------	
	НачПериода = НачалоМесяца( ТекущаяДата() );
	КонПериода =  ТекущаяДата() ;
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = НачПериода;
      ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = КонецДня(КонПериода);


КонецПроцедуры

Процедура ПодразделениеПриИзменении(Элемент)
	
	Параметр0 = КомпоновщикНастроек.Настройки.Отбор.Элементы[0];
	Параметр0.ПравоеЗначение = Подразделение;	

КонецПроцедуры

функция получитьСписФилиалов()
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
|	Подразделения.Ссылка
|ИЗ
|	Справочник.Подразделения КАК Подразделения
|ГДЕ
|	Подразделения.ОбособленноеПодразделение
|	И Подразделения.ПометкаУдаления = ЛОЖЬ";
Результат = Запрос.Выполнить();
табл = Результат.Выгрузить();
возврат табл.ВыгрузитьКолонку("Ссылка");	
КонецФункции