Перем мИмяРегистраДляПодбораСерий Экспорт;
Перем мИспользоватьХарактеристики Экспорт;
Перем мИспользоватьСерии Экспорт;

Перем мТекстЗапросаОтборНоменклатурыПоРодителю;

// Функция формирует список имен параметров для подстановки значений в запросы
//
// Параметры
//  ИмяПодбора - строка, имя подбора, по которому определяется запрос
//
// Возвращаемое значение:
//   СписокЗначений
//
Функция ПолучитьСписокПараметровЗапроса(ИмяПодбора) Экспорт

	СписокЗначенийВозврата = Новый СписокЗначений;

	Если ИмяПодбора = "ПриходЦеныКонтрагента"
	 ИЛИ ИмяПодбора = "ПриходНоменклатураКонтрагента"
	 ИЛИ ИмяПодбора = "РасходЦеныНоменклатуры"
	 ИЛИ ИмяПодбора = "РасходОстаткиИЦеныНоменклатуры"
	 ИЛИ ИмяПодбора = "РасходОстаткиКачествоИЦеныНоменклатуры"
	 ИЛИ ИмяПодбора = "ВозвратПоставщикуЦеныКонтрагентаИОстатки"
	 ИЛИ ИмяПодбора = "ВозвратПоставщикуНоменклатураКонтрагентаИОстатки"
	 ИЛИ ИмяПодбора = "РасходЦеныПлановойСебестоимостиНоменклатуры" Тогда

		СписокЗначенийВозврата.Добавить("ТипЦен");
		СписокЗначенийВозврата.Добавить("Контрагент");
		СписокЗначенийВозврата.Добавить("Организация");
		СписокЗначенийВозврата.Добавить("Склад");
		СписокЗначенийВозврата.Добавить("ДоговорКонтрагента");

	ИначеЕсли ИмяПодбора = "ОстаткиУКомиссионеров"
		  ИЛИ ИмяПодбора = "ОстаткиТоваровКомитентов" Тогда

		СписокЗначенийВозврата.Добавить("ТипЦен");
		СписокЗначенийВозврата.Добавить("Контрагент");
		СписокЗначенийВозврата.Добавить("ДоговорКонтрагента");

	ИначеЕсли ИмяПодбора = "ОстаткиНоменклатуры"
		  ИЛИ ИмяПодбора = "ОстаткиВсейНоменклатуры"
		  ИЛИ ИмяПодбора = "ОстаткиИКачествоНоменклатуры" Тогда

		СписокЗначенийВозврата.Добавить("Организация");
		СписокЗначенийВозврата.Добавить("Склад");

	ИначеЕсли ИмяПодбора = "ОстаткиНеавтоматизированнаяТорговаяТочка" Тогда

		СписокЗначенийВозврата.Добавить("Склад");

	ИначеЕсли ИмяПодбора = "РасходЦеныУслуг"
		  ИЛИ ИмяПодбора = "РасходПоЦенамНоменклатуры" Тогда

		СписокЗначенийВозврата.Добавить("ТипЦен");
		СписокЗначенийВозврата.Добавить("ДоговорКонтрагента");
		СписокЗначенийВозврата.Добавить("Контрагент");

	ИначеЕсли ИмяПодбора = "ПриходНоменклатураКонтрагентаБезЦенИОстатков" Тогда

		СписокЗначенийВозврата.Добавить("Контрагент");

	ИначеЕсли ИмяПодбора = "ЛимитПокупателю"
		  ИЛИ ИмяПодбора = "ЛимитПоставщика" Тогда

		СписокЗначенийВозврата.Добавить("ДоговорКонтрагента");

	КонецЕсли;

	Возврат СписокЗначенийВозврата;

КонецФункции

// Функция формирует текст запроса по ИмяПодбора = "ПриходЦеныКонтрагента" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросПриходЦеныКонтрагента()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.КоличествоСвободныйОстаток               КАК КоличествоСвободныйОстаток,
	|	Подбор.КоличествоОстатокОрганизации             КАК КоличествоОстатокОрганизации,
	|	Подбор.КоличествоЗаказанное                     КАК КоличествоЗаказанное,
	|	Подбор.Цена                                     КАК Цена,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.НаименованиеНоменклатурыКонтрагента      КАК НаименованиеНоменклатурыКонтрагента,
	|	Подбор.АртикулНоменклатурыКонтрагента           КАК АртикулНоменклатурыКонтрагента,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                       КАК Код,
	|	СправочникНоменклатура.Артикул                   КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                 КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления           КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                     КАК Набор,
	|	СправочникНоменклатура.Услуга                    КАК Услуга,
	|	СправочникНоменклатура.Ссылка                    КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                  КАК Родитель,
	|	СУММА(Остатки.КоличествоСвободныйОстаток)        КАК КоличествоСвободныйОстаток,
	|	СУММА(Остатки.КоличествоОстатокОрганизации)      КАК КоличествоОстатокОрганизации,
	|	СУММА(Заказано.КоличествоЗаказанное)             КАК КоличествоЗаказанное,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ИНАЧЕ ЦеныСрезПоследних.Цена КОНЕЦ) КАК Цена,
	|	МАКСИМУМ(СправочникНоменклатура.ЕдиницаХраненияОстатков) КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Валюта ИНАЧЕ ЦеныСрезПоследних.Валюта КОНЕЦ) КАК Валюта,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	МАКСИМУМ(ВЫБОР КОГДА СправочникНоменклатура.ЭтоГруппа ТОГДА NULL ИНАЧЕ ВЫРАЗИТЬ(НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента КАК Строка(100)) КОНЕЦ) КАК НаименованиеНоменклатурыКонтрагента,
	|	МАКСИМУМ(ВЫБОР КОГДА СправочникНоменклатура.ЭтоГруппа ТОГДА NULL ИНАЧЕ НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента КОНЕЦ) КАК АртикулНоменклатурыКонтрагента,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ФлагУсловийПоставки
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ЦеныТаблицаСрезПоследних.Номенклатура               КАК Номенклатура,
	|		ЦеныТаблицаСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВЫБОР КОГДА ЦеныТаблицаСрезПоследних.ЕдиницаИзмерения = ЦеныТаблицаСрезПоследних.Номенклатура.ЕдиницаХраненияОстатков
	|			  ТОГДА ЦеныТаблицаСрезПоследних.Цена
	|			  ИНАЧЕ ЦеныТаблицаСрезПоследних.Цена * (ЦеныТаблицаСрезПоследних.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныТаблицаСрезПоследних.ЕдиницаИзмерения.Коэффициент) КОНЕЦ КАК Цена,
	|		ЦеныТаблицаСрезПоследних.Валюта       КАК Валюта
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И ТипЦен = &ТипЦен) КАК ЦеныТаблицаСрезПоследних
	|
	|	) КАК ЦеныСрезПоследних
	|ПО
	|	ЦеныСрезПоследних.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ                                           КАК Номенклатура,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|		СУММА((ВЫБОР КОГДА ТоварыНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыВРезервеНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыВРезервеНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыКПередачеСоСкладов.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыКПередачеСоСкладов.КоличествоОстаток КОНЕЦ)) КАК КоличествоСвободныйОстаток,
	|		СУММА(ВЫБОР КОГДА ОстаткиОрганизации.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ОстаткиОрганизации.КоличествоОстаток КОНЕЦ) КАК КоличествоОстатокОрганизации
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И Склад = &Склад) КАК ТоварыНаСкладах
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И Склад = &Склад) КАК ТоварыВРезервеНаСкладах
	|	ПО
	|		ТоварыВРезервеНаСкладах.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И Склад = &Склад) КАК ТоварыКПередачеСоСкладов
	|	ПО
	|		ТоварыКПередачеСоСкладов.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыКПередачеСоСкладов.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|		
	|	ПОЛНОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыОрганизаций.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И Организация = &Организация) КАК ОстаткиОрганизации
	|	ПО
	|		ОстаткиОрганизации.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ОстаткиОрганизации.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ
	|	) КАК Остатки
	|
	|ПО
	|	Остатки.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	(Остатки.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.ХарактеристикаНоменклатуры ИЛИ ЦеныСрезПоследних.ХарактеристикаНоменклатуры = &ПустаяХарактеристика)
	|	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ЗаказыПоставщикам.Номенклатура               КАК Номенклатура,
	|		ЗаказыПоставщикам.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		СУММА(ЗаказыПоставщикам.КоличествоОстаток
	|		      - ВЫБОР КОГДА ТоварыРазмещенные.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыРазмещенные.КоличествоОстаток КОНЕЦ) КАК КоличествоЗаказанное
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ") КАК ЗаказыПоставщикам
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ") КАК ТоварыРазмещенные
	|	ПО
	|		ЗаказыПоставщикам.Номенклатура = ТоварыРазмещенные.Номенклатура
	|		И
	|		ЗаказыПоставщикам.ХарактеристикаНоменклатуры = ТоварыРазмещенные.ХарактеристикаНоменклатуры
	|		И
	|		ЗаказыПоставщикам.ЗаказПоставщику = ТоварыРазмещенные.ЗаказПоставщику
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗаказыПоставщикам.Номенклатура,
	|		ЗаказыПоставщикам.ХарактеристикаНоменклатуры
	|	) КАК Заказано
	|
	|ПО
	|	Заказано.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	(Заказано.ХарактеристикаНоменклатуры = Остатки.ХарактеристикаНоменклатуры
	|	 ИЛИ Остатки.ХарактеристикаНоменклатуры ЕСТЬ NULL)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		НоменклатураКонтрагентов.Номенклатура,
	|		НоменклатураКонтрагентов.Контрагент,
	|		НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента КАК НаименованиеНоменклатурыКонтрагента,
	|		НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента      КАК АртикулНоменклатурыКонтрагента
	|	ИЗ
	|		РегистрСведений.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|
	|	) КАК НоменклатураКонтрагентов
	|ПО
	|	НоменклатураКонтрагентов.Номенклатура = СправочникНоменклатура.Ссылка
	|	И НоменклатураКонтрагентов.Контрагент = &Контрагент
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура КАК Номенклатура,
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВЫБОР КОГДА ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения = ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура.ЕдиницаХраненияОстатков
	|			  ТОГДА ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена
	|			  ИНАЧЕ ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена * (ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения.Коэффициент) КОНЕЦ КАК Цена,
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены   КАК Валюта
	|	ИЗ
	|		РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|
	|	) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ
	|
	|ГДЕ
	|	(СправочникНоменклатура.Родитель = &Родитель) И
	|	((СправочникНоменклатура.Ссылка.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор)
	|	ИЛИ
	|	((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена > 0) ИЛИ ((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена = 0 ИЛИ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) И ЦеныСрезПоследних.Цена > 0)))
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросПриходЦеныКонтрагента()

// Функция формирует текст запроса по ИмяПодбора = "ПриходНоменклатураКонтрагента" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросПриходНоменклатураКонтрагента()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.КоличествоСвободныйОстаток               КАК КоличествоСвободныйОстаток,
	|	Подбор.КоличествоОстатокОрганизации             КАК КоличествоОстатокОрганизации,
	|	Подбор.КоличествоЗаказанное                     КАК КоличествоЗаказанное,
	|	Подбор.Цена                                     КАК Цена,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.НаименованиеНоменклатурыКонтрагента      КАК НаименованиеНоменклатурыКонтрагента,
	|	Подбор.АртикулНоменклатурыКонтрагента           КАК АртикулНоменклатурыКонтрагента,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                                      КАК Код,
	|	СправочникНоменклатура.Артикул                                  КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                                КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                          КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                                    КАК Набор,
	|	СправочникНоменклатура.Услуга                                   КАК Услуга,
	|	СправочникНоменклатура.Ссылка                                   КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                                 КАК Родитель,
	|	СУММА(Остатки.КоличествоСвободныйОстаток)                       КАК КоличествоСвободныйОстаток,
	|	СУММА(Остатки.КоличествоОстатокОрганизации)                     КАК КоличествоОстатокОрганизации,
	|	СУММА(Заказано.КоличествоЗаказанное)                            КАК КоличествоЗаказанное,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ИНАЧЕ ЦеныСрезПоследних.Цена КОНЕЦ) КАК Цена,
	|	МАКСИМУМ(СправочникНоменклатура.ЕдиницаХраненияОстатков)        КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Валюта ИНАЧЕ ЦеныСрезПоследних.Валюта КОНЕЦ) КАК Валюта,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	МАКСИМУМ(ВЫБОР КОГДА СправочникНоменклатура.ЭтоГруппа ТОГДА NULL ИНАЧЕ ВЫРАЗИТЬ(НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента КАК Строка(100)) КОНЕЦ) КАК НаименованиеНоменклатурыКонтрагента,
	|	МАКСИМУМ(ВЫБОР КОГДА СправочникНоменклатура.ЭтоГруппа ТОГДА NULL ИНАЧЕ НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента КОНЕЦ) КАК АртикулНоменклатурыКонтрагента,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ФлагУсловийПоставки
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ПРАВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		НоменклатураКонтрагентов.Номенклатура,
	|		НоменклатураКонтрагентов.Контрагент,
	|		НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента КАК НаименованиеНоменклатурыКонтрагента,
	|		НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента      КАК АртикулНоменклатурыКонтрагента
	|	ИЗ
	|		РегистрСведений.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|	ГДЕ
	|		НоменклатураКонтрагентов.Контрагент = &Контрагент
	|	) КАК НоменклатураКонтрагентов
	|ПО
	|	НоменклатураКонтрагентов.Номенклатура = СправочникНоменклатура.Ссылка
	|	ИЛИ
	|	СправочникНоменклатура.ЭтоГруппа = ИСТИНА 
	|	ИЛИ 
	|	СправочникНоменклатура.Набор
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ЦеныТаблицаСрезПоследних.Номенклатура               КАК Номенклатура,
	|		ЦеныТаблицаСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВЫБОР КОГДА ЦеныТаблицаСрезПоследних.ЕдиницаИзмерения = ЦеныТаблицаСрезПоследних.Номенклатура.ЕдиницаХраненияОстатков
	|			  ТОГДА ЦеныТаблицаСрезПоследних.Цена
	|			  ИНАЧЕ ЦеныТаблицаСрезПоследних.Цена * (ЦеныТаблицаСрезПоследних.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныТаблицаСрезПоследних.ЕдиницаИзмерения.Коэффициент) КОНЕЦ КАК Цена,
	|		ЦеныТаблицаСрезПоследних.Валюта       КАК Валюта
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И ТипЦен = &ТипЦен) КАК ЦеныТаблицаСрезПоследних
	|
	|	) КАК ЦеныСрезПоследних
	|ПО
	|	ЦеныСрезПоследних.Номенклатура = СправочникНоменклатура.Ссылка
	|	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ                                           КАК Номенклатура,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|		СУММА((ВЫБОР КОГДА ТоварыНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыВРезервеНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыВРезервеНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыКПередачеСоСкладов.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыКПередачеСоСкладов.КоличествоОстаток КОНЕЦ)) КАК КоличествоСвободныйОстаток,
	|		СУММА(ВЫБОР КОГДА ОстаткиОрганизации.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ОстаткиОрганизации.КоличествоОстаток КОНЕЦ) КАК КоличествоОстатокОрганизации
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И Склад = &Склад) КАК ТоварыНаСкладах
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И Склад = &Склад) КАК ТоварыВРезервеНаСкладах
	|	ПО
	|		ТоварыВРезервеНаСкладах.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И Склад = &Склад) КАК ТоварыКПередачеСоСкладов
	|	ПО
	|		ТоварыКПередачеСоСкладов.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыКПередачеСоСкладов.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|		
	|	ПОЛНОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыОрганизаций.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И Организация = &Организация) КАК ОстаткиОрганизации
	|	ПО
	|		ОстаткиОрганизации.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ОстаткиОрганизации.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ
	|	) КАК Остатки
	|
	|ПО
	|	Остатки.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	(Остатки.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.ХарактеристикаНоменклатуры ИЛИ ЦеныСрезПоследних.ХарактеристикаНоменклатуры = &ПустаяХарактеристика)
	|	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ЗаказыПоставщикам.Номенклатура               КАК Номенклатура,
	|		ЗаказыПоставщикам.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		СУММА(ЗаказыПоставщикам.КоличествоОстаток
	|		      - ВЫБОР КОГДА ТоварыРазмещенные.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыРазмещенные.КоличествоОстаток КОНЕЦ) КАК КоличествоЗаказанное
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ") КАК ЗаказыПоставщикам
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ") КАК ТоварыРазмещенные
	|	ПО
	|		ЗаказыПоставщикам.Номенклатура = ТоварыРазмещенные.Номенклатура
	|		И
	|		ЗаказыПоставщикам.ХарактеристикаНоменклатуры = ТоварыРазмещенные.ХарактеристикаНоменклатуры
	|		И
	|		ЗаказыПоставщикам.ЗаказПоставщику = ТоварыРазмещенные.ЗаказПоставщику
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗаказыПоставщикам.Номенклатура,
	|		ЗаказыПоставщикам.ХарактеристикаНоменклатуры
	|	) КАК Заказано
	|
	|ПО
	|	Заказано.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	(Заказано.ХарактеристикаНоменклатуры = Остатки.ХарактеристикаНоменклатуры
	|	 ИЛИ Остатки.ХарактеристикаНоменклатуры ЕСТЬ NULL)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура КАК Номенклатура,
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВЫБОР КОГДА ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения = ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура.ЕдиницаХраненияОстатков
	|			  ТОГДА ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена
	|			  ИНАЧЕ ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена * (ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения.Коэффициент) КОНЕЦ КАК Цена,
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены   КАК Валюта
	|	ИЗ
	|		РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|
	|	) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ
	|
	|ГДЕ
	|	СправочникНоменклатура.Родитель = &Родитель
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросПриходНоменклатураКонтрагента()

// Функция формирует текст запроса по ИмяПодбора = "ПриходНоменклатураКонтрагентаБезЦенИОстатков" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросПриходНоменклатураКонтрагентаБезЦенИОстатков()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.НаименованиеНоменклатурыКонтрагента      КАК НаименованиеНоменклатурыКонтрагента,
	|	Подбор.АртикулНоменклатурыКонтрагента           КАК АртикулНоменклатурыКонтрагента,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                                      КАК Код,
	|	СправочникНоменклатура.Артикул                                  КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                                КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                          КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                                    КАК Набор,
	|	СправочникНоменклатура.Услуга                                   КАК Услуга,
	|	СправочникНоменклатура.Ссылка                                   КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                                 КАК Родитель,
	|	МАКСИМУМ(ВЫБОР КОГДА СправочникНоменклатура.ЭтоГруппа ТОГДА NULL ИНАЧЕ ВЫРАЗИТЬ(НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента КАК Строка(100)) КОНЕЦ) КАК НаименованиеНоменклатурыКонтрагента,
	|	МАКСИМУМ(ВЫБОР КОГДА СправочникНоменклатура.ЭтоГруппа ТОГДА NULL ИНАЧЕ НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента КОНЕЦ) КАК АртикулНоменклатурыКонтрагента,
	|	МАКСИМУМ(СправочникНоменклатура.ЕдиницаХраненияОстатков)        КАК ЕдиницаИзмерения
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ПРАВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		НоменклатураКонтрагентов.Номенклатура,
	|		НоменклатураКонтрагентов.Контрагент,
	|		НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента КАК НаименованиеНоменклатурыКонтрагента,
	|		НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента      КАК АртикулНоменклатурыКонтрагента
	|	ИЗ
	|		РегистрСведений.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|	ГДЕ
	|		НоменклатураКонтрагентов.Контрагент = &Контрагент
	|		И
	|		НоменклатураКонтрагентов.Номенклатура.Родитель = &Родитель
	|	) КАК НоменклатураКонтрагентов
	|ПО
	|	НоменклатураКонтрагентов.Номенклатура = СправочникНоменклатура.Ссылка
	|	ИЛИ
	|	СправочникНоменклатура.ЭтоГруппа = ИСТИНА
	|	ИЛИ 
	|	СправочникНоменклатура.Набор
	|	
	|ГДЕ
	|	СправочникНоменклатура.Родитель = &Родитель
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросПриходНоменклатураКонтрагентаБезЦенИОстатков()

// Функция формирует текст запроса по ИмяПодбора = "РасходЦеныНоменклатуры" 
// и "РасходЦеныПлановойСебестоимостиНоменклатуры" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросРасходЦеныНоменклатуры_РасходЦеныПлановойСебестоимостиНоменклатуры(Склад, Организация)

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.КоличествоСвободныйОстаток               КАК КоличествоСвободныйОстаток,
	|	Подбор.КоличествоОстатокОрганизации             КАК КоличествоОстатокОрганизации,
	|	Подбор.Цена                                     КАК Цена,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	СУММА(Остатки.КоличествоСвободныйОстаток)                КАК КоличествоСвободныйОстаток,
	|	СУММА(Остатки.КоличествоОстатокОрганизации)              КАК КоличествоОстатокОрганизации,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ИНАЧЕ ЦеныСрезПоследних.Цена КОНЕЦ) КАК Цена,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения ИНАЧЕ ЦеныСрезПоследних.ЕдиницаИзмерения КОНЕЦ) КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены ИНАЧЕ ЦеныСрезПоследних.Валюта КОНЕЦ) КАК Валюта,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ФлагУсловийПоставки
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаРегистраСведений, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
	|ПО
	|	ЦеныСрезПоследних.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ                                           КАК Номенклатура,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|		СУММА((ВЫБОР КОГДА ТоварыНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыВРезервеНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыВРезервеНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыКПередачеСоСкладов.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыКПередачеСоСкладов.КоличествоОстаток КОНЕЦ)) КАК КоличествоСвободныйОстаток,
	|		СУММА(ВЫБОР КОГДА ОстаткиОрганизации.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ОстаткиОрганизации.КоличествоОстаток КОНЕЦ) КАК КоличествоОстатокОрганизации
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыНаСкладах
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыВРезервеНаСкладах
	|	ПО
	|		ТоварыВРезервеНаСкладах.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыКПередачеСоСкладов
	|	ПО
	|		ТоварыКПередачеСоСкладов.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыКПередачеСоСкладов.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|		
	|	ПОЛНОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыОрганизаций.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Организация <> Неопределено, " И Организация = &Организация", "") +") КАК ОстаткиОрганизации
	|	ПО
	|		ОстаткиОрганизации.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ОстаткиОрганизации.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ
	|	) КАК Остатки
	|
	|ПО
	|	Остатки.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	(Остатки.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.ХарактеристикаНоменклатуры ИЛИ ЦеныСрезПоследних.ХарактеристикаНоменклатуры = &ПустаяХарактеристика)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ
	|
	|ГДЕ
	|	(СправочникНоменклатура.Родитель = &Родитель) И
	|	((СправочникНоменклатура.Ссылка.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор)
	|	ИЛИ
	|	((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена > 0) ИЛИ ((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена = 0 ИЛИ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) И ЦеныСрезПоследних.Цена > 0)))
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросРасходЦеныНоменклатуры_РасходЦеныПлановойСебестоимостиНоменклатуры()

// Функция формирует текст запроса по ИмяПодбора = "РасходОстаткиИЦеныНоменклатуры" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросРасходОстаткиИЦеныНоменклатуры(Склад, Организация)

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.КоличествоСвободныйОстаток               КАК КоличествоСвободныйОстаток,
	|	Подбор.КоличествоОстатокОрганизации             КАК КоличествоОстатокОрганизации,
	|	Подбор.Цена                                     КАК Цена,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	СУММА(Остатки.КоличествоСвободныйОстаток)                КАК КоличествоСвободныйОстаток,
	|	СУММА(Остатки.КоличествоОстатокОрганизации)              КАК КоличествоОстатокОрганизации,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ИНАЧЕ ЦеныСрезПоследних.Цена КОНЕЦ) КАК Цена,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения ИНАЧЕ ЦеныСрезПоследних.ЕдиницаИзмерения КОНЕЦ) КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены ИНАЧЕ ЦеныСрезПоследних.Валюта КОНЕЦ) КАК Валюта,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ФлагУсловийПоставки
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаРегистраСведений, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
	|ПО
	|	ЦеныСрезПоследних.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ                                           КАК Номенклатура,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|		СУММА((ВЫБОР КОГДА ТоварыНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыВРезервеНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыВРезервеНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыКПередачеСоСкладов.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыКПередачеСоСкладов.КоличествоОстаток КОНЕЦ)) КАК КоличествоСвободныйОстаток,
	|		СУММА(ВЫБОР КОГДА ОстаткиОрганизации.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ОстаткиОрганизации.КоличествоОстаток КОНЕЦ) КАК КоличествоОстатокОрганизации
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыНаСкладах
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыВРезервеНаСкладах
	|	ПО
	|		ТоварыВРезервеНаСкладах.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыКПередачеСоСкладов
	|	ПО
	|		ТоварыКПередачеСоСкладов.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыКПередачеСоСкладов.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|		
	|	ПОЛНОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыОрганизаций.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Организация <> Неопределено, " И Организация = &Организация", "") +") КАК ОстаткиОрганизации
	|	ПО
	|		ОстаткиОрганизации.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ОстаткиОрганизации.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ
	|	) КАК Остатки
	|
	|ПО
	|	Остатки.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	(Остатки.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.ХарактеристикаНоменклатуры ИЛИ ЦеныСрезПоследних.ХарактеристикаНоменклатуры = &ПустаяХарактеристика)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ
	|
	|ГДЕ
	|	(СправочникНоменклатура.Родитель = &Родитель) И
	|	((СправочникНоменклатура.Услуга ИЛИ СправочникНоменклатура.Ссылка.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор)
	|	ИЛИ
	|	((НЕ СправочникНоменклатура.Ссылка.ЭтоГруппа И СправочникНоменклатура.Ссылка.Услуга = Истина)
	|	И
	|	((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена > 0) ИЛИ ((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена = 0 ИЛИ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) И ЦеныСрезПоследних.Цена > 0)))
	|	ИЛИ
	|	(((((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена > 0) ИЛИ ((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена = 0 ИЛИ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) И ЦеныСрезПоследних.Цена > 0))) И (КоличествоСвободныйОстаток > 0 ИЛИ КоличествоОстатокОрганизации > 0))
	|	И
	|	(Остатки.КоличествоСвободныйОстаток > 0"+?(РазрешеноПревышениеОстаткаТоваровОрганизации(),""," И Остатки.КоличествоОстатокОрганизации > 0")+")))
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросРасходОстаткиИЦеныНоменклатуры()

// Функция формирует текст запроса по ИмяПодбора = "ОстаткиНоменклатуры" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросОстаткиНоменклатуры(Склад, Организация)

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.КоличествоСвободныйОстаток               КАК КоличествоСвободныйОстаток,
	|	Подбор.КоличествоОстатокОрганизации             КАК КоличествоОстатокОрганизации,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	СУММА(Остатки.КоличествоСвободныйОстаток)                КАК КоличествоСвободныйОстаток,
	|	СУММА(Остатки.КоличествоОстатокОрганизации)              КАК КоличествоОстатокОрганизации,
	|	МАКСИМУМ(СправочникНоменклатура.ЕдиницаХраненияОстатков) КАК ЕдиницаИзмерения,
	|	Остатки.ХарактеристикаНоменклатуры                       КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ                                           КАК Номенклатура,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|		СУММА((ВЫБОР КОГДА ТоварыНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыВРезервеНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыВРезервеНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыКПередачеСоСкладов.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыКПередачеСоСкладов.КоличествоОстаток КОНЕЦ)) КАК КоличествоСвободныйОстаток,
	|		СУММА(ВЫБОР КОГДА ОстаткиОрганизации.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ОстаткиОрганизации.КоличествоОстаток КОНЕЦ) КАК КоличествоОстатокОрганизации
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыНаСкладах
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыВРезервеНаСкладах
	|	ПО
	|		ТоварыВРезервеНаСкладах.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыКПередачеСоСкладов
	|	ПО
	|		ТоварыКПередачеСоСкладов.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыКПередачеСоСкладов.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|		
	|	ПОЛНОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыОрганизаций.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Организация <> Неопределено, " И Организация = &Организация", "") +") КАК ОстаткиОрганизации
	|	ПО
	|		ОстаткиОрганизации.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ОстаткиОрганизации.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ
	|	) КАК Остатки
	|
	|ПО
	|	Остатки.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ГДЕ
	|	(СправочникНоменклатура.Родитель = &Родитель) И
	|	((СправочникНоменклатура.Ссылка.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор)
	|	ИЛИ
	|	(НЕ СправочникНоменклатура.Ссылка.ЭтоГруппа И СправочникНоменклатура.Ссылка.Услуга = Истина)
	|	ИЛИ
	|	(Остатки.КоличествоСвободныйОстаток > 0"+?(РазрешеноПревышениеОстаткаТоваровОрганизации(),""," И Остатки.КоличествоОстатокОрганизации > 0")+"))
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка,
	|	Остатки.ХарактеристикаНоменклатуры
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросОстаткиНоменклатуры()

// Функция формирует текст запроса по ИмяПодбора = "ОстаткиИКачествоНоменклатуры" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросОстаткиИКачествоНоменклатуры(Склад, Организация)

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.КоличествоСвободныйОстаток               КАК КоличествоСвободныйОстаток,
	|	Подбор.КоличествоОстатокОрганизации             КАК КоличествоОстатокОрганизации,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.Качество                                 КАК Качество,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Качество.Представление                   КАК ПредставлениеКачество,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	СУММА(Остатки.КоличествоСвободныйОстаток)                КАК КоличествоСвободныйОстаток,
	|	СУММА(Остатки.КоличествоОстатокОрганизации)              КАК КоличествоОстатокОрганизации,
	|	МАКСИМУМ(СправочникНоменклатура.ЕдиницаХраненияОстатков) КАК ЕдиницаИзмерения,
	|	Остатки.ХарактеристикаНоменклатуры                       КАК ХарактеристикаНоменклатуры,
	|	Остатки.Качество                                         КАК Качество
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ                                           КАК Номенклатура,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|		ВЫБОР КОГДА ТоварыНаСкладах.Качество ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Качество ИНАЧЕ ТоварыНаСкладах.Качество КОНЕЦ КАК Качество,
	|		СУММА((ВЫБОР КОГДА ТоварыНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыВРезервеНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыВРезервеНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыКПередачеСоСкладов.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыКПередачеСоСкладов.КоличествоОстаток КОНЕЦ)) КАК КоличествоСвободныйОстаток,
	|		СУММА(ВЫБОР КОГДА ОстаткиОрганизации.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ОстаткиОрганизации.КоличествоОстаток КОНЕЦ) КАК КоличествоОстатокОрганизации
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыНаСкладах
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыВРезервеНаСкладах
	|	ПО
	|		ТоварыВРезервеНаСкладах.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыКПередачеСоСкладов
	|	ПО
	|		ТоварыКПередачеСоСкладов.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыКПередачеСоСкладов.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|		И
	|		ТоварыКПередачеСоСкладов.Качество = ТоварыНаСкладах.Качество
	|		
	|	ПОЛНОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыОрганизаций.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Организация <> Неопределено, " И Организация = &Организация", "") +") КАК ОстаткиОрганизации
	|	ПО
	|		ОстаткиОрганизации.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ОстаткиОрганизации.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|		И
	|		ОстаткиОрганизации.Качество = ТоварыНаСкладах.Качество
	|
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ,
	|		ВЫБОР КОГДА ТоварыНаСкладах.Качество ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Качество ИНАЧЕ ТоварыНаСкладах.Качество КОНЕЦ
	|	) КАК Остатки
	|
	|ПО
	|	Остатки.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ГДЕ
	|	(СправочникНоменклатура.Родитель = &Родитель) И
	|	((СправочникНоменклатура.Ссылка.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор)
	|	ИЛИ
	|	(НЕ СправочникНоменклатура.Ссылка.ЭтоГруппа И СправочникНоменклатура.Ссылка.Услуга = Истина)
	|	ИЛИ
	|	(Остатки.КоличествоСвободныйОстаток > 0"+?(РазрешеноПревышениеОстаткаТоваровОрганизации(),""," И Остатки.КоличествоОстатокОрганизации > 0")+"))
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.Качество
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросОстаткиИКачествоНоменклатуры()

// Функция формирует текст запроса по ИмяПодбора = "РасходОстаткиКачествоИЦеныНоменклатуры" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросРасходОстаткиКачествоИЦеныНоменклатуры(Склад, Организация)

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.КоличествоСвободныйОстаток               КАК КоличествоСвободныйОстаток,
	|	Подбор.КоличествоОстатокОрганизации             КАК КоличествоОстатокОрганизации,
	|	Подбор.Цена                                     КАК Цена,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.Качество                                 КАК Качество,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	Подбор.Качество.Представление                   КАК ПредставлениеКачество,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	СУММА(Остатки.КоличествоСвободныйОстаток)                КАК КоличествоСвободныйОстаток,
	|	СУММА(Остатки.КоличествоОстатокОрганизации)              КАК КоличествоОстатокОрганизации,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ИНАЧЕ ЦеныСрезПоследних.Цена КОНЕЦ) КАК Цена,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения ИНАЧЕ ЦеныСрезПоследних.ЕдиницаИзмерения КОНЕЦ) КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены ИНАЧЕ ЦеныСрезПоследних.Валюта КОНЕЦ) КАК Валюта,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	Остатки.Качество                                         КАК Качество,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ФлагУсловийПоставки
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаРегистраСведений, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
	|ПО
	|	ЦеныСрезПоследних.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ                                           КАК Номенклатура,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|		ВЫБОР КОГДА ТоварыНаСкладах.Качество ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Качество ИНАЧЕ ТоварыНаСкладах.Качество КОНЕЦ КАК Качество,
	|		СУММА((ВЫБОР КОГДА ТоварыНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыВРезервеНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыВРезервеНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыКПередачеСоСкладов.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыКПередачеСоСкладов.КоличествоОстаток КОНЕЦ)) КАК КоличествоСвободныйОстаток,
	|		СУММА(ВЫБОР КОГДА ОстаткиОрганизации.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ОстаткиОрганизации.КоличествоОстаток КОНЕЦ) КАК КоличествоОстатокОрганизации
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыНаСкладах
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыВРезервеНаСкладах
	|	ПО
	|		ТоварыВРезервеНаСкладах.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыКПередачеСоСкладов
	|	ПО
	|		ТоварыКПередачеСоСкладов.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыКПередачеСоСкладов.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|		И
	|		ТоварыКПередачеСоСкладов.Качество = ТоварыНаСкладах.Качество
	|		
	|	ПОЛНОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыОрганизаций.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Организация <> Неопределено, " И Организация = &Организация", "") +") КАК ОстаткиОрганизации
	|	ПО
	|		ОстаткиОрганизации.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ОстаткиОрганизации.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|		И
	|		ОстаткиОрганизации.Качество = ТоварыНаСкладах.Качество
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ,
	|		ВЫБОР КОГДА ТоварыНаСкладах.Качество ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Качество ИНАЧЕ ТоварыНаСкладах.Качество КОНЕЦ
	|	) КАК Остатки
	|
	|ПО
	|	Остатки.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	(Остатки.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.ХарактеристикаНоменклатуры ИЛИ ЦеныСрезПоследних.ХарактеристикаНоменклатуры = &ПустаяХарактеристика)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ
	|
	|ГДЕ
	|	(СправочникНоменклатура.Родитель = &Родитель) И
	|	((СправочникНоменклатура.Услуга ИЛИ СправочникНоменклатура.Ссылка.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор)
	|	ИЛИ
	|	((НЕ СправочникНоменклатура.Ссылка.ЭтоГруппа И СправочникНоменклатура.Ссылка.Услуга = Истина)
	|	И
	|	((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена > 0) ИЛИ ((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена = 0 ИЛИ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) И ЦеныСрезПоследних.Цена > 0)))
	|	ИЛИ
	|	(((((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена > 0) ИЛИ ((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена = 0 ИЛИ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) И ЦеныСрезПоследних.Цена > 0))) И (КоличествоСвободныйОстаток > 0 ИЛИ КоличествоОстатокОрганизации > 0))
	|	И
	|	(Остатки.КоличествоСвободныйОстаток > 0"+?(РазрешеноПревышениеОстаткаТоваровОрганизации(),""," И Остатки.КоличествоОстатокОрганизации > 0")+")))
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка,
	|	Остатки.Качество,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросРасходОстаткиКачествоИЦеныНоменклатуры()

// Функция формирует текст запроса по ИмяПодбора = "ОстаткиВсейНоменклатуры" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросОстаткиВсейНоменклатуры(Склад, Организация)

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.КоличествоСвободныйОстаток               КАК КоличествоСвободныйОстаток,
	|	Подбор.КоличествоОстатокОрганизации             КАК КоличествоОстатокОрганизации,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	СУММА(Остатки.КоличествоСвободныйОстаток)                КАК КоличествоСвободныйОстаток,
	|	СУММА(Остатки.КоличествоОстатокОрганизации)              КАК КоличествоОстатокОрганизации,
	|	МАКСИМУМ(СправочникНоменклатура.ЕдиницаХраненияОстатков) КАК ЕдиницаИзмерения,
	|	Остатки.ХарактеристикаНоменклатуры                       КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ                                           КАК Номенклатура,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|		СУММА((ВЫБОР КОГДА ТоварыНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыВРезервеНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыВРезервеНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыКПередачеСоСкладов.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыКПередачеСоСкладов.КоличествоОстаток КОНЕЦ)) КАК КоличествоСвободныйОстаток,
	|		СУММА(ВЫБОР КОГДА ОстаткиОрганизации.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ОстаткиОрганизации.КоличествоОстаток КОНЕЦ) КАК КоличествоОстатокОрганизации
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыНаСкладах
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыВРезервеНаСкладах
	|	ПО
	|		ТоварыВРезервеНаСкладах.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Склад <> Неопределено, " И Склад = &Склад", "") + ") КАК ТоварыКПередачеСоСкладов
	|	ПО
	|		ТоварыКПередачеСоСкладов.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыКПередачеСоСкладов.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|		
	|	ПОЛНОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыОрганизаций.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ?(Организация <> Неопределено, " И Организация = &Организация", "") +") КАК ОстаткиОрганизации
	|	ПО
	|		ОстаткиОрганизации.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ОстаткиОрганизации.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ
	|	) КАК Остатки
	|
	|ПО
	|	Остатки.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ГДЕ
	|	СправочникНоменклатура.Родитель = &Родитель
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка,
	|	Остатки.ХарактеристикаНоменклатуры
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросОстаткиВсейНоменклатуры()

// Функция формирует текст запроса по ИмяПодбора = "ВозвратПоставщикуЦеныКонтрагентаИОстатки" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросВозвратПоставщикуЦеныКонтрагентаИОстатки()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.КоличествоСвободныйОстаток               КАК КоличествоСвободныйОстаток,
	|	Подбор.КоличествоОстатокОрганизации             КАК КоличествоОстатокОрганизации,
	|	Подбор.Цена                                     КАК Цена,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.НаименованиеНоменклатурыКонтрагента      КАК НаименованиеНоменклатурыКонтрагента,
	|	Подбор.АртикулНоменклатурыКонтрагента           КАК АртикулНоменклатурыКонтрагента,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	СУММА(Остатки.КоличествоСвободныйОстаток)                КАК КоличествоСвободныйОстаток,
	|	СУММА(Остатки.КоличествоОстатокОрганизации)              КАК КоличествоОстатокОрганизации,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ИНАЧЕ ЦеныСрезПоследних.Цена КОНЕЦ) КАК Цена,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения ИНАЧЕ ЦеныСрезПоследних.ЕдиницаИзмерения КОНЕЦ) КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Валюта ИНАЧЕ ЦеныСрезПоследних.Валюта КОНЕЦ) КАК Валюта,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	МАКСИМУМ(ВЫБОР КОГДА СправочникНоменклатура.ЭтоГруппа ТОГДА NULL ИНАЧЕ ВЫРАЗИТЬ(НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента КАК Строка(100)) КОНЕЦ) КАК НаименованиеНоменклатурыКонтрагента,
	|	МАКСИМУМ(ВЫБОР КОГДА СправочникНоменклатура.ЭтоГруппа ТОГДА NULL ИНАЧЕ НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента КОНЕЦ) КАК АртикулНоменклатурыКонтрагента,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ФлагУсловийПоставки
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ЦеныТаблицаСрезПоследних.Номенклатура               КАК Номенклатура,
	|		ЦеныТаблицаСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВЫБОР КОГДА ЦеныТаблицаСрезПоследних.ЕдиницаИзмерения = ЦеныТаблицаСрезПоследних.Номенклатура.ЕдиницаХраненияОстатков
	|			  ТОГДА ЦеныТаблицаСрезПоследних.Цена
	|			  ИНАЧЕ ЦеныТаблицаСрезПоследних.Цена * (ЦеныТаблицаСрезПоследних.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныТаблицаСрезПоследних.ЕдиницаИзмерения.Коэффициент) КОНЕЦ КАК Цена,
	|		ЦеныТаблицаСрезПоследних.ЕдиницаИзмерения           КАК ЕдиницаИзмерения,
	|		ЦеныТаблицаСрезПоследних.Валюта                     КАК Валюта
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И ТипЦен = &ТипЦен) КАК ЦеныТаблицаСрезПоследних
	|
	|	) КАК ЦеныСрезПоследних
	|ПО
	|	ЦеныСрезПоследних.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ                                           КАК Номенклатура,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|		СУММА((ВЫБОР КОГДА ТоварыНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыВРезервеНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыВРезервеНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыКПередачеСоСкладов.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыКПередачеСоСкладов.КоличествоОстаток КОНЕЦ)) КАК КоличествоСвободныйОстаток,
	|		СУММА(ВЫБОР КОГДА ОстаткиОрганизации.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ОстаткиОрганизации.КоличествоОстаток КОНЕЦ) КАК КоличествоОстатокОрганизации
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И Склад = &Склад) КАК ТоварыНаСкладах
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И Склад = &Склад) КАК ТоварыВРезервеНаСкладах
	|	ПО
	|		ТоварыВРезервеНаСкладах.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И Склад = &Склад) КАК ТоварыКПередачеСоСкладов
	|	ПО
	|		ТоварыКПередачеСоСкладов.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыКПередачеСоСкладов.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|		
	|	ПОЛНОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыОрганизаций.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И Организация = &Организация) КАК ОстаткиОрганизации
	|	ПО
	|		ОстаткиОрганизации.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ОстаткиОрганизации.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ
	|	) КАК Остатки
	|
	|ПО
	|	Остатки.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	(Остатки.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.ХарактеристикаНоменклатуры ИЛИ ЦеныСрезПоследних.ХарактеристикаНоменклатуры = &ПустаяХарактеристика)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		НоменклатураКонтрагентов.Номенклатура,
	|		НоменклатураКонтрагентов.Контрагент,
	|		НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента КАК НаименованиеНоменклатурыКонтрагента,
	|		НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента      КАК АртикулНоменклатурыКонтрагента
	|	ИЗ
	|		РегистрСведений.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|
	|	) КАК НоменклатураКонтрагентов
	|ПО
	|	НоменклатураКонтрагентов.Номенклатура = СправочникНоменклатура.Ссылка
	|	И НоменклатураКонтрагентов.Контрагент = &Контрагент
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура     КАК Номенклатура,
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВЫБОР КОГДА ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения = ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура.ЕдиницаХраненияОстатков
	|			  ТОГДА ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена
	|			  ИНАЧЕ ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена * (ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения.Коэффициент) КОНЕЦ КАК Цена,
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены       КАК Валюта
	|	ИЗ
	|		РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|
	|	) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ
	|
	|ГДЕ
	|	(СправочникНоменклатура.Родитель = &Родитель) И
	|	((СправочникНоменклатура.Ссылка.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор)
	|	ИЛИ
	|	((Остатки.КоличествоСвободныйОстаток > 0"+?(РазрешеноПревышениеОстаткаТоваровОрганизации(),""," И Остатки.КоличествоОстатокОрганизации > 0")+") И ((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена > 0) ИЛИ ((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена = 0 ИЛИ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) И ЦеныСрезПоследних.Цена > 0))))
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросВозвратПоставщикуЦеныКонтрагентаИОстатки()

// Функция формирует текст запроса по ИмяПодбора = "ВозвратПоставщикуНоменклатураКонтрагентаИОстатки" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросВозвратПоставщикуНоменклатураКонтрагентаИОстатки()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.КоличествоСвободныйОстаток               КАК КоличествоСвободныйОстаток,
	|	Подбор.КоличествоОстатокОрганизации             КАК КоличествоОстатокОрганизации,
	|	Подбор.Цена                                     КАК Цена,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.НаименованиеНоменклатурыКонтрагента      КАК НаименованиеНоменклатурыКонтрагента,
	|	Подбор.АртикулНоменклатурыКонтрагента           КАК АртикулНоменклатурыКонтрагента,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	СУММА(Остатки.КоличествоСвободныйОстаток)                КАК КоличествоСвободныйОстаток,
	|	СУММА(Остатки.КоличествоОстатокОрганизации)              КАК КоличествоОстатокОрганизации,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ИНАЧЕ ЦеныСрезПоследних.Цена КОНЕЦ) КАК Цена,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения ИНАЧЕ ЦеныСрезПоследних.ЕдиницаИзмерения КОНЕЦ) КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Валюта ИНАЧЕ ЦеныСрезПоследних.Валюта КОНЕЦ) КАК Валюта,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	МАКСИМУМ(ВЫБОР КОГДА СправочникНоменклатура.ЭтоГруппа ТОГДА NULL ИНАЧЕ ВЫРАЗИТЬ(НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента КАК Строка(100)) КОНЕЦ) КАК НаименованиеНоменклатурыКонтрагента,
	|	МАКСИМУМ(ВЫБОР КОГДА СправочникНоменклатура.ЭтоГруппа ТОГДА NULL ИНАЧЕ НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента КОНЕЦ) КАК АртикулНоменклатурыКонтрагента,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ФлагУсловийПоставки
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ПРАВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		НоменклатураКонтрагентов.Номенклатура,
	|		НоменклатураКонтрагентов.Контрагент,
	|		НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента КАК НаименованиеНоменклатурыКонтрагента,
	|		НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента      КАК АртикулНоменклатурыКонтрагента
	|	ИЗ
	|		РегистрСведений.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|	ГДЕ
	|		НоменклатураКонтрагентов.Контрагент = &Контрагент
	|		И
	|		НоменклатураКонтрагентов.Номенклатура.Родитель = &Родитель
	|	) КАК НоменклатураКонтрагентов
	|ПО
	|	НоменклатураКонтрагентов.Номенклатура = СправочникНоменклатура.Ссылка
	|	ИЛИ
	|	СправочникНоменклатура.ЭтоГруппа = ИСТИНА
	|	ИЛИ 
	|	СправочникНоменклатура.Набор
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ЦеныТаблицаСрезПоследних.Номенклатура               КАК Номенклатура,
	|		ЦеныТаблицаСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВЫБОР КОГДА ЦеныТаблицаСрезПоследних.ЕдиницаИзмерения = ЦеныТаблицаСрезПоследних.Номенклатура.ЕдиницаХраненияОстатков
	|			  ТОГДА ЦеныТаблицаСрезПоследних.Цена
	|			  ИНАЧЕ ЦеныТаблицаСрезПоследних.Цена * (ЦеныТаблицаСрезПоследних.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныТаблицаСрезПоследних.ЕдиницаИзмерения.Коэффициент) КОНЕЦ КАК Цена,
	|		ЦеныТаблицаСрезПоследних.ЕдиницаИзмерения           КАК ЕдиницаИзмерения,
	|		ЦеныТаблицаСрезПоследних.Валюта                     КАК Валюта
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И ТипЦен = &ТипЦен) КАК ЦеныТаблицаСрезПоследних
	|
	|	) КАК ЦеныСрезПоследних
	|ПО
	|	ЦеныСрезПоследних.Номенклатура = СправочникНоменклатура.Ссылка
	|	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ                                           КАК Номенклатура,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|		СУММА((ВЫБОР КОГДА ТоварыНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыВРезервеНаСкладах.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыВРезервеНаСкладах.КоличествоОстаток КОНЕЦ)
	|		      - (ВЫБОР КОГДА ТоварыКПередачеСоСкладов.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ТоварыКПередачеСоСкладов.КоличествоОстаток КОНЕЦ)) КАК КоличествоСвободныйОстаток,
	|		СУММА(ВЫБОР КОГДА ОстаткиОрганизации.КоличествоОстаток ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ОстаткиОрганизации.КоличествоОстаток КОНЕЦ) КАК КоличествоОстатокОрганизации
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И Склад = &Склад) КАК ТоварыНаСкладах
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И Склад = &Склад) КАК ТоварыВРезервеНаСкладах
	|	ПО
	|		ТоварыВРезервеНаСкладах.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И Склад = &Склад) КАК ТоварыКПередачеСоСкладов
	|	ПО
	|		ТоварыКПередачеСоСкладов.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ТоварыКПередачеСоСкладов.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|		
	|	ПОЛНОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ТоварыОрганизаций.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И Организация = &Организация) КАК ОстаткиОрганизации
	|	ПО
	|		ОстаткиОрганизации.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		И
	|		ОстаткиОрганизации.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР КОГДА ТоварыНаСкладах.Номенклатура ЕСТЬ NULL ТОГДА ОстаткиОрганизации.Номенклатура ИНАЧЕ ТоварыНаСкладах.Номенклатура КОНЕЦ,
	|		ВЫБОР КОГДА ТоварыНаСкладах.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА ОстаткиОрганизации.ХарактеристикаНоменклатуры ИНАЧЕ ТоварыНаСкладах.ХарактеристикаНоменклатуры КОНЕЦ
	|	) КАК Остатки
	|
	|ПО
	|	Остатки.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	(Остатки.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.ХарактеристикаНоменклатуры ИЛИ ЦеныСрезПоследних.ХарактеристикаНоменклатуры = &ПустаяХарактеристика)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура     КАК Номенклатура,
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВЫБОР КОГДА ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения = ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура.ЕдиницаХраненияОстатков
	|			  ТОГДА ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена
	|			  ИНАЧЕ ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена * (ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения.Коэффициент) КОНЕЦ КАК Цена,
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены       КАК Валюта
	|	ИЗ
	|		РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|
	|	) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ
	|
	|ГДЕ
	|	
	|	СправочникНоменклатура.Родитель = &Родитель
	|	И
	|	((СправочникНоменклатура.Ссылка.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор)
	|	ИЛИ
	|	(Остатки.КоличествоСвободныйОстаток > 0"+?(РазрешеноПревышениеОстаткаТоваровОрганизации(),""," И Остатки.КоличествоОстатокОрганизации > 0")+"))
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросВозвратПоставщикуНоменклатураКонтрагентаИОстатки()

// Функция формирует текст запроса по ИмяПодбора = "ОстаткиУКомиссионеров" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросОстаткиУКомиссионеров()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.КоличествоСвободныйОстаток               КАК КоличествоСвободныйОстаток,
	|	Подбор.Цена                                     КАК Цена,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	СУММА(Остатки.Количество)                                КАК КоличествоСвободныйОстаток,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ИНАЧЕ ЦеныСрезПоследних.Цена КОНЕЦ) КАК Цена,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения ИНАЧЕ ЦеныСрезПоследних.ЕдиницаИзмерения КОНЕЦ) КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены ИНАЧЕ ЦеныСрезПоследних.Валюта КОНЕЦ) КАК Валюта,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ФлагУсловийПоставки
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаРегистраСведений, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
	|ПО
	|	ЦеныСрезПоследних.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ТоварыПереданныеОстатки.Номенклатура               КАК Номенклатура,
	|		ТоварыПереданныеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		СУММА(ВЫБОР КОГДА ЗаказыПокупателейОстатки.КоличествоОстаток ЕСТЬ NULL ТОГДА ТоварыПереданныеОстатки.КоличествоОстаток ИНАЧЕ (ТоварыПереданныеОстатки.КоличествоОстаток - ЗаказыПокупателейОстатки.КоличествоОстаток) КОНЕЦ) КАК Количество
	|
	|	ИЗ
	|		РегистрНакопления.ТоварыПереданные.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И (ДоговорКонтрагента = &ДоговорКонтрагента И СтатусПередачи = &СтатусКомиссия)) КАК ТоварыПереданныеОстатки
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрНакопления.ЗаказыПокупателей.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ") КАК ЗаказыПокупателейОстатки
	|		ПО
	|			ТоварыПереданныеОстатки.Номенклатура = ЗаказыПокупателейОстатки.Номенклатура
	|			И
	|			ТоварыПереданныеОстатки.ХарактеристикаНоменклатуры = ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры
	|			И
	|			ТоварыПереданныеОстатки.Сделка = ЗаказыПокупателейОстатки.ЗаказПокупателя
	|
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыПереданныеОстатки.Номенклатура,
	|		ТоварыПереданныеОстатки.ХарактеристикаНоменклатуры
	|
	|	) КАК Остатки
	|
	|ПО
	|	Остатки.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	(Остатки.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.ХарактеристикаНоменклатуры ИЛИ ЦеныСрезПоследних.ХарактеристикаНоменклатуры = &ПустаяХарактеристика)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ
	|
	|ГДЕ
	|	СправочникНоменклатура.Родитель = &Родитель
	|	И
	|	((СправочникНоменклатура.Ссылка.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор)
	|	ИЛИ
	|	(Остатки.Количество > 0))
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросОстаткиУКомиссионеров()

// Функция формирует текст запроса по ИмяПодбора = "ОстаткиТоваровКомитентов" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросОстаткиТоваровКомитентов()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.КоличествоСвободныйОстаток               КАК КоличествоСвободныйОстаток,
	|	Подбор.Цена                                     КАК Цена,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.НаименованиеНоменклатурыКонтрагента      КАК НаименованиеНоменклатурыКонтрагента,
	|	Подбор.АртикулНоменклатурыКонтрагента           КАК АртикулНоменклатурыКонтрагента,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                                      КАК Код,
	|	СправочникНоменклатура.Артикул                                  КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                                КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                          КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                                    КАК Набор,
	|	СправочникНоменклатура.Услуга                                   КАК Услуга,
	|	СправочникНоменклатура.Ссылка                                   КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                                 КАК Родитель,
	|	СУММА(Остатки.Количество)                                       КАК КоличествоСвободныйОстаток,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ИНАЧЕ ЦеныСрезПоследних.Цена КОНЕЦ) КАК Цена,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения ИНАЧЕ ЦеныСрезПоследних.ЕдиницаИзмерения КОНЕЦ) КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Валюта ИНАЧЕ ЦеныСрезПоследних.Валюта КОНЕЦ) КАК Валюта,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	МАКСИМУМ(ВЫБОР КОГДА СправочникНоменклатура.ЭтоГруппа ТОГДА NULL ИНАЧЕ ВЫРАЗИТЬ(НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента КАК Строка(100)) КОНЕЦ) КАК НаименованиеНоменклатурыКонтрагента,
	|	МАКСИМУМ(ВЫБОР КОГДА СправочникНоменклатура.ЭтоГруппа ТОГДА NULL ИНАЧЕ НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента КОНЕЦ) КАК АртикулНоменклатурыКонтрагента,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ФлагУсловийПоставки
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ЦеныТаблицаСрезПоследних.Номенклатура               КАК Номенклатура,
	|		ЦеныТаблицаСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВЫБОР КОГДА ЦеныТаблицаСрезПоследних.ЕдиницаИзмерения = ЦеныТаблицаСрезПоследних.Номенклатура.ЕдиницаХраненияОстатков
	|			  ТОГДА ЦеныТаблицаСрезПоследних.Цена
	|			  ИНАЧЕ ЦеныТаблицаСрезПоследних.Цена * (ЦеныТаблицаСрезПоследних.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныТаблицаСрезПоследних.ЕдиницаИзмерения.Коэффициент) КОНЕЦ КАК Цена,
	|		ЦеныТаблицаСрезПоследних.ЕдиницаИзмерения           КАК ЕдиницаИзмерения,
	|		ЦеныТаблицаСрезПоследних.Валюта                     КАК Валюта
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И ТипЦен = &ТипЦен) КАК ЦеныТаблицаСрезПоследних
	|
	|	) КАК ЦеныСрезПоследних
	|ПО
	|	ЦеныСрезПоследних.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ТоварыПолученныеОстатки.Номенклатура               КАК Номенклатура,
	|		ТоварыПолученныеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		СУММА(ВЫБОР КОГДА ЗаказыПоставщикамОстатки.КоличествоОстаток ЕСТЬ NULL ТОГДА ТоварыПолученныеОстатки.КоличествоОстаток ИНАЧЕ (ТоварыПолученныеОстатки.КоличествоОстаток - ЗаказыПоставщикамОстатки.КоличествоОстаток) КОНЕЦ) КАК Количество
	|
	|	ИЗ
	|		РегистрНакопления.ТоварыПолученные.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И (ДоговорКонтрагента = &ДоговорКонтрагента И СтатусПолучения = &СтатусКомиссия)) КАК ТоварыПолученныеОстатки
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрНакопления.ЗаказыПоставщикам.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + ") КАК ЗаказыПоставщикамОстатки
	|		ПО
	|			ТоварыПолученныеОстатки.Номенклатура = ЗаказыПоставщикамОстатки.Номенклатура
	|			И
	|			ТоварыПолученныеОстатки.ХарактеристикаНоменклатуры = ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры
	|			И
	|			ТоварыПолученныеОстатки.Сделка = ЗаказыПоставщикамОстатки.ЗаказПоставщику
	|
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыПолученныеОстатки.Номенклатура,
	|		ТоварыПолученныеОстатки.ХарактеристикаНоменклатуры
	|
	|	) КАК Остатки
	|
	|ПО
	|	Остатки.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	(Остатки.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.ХарактеристикаНоменклатуры ИЛИ ЦеныСрезПоследних.ХарактеристикаНоменклатуры = &ПустаяХарактеристика)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		НоменклатураКонтрагентов.Номенклатура,
	|		НоменклатураКонтрагентов.Контрагент,
	|		НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента КАК НаименованиеНоменклатурыКонтрагента,
	|		НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента      КАК АртикулНоменклатурыКонтрагента
	|	ИЗ
	|		РегистрСведений.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|
	|	) КАК НоменклатураКонтрагентов
	|ПО
	|	НоменклатураКонтрагентов.Номенклатура = СправочникНоменклатура.Ссылка
	|	И НоменклатураКонтрагентов.Контрагент = &Контрагент
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|	ВЫБРАТЬ
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура КАК Номенклатура,
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВЫБОР КОГДА ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения = ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура.ЕдиницаХраненияОстатков
	|			  ТОГДА ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена
	|			  ИНАЧЕ ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена * (ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения.Коэффициент) КОНЕЦ КАК Цена,
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены       КАК Валюта
	|	ИЗ
	|		РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК ТаблицаУсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|
	|	) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ
	|
	|ГДЕ
	|	СправочникНоменклатура.Родитель = &Родитель
	|	И
	|	((СправочникНоменклатура.Ссылка.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор)
	|	ИЛИ
	|	(Остатки.Количество > 0))
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка,
	|	ВЫБОР КОГДА ЦеныСрезПоследних.ХарактеристикаНоменклатуры ЕСТЬ NULL ТОГДА Остатки.ХарактеристикаНоменклатуры ИНАЧЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры КОНЕЦ,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросОстаткиТоваровКомитентов()

// Функция формирует текст запроса по ИмяПодбора = "ОстаткиНеавтоматизированнаяТорговаяТочка" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросОстаткиНеавтоматизированнаяТорговаяТочка()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.КоличествоСвободныйОстаток               КАК КоличествоСвободныйОстаток,
	|	Подбор.Цена                                     КАК Цена,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	СУММА(Остатки.КоличествоОстаток)                         КАК КоличествоСвободныйОстаток,
	|	Остатки.ЦенаВРознице                                     КАК Цена,
	|	МАКСИМУМ(СправочникНоменклатура.ЕдиницаХраненияОстатков) КАК ЕдиницаИзмерения,
	|	&ВалютаРегламентированногоУчета                          КАК Валюта,
	|	Остатки.ХарактеристикаНоменклатуры                       КАК ХарактеристикаНоменклатуры,
	|	Ложь                                                     КАК ФлагУсловийПоставки
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыВНеавтоматизированныхТорговыхТочках.Остатки(&Дата, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И Склад = &Склад) КАК Остатки
	|ПО
	|	Остатки.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ГДЕ
	|	СправочникНоменклатура.Родитель = &Родитель
	|	И
	|	((СправочникНоменклатура.Ссылка.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор)
	|	ИЛИ
	|	(Остатки.КоличествоОстаток > 0))
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.ЦенаВРознице
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросОстаткиНеавтоматизированнаяТорговаяТочка()

// Функция формирует текст запроса по ИмяПодбора = "РасходУслуги" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросРасходУслуги()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	СправочникНоменклатура.ЕдиницаХраненияОстатков           КАК ЕдиницаИзмерения
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ГДЕ
	|	СправочникНоменклатура.Родитель = &Родитель
	|	И
	|	(СправочникНоменклатура.Услуга = Истина
	|	ИЛИ
	|	СправочникНоменклатура.ЭтоГруппа = Истина ИЛИ СправочникНоменклатура.Набор)
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросРасходУслуги()

// Функция формирует текст запроса по ИмяПодбора = "РасходЦеныУслуг" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросРасходЦеныУслуг()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.Цена                                     КАК Цена,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ИНАЧЕ ЦеныСрезПоследних.Цена КОНЕЦ) КАК Цена,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения ИНАЧЕ ЦеныСрезПоследних.ЕдиницаИзмерения КОНЕЦ) КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены ИНАЧЕ ЦеныСрезПоследних.Валюта КОНЕЦ) КАК Валюта,
	|	ЦеныСрезПоследних.ХарактеристикаНоменклатуры             КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ФлагУсловийПоставки
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаРегистраСведений, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
	|ПО
	|	ЦеныСрезПоследних.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.ХарактеристикаНоменклатуры
	|
	|ГДЕ
	|	(СправочникНоменклатура.Родитель = &Родитель) И
	|	((СправочникНоменклатура.Ссылка.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор)
	|	ИЛИ
	|	(((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена > 0) ИЛИ ((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена = 0 ИЛИ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) И ЦеныСрезПоследних.Цена > 0)) И СправочникНоменклатура.Услуга = Истина))
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка,
	|	ЦеныСрезПоследних.ХарактеристикаНоменклатуры,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросРасходЦеныУслуг()

// Функция формирует текст запроса по ИмяПодбора = "РасходПоЦенамНоменклатуры" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросРасходПоЦенамНоменклатуры()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.Цена                                     КАК Цена,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ИНАЧЕ ЦеныСрезПоследних.Цена КОНЕЦ) КАК Цена,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения ИНАЧЕ ЦеныСрезПоследних.ЕдиницаИзмерения КОНЕЦ) КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены ИНАЧЕ ЦеныСрезПоследних.Валюта КОНЕЦ) КАК Валюта,
	|	ЦеныСрезПоследних.ХарактеристикаНоменклатуры             КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ФлагУсловийПоставки
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаРегистраСведений, " + мТекстЗапросаОтборНоменклатурыПоРодителю + " И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
	|ПО
	|	ЦеныСрезПоследних.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = СправочникНоменклатура.Ссылка
	|	И
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.ХарактеристикаНоменклатуры
	|
	|ГДЕ
	|	(СправочникНоменклатура.Родитель = &Родитель) И
	|	((СправочникНоменклатура.Ссылка.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор)
	|	ИЛИ
	|	((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена > 0) ИЛИ ((УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена = 0 ИЛИ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) И ЦеныСрезПоследних.Цена > 0)))
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка,
	|	ЦеныСрезПоследних.ХарактеристикаНоменклатуры,
	|	ВЫБОР КОГДА (УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена <> 0 И НЕ УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена ЕСТЬ NULL) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросРасходПоЦенамНоменклатуры()

// Функция формирует текст запроса по ИмяПодбора = "ЛимитПокупателю" и "ЛимитПоставщика" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросЛимитПокупателю_ЛимитПоставщика(ИмяПодбора)

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.Лимит                                    КАК Лимит,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	МАКСИМУМ(Лимиты."+ИмяПодбора+")                          КАК Лимит,
	|	МАКСИМУМ(СправочникНоменклатура.ЕдиницаХраненияОстатков) КАК ЕдиницаИзмерения
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЛимитыВозвратнойТары.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК Лимиты
	|ПО
	|	Лимиты.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ГДЕ
	|	(СправочникНоменклатура.Родитель = &Родитель) И
	|	((СправочникНоменклатура.Ссылка.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор)
	|	  ИЛИ
	|	 (Лимиты."+ИмяПодбора+" > 0))
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросЛимитПокупателю_ЛимитПоставщика()

// Функция определяет какой запрос надо использовать для заполнения табличной части
//
// Параметры
//  ИмяПодбора  - строка, имя подбора для определения запроса
//  Родитель    - СправочникСсылка.Номенклатура, родитель для элементов, по коротым будет строиться запрос
//  ДатаЗапроса - Дата, на которую будут рассчитываться остатки и пр.
//
// Возвращаемое значение:
//   Запрос, с заполненным текстом и параметрами
//
Функция ПолучитьЗапросДляПодбора(ИмяПодбора, Родитель, ДатаЗапроса) Экспорт

	Запрос = Новый Запрос;

	мИмяРегистраДляПодбораСерий = "";

	СписокПараметровЗапроса = ПолучитьСписокПараметровЗапроса(ИмяПодбора);

	Если ИмяПодбора = "ПриходЦеныКонтрагента" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(ЗначениеНеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Запрос.УстановитьПараметр("ПустаяХарактеристика" , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		Запрос.Текст = ЗапросПриходЦеныКонтрагента();

	ИначеЕсли ИмяПодбора = "ПриходНоменклатураКонтрагента" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(ЗначениеНеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Запрос.УстановитьПараметр("ПустаяХарактеристика" , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		Запрос.Текст = ЗапросПриходНоменклатураКонтрагента();

	ИначеЕсли ИмяПодбора = "ПриходНоменклатураКонтрагентаБезЦенИОстатков" Тогда

		Запрос.УстановитьПараметр("Родитель", Родитель);
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		Запрос.Текст = ЗапросПриходНоменклатураКонтрагентаБезЦенИОстатков();

	ИначеЕсли ИмяПодбора = "РасходЦеныНоменклатуры"
		  ИЛИ ИмяПодбора = "РасходЦеныПлановойСебестоимостиНоменклатуры" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(ЗначениеНеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Запрос.УстановитьПараметр("ПустаяХарактеристика" , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Если ЭлементСписка.Значение = "ТипЦен" И СтруктураИсходныхПараметров[ЭлементСписка.Значение].Рассчитывается Тогда
				Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение].БазовыйТипЦен);
			Иначе
				Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
			КонецЕсли;
		КонецЦикла;

		Если ИмяПодбора = "РасходЦеныПлановойСебестоимостиНоменклатуры" Тогда
			ПлановыйТипЦен = Константы.ТипЦенПлановойСебестоимостиНоменклатуры.Получить();
			Если ПлановыйТипЦен.Рассчитывается Тогда
				Запрос.УстановитьПараметр(ЭлементСписка.Значение , ПлановыйТипЦен.БазовыйТипЦен);
			Иначе
				Запрос.УстановитьПараметр("ТипЦен", ПлановыйТипЦен);
			КонецЕсли;
		КонецЕсли;

		Организация = СтруктураИсходныхПараметров["Организация"];
		Склад       = СтруктураИсходныхПараметров["Склад"];

		мИмяРегистраДляПодбораСерий = "ТоварыНаСкладах";

		Запрос.Текст = ЗапросРасходЦеныНоменклатуры_РасходЦеныПлановойСебестоимостиНоменклатуры(Склад, Организация);

	ИначеЕсли ИмяПодбора = "РасходОстаткиИЦеныНоменклатуры"
		  ИЛИ ИмяПодбора = "РасходОстаткиКачествоИЦеныНоменклатуры" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(ЗначениеНеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Запрос.УстановитьПараметр("ПустаяХарактеристика" , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Если ЭлементСписка.Значение = "ТипЦен" И СтруктураИсходныхПараметров[ЭлементСписка.Значение].Рассчитывается Тогда
				Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение].БазовыйТипЦен);
			Иначе
				Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
			КонецЕсли;
		КонецЦикла;

		Организация = СтруктураИсходныхПараметров["Организация"];
		Склад       = СтруктураИсходныхПараметров["Склад"];

		мИмяРегистраДляПодбораСерий = "ТоварыНаСкладах";

		Если ИмяПодбора = "РасходОстаткиКачествоИЦеныНоменклатуры" Тогда
			Запрос.Текст = ЗапросРасходОстаткиКачествоИЦеныНоменклатуры(Склад, Организация);
		Иначе
			Запрос.Текст = ЗапросРасходОстаткиИЦеныНоменклатуры(Склад, Организация);
		КонецЕсли;

	ИначеЕсли ИмяПодбора = "ОстаткиНоменклатуры"
		  ИЛИ ИмяПодбора = "ОстаткиИКачествоНоменклатуры" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(ЗначениеНеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		Организация = СтруктураИсходныхПараметров["Организация"];
		Склад       = СтруктураИсходныхПараметров["Склад"];

		мИмяРегистраДляПодбораСерий = "ТоварыНаСкладах";

		Если ИмяПодбора = "ОстаткиИКачествоНоменклатуры" Тогда
			Запрос.Текст = ЗапросОстаткиИКачествоНоменклатуры(Склад, Организация);
		Иначе
			Запрос.Текст = ЗапросОстаткиНоменклатуры(Склад, Организация);
		КонецЕсли;

	ИначеЕсли ИмяПодбора = "ОстаткиВсейНоменклатуры" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(ЗначениеНеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		Организация = СтруктураИсходныхПараметров["Организация"];
		Склад       = СтруктураИсходныхПараметров["Склад"];

		мИмяРегистраДляПодбораСерий = "ТоварыНаСкладах";

		Запрос.Текст = ЗапросОстаткиВсейНоменклатуры(Склад, Организация);

	ИначеЕсли ИмяПодбора = "ВозвратПоставщикуЦеныКонтрагентаИОстатки" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(ЗначениеНеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Запрос.УстановитьПараметр("ПустаяХарактеристика" , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		мИмяРегистраДляПодбораСерий = "ТоварыНаСкладах";

		Запрос.Текст = ЗапросВозвратПоставщикуЦеныКонтрагентаИОстатки();

	ИначеЕсли ИмяПодбора = "ВозвратПоставщикуНоменклатураКонтрагентаИОстатки" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(ЗначениеНеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Запрос.УстановитьПараметр("ПустаяХарактеристика" , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		мИмяРегистраДляПодбораСерий = "ТоварыНаСкладах";

		Запрос.Текст = ЗапросВозвратПоставщикуНоменклатураКонтрагентаИОстатки();

	ИначеЕсли  ИмяПодбора = "ОстаткиУКомиссионеров" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(ЗначениеНеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("СтатусКомиссия"       , Перечисления.СтатусыПолученияПередачиТоваров.НаКомиссию);
		Запрос.УстановитьПараметр("ПустаяХарактеристика" , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Если ЭлементСписка.Значение = "ТипЦен" И СтруктураИсходныхПараметров[ЭлементСписка.Значение].Рассчитывается Тогда
				Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение].БазовыйТипЦен);
			Иначе
				Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
			КонецЕсли;
		КонецЦикла;

		мИмяРегистраДляПодбораСерий = "ТоварыОрганизаций";

		Запрос.Текст = ЗапросОстаткиУКомиссионеров();

	ИначеЕсли ИмяПодбора = "ОстаткиТоваровКомитентов" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(ЗначениеНеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Запрос.УстановитьПараметр("СтатусКомиссия"       , Перечисления.СтатусыПолученияПередачиТоваров.НаКомиссию);
		Запрос.УстановитьПараметр("ПустаяХарактеристика" , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		мИмяРегистраДляПодбораСерий = "ТоварыНаСкладах";

		Запрос.Текст = ЗапросОстаткиТоваровКомитентов();

	ИначеЕсли ИмяПодбора = "ОстаткиНеавтоматизированнаяТорговаяТочка" Тогда

		Запрос.УстановитьПараметр("Дата"                           , ДатаЗапроса);
		Запрос.УстановитьПараметр("Родитель"                       , Родитель);
		Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета" , Константы.ВалютаРегламентированногоУчета.Получить());
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		мИмяРегистраДляПодбораСерий = "ТоварыВНеавтоматизированныхТорговыхТочках";

		Запрос.Текст = ЗапросОстаткиНеавтоматизированнаяТорговаяТочка();

	ИначеЕсли ИмяПодбора = "РасходУслуги" Тогда

		Запрос.УстановитьПараметр("Родитель", Родитель);

		Запрос.Текст = ЗапросРасходУслуги();

	ИначеЕсли ИмяПодбора = "РасходЦеныУслуг" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(ЗначениеНеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Если ЭлементСписка.Значение = "ТипЦен" И СтруктураИсходныхПараметров[ЭлементСписка.Значение].Рассчитывается Тогда
				Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение].БазовыйТипЦен);
			Иначе
				Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
			КонецЕсли;
		КонецЦикла;

		Запрос.Текст = ЗапросРасходЦеныУслуг();

	ИначеЕсли ИмяПодбора = "РасходПоЦенамНоменклатуры" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(ЗначениеНеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Если ЭлементСписка.Значение = "ТипЦен" И СтруктураИсходныхПараметров[ЭлементСписка.Значение].Рассчитывается Тогда
				Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение].БазовыйТипЦен);
			Иначе
				Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
			КонецЕсли;
		КонецЦикла;

		Запрос.Текст = ЗапросРасходПоЦенамНоменклатуры();

	ИначеЕсли ИмяПодбора = "ЛимитПокупателю" 
		  ИЛИ ИмяПодбора = "ЛимитПоставщика" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(ЗначениеНеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		Запрос.Текст = ЗапросЛимитПокупателю_ЛимитПоставщика(ИмяПодбора);

	КонецЕсли;

	Если ПустаяСтрока(Запрос.Текст) Тогда
		Возврат Неопределено;
	Иначе
		Возврат Запрос;
	КонецЕсли; 

КонецФункции // ПолучитьЗапросДляПодбора()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМЫ ВВОДА ДОПОЛНИТЕЛЬНЫХ ПАРАМЕТРОВ

// Процедура формирует и выводит сумму в информационной надписи.
//
Процедура мОбновитьНадписьФомулаСумма(Форма) Экспорт

	Если Форма.ЭлементыФормы.Найти("ТаблицаХарактеристикНоменклатуры") = Неопределено Тогда
		Форма.ЭлементыФормы.НадписьФомулаСумма.Заголовок = ФорматСумм(Форма.Цена * Форма.Количество,,"0,00");
	Иначе
		ИтоговаяСумма = 0;
		Для Каждого СтрокаТабличнойЧасти Из Форма.ТаблицаХарактеристикНоменклатуры Цикл
			ИтоговаяСумма = ИтоговаяСумма + ПересчитатьЦенуПриИзмененииВалюты(СтрокаТабличнойЧасти.Цена, СтрокаТабличнойЧасти.ВалютаЦены, Форма.ВалютаЦены) * СтрокаТабличнойЧасти.Количество;
		КонецЦикла;
		Форма.ЭлементыФормы.НадписьФомулаСумма.Заголовок = ИтоговаяСумма;
	КонецЕсли;

КонецПроцедуры // мОбновитьНадписьФомулаСумма()

// Процедура возвращает в форму-владельца выбранные значения.
//
Процедура мВыборВозврат(Форма) Экспорт

	Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	Если Форма.ЭлементыФормы.Найти("ТаблицаХарактеристикНоменклатуры") <> Неопределено Тогда

		МассивСтруктурПараметров = Новый Массив;

		Для Каждого СтрокаТаблицыХарактеристик Из Форма.ТаблицаХарактеристикНоменклатуры Цикл

			Если СтрокаТаблицыХарактеристик.Количество <> 0 Тогда
				Характеристика = СтрокаТаблицыХарактеристик.Характеристика;
				Если ТипЗнч(Характеристика) <> Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
					Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(); // Это строка = нужно присвоить пустую ссылку
				КонецЕсли;

				СтруктураПараметров = Новый Структура();
				СтруктураПараметров.Вставить("ЕдиницаИзмерения", СтрокаТаблицыХарактеристик.ЕдиницаИзмерения);
				СтруктураПараметров.Вставить("Количество",       СтрокаТаблицыХарактеристик.Количество);
				СтруктураПараметров.Вставить("Цена",             СтрокаТаблицыХарактеристик.Цена);
				СтруктураПараметров.Вставить("ВалютаЦены",       СтрокаТаблицыХарактеристик.ВалютаЦены);
				СтруктураПараметров.Вставить("Серия",            Форма.Серия);
				СтруктураПараметров.Вставить("Характеристика",   Характеристика);

				МассивСтруктурПараметров.Добавить(СтруктураПараметров);
			КонецЕсли;

		КонецЦикла;

		Форма.Закрыть(МассивСтруктурПараметров);
		Возврат;

	КонецЕсли;

	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ЕдиницаИзмерения", Форма.ЕдиницаИзмерения);
	СтруктураПараметров.Вставить("Количество",       Форма.Количество);
	СтруктураПараметров.Вставить("Цена",             Форма.Цена);
	СтруктураПараметров.Вставить("Серия",            Форма.Серия);
	СтруктураПараметров.Вставить("Характеристика",   Характеристика);

	Форма.Закрыть(СтруктураПараметров);

КонецПроцедуры // мВыборВозврат()

// Процедура - обработчик события "ПриОткрытии" формы.
//
Процедура мПриОткрытии(Форма) Экспорт

	Перем ЗапрашиватьЦену, ЗапрашиватьСерию;
	Перем ЕстьЦена, ЕстьКоличество;

	Форма.Заголовок = "Количество и цена """ + Форма.Номенклатура + """";

	ЗапрашиватьКоличество = Форма.ВладелецФормы.ЗапрашиватьКоличество;
	ЗапрашиватьЦену       = Форма.ВладелецФормы.ЗапрашиватьЦену;
	ЗапрашиватьСерию      = Форма.ВладелецФормы.ЗапрашиватьСерию;

	Если Форма.ЭлементыФормы.Найти("ТаблицаХарактеристикНоменклатуры") = Неопределено Тогда
		Форма.ЭлементыФормы.НадписьКоличество. Доступность = ЗапрашиватьКоличество;
		Форма.ЭлементыФормы.Количество.        Доступность = ЗапрашиватьКоличество;
		Форма.ЭлементыФормы.ЕдиницаИзмерения.  Доступность = ЗапрашиватьКоличество;
		Форма.ЭлементыФормы.НадписьЦена.       Доступность = ЗапрашиватьЦену;
		Форма.ЭлементыФормы.Цена.              Доступность = ЗапрашиватьЦену;
		Форма.ЭлементыФормы.НадписьВалютаЦены. Доступность = ЗапрашиватьЦену;
	Иначе

		Если ЗапрашиватьЦену Тогда
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.Найти("Цена").ПропускатьПриВводе = Ложь;
		Иначе
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.Найти("Цена").ПропускатьПриВводе = Истина;
		КонецЕсли;

		// Активизируем первую строку
		Если Форма.ТаблицаХарактеристикНоменклатуры.Количество() > 0 Тогда
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.ТекущаяСтрока = Форма.ТаблицаХарактеристикНоменклатуры.Получить(0);
		КонецЕсли;

		Если СтруктураИсходныхПараметров.Свойство("ЕстьКоличество" , ЕстьКоличество) И НЕ ЕстьКоличество Тогда
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.Количество.Данные       = "";
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.Количество.ДанныеФлажка = "Количество";
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.Количество.ТекстШапки   = "Подбирать в документ";
		КонецЕсли;

		Если Не СтруктураИсходныхПараметров.Свойство("ЕстьЦена" , ЕстьЦена) Или НЕ ЕстьЦена Тогда
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.Цена.Видимость       = Ложь;
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.ВалютаЦены.Видимость = Ложь;
		Иначе
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.Цена.Видимость       = Истина;
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.ВалютаЦены.Видимость = Истина;
			Если ЗапрашиватьЦену Тогда
				Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.Цена.Доступность       = Истина;
				Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.ВалютаЦены.Доступность = Истина;
			Иначе
				Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.Цена.Доступность       = Ложь;
				Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.ВалютаЦены.Доступность = Ложь;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	Форма.ЭлементыФормы.НадписьВалютаСуммы.Доступность = ЗапрашиватьЦену;
	Форма.ЭлементыФормы.НадписьСумма.      Доступность = ЗапрашиватьЦену;
	Форма.ЭлементыФормы.НадписьФомулаСумма.Доступность = ЗапрашиватьЦену;

	Если Форма.ЭлементыФормы.Найти("Серия") <> Неопределено Тогда
		Форма.ЭлементыФормы.Серия.Доступность = ЗапрашиватьСерию;
	КонецЕсли;

	Если глТорговоеОборудование = Неопределено Тогда
		Форма.ЭлементыФормы.КоманднаяПанельДействийСлева.Видимость = Ложь;
		Форма.ЭлементыФормы.КоманднаяПанельДействийСлева.Кнопки.ПолучитьВес.Доступность = Ложь;
		Форма.ЭлементыФормы.НадписьВесы.Видимость                                     = Ложь;
		Форма.ЭлементыФормы.ТекущиеВесы.Видимость                                     = Ложь;
	ИначеЕсли глТорговоеОборудование.млВесы.Количество() = 0 Тогда
		Форма.ЭлементыФормы.КоманднаяПанельДействийСлева.Видимость = Ложь;
		Форма.ЭлементыФормы.КоманднаяПанельДействийСлева.Кнопки.ПолучитьВес.Доступность = Ложь;
		Форма.ЭлементыФормы.НадписьВесы.Видимость                                     = Ложь;
		Форма.ЭлементыФормы.ТекущиеВесы.Видимость                                     = Ложь;
	Иначе
		Форма.ЭлементыФормы.КоманднаяПанельДействийСлева.Видимость = Истина;
		Форма.ЭлементыФормы.КоманднаяПанельДействийСлева.Кнопки.ПолучитьВес.Доступность = ЗапрашиватьКоличество;

		Если глТорговоеОборудование.млВесы.Количество() = 1 Тогда

			Форма.ЭлементыФормы.НадписьВесы.Видимость                            = Ложь;
			Форма.ЭлементыФормы.ТекущиеВесы.Видимость                            = Ложь;

			Весы = глТорговоеОборудование.млВесы[0];
			Форма.ЭлементыФормы.ТекущиеВесы.СписокВыбора.Добавить(Весы.Модель);
			Форма.ЭлементыФормы.ТекущиеВесы.Значение = Весы.Модель;

		Иначе

			Форма.ЭлементыФормы.НадписьВесы.Видимость                            = ЗапрашиватьКоличество;
			Форма.ЭлементыФормы.ТекущиеВесы.Видимость                            = ЗапрашиватьКоличество;

			Для Каждого Весы Из глТорговоеОборудование.млВесы Цикл
				Форма.ЭлементыФормы.ТекущиеВесы.СписокВыбора.Добавить(Весы.Модель);
			КонецЦикла;

			МодельВесов = ВосстановитьЗначение("ВесыПредыдущегоСеанса");
			Форма.ЭлементыФормы.ТекущиеВесы.Значение = МодельВесов;

		КонецЕсли;
	КонецЕсли;

	мОбновитьНадписьФомулаСумма(Форма);

КонецПроцедуры // мПриОткрытии()

// Процедура - обработчик события "ПриЗакрытии" формы.
//
Процедура мПередЗакрытием(Форма) Экспорт

	Если Форма.ЭлементыФормы.ТекущиеВесы.Значение <> Неопределено Тогда
		СохранитьЗначение("ВесыПредыдущегоСеанса", Форма.ЭлементыФормы.ТекущиеВесы.Значение);
	КонецЕсли;

КонецПроцедуры // мПередЗакрытием()

// Процедура - обработчик события "ОбновлениеОтображения" формы.
//
Процедура мОбновлениеОтображения(Форма) Экспорт

КонецПроцедуры // мОбновлениеОтображения()

// Процедура - обработчик события "ОбработкаВыбора" поля ввода единицы измерения.
//  Пересчитывает цену при изменении единицы измерения.
//
Процедура мЕдиницаИзмеренияОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт

	СтарыйКоэффициент = Элемент.Значение.Коэффициент;
	Если СтарыйКоэффициент <> 0 Тогда
		Форма.Цена = Форма.Цена * ВыбранноеЗначение.Коэффициент / СтарыйКоэффициент;
	КонецЕсли;
	Форма.Активизировать();

КонецПроцедуры // мЕдиницаИзмеренияОбработкаВыбора()

// Процедура - обработчик события "ПриИзменении" поля ввода количества.
//
Процедура мКоличествоПриИзменении(Форма, Элемент) Экспорт

	мОбновитьНадписьФомулаСумма(Форма);

КонецПроцедуры // мКоличествоПриИзменении()

// Процедура - обработчик события "ПриИзменении" поля ввода цены.
//
Процедура мЦенаПриИзменении(Форма, Элемент) Экспорт

	мОбновитьНадписьФомулаСумма(Форма);

КонецПроцедуры // мЦенаПриИзменении()

// Процедура - обработчик события "Нажатие" кнопки "ОК".
//
Процедура мКнопкаОКНажатие(Форма, Элемент) Экспорт

	мВыборВозврат(Форма);

КонецПроцедуры // мКнопкаОКНажатие()

// Процедура - обработчик события "ПриАктивизацииСтроки" табличного поля характеристик номенклатуры.
//
Процедура мТаблицаХарактеристикНоменклатурыПриАктивизацииСтроки(Форма, Элемент) Экспорт

КонецПроцедуры // мТаблицаХарактеристикНоменклатурыПриАктивизацииСтроки()

// Процедура - обработчик события "ПриОкончанииРедактирования" табличного поля характеристик номенклатуры.
//
Процедура мТаблицаХарактеристикНоменклатурыПриОкончанииРедактирования(Форма, Элемент, НоваяСтрока, ОтменаРедактирования) Экспорт

	мОбновитьНадписьФомулаСумма(Форма);

КонецПроцедуры // мТаблицаХарактеристикНоменклатурыПриОкончанииРедактирования()

// Процедура - обработчик события "ПриНачалеРедактирования" табличного поля характеристик номенклатуры.
//
Процедура мТаблицаХарактеристикНоменклатурыПриНачалеРедактирования(Форма, Элемент, НоваяСтрока) Экспорт

	Если НоваяСтрока Тогда
		СтрокаТабличнойЧасти = Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.ТекущиеДанные;
		СтрокаТабличнойЧасти.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КОнецЕсли;

КонецПроцедуры // мТаблицаХарактеристикНоменклатурыПриНачалеРедактирования()

// Процедура - обработчик события "ПриИзменении" пола "Характеристика" таблицы характеристик номенклатуры.
//
Процедура мТаблицаХарактеристикНоменклатурыХарактеристикаПриИзменении(Форма, Элемент) Экспорт

	СтрокаТабличнойЧасти = Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.ТекущиеДанные;

	
	ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");

	Характеристика   = ОписаниеТипов.ПривестиЗначение(СтрокаТабличнойЧасти.Характеристика);
	Номенклатура     = Форма.Номенклатура;
	ЕдиницаИзмерения = Форма.Номенклатура.ЕдиницаХраненияОстатков;
	ВалютаЦены       = Форма.ВалютаЦены;
	ВалютаЦены       = ?(ЗначениеНеЗаполнено(ВалютаЦены), ?(СтруктураИсходныхПараметров.Свойство("ВалютаДокумента"), СтруктураИсходныхПараметров.ВалютаДокумента, Константы.ВалютаРегламентированногоУчета.Получить()), ВалютаЦены);

	// Получим Цену
	Цена = 0;
	Если СтруктураИсходныхПараметров.Свойство("ТипЦен") Тогда
		Если ТипЗнч(СтруктураИсходныхПараметров.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатуры") Тогда
			Цена = ПолучитьЦенуНоменклатуры(Номенклатура, Характеристика, СтруктураИсходныхПараметров.ТипЦен, Форма.ДатаРасчетов, ЕдиницаИзмерения, ВалютаЦены);
		ИначеЕсли ТипЗнч(СтруктураИсходныхПараметров.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов") Тогда
			Цена = ПолучитьЦенуКонтрагента(Номенклатура, Характеристика, СтруктураИсходныхПараметров.Контрагент,
											 СтруктураИсходныхПараметров.ТипЦен, Форма.ДатаРасчетов, ЕдиницаИзмерения, ВалютаЦены);
		КонецЕсли; 
	КонецЕсли;

	Если ЗначениеНеЗаполнено(СтрокаТабличнойЧасти.Характеристика)
	 Или ТипЗнч(СтрокаТабличнойЧасти.Характеристика) = Тип("Строка") Тогда
		СтрокаТабличнойЧасти.Характеристика = "<без характеристики>";
	КонецЕсли;

	СтрокаТабличнойЧасти.ВалютаЦены       = ВалютаЦены;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Цена             = Цена;

	Если СтрокаТабличнойЧасти.Количество =  0 Тогда
		СтрокаТабличнойЧасти.Количество = Форма.Количество;
	КонецЕсли;

КонецПроцедуры // мТаблицаХарактеристикНоменклатурыХарактеристикаПриИзменении()

// Процедура - обработчик события "НачалоВыбора" пола "Характеристика" таблицы характеристик номенклатуры.
//
Процедура мТаблицаХарактеристикНоменклатурыХарактеристикаНачалоВыбора(Форма, Элемент, СтандартнаяОбработка) Экспорт

	СтрокаТабличнойЧасти = Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.ТекущиеДанные;

	Если ТипЗнч(СтрокаТабличнойЧасти.Характеристика) = Тип("Строка") Тогда
		СтрокаТабличнойЧасти.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры // мТаблицаХарактеристикНоменклатурыХарактеристикаНачалоВыбора()

// Процедура - обработчик события "ОбработкаВыбора" единицы измерения.
//
Процедура мТаблицаХарактеристикНоменклатурыЕдиницаИзмеренияОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт

	СтарыйКоэффициент = Элемент.Значение.Коэффициент;
	Если СтарыйКоэффициент <> 0 Тогда
		СтрокаТабличнойЧасти = Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.ТекущаяСтрока;
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Цена * ВыбранноеЗначение.Коэффициент / СтарыйКоэффициент;
	КонецЕсли;

КонецПроцедуры // мТаблицаХарактеристикНоменклатурыЕдиницаИзмеренияОбработкаВыбора()

// Процедура - обработчик события "НачалоВыбораИзСписка" поля ввода серии.
//
Процедура мСерияНачалоВыбораИзСписка(Форма, Элемент, СтандартнаяОбработка) Экспорт

	СписокСерий = Форма.ЭлементыФормы.Серия.СписокВыбора;
	Если СписокСерий.Количество() = 0 Тогда

		// Заполнение списка при первом обращении к нему
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Номенклатура" , Форма.Номенклатура);
		
		Если ЗначениеНеЗаполнено(мИмяРегистраДляПодбораСерий) Тогда

			Запрос.Текст = "
			|ВЫБРАТЬ
			|	Серии.Ссылка КАК Серия,
			|	0            КАК Количество
			|
			|ИЗ
			|	Справочник.СерииНоменклатуры КАК Серии
			|
			|ГДЕ
			|	Серии.Ссылка.Владелец = &Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	Серии.Ссылка ВОЗР
			|";

		Иначе

			Если Форма.ВладелецФормы.ЭлементыФормы.СписокВидовПодбора.Значение = "ОстаткиУКомиссионеров" Тогда
				Запрос.УстановитьПараметр("Комиссионер", СтруктураИсходныхПараметров.Контрагент);
				Если СтруктураИсходныхПараметров.Свойство("Организация") Тогда
					Запрос.УстановитьПараметр("Организация", СтруктураИсходныхПараметров.Организация);
				КонецЕсли; 
			КонецЕсли; 
			Запрос.УстановитьПараметр("Дата"                      , Форма.ДатаРасчетов);
			Запрос.УстановитьПараметр("Склад"                     , СтруктураИсходныхПараметров.Склад);
			Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Форма.Характеристика);
			Запрос.УстановитьПараметр("ЦенаВРознице"              , Форма.Цена);
		
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	Остатки.СерияНоменклатуры        КАК Серия,
			|	СУММА(Остатки.КоличествоОстаток) КАК Количество
			|
			|ИЗ
			|	РегистрНакопления." + мИмяРегистраДляПодбораСерий + ".Остатки(&Дата, (Номенклатура = &Номенклатура И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры" + ?(мИмяРегистраДляПодбораСерий = "ТоварыВНеавтоматизированныхТорговыхТочках", " И ЦенаВРознице = &ЦенаВРознице", "") + ?(СтруктураИсходныхПараметров.Склад <> Неопределено, (" И Склад = &Склад"), "") + ?(Форма.ВладелецФормы.ЭлементыФормы.СписокВидовПодбора.Значение = "ОстаткиУКомиссионеров", " И Комиссионер = &Комиссионер", "") + ?((СтруктураИсходныхПараметров.Свойство("Организация") И Форма.ВладелецФормы.ЭлементыФормы.СписокВидовПодбора.Значение = "ОстаткиУКомиссионеров"), " И Организация = &Организация", "") + ")) КАК Остатки
			|
			|ГДЕ
			|	Остатки.КоличествоОстаток > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	Остатки.СерияНоменклатуры
			|
			|УПОРЯДОЧИТЬ ПО
			|	Серия ВОЗР
			|";

		КонецЕсли; 

		ТаблицаСерий = Запрос.Выполнить().Выгрузить();

		Для каждого Строка Из ТаблицаСерий Цикл
			Если ЗначениеНеЗаполнено(мИмяРегистраДляПодбораСерий) Тогда
				СписокСерий.Добавить(Строка.Серия, Строка(Строка.Серия));
			Иначе
				СписокСерий.Добавить(Строка.Серия, (?(ПустаяСтрока(Строка(Строка.Серия)), "<без серии>", Строка(Строка.Серия)) + " (" + СокрЛП(Формат(Строка.Количество, "ЧЦ=15; ЧДЦ=3")) + " " + СокрЛП(Форма.Номенклатура.ЕдиницаХраненияОстатков) + ")"));
			КонецЕсли;
		КонецЦикла;
		
		Если СписокСерий.Количество() > 0 Тогда
			Форма.ЭлементыФормы.Серия.Значение = СписокСерий[0].Значение;
		КонецЕсли;

	КОнецЕсли;

КонецПроцедуры // мСерияНачалоВыбораИзСписка()

Процедура мЕдиницаИзмеренияПриИзменении(Форма, Элемент) Экспорт

	мОбновитьНадписьФомулаСумма(Форма);

КонецПроцедуры // мЕдиницаИзмеренияПриИзменении()

// Процедура - обработчик события "Нажатие" кнопки "Заполнить" командной панели таблицы характеристик.
//
Процедура мКоманднаяПанельТаблицыХарактеристикНоменклатурыЗаполнить(Форма) Экспорт

	// Заполним характеристики
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Дата"                             , Форма.ДатаРасчетов);
	Запрос.УстановитьПараметр("Номенклатура"                     , Форма.Номенклатура);
	Запрос.УстановитьПараметр("ВалютаЦены"                       , Форма.ВалютаЦены);
	Запрос.УстановитьПараметр("ПустаяХарактеристикаНоменклатуры" , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());

	Если СтруктураИсходныхПараметров.Свойство("ТипЦен") и СтруктураИсходныхПараметров.ТипЦен <> Неопределено Тогда

		ТипЦен = СтруктураИсходныхПараметров.ТипЦен;

		Если ТипЗнч(СтруктураИсходныхПараметров.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатуры") Тогда

			Если ТипЦен.Рассчитывается Тогда  // Надо достать цену базового типа и рассчитать на наценке
				Запрос.УстановитьПараметр("ТипЦен", ТипЦен.БазовыйТипЦен);
			Иначе
				Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
			КонецЕсли;

			Запрос.Текст = "
			|ВЫБРАТЬ
			|	Характеристики.Ссылка                                                   КАК Характеристика,
			|	ВЫБОР КОГДА НЕ ЦеныСХарактеристикой.Цена ЕСТЬ NULL
			|	      ТОГДА ЦеныСХарактеристикой.Цена
			|	      ИНАЧЕ ВЫБОР КОГДА НЕ ЦеныБезХарактеристики.Цена ЕСТЬ NULL
			|	                  ТОГДА ЦеныБезХарактеристики.Цена
			|	                  ИНАЧЕ 0 КОНЕЦ КОНЕЦ                                   КАК Цена,
			|	ВЫБОР КОГДА НЕ ЦеныСХарактеристикой.Валюта ЕСТЬ NULL
			|	      ТОГДА ЦеныСХарактеристикой.Валюта
			|	      ИНАЧЕ ВЫБОР КОГДА НЕ ЦеныБезХарактеристики.Валюта ЕСТЬ NULL
			|	                  ТОГДА ЦеныБезХарактеристики.Валюта
			|	                  ИНАЧЕ &ВалютаЦены КОНЕЦ КОНЕЦ                         КАК ВалютаЦены,
			|	ВЫБОР КОГДА НЕ ЦеныСХарактеристикой.ЕдиницаИзмерения ЕСТЬ NULL
			|	      ТОГДА ЦеныСХарактеристикой.ЕдиницаИзмерения
			|	      ИНАЧЕ ВЫБОР КОГДА НЕ ЦеныБезХарактеристики.ЕдиницаИзмерения ЕСТЬ NULL
			|	                  ТОГДА ЦеныБезХарактеристики.ЕдиницаИзмерения
			|	                  ИНАЧЕ Характеристики.Владелец.ЕдиницаХраненияОстатков КОНЕЦ КОНЕЦ КАК ЕдиницаИзмерения
			|
			|ИЗ
			|	(ВЫБРАТЬ
			|		Характеристики.Ссылка   КАК Ссылка,
			|		Характеристики.Владелец КАК Владелец
			|	ИЗ
			|		Справочник.ХарактеристикиНоменклатуры КАК Характеристики
			|
			|	ГДЕ
			|		Характеристики.Ссылка.Владелец = &Номенклатура
			|
			|	ОБЪЕДИНИТЬ ВСЕ
			|
			|	ВЫБРАТЬ
			|		&ПустаяХарактеристикаНоменклатуры КАК Ссылка,
			|		Номенклатура.Ссылка               КАК Владелец
			|	ИЗ
			|		Справочник.Номенклатура КАК Номенклатура
			|
			|	ГДЕ
			|		Номенклатура.Ссылка = &Номенклатура
			|	) КАК Характеристики
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, Номенклатура = &Номенклатура И ТипЦен = &ТипЦен
			|	                                               И ХарактеристикаНоменклатуры  = &ПустаяХарактеристикаНоменклатуры) КАК ЦеныБезХарактеристики
			|ПО
			|	ИСТИНА
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, Номенклатура = &Номенклатура И ТипЦен = &ТипЦен) КАК ЦеныСХарактеристикой
			|ПО
			|	ЦеныСХарактеристикой.ХарактеристикаНоменклатуры = Характеристики.Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	Характеристики.Ссылка ВОЗР
			|";
		ИначеЕсли ТипЗнч(СтруктураИсходныхПараметров.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов") Тогда

			Запрос.УстановитьПараметр("ТипЦен", ТипЦен);

			Запрос.Текст = "
			|ВЫБРАТЬ
			|	Характеристики.Ссылка                                                   КАК Характеристика,
			|	ВЫБОР КОГДА НЕ ЦеныСХарактеристикой.Цена ЕСТЬ NULL
			|	      ТОГДА ЦеныСХарактеристикой.Цена
			|	      ИНАЧЕ ВЫБОР КОГДА НЕ ЦеныБезХарактеристики.Цена ЕСТЬ NULL
			|	                  ТОГДА ЦеныБезХарактеристики.Цена
			|	                  ИНАЧЕ 0 КОНЕЦ КОНЕЦ                                   КАК Цена,
			|	ВЫБОР КОГДА НЕ ЦеныСХарактеристикой.Валюта ЕСТЬ NULL
			|	      ТОГДА ЦеныСХарактеристикой.Валюта
			|	      ИНАЧЕ ВЫБОР КОГДА НЕ ЦеныБезХарактеристики.Валюта ЕСТЬ NULL
			|	                  ТОГДА ЦеныБезХарактеристики.Валюта
			|	                  ИНАЧЕ &ВалютаЦены КОНЕЦ КОНЕЦ                         КАК ВалютаЦены,
			|	ВЫБОР КОГДА НЕ ЦеныСХарактеристикой.ЕдиницаИзмерения ЕСТЬ NULL
			|	      ТОГДА ЦеныСХарактеристикой.ЕдиницаИзмерения
			|	      ИНАЧЕ ВЫБОР КОГДА НЕ ЦеныБезХарактеристики.ЕдиницаИзмерения ЕСТЬ NULL
			|	                  ТОГДА ЦеныБезХарактеристики.ЕдиницаИзмерения
			|	                  ИНАЧЕ Характеристики.Владелец.ЕдиницаХраненияОстатков КОНЕЦ КОНЕЦ КАК ЕдиницаИзмерения
			|
			|ИЗ
			|	(ВЫБРАТЬ
			|		Характеристики.Ссылка   КАК Ссылка,
			|		Характеристики.Владелец КАК Владелец
			|	ИЗ
			|		Справочник.ХарактеристикиНоменклатуры КАК Характеристики
			|
			|	ГДЕ
			|		Характеристики.Ссылка.Владелец = &Номенклатура
			|
			|	ОБЪЕДИНИТЬ ВСЕ
			|
			|	ВЫБРАТЬ
			|		&ПустаяХарактеристикаНоменклатуры КАК Ссылка,
			|		Номенклатура.Ссылка               КАК Владелец
			|	ИЗ
			|		Справочник.Номенклатура КАК Номенклатура
			|
			|	ГДЕ
			|		Номенклатура.Ссылка = &Номенклатура
			|	) КАК Характеристики
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&Дата, Номенклатура = &Номенклатура И ТипЦен = &ТипЦен
			|	                                               И ХарактеристикаНоменклатуры  = &ПустаяХарактеристикаНоменклатуры) КАК ЦеныБезХарактеристики
			|ПО
			|	ИСТИНА
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&Дата, Номенклатура = &Номенклатура И ТипЦен = &ТипЦен) КАК ЦеныСХарактеристикой
			|ПО
			|	ЦеныСХарактеристикой.ХарактеристикаНоменклатуры = Характеристики.Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	Характеристики.Ссылка ВОЗР
			|";
		КонецЕсли;
	Иначе
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Характеристики.Ссылка                           КАК Характеристика,
		|	0                                               КАК Цена,
		|	&ВалютаЦены                                     КАК ВалютаЦены,
		|	Характеристики.Владелец.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения
		|
		|ИЗ
		|	(ВЫБРАТЬ
		|		Характеристики.Ссылка   КАК Ссылка,
		|		Характеристики.Владелец КАК Владелец
		|	ИЗ
		|		Справочник.ХарактеристикиНоменклатуры КАК Характеристики
		|
		|	ГДЕ
		|		Характеристики.Ссылка.Владелец = &Номенклатура
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		&ПустаяХарактеристикаНоменклатуры КАК Ссылка,
		|		Номенклатура.Ссылка               КАК Владелец
		|	ИЗ
		|		Справочник.Номенклатура КАК Номенклатура
		|
		|	ГДЕ
		|		Номенклатура.Ссылка = &Номенклатура
		|	) КАК Характеристики
		|
		|УПОРЯДОЧИТЬ ПО
		|	Характеристики.Ссылка ВОЗР
		|";
	КонецЕсли;

	Форма.ТаблицаХарактеристикНоменклатуры.Очистить();

	ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), Форма.ТаблицаХарактеристикНоменклатуры);

	Если СтруктураИсходныхПараметров.Свойство("ТипЦен")
	   И СтруктураИсходныхПараметров.ТипЦен <> Неопределено
	   И ТипЗнч(СтруктураИсходныхПараметров.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатуры")
	   И ТипЦен.Рассчитывается Тогда

		Для Каждого СтрокаТабличнойЧасти Из Форма.ТаблицаХарактеристикНоменклатуры Цикл

			СтрокаТабличнойЧасти.Цена = ОкруглитьЦену(СтрокаТабличнойЧасти.Цена * (100 + ТипЦен.ПроцентСкидкиНаценки) / 100, ТипЦен.ПорядокОкругления, ТипЦен.ОкруглятьВБольшуюСторону);

		КОнецЦикла;

	КонецЕсли;

	// Заменим пустые характеристики на строку "<без характеристики>"
	СтрокаПустойХарактеристики = Форма.ТаблицаХарактеристикНоменклатуры.Найти(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), "Характеристика");
	Пока СтрокаПустойХарактеристики <> Неопределено Цикл
		СтрокаПустойХарактеристики.Характеристика = "<без характеристики>";
		СтрокаПустойХарактеристики = Форма.ТаблицаХарактеристикНоменклатуры.Найти(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), "Характеристика");
	КонецЦикла;

КонецПроцедуры // мКоманднаяПанельТаблицыХарактеристикНоменклатурыЗаполнить()

// Процедура - обработчик события "Нажатие" кнопки "ПолучитьВес".
//
Процедура мКоманднаяПанельДействийСлеваПолучитьВес(Форма, Кнопка) Экспорт

	Перем Ответ;

	ПредставлениеОбработки = Метаданные.Обработки.ПодборНоменклатуры.Представление();

	ВесТовара = 0;
	Ответ = глТорговоеОборудование.ВыполнитьОперациюВесов(Форма.ЭлементыФормы.ТекущиеВесы.Значение, "ПолучитьВес", ВесТовара);
	Если ПустаяСтрока(Ответ) Тогда
		Если Форма.ЭлементыФормы.Найти("ТаблицаХарактеристикНоменклатуры") = Неопределено Тогда
			Форма.Количество = ВесТовара;
		Иначе
			СтрокаТабличнойЧасти = Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.ТекущаяСтрока;
			Если СтрокаТабличнойЧасти <> Неопределено Тогда
				СтрокаТабличнойЧасти.Количество = ВесТовара;
			КонецЕсли;
		КОнецЕсли;
	Иначе
		Предупреждение(Ответ,,ПредставлениеОбработки);
	КонецЕсли;

КонецПроцедуры // мКоманднаяПанельДействийСлеваПолучитьВес()


мИмяРегистраДляПодбораСерий = "";
мИспользоватьХарактеристики = Константы.ИспользоватьХарактеристикиНоменклатуры.Получить();
мИспользоватьСерии          = Константы.ИспользоватьСерииНоменклатуры.Получить();

мТекстЗапросаОтборНоменклатурыПоРодителю = "
|Номенклатура В (ВЫБРАТЬ Номенклатура.Ссылка ИЗ Справочник.Номенклатура
|	        КАК Номенклатура ГДЕ Номенклатура.Родитель = &Родитель)";
