Перем Эксель, Лист, Книга, Файл;

Процедура ПутьКФайлуНачалоВыбора(Элемент, СтандартнаяОбработка)
	Диалог = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файлы exel (.xls)|*.xls";
	
	Если Диалог.Выбрать() Тогда
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры


Процедура Кнопка1Нажатие(Элемент)
	ЭлементыФормы.ИмяЛиста.СписокВыбора.Очистить();
	ЭлементыФормы.ИмяЛиста.ВыделенныйТекст="";
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
	Исключение
		Сообщить(ОписаниеОшибки());       
	КонецПопытки;
	Файл = Новый Файл(ПутьКФайлу);
	Если Не Файл.Существует() Тогда
		Сообщить("Файл не существует!");
		Возврат;
	КонецЕсли; 
	Книга   = Эксель.Workbooks.Open(ПутьКФайлу);
	КоличествоЛистов = Книга.Sheets.Count;
	НомерЛиста=1;
	Пока НомерЛиста <= КоличествоЛистов Цикл
		ЭлементыФормы.ИмяЛиста.СписокВыбора.Добавить(Книга.Sheets(НомерЛиста).Name);
		НомерЛиста=НомерЛиста+1;
	КонецЦикла;	
КонецПроцедуры

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Если СокрЛП(ЭлементыФормы.ИмяЛиста.ВыделенныйТекст)="" или
		СокрЛП(ИмяКолонкимодели)="" или
		СокрЛП(ИмяКолонкиРазмеры)="" тогда 
		возврат;
	КонецЕсли;	
	
	тзПФИЗФайла=новый таблицаЗначений;
	тзПФИЗФайла.Колонки.Добавить("ПрессФорма",);
	тзПФИЗФайла.Колонки.Добавить("ЦенаФайл",   Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
	
	тз=новый таблицаЗначений;
	тз.Колонки.Добавить("ПрессФорма");
	тз.Колонки.Добавить("ЦенаФайл",   Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
	тз.Колонки.Добавить("ЦенаЗаявка", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
	
	
	
	//Книга   = Эксель.Workbooks.Open(ПутьКФайлу);
	Лист                = Книга.Worksheets(ЭлементыФормы.ИмяЛиста.ВыделенныйТекст);
	КоличествоСтрок     = Лист.Cells(1,1).SpecialCells(11).Row;
	
	для сч = 1 по КоличествоСтрок Цикл
		Модели =  СокрЛП(Строка(Лист.Cells(сч,  СокрЛП(ИмяКолонкимодели)).Value));
		Размеры =  СтрЗаменить(СокрЛП(Строка(Лист.Cells(сч,  СокрЛП(ИмяКолонкиРазмеры)).Value))," ","");
		Цена=СтрЗаменить(Строка(Лист.Cells(сч,  СокрЛП(ИмяКолонкиЦена)).Value)," ","");    
		Если Модели<>"" тогда
			МассМоделей=РазложитьСтрокуВМассивПодстрок(Модели," ");
			Если стрДлина(Размеры)=4 тогда
				Диаметр=Число(Лев(Размеры,2));
				Если Число(Сред(Размеры,3,1))=1 тогда
					Ширинаа=Число(Прав(Размеры,2));
				Иначе
					Ширинаа=Число(Сред(Размеры,3,1)+","+Прав(Размеры,1));
				КонецЕсли;
			
				ПФ=НайтиПрессФорму(Модели,МассМоделей,Диаметр,Ширинаа,ЗаявкаПоПрессФормам);
				стр1=тз.Добавить();
				стр1.ПрессФорма=ПФ;
				стр1.ЦенаФайл=Цена;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	Для каждого эл из ЗаявкаПоПрессФормам Цикл
		Для каждого стр из эл.Значение.ПрессФормы Цикл
			стртз=тз.Найти(стр.ПрессФорма,"ПрессФорма");
			Если Стртз<>неопределено тогда
				стртз.ЦенаЗаявка=стр.Сумма;
			Иначе
				стр1=тз.Добавить();
				стр1.ПрессФорма=стр.ПрессФорма;
				стр1.ЦенаФайл=0;
				стр1.ЦенаЗаявка=стр.Сумма;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	табДок=Новый ТабличныйДокумент;
	Макет=ПолучитьМакет("Макет");
	ТабДок.Вывести(Макет.ПолучитьОбласть("Шапка"));
	ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
	Для каждого стр из тз цикл
		Если стр.ЦенаФайл<>стр.ЦенаЗаявка тогда
			ОбластьСтрока.Параметры.Заполнить(стр);
			ТабДок.Вывести(ОбластьСтрока);
		КонецЕсли;
	КонецЦикла;
	ТабДок.Показать();
	
	Эксель.quit();
	
КонецПроцедуры

Функция НайтиПрессФорму(Модели,МассМоделей,Диаметр,Ширинаа,Заявка)
	ПФ=""+Модели+" "+Диаметр+" "+Ширинаа;
	
	УсловияПоМоделям="";
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ЗаказПоПрессФормамПрессФормы.ПрессФорма
	             |ПОМЕСТИТЬ втПФИзЗаявки
	             |ИЗ
	             |	Документ.ЗаказПоПрессФормам.ПрессФормы КАК ЗаказПоПрессФормамПрессФормы
	             |ГДЕ
	             |	ЗаказПоПрессФормамПрессФормы.Ссылка в( &Ссылка)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ПрессФормы.Ссылка КАК ПрессФорма
	             |ИЗ
	             |	Справочник.ПрессФормы КАК ПрессФормы
	             |ГДЕ
	             |	ПрессФормы.Радиус = &Радиус
	             |	И ПрессФормы.Ширина = &Ширина
	             |	И ПрессФормы.Ссылка В
	             |			(ВЫБРАТЬ
	             |				втПФИзЗаявки.ПрессФорма
	             |			ИЗ
	             |				втПФИзЗаявки КАК втПФИзЗаявки)
	|	//УсловияПоМоделям";
	Для каждого мод из МассМоделей Цикл
		УсловияПоМоделям=УсловияПоМоделям+" И ((ПрессФормы.Наименование ПОДОБНО ""%-"+Мод+"%"") или (ПрессФормы.Наименование ПОДОБНО ""% "+Мод+"%"") или (ПрессФормы.Наименование ПОДОБНО ""%,"+Мод+"%""))";
	КонецЦикла;
	Запрос.Текст=СтрЗаменить(Запрос.Текст,"//УсловияПоМоделям",УсловияПоМоделям);
	Запрос.УстановитьПараметр("Радиус",Диаметр);
	Запрос.УстановитьПараметр("Ширина",Ширинаа);
	Запрос.УстановитьПараметр("Ссылка",Заявка);

	Рез=Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		ПФ=Рез.ПрессФорма;
	КонецЦикла;
	Возврат ПФ;
КонецФункции

Процедура ПриОткрытии()
	ИмяКолонкимодели="A";
	ИмяКолонкиРазмеры="B";
	ИмяКолонкиЦена="C";

КонецПроцедуры
