
Процедура КнопкаСформироватьНажатие(Кнопка)
	// Вставить содержимое обработчика.
	
	ЗапросПродажи = Новый Запрос("ВЫБРАТЬ
	                             |	""Факторинг"" КАК ТипДоговора,
	                             |	ПродажиОбороты.Период,
	                             |	ПродажиОбороты.СтоимостьОборот как Сумма
	                             |ИЗ
	                             |	РегистрНакопления.Продажи.Обороты(&дата1, &Дата2, МЕСЯЦ, ДоговорКонтрагента.ТипДоговора = &Факторинг и ДоговорКонтрагента.ВедениеВзаиморасчетов=&позаказам) КАК ПродажиОбороты
	                             |
	                             |ОБЪЕДИНИТЬ ВСЕ
	                             |
	                             |ВЫБРАТЬ
	                             |	""Не факторинг"",
	                             |	ПродажиОбороты.Период,
	                             |	ПродажиОбороты.СтоимостьОборот
	                             |ИЗ
	                             |	РегистрНакопления.Продажи.Обороты(&дата1, &Дата2, МЕСЯЦ, ДоговорКонтрагента.ТипДоговора <> &Факторинг и ДоговорКонтрагента.ВедениеВзаиморасчетов=&позаказам) КАК ПродажиОбороты");
								 
	ЗапросПродажи.УстановитьПараметр("Факторинг",Справочники.ТипыДоговоров.Факторинг);
	ЗапросПродажи.УстановитьПараметр("ПоЗаказам",Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам);							
	
	
	ЗапросДеньги = Новый Запрос("ВЫБРАТЬ
	                            |	""Не факторинг"" КАК ТипДоговора,
	                            |	СУММА(ПЗ.СуммаВзаиморасчетов) КАК Сумма
	                            |ИЗ
	                            |	(ВЫБРАТЬ
	                            |		ВзаиморасчетыСКонтрагентами.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов
	                            |	ИЗ
	                            |		РегистрНакопления.ВзаиморасчетыСКонтрагентами КАК ВзаиморасчетыСКонтрагентами
	                            |	ГДЕ
	                            |		ВзаиморасчетыСКонтрагентами.ВидДвижения = &Расход
	                            |		И ВзаиморасчетыСКонтрагентами.Период МЕЖДУ &Дата1 И &Дата2
	                            |		И ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента.ТипДоговора <> &Факторинг
	                            |		И ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоЗАказам
	                            |		И ВзаиморасчетыСКонтрагентами.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	                            |	
	                            |	ОБЪЕДИНИТЬ ВСЕ
	                            |	
	                            |	ВЫБРАТЬ
	                            |		ВзаиморасчетыСКонтрагентами.СуммаВзаиморасчетов
	                            |	ИЗ
	                            |		РегистрНакопления.ВзаиморасчетыСКонтрагентами КАК ВзаиморасчетыСКонтрагентами
	                            |	ГДЕ
	                            |		ВзаиморасчетыСКонтрагентами.ВидДвижения = &Расход
	                            |		И ВзаиморасчетыСКонтрагентами.Период МЕЖДУ &Дата1 И &Дата2
	                            |		И ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоЗАказам
	                            |		И ВзаиморасчетыСКонтрагентами.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
	                            |		И ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента.ТипДоговора <> &Факторинг
	                            |	
	                            |	ОБЪЕДИНИТЬ ВСЕ
	                            |	
	                            |	ВЫБРАТЬ
	                            |		ВзаиморасчетыСКонтрагентами.СуммаВзаиморасчетов
	                            |	ИЗ
	                            |		РегистрНакопления.ВзаиморасчетыСКонтрагентами КАК ВзаиморасчетыСКонтрагентами
	                            |	ГДЕ
	                            |		ВзаиморасчетыСКонтрагентами.ВидДвижения = &Расход
	                            |		И ВзаиморасчетыСКонтрагентами.Период МЕЖДУ &Дата1 И &Дата2
	                            |		И ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоЗАказам
	                            |		И ВзаиморасчетыСКонтрагентами.Регистратор ССЫЛКА Документ.Взаимозачет
	                            |		И ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента.ТипДоговора <> &Факторинг
	                            |		И ВзаиморасчетыСКонтрагентами.Регистратор.УчитыватьДляРасчетаПремии = ИСТИНА) КАК ПЗ
	                            |
	                            |ОБЪЕДИНИТЬ ВСЕ
	                            |
	                            |ВЫБРАТЬ
	                            |	""Факторинг"",
	                            |	СУММА(ПЗ.СуммаВзаиморасчетов)
	                            |ИЗ
	                            |	(ВЫБРАТЬ
	                            |		ВзаиморасчетыСКонтрагентами.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов
	                            |	ИЗ
	                            |		РегистрНакопления.ВзаиморасчетыСКонтрагентами КАК ВзаиморасчетыСКонтрагентами
	                            |	ГДЕ
	                            |		ВзаиморасчетыСКонтрагентами.ВидДвижения = &Расход
	                            |		И ВзаиморасчетыСКонтрагентами.Период МЕЖДУ &Дата1 И &Дата2
	                            |		И ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента.ТипДоговора = &Факторинг
	                            |		И ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоЗАказам
	                            |		И ВзаиморасчетыСКонтрагентами.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	                            |	
	                            |	ОБЪЕДИНИТЬ ВСЕ
	                            |	
	                            |	ВЫБРАТЬ
	                            |		ВзаиморасчетыСКонтрагентами.СуммаВзаиморасчетов
	                            |	ИЗ
	                            |		РегистрНакопления.ВзаиморасчетыСКонтрагентами КАК ВзаиморасчетыСКонтрагентами
	                            |	ГДЕ
	                            |		ВзаиморасчетыСКонтрагентами.ВидДвижения = &Расход
	                            |		И ВзаиморасчетыСКонтрагентами.Период МЕЖДУ &Дата1 И &Дата2
	                            |		И ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоЗАказам
	                            |		И ВзаиморасчетыСКонтрагентами.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
	                            |		И ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента.ТипДоговора = &Факторинг
	                            |	
	                            |	ОБЪЕДИНИТЬ ВСЕ
	                            |	
	                            |	ВЫБРАТЬ
	                            |		ВзаиморасчетыСКонтрагентами.СуммаВзаиморасчетов
	                            |	ИЗ
	                            |		РегистрНакопления.ВзаиморасчетыСКонтрагентами КАК ВзаиморасчетыСКонтрагентами
	                            |	ГДЕ
	                            |		ВзаиморасчетыСКонтрагентами.ВидДвижения = &Расход
	                            |		И ВзаиморасчетыСКонтрагентами.Период МЕЖДУ &Дата1 И &Дата2
	                            |		И ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоЗАказам
	                            |		И ВзаиморасчетыСКонтрагентами.Регистратор ССЫЛКА Документ.Взаимозачет
	                            |		И ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента.ТипДоговора = &Факторинг
	                            |		И ВзаиморасчетыСКонтрагентами.Регистратор.УчитыватьДляРасчетаПремии = ИСТИНА) КАК ПЗ");
								
								
	ЗапросДеньги.УстановитьПараметр("Факторинг",Справочники.ТипыДоговоров.Факторинг);							
	ЗапросДеньги.УстановитьПараметр("ПоЗаказам",Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам);							
	ЗапросДеньги.УстановитьПараметр("Расход",ВидДвиженияНакопления.Расход);							
	
	ТаблицаМесяцев = Новый ТаблицаЗначений; 
	
	ТаблицаМесяцев.Колонки.Добавить("ДатаНач");
	ТаблицаМесяцев.Колонки.Добавить("ДатаКон");
	
	ДатаТек = НачПериода;
	
	Пока Истина Цикл
		СтрХ = ТаблицаМесяцев.Добавить();
		
		СтрХ.ДатаНач = НачалоМесяца(ДатаТек);
		СтрХ.ДатаКон = КонецМесяца(ДатаТек);
		
		ДатаТек = ДобавитьМесяц(ДатаТек,1);
		
		Если (ДатаТек>КонПериода) Тогда
			Прервать;		
		КонецЕсли;
		
	КонеЦЦикла;
	
	// Выводим отчет
	
	ТД = новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Макет");
	Заг = Макет.ПолучитьОбласть("Заг");
	Подв = Макет.ПолучитьОбласть("Подв");
	Заг.Параметры.Датанач = Формат(НачПериода,"ДЛФ=Д");
	Заг.Параметры.Датакон = Формат(КонПериода,"ДЛФ=Д");
	ТД.Вывести(Заг);
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Строка = Макет.ПолучитьОбласть("Строка");
	
	ТД.Вывести(Шапка);
	
	Для Каждого Стрх из ТаблицаМесяцев Цикл
		ЗапросПродажи.УстановитьПараметр("Дата1",Стрх.ДатаНач);
		ЗапросПродажи.УстановитьПараметр("Дата2",Стрх.ДатаКон);
		
		ЗапросДеньги.УстановитьПараметр("Дата1",Стрх.ДатаНач);							
		ЗапросДеньги.УстановитьПараметр("Дата2",Стрх.ДатаКон);							

		ВыбДеньги = ЗапросДеньги.Выполнить().Выбрать();
		ВыбПродажи = ЗапросПродажи.Выполнить().Выбрать();
		
		
		Строкмесяц = Сред(Формат(Стрх.ДатаНач,"ДЛФ=Д"),4,2);
		
		Если (Строкмесяц="01") Тогда 
			Строка.Параметры.Месяц = "Январь " + Прав(Формат(Стрх.ДатаНач,"ДЛФ=Д"),4);
		ИначеЕсли (Строкмесяц="02") Тогда 
			Строка.Параметры.Месяц = "Февраль " + Прав(Формат(Стрх.ДатаНач,"ДЛФ=Д"),4);
		ИначеЕсли (Строкмесяц="03") Тогда 
			Строка.Параметры.Месяц = "Март " + Прав(Формат(Стрх.ДатаНач,"ДЛФ=Д"),4);
		ИначеЕсли (Строкмесяц="04") Тогда 
			Строка.Параметры.Месяц = "Апрель " + Прав(Формат(Стрх.ДатаНач,"ДЛФ=Д"),4);
		ИначеЕсли (Строкмесяц="05") Тогда 
			Строка.Параметры.Месяц = "Май " + Прав(Формат(Стрх.ДатаНач,"ДЛФ=Д"),4);
		ИначеЕсли (Строкмесяц="06") Тогда 
			Строка.Параметры.Месяц = "Июнь " + Прав(Формат(Стрх.ДатаНач,"ДЛФ=Д"),4);
		ИначеЕсли (Строкмесяц="07") Тогда 
			Строка.Параметры.Месяц = "Июль " + Прав(Формат(Стрх.ДатаНач,"ДЛФ=Д"),4);
		ИначеЕсли (Строкмесяц="08") Тогда 
			Строка.Параметры.Месяц = "Август " + Прав(Формат(Стрх.ДатаНач,"ДЛФ=Д"),4);
		ИначеЕсли (Строкмесяц="09") Тогда 
			Строка.Параметры.Месяц = "Сентябрь " + Прав(Формат(Стрх.ДатаНач,"ДЛФ=Д"),4);
		ИначеЕсли (Строкмесяц="10") Тогда 
			Строка.Параметры.Месяц = "Октябрь " + Прав(Формат(Стрх.ДатаНач,"ДЛФ=Д"),4);
		ИначеЕсли (Строкмесяц="11") Тогда 
			Строка.Параметры.Месяц = "Ноябрь " + Прав(Формат(Стрх.ДатаНач,"ДЛФ=Д"),4);
		ИначеЕсли (Строкмесяц="12") Тогда 
			Строка.Параметры.Месяц = "Декабрь " + Прав(Формат(Стрх.ДатаНач,"ДЛФ=Д"),4);
		конецесли;
		
		ОбщСумма1 = 0;
		Строка.Параметры.ПоступлениеФакторинг = 0;
		Строка.Параметры.ПоступлениеНеФакторинг = 0;
		
		Пока ВыбДеньги.Следующий() Цикл
			Если (ВыбДеньги.ТипДоговора = "Факторинг") Тогда 
				Строка.Параметры.ПоступлениеФакторинг = ВыбДеньги.Сумма;
			Иначе 
				Строка.Параметры.ПоступлениеНеФакторинг = ВыбДеньги.Сумма;
			Конецесли;
			
			ОбщСумма1 = ОбщСумма1 + ?(ВыбДеньги.Сумма=null,0,ВыбДеньги.Сумма);
		КонецЦикла;
		Строка.Параметры.ПоступлениеСумма = ОбщСумма1;
		
		ОбщСумма2 = 0;
		Строка.Параметры.ПродажиФакторинг = 0;
		Строка.Параметры.ПродажиНеФакторинг = 0;
		
		Пока ВыбПродажи.Следующий() Цикл
			Если (ВыбПродажи.ТипДоговора = "Факторинг") Тогда 
				Строка.Параметры.ПродажиФакторинг = ВыбПродажи.Сумма;
			Иначе 
				Строка.Параметры.ПродажиНеФакторинг = ВыбПродажи.Сумма;
			Конецесли;
			
			ОбщСумма2 = ОбщСумма2 + ?(ВыбПродажи.Сумма=null,0,ВыбПродажи.Сумма);
		КонецЦикла;
		
		Строка.Параметры.ПродажиСумма = общСумма2;
		
		Если (Общсумма1<>0) или (Общсумма2<>0) Тогда 
			ТД.Вывести(строка);
		КонецЕсли;
		
		ОбщСумма = 0;
		
	КонецЦикла;
	
	ТД.Вывести(Подв);
	ТД.Показать();
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

Процедура ДействияФормыСформировать(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры
