
Процедура КнопкаСформироватьНажатие(Кнопка)
	
	//проверка заполненности каталога
	Если КаталогДляПоиска.Количество()=0 Тогда
		Предупреждение("Не указан каталог для поиска изображений !");
		возврат;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	КолКаталогов = 0;
	Для Каждого Стр из КаталогДляПоиска Цикл
		Если СокрЛП(Стр.ИмяКаталога) <> "" Тогда
			КолКаталогов = КолКаталогов+1;
			//проверка существования каталога
			КаталогНаДиске = Новый Файл(Стр.ИмяКаталога);
			Если НЕ КаталогНаДиске.Существует() Тогда
				сообщить("Не найден каталог для поиска изображений :"+КаталогНаДиске, СтатусСообщения.Важное);
				ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если КолКаталогов = 0 Тогда
		Предупреждение("Не указан каталог для поиска изображений !");
		возврат;
	КонецЕсли;	
	Если ЕстьОшибки Тогда
		Предупреждение("Необходимо исправить наименование каталога для поиска изображений!
		|Отчет не сформирован!");
	КонецЕсли;	
	Таб = ЭлементыФормы.ПолеТабличногоДокумента1;
	Таб.Очистить();
	СформироватьОтчет(Таб);
	Таб.ТолькоПросмотр = Истина;
	Таб.Показать();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если Склад.Количество()=0 Тогда
		Склад.Добавить(Справочники.Склады.НайтиПоНаименованию("ЯШТ 5000"));
		Склад.Добавить(Справочники.Склады.НайтиПоНаименованию("ЯШТ 8000"));
		Склад.Добавить(Справочники.Склады.НайтиПоНаименованию("Ангар-1"));
		Склад.Добавить(Справочники.Склады.НайтиПоНаименованию("Ангар-2"));
		Склад.Добавить(Справочники.Склады.НайтиПоНаименованию("Ангар-3"));
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОсновныеДействияФормыДействиеПечать(Кнопка)
	
	Если НЕ ТипЗнч(ТЗзаказ) = Тип("ТаблицаЗначений") Тогда
		Предупреждение("Нет данных для печати !");
		возврат;
	КонецЕсли;	
	Если ТЗзаказ.Количество() = 0 Тогда
		Предупреждение("Нет данных для печати !");
		возврат;
	КонецЕсли;
	
	ПечатьЗаданияНаОтгрузку();
		
КонецПроцедуры

Процедура ПолеТабличногоДокумента1ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка)=Тип("Структура") Тогда
		Если Расшифровка.Свойство("ПризнакПечати") Тогда
			СтандартнаяОбработка = Ложь;
			НомПП = 0;
			Если Расшифровка.Свойство("НомПП", НомПП) Тогда
				ТабличныйДокумент = ЭлементыФормы.ПолеТабличногоДокумента1;
				ТекущаяОбласть    = ТабличныйДокумент.ТекущаяОбласть;
				СтрТЗ = ТЗзаказ.Найти(НомПП, "НомерСтроки");
				Если НЕ СтрТЗ = Неопределено Тогда
					Если ТекущаяОбласть.Текст = "V" Тогда
						СтрТЗ.НадоПечатать = Ложь;
						ТекущаяОбласть.Текст = "";
					Иначе
						СтрТЗ.НадоПечатать = Истина;
						ТекущаяОбласть.Текст = "V";
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


Процедура КаталогДляПоискаИмяКаталогаНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ТД = ЭлементыФормы.КаталогДляПоиска.ТекущаяСтрока;
	ТекИмяКаталога = СокрЛП(ТД.ИмяКаталога);
	Если СокрЛП(ТекИмяКаталога)="" Тогда
		ТекИмяКаталога = "\\Terminal\ОТДЕЛ ДИСКОВ\тексты и фото для клиентов"
	КонецЕсли;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Укажите каталог";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = ТекИмяКаталога;

	Если Диалог.Выбрать() Тогда
		ТекИмяКаталога = Диалог.Каталог;
		ТД.ИмяКаталога = ТекИмяКаталога;
	КонецЕсли;
	
КонецПроцедуры

