
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    Форма= ЭтотОбъект.ПолучитьФорму("ФормаОтчета");

   КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
   Если ЗначениеНеЗаполнено(Форма.ЭлементыФормы.НачПериода.Значение) и ЗначениеНеЗаполнено(Форма.ЭлементыФормы.КонПериода.Значение) ТОгда
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ОтборДаты");
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение = Ложь;
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач") ;
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение = Дата(1,1,1);

        ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон") ;
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение = Дата(1,1,1);

	Иначе
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ОтборДаты");
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение = Истина;
        ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач") ;
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение = НачалоДня(Форма.ЭлементыФормы.НачПериода.Значение);
        ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон") ;
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение = КонецДня(Форма.ЭлементыФормы.КонПериода.Значение);

	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.ЭлементыФормы.Контрагент.Значение) Тогда
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Контрагент");
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение = Форма.ЭлементыФормы.Контрагент.Значение;
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.ЭлементыФормы.ДоговорКонтрагента.Значение) Тогда
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДоговорКонтрагента") ;
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение = Форма.ЭлементыФормы.ДоговорКонтрагента.Значение;
    КонецЕсли;
    Если ЗначениеЗаполнено(Форма.ЭлементыФормы.Ответственный.Значение) Тогда
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Менеджер");
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение = Форма.ЭлементыФормы.Ответственный.Значение;
    КонецЕсли;



	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки,ДанныеРасшифровки );
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	
	
	
	
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки);
	
	//	 ДанныеРасшифровки=ДанныеРасшифровки_;
	
	//Очищаем поле табличного документа
	ДокументРезультат.Очистить();
	
	//        //Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры
