//вспомогательные функции
функция ПолучитьСтрокуКодовИсключений()
	стрИскл = ""; ном=0;
	Для каждого стр1 из Исключения цикл
		Если НЕ стр1.Контрагент.Пустая() тогда
			стрИскл = стрИскл + сокрЛП(стр1.Контрагент.Код)+",";
		КонецЕсли;
	КонецЦикла;
	// и начале и в конце, чтобы искать ",код,"
	Если стрИскл<>"" тогда
		стрИскл = ","+стрИскл; 
	КонецЕсли;	
	Возврат стрИскл;
КонецФункции

функция ПолучитьСимвРазделитель(Стр1) экспорт
	симв1 = "";
	Если Стр1<>"" тогда
		Если Найти(Стр1,";")>0 тогда симв1 = ";";
		ИначеЕсли Найти(Стр1,"¶")>0 тогда симв1 = "¶";
		Иначе симв1 = ","; //по умолчанию
		КонецЕсли;
	КонецЕсли;
возврат симв1;	
КонецФункции	

Функция ПолучитьСписокДиаметров( диаметрСтр ) Экспорт
	СписДиаметров = новый СписокЗначений;
	симв1 = ПолучитьСимвРазделитель(диаметрСтр);
	
	Если СокрЛП(диаметрСтр) = "" тогда 		//1) без диаметра
		СписДиаметров.Добавить("");
		
	ИначеЕсли симв1 <> "" тогда //2) список значений
		Если прав(диаметрСтр,1)=симв1 тогда //обрезаем последний символ разделить! нельзя так!
			диаметрСтр = лев(диаметрСтр, стрДлина(диаметрСтр)-1);
		КонецЕсли;	
		мас1 = РазложитьСтрокуВМассивПодстрок(диаметрСтр, симв1);
		СписДиаметров.ЗагрузитьЗначения( мас1 );
			
	ИначеЕсли Найти(диаметрСтр,"-")>0 тогда //3) диапазон
		k = Найти(диаметрСтр,"-");	
		зн1 = лев(диаметрСтр, k-1);  зн2 = прав(диаметрСтр, стрДлина(диаметрСтр)-k);
		МинНом=число(зн1); МаксНом = число(зн2);
   		для нн=МинНом по МаксНом цикл
 			СписДиаметров.Добавить(нн);
		КонецЦикла;	
		
	ИначеЕсли Найти(диаметрСтр,">")>0 тогда //4) > или >=
		k = Найти(диаметрСтр,">");	
		бр = (Найти(диаметрСтр,">=")>0); 
		зн1 = прав(диаметрСтр, стрДлина(диаметрСтр)-k - ?(бр, 1, 0) );
		если бр тогда 
			СписДиаметров.Добавить(зн1);	
		КонецЕсли;	
		МинНом=число(зн1); МаксНом=23;
		для нн=МинНом+1 по МаксНом цикл
			СписДиаметров.Добавить( строка(нн) );
		КонецЦикла;	
			
	ИначеЕсли Найти(диаметрСтр,"<")>0 тогда //5) < или <=
		k = Найти(диаметрСтр,"<");	
		бр = (Найти(диаметрСтр,"<=")>0); 
		зн2 = прав(диаметрСтр, стрДлина(диаметрСтр)-k - ?(бр, 1, 0) );
		
		МинНом=13; МаксНом = число(зн2);
		для нн=МинНом по МаксНом-1 цикл
			СписДиаметров.Добавить( строка(нн) );
		КонецЦикла;	
		Если бр тогда 
			СписДиаметров.Добавить(зн2);	
		КонецЕсли;			
		
	Иначе //6) 1 диаметр
		СписДиаметров.Добавить( СокрЛП(диаметрСтр) );
	КонецЕсли;
	
	возврат СписДиаметров;	
КонецФункции

//============================================================
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ПравилаУстановкиБонусовПоставщиков
	Движения.ПравилаУстановкиБонусовПоставщиков.Записывать = Истина;
	Движения.ПравилаУстановкиБонусовПоставщиков.Очистить();
	Если БонусОтПродаж и СписокИНН<>"" тогда  // список через ,
		масИНН = РазложитьСтрокуВМассивПодстрок(СписокИНН, ","); 
	иначе 
		масИНН = новый Массив;
		масИНН.Добавить("");
	КонецЕсли;
	
	СтрокаСпискаИсключений = "";
	Если БонусОтПродаж тогда
		СтрокаСпискаИсключений = ПолучитьСтрокуКодовИсключений();
	КонецЕсли;

	КолИНН = масИНН.Количество();
	Приоритет = 0; //сквозная нумерация!
	
	Для k=0 по КолИНН-1 цикл
		ИНН = СокрЛП( масИНН[k] );

		Если ДопУсловия.Количество()=0 тогда // БЕЗ доп.условий!
			i=0; дата1 = ДатаПо+86400;
			пока i<2 цикл
				Движение = Движения.ПравилаУстановкиБонусовПоставщиков.Добавить();
				Движение.Период    = дата1; 
				Движение.Приоритет = k+1000; // 2 периода на 1 правило по каждому ИНН... = N правил
				
				Движение.Производитель 		  = Производитель;
				Движение.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
				Движение.ПроцентБонуса = i*ПроцентБонуса;
				
				//Модель, Диаметр, Номенклатура
				Движение.ИНН = ИНН;
				Движение.БонусОтПродаж = БонусОтПродаж;
				Если НЕ БонусОтПродаж тогда 
				Движение.Контрагент = Контрагент;
				КонецЕсли;
				
				i=i+1; дата1 = ДатаС; 
			КонецЦикла;
		Иначе //=============================================================
		для каждого стр1 из ДопУсловия цикл	
			списДиаметров = ПолучитьСписокДиаметров(стр1.Диаметр);
			для d = 0 по СписДиаметров.Количество()-1 цикл
			Приоритет = Приоритет + 1; // от Номера строки / диаметра / ИНН
				i=0; дата1 = ДатаПо+86400;  
				пока i<2 цикл
					Движение = Движения.ПравилаУстановкиБонусовПоставщиков.Добавить();
					Движение.Период     = дата1;
					Движение.Приоритет  = Приоритет; // 2 периода на <НомерСтроки> правило по 1 ИНН
					
					Движение.Производитель 		  = Производитель;
					Движение.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
					Движение.ПроцентБонуса = i*стр1.ПроцентБонуса;
					
					Движение.Модель = стр1.Модель;
					Движение.Диаметр = списДиаметров[d].Значение;
					Движение.Номенклатура = стр1.Номенклатура;
					
					Движение.БонусОтПродаж = БонусОтПродаж;
					
					Если БонусОтПродаж тогда 
						Движение.ИНН = СокрЛП(ИНН); //+++ 
						Движение.СтрокаСпискаИсключений  = СтрокаСпискаИсключений; //---
					Иначе
						Движение.Контрагент = Контрагент;
					КонецЕсли;	
					
				i=i+1; дата1 = ДатаС; 
				КонецЦикла; //i
			КонецЦикла;//d
		КонецЦикла;//доп.условия
		
		КонецЕсли;
	
	КонецЦикла;//ИНН

КонецПроцедуры

