
Процедура ПриОткрытии()
	
	КартинкаЗаголовка= ЭДО_БиблиотекаКартинок().КартинкаЗаголовка;
	
	ТекстОшибки = СокрЛП(ТекстОшибки);
	
	Если НЕ ЗначениеЗаполнено(РежимОтображения) Тогда
		
		УстановитьРежимСверткиЭлементаУправления(ЭлементыФормы.ПанельКнопкаОткрыть, РежимСверткиЭлементаУправления.Низ);
		
	ИначеЕсли РежимОтображения = "ТолькоКнопкаЗакрыть" Тогда
		
		УстановитьРежимСверткиЭлементаУправления(ЭлементыФормы.ПанельКнопкаОткрыть, РежимСверткиЭлементаУправления.Низ);
		
		ЭлементыФормы.КоманднаяПанель.Кнопки.Удалить(ЭлементыФормы.КоманднаяПанель.Кнопки.КнопкаПовторить);
		ЭлементыФормы.КоманднаяПанель.Кнопки.Удалить(ЭлементыФормы.КоманднаяПанель.Кнопки.КнопкаПропустить);
		ЭлементыФормы.КоманднаяПанель.Кнопки.Удалить(ЭлементыФормы.КоманднаяПанель.Кнопки.Разделитель1);
		
		ЭлементыФормы.КоманднаяПанель.Кнопки.КнопкаПрекратить.Текст 	= "Закрыть";
		ЭлементыФормы.КоманднаяПанель.Кнопки.КнопкаПрекратить.Подсказка = "Закрыть";
		ЭлементыФормы.КоманднаяПанель.Кнопки.КнопкаПрекратить.Пояснение = "Закрыть";
		
	ИначеЕсли РежимОтображения = "ТолькоКнопкиПропуститьПрекратить" Тогда
		
		УстановитьРежимСверткиЭлементаУправления(ЭлементыФормы.ПанельКнопкаОткрыть, РежимСверткиЭлементаУправления.Низ);
		
		ЭлементыФормы.КоманднаяПанель.Кнопки.Удалить(ЭлементыФормы.КоманднаяПанель.Кнопки.КнопкаПовторить);
		
	ИначеЕсли РежимОтображения = "КнопкаОткрытьПакет" Тогда
		
		Элементыформы.КнопкаОткрыть.Заголовок = "Открыть пакет";
		
	ИначеЕсли РежимОтображения = "КнопкаОткрытьДокумент" Тогда
		
		Элементыформы.КнопкаОткрыть.Заголовок = "Открыть " + ДополнительныеПараметры.ТипДокумента;
		
	ИначеЕсли РежимОтображения = "КнопкаЗаполнитьПараметрыПодписанияУПД" Тогда
		
		ЭлементыФормы.КнопкаОткрыть.Ширина 	  = 229;
		Элементыформы.КнопкаОткрыть.Заголовок = "Заполнить параметры подписания";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КнопкаОткрытьНажатие(Элемент)
	
	Если РежимОтображения = "КнопкаОткрытьПакет" Тогда
		
		ТекущийДокумент = Неопределено;
		
		НоваяФорма = ПолучитьФорму("ФормаПечатногоДокумента");
	    МассивDocuments = НоваяФорма.СформироватьИПоказатьПечатнуюФорму(ДополнительныеПараметры.МассивДокументовПакета,,,,ДополнительныеПараметры.Документ);
		
		Если ЗначениеЗаполнено(МассивDocuments) Тогда
			Закрыть(МассивDocuments); // Выгружено
		КонецЕсли;
		
	ИначеЕсли РежимОтображения = "КнопкаОткрытьДокумент"  Тогда
		
		НоваяФорма = ПолучитьФорму("ФормаПечатногоДокумента");
	    МассивDocuments = НоваяФорма.СформироватьИПоказатьПечатнуюФорму(ДополнительныеПараметры.МассивДокументовПакета,,,,ДополнительныеПараметры.Документ);
		
		Если ЗначениеЗаполнено(МассивDocuments) Тогда
			Закрыть(МассивDocuments); // Выгружено
		КонецЕсли;
		
	ИначеЕсли РежимОтображения = "КнопкаЗаполнитьПараметрыПодписанияУПД"  Тогда
		
		НоваяФорма = ПолучитьФорму("ФормаНастройкиПодписиУПД");
		ЗаполнитьЗначенияСвойств(НоваяФорма, ДополнительныеПараметры);
		НоваяФорма.Открыть();
		
	КонецЕсли;
		
КонецПроцедуры

Процедура КнопкаПовторитьНажатие(Кнопка)
	
	Закрыть(1);
	
КонецПроцедуры

Процедура КнопкаПропуститьНажатие(Кнопка)
	
	Закрыть(2);
	
КонецПроцедуры

Процедура КнопкаПрекратитьНажатие(Кнопка)
	
	Закрыть();
	
КонецПроцедуры
