Функция Печать(НомерДока = "") Экспорт
	
	НомерНаПечать = НомерДока;
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ЗаказПоставщикуСезонный")  Тогда
		Возврат ПечатьДокумента(СсылкаНаОбъект);
	КонецЕсли;
	
КонецФункции // Печать

Функция ПечатьДокумента(СсылкаНаОбъект)
		
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Спецификация";
	
	

	Макет = ПолучитьМакет("Спецификация");
	ОбластьШапка        = Макет.ПолучитьОбласть("Шапка");

	ОбластьСтрока       = Макет.ПолучитьОбласть("ТоварДетали");
	ОбластьИтог         = Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияСвойствОбъектов.Объект,
	               |	ЗначенияСвойствОбъектов.Свойство,
	               |	ЗначенияСвойствОбъектов.Значение
	               |ПОМЕСТИТЬ мин
	               |ИЗ
	               |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |ГДЕ
	               |	ЗначенияСвойствОбъектов.Свойство.Код = ""90250""
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗначенияСвойствОбъектов.Объект,
	               |	ЗначенияСвойствОбъектов.Свойство,
	               |	ЗначенияСвойствОбъектов.Значение
	               |ПОМЕСТИТЬ макс
	               |ИЗ
	               |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |ГДЕ
	               |	ЗначенияСвойствОбъектов.Свойство.Код = ""90205""
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Документ.Номенклатура.Код КАК Код,
	               |	Документ.Номенклатура КАК Номенклатура,
	               |	СУММА(Документ.Количество) КАК Количество,
	               |	СУММА(Документ.Сумма) КАК Сумма,
	               |	Документ.Цена КАК Цена,
	               |	макс.Значение КАК МаксНагрузка,
	               |	мин.Значение КАК МинНагрузка
	               |ИЗ
	               |	Документ.ЗаказПоставщикуСезонный.Товары КАК Документ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ мин КАК мин
	               |		ПО Документ.Номенклатура = мин.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ макс КАК макс
	               |		ПО Документ.Номенклатура = макс.Объект
	               |ГДЕ
	               |	Документ.Ссылка = &ТекущийДокумент
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Документ.Номенклатура,
	               |	Документ.Цена,
	               |	Документ.Номенклатура.Код,
	               |	макс.Значение,
	               |	мин.Значение
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПОДСТРОКА(Документ.Номенклатура.НаименованиеПолное, 1, 50)";
	

	ТЗТоваров = Запрос.Выполнить().Выгрузить();
	
	
	//ОбластьШапка.Параметры.НомерЗаказа = ПолучитьНомерНаПечать(СсылкаНаОбъект);	
	ОбластьШапка.Параметры.НомерЗаказа = СсылкаНаОбъект.Номер;	
	ОбластьШапка.Параметры.Контрагент = СсылкаНаОбъект.Контрагент;	
	ОбластьШапка.Параметры.ДатаЗаказа = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");	
	Если СсылкаНаОбъект.Организация = Справочники.Организации.НайтиПоКоду("00005") Тогда
		//WG
		ОбластьШапка.Параметры.Локация = "";
	Иначе
		ОбластьШапка.Параметры.Локация = "Ярославль/Yaroslavl";
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьШапка);
	
	Для Каждого Строка Из ТЗТоваров Цикл
		ОбластьСтрока.Параметры.Номенклатура = Строка.Номенклатура.Наименование;
		ОбластьСтрока.Параметры.Количество = Строка.Количество;
		ОбластьСтрока.Параметры.Цена = Строка.Цена;
		ОбластьСтрока.Параметры.Сумма = Строка.Сумма;
		ОбластьСтрока.Параметры.Код = Строка.Код;
        ОбластьСтрока.Параметры.Мин = Строка.МинНагрузка;
		ОбластьСтрока.Параметры.Макс = Строка.МаксНагрузка;
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	//Итог
	ОбластьИтог.Параметры.КоличествоИтого = ТЗТоваров.Итог("Количество");
	ОбластьИтог.Параметры.СуммаИтого = Формат(ТЗТоваров.Итог("Сумма"),"ЧДЦ=2");
	Если СсылкаНаОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоКоду("840") Тогда    //USD
		СтрРус =  "доллор США, доллара США, долларов США, м, цент, цента, центов, ж, 2";
		СтрИнЯз =  "USD, USD, cent, cents, 2";
	ИначеЕсли СсылкаНаОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоКоду("978") Тогда   // EURO
		СтрРус =  "ЕВРО, ЕВРО, ЕВРО, М, цент, цента,центов,ж, 2";
		СтрИнЯз =  "EURO, EURO, М, Cent, Cent, M, 2";
    Иначе   //
		СтрРус =  "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
		СтрИнЯз =  "RUB, RUB, М, k, k, M, 2";
    КонецЕсли;
	ОбластьИтог.Параметры.СуммаПрописьюИнЯз = ЧислоПрописью(ТЗТоваров.Итог("Сумма"),"Л=en_US",СтрИнЯз);
	ОбластьИтог.Параметры.СуммаПрописью = ЧислоПрописью(ТЗТоваров.Итог("Сумма"),"Л=ru_RU",СтрРус);
	Если СсылкаНаОбъект.Контрагент.Код = "91535  " Тогда // JIANGSU SAINTY MACHINERY I&E CORP. LTD
		ОбластьИтог.Параметры.Контрагент = "Jiangsu Sanhe Aluminium Wheel Manufacturing Co. LTD";
	Иначе
		ОбластьИтог.Параметры.Контрагент = СсылкаНаОбъект.Контрагент;
	КонецЕсли;
	ОбластьИтог.Параметры.ДатаОкончанияСЗ     = Формат(СсылкаНаОбъект.ДатаДействияПо,"ДФ=dd.MM.yyyy");
	ПортНазначения = СсылкаНаОбъект.ПортНазначения;
	ОбластьИтог.Параметры.ПортНазначенияРус   = "8. Порт назначения: "     + ПортНазначения;
	ОбластьИтог.Параметры.ПортНазначенияНеРус = "8. Port of destination: " + ПортНазначения;
	ТабДокумент.Вывести(ОбластьИтог);
	
	Если СсылкаНаОбъект.Организация = Справочники.Организации.НайтиПоКоду("00005") Тогда
		ОбластьПечать = Макет.ПолучитьОбласть("ПечатьWG");
	Иначе
		ОбластьПечать = Макет.ПолучитьОбласть("Печать");
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьПечать);
		
	ТабДокумент.АвтоМасштаб = Истина;	
	Возврат ТабДокумент;
				   
КонецФункции
