
Процедура ПередЗаписью(Отказ)
	
	Таблица = ФизическиеЛица.Выгрузить();
	Таблица.Колонки.Добавить("Число");
	
	Для Каждого Стр из Таблица Цикл
		
		Стр.Число = 1;	
		
	КонецЦикла;
	
	Таблица.Свернуть("ФизическоеЛицо","Число");
	
	Для Каждого Стр из Таблица Цикл
		
		Если (Стр.Число>1) Тогда 
			Сообщить("Физ лицо " + Стр.ФизическоеЛицо + " дублируется.");
			Отказ = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ Отказ Тогда
	
		обЗаписатьПротоколИзменений(ЭтотОбъект);
	
	КонецЕсли; 
	
КонецПроцедуры
