Функция Печать() Экспорт
	
	//Если Не Метаданные.Имя = "УправлениеТорговлей" Тогда
	//	Сообщить("Печатная форма предназначена для использования в конфигурации ""Управление торговлей""", СтатусСообщения.Внимание);
	//КонецЕсли;
	
	Возврат ПечатьРеализации();
	
	
КонецФункции // Печать

Функция ПечатьРеализации() 
	
	ТабДок=Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ОтчетРеализация");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Номенклатура.Код КАК Код,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.Количество,
	|	ЦеныФопЭкспортСрезПоследних.Цена КАК СебестоимостьШтуки,
	|	ЗаказПокупателяТовары.Цена,
	|	ЗаказПокупателяТовары.Сумма,
	|	(ЗаказПокупателяТовары.Цена - ЦеныФопЭкспортСрезПоследних.Цена) * ЗаказПокупателяТовары.Количество КАК ВаловаяПрибыль,
	|	ВЫБОР
	|		КОГДА ЦеныФопЭкспортСрезПоследних.Цена > 0
	|			ТОГДА ВЫРАЗИТЬ(100 * (ЗаказПокупателяТовары.Цена / ЦеныФопЭкспортСрезПоследних.Цена - 1) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентНаценки,
	|	ЕСТЬNULL(ЦенообразованиеФОБ.LugCount, 0) * ЕСТЬNULL(ЦенообразованиеФОБ.КрепежКоличество, 0) + ЦеныФопЭкспортСрезПоследних.Цена КАК СебестоимостьКрепежа
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|		ЗаказПокупателяТовары.Количество КАК Количество,
	|		ЗаказПокупателяТовары.Цена КАК Цена,
	|		ЗаказПокупателяТовары.Сумма КАК Сумма,
	|		ЗаказПокупателяТовары.НомерСтроки КАК НомерСтроки
	|	ИЗ
	|		Документ.ЗаказПокупателяСезонный.Товары КАК ЗаказПокупателяТовары
	|	ГДЕ
	|		ЗаказПокупателяТовары.Ссылка = &Ссылка) КАК ЗаказПокупателяТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныФопЭкспорт.СрезПоследних(, ) КАК ЦеныФопЭкспортСрезПоследних
	|		ПО ЗаказПокупателяТовары.Номенклатура = ЦеныФопЭкспортСрезПоследних.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦенообразованиеФОБ КАК ЦенообразованиеФОБ
	|		ПО ЗаказПокупателяТовары.Номенклатура = ЦенообразованиеФОБ.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПокупателяТовары.НомерСтроки";
	
	//+++ 01.08.2014 - ВАЖНО на дату документа!
	грДок = Новый Граница(СсылкаНаОбъект.Дата, ВидГраницы.Исключая);
	Запрос.УстановитьПараметр("ДатаДок", грДок ); // граница на начало документа
		
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	Если ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "УчетТолькоПоПодразделениюПользователя") тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"//ОТБОР_СКЛАД_ПОДРАЗДЕЛЕНИЕ","И Склад.Транзитный И Склад.Подразделение=&Подразделение");
		Запрос.УстановитьПараметр("Подразделение",глТекущийПользователь.ОсновноеПодразделение); //только по своему подразделению
	Иначе
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"//ОТБОР_СКЛАД_ПОДРАЗДЕЛЕНИЕ"," И "+?(СсылкаНаОбъект.транзит,"","НЕ")+" Склад.Транзитный
		|"+?(СсылкаНаОбъект.Транзит, " И Склад.Подразделение=&Подразделение","") );	
		
		Запрос.УстановитьПараметр("Подразделение",СсылкаНаОбъект.Подразделение);
	КонецЕсли;	
	
	Результат = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	
	ТабДок.Очистить();
	ОбластьЗаголовок.Параметры.Ссылка = Строка(СсылкаНаОбъект) ;
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	ВыборкаДетали = Результат.Выбрать();
	
	Пока ВыборкаДетали.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	
	Возврат ТабДок;
КонецФункции