
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Если Вопрос("Установить во все выделенные Группы - выбранных Грузчиков?", РежимДиалогаВопрос.ДаНет,0)<>КодВозвратаДиалога.Да тогда
		возврат;
	КонецЕсли;
	
	для каждого стр1 из ГруппаСкладов цикл
		если не стр1.флаг тогда
			продолжить;
		КонецЕсли;
		группаОб = стр1.Группа.ПолучитьОбъект();
		
		группаОб.Состав.Очистить(); N=0;
		для каждого стр2 из Грузчики цикл
			если не стр2.флаг тогда
				продолжить;
			КонецЕсли;
		стр222 = группаОб.Состав.Добавить();
		стр222.ФизЛицо = стр2.Грузчик;
		N=N+1;
		КонецЦикла;
		
		попытка
			группаОб.Записать();
			сообщить("Записаны "+строка(N)+" грузчиков в группу: "+строка(группаОб), СтатусСообщения.Информация);
		Исключение
			сообщить("Ошибка при записи "+строка(N)+" грузчиков в группу: "+строка(группаОб)+" : "+ОписаниеОшибки(), СтатусСообщения.Внимание);
		КонецПопытки;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодразделениеПриИзменении(Элемент)
	ПолучитьСписокГрупп();
КонецПроцедуры

процедура ПолучитьСписокГрупп()
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	ЛОЖЬ КАК Флаг,
	                |	ВЫБОР
	                |		КОГДА Склады.ГруппаСкладов = ЗНАЧЕНИЕ(Справочник.ГруппыСкладов.ПустаяСсылка)
	                |			ТОГДА &ОсновнойСклад
	                |		ИНАЧЕ Склады.ГруппаСкладов
	                |	КОНЕЦ КАК Группа
	                |ИЗ
	                |	Справочник.Склады КАК Склады
	                |ГДЕ
	                |	НЕ Склады.ПометкаУдаления
	                |	И НЕ Склады.ЭтоГруппа
					|	И НЕ Склады.ЗапретитьИспользование
	                |	И Склады.Транзитный = &Транзит
	               |	И ( (&Транзит
	                |       И Склады.Подразделение = &Подразделение
	                |		и НЕ Склады.ГруппаСкладов = ЗНАЧЕНИЕ(Справочник.ГруппыСкладов.ПустаяСсылка)
	                |	   ) ИЛИ (НЕ &Транзит) )";
	 Запрос.УстановитьПараметр("Подразделение", Подразделение);
	 Запрос.УстановитьПараметр("Транзит", Подразделение.ОбособленноеПодразделение);
	 Запрос.УстановитьПараметр("ОсновнойСклад", справочники.ГруппыСкладов.ОсновнойСклад );
	 Результат = Запрос.Выполнить();
	 ГруппаСкладов =результат.Выгрузить();
	 
КонецПроцедуры

процедура ПолучитьГрузчиковГруппы(группа)
	 	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	ИСТИНА КАК Флаг,
	                |	Состав.ФизЛицо КАК Грузчик
	                |ИЗ
	                |	Справочник.ГруппыСкладов.Состав КАК Состав
	                |ГДЕ
	                |	Состав.Ссылка = &группа";
	 
	 Запрос.УстановитьПараметр("группа", группа);
	 
	 Результат = Запрос.Выполнить();
	 Грузчики =результат.Выгрузить();
     ЭлементыФормы.Надпись2.Заголовок = строка(Грузчики.Количество())+" чел. группы: "+строка(группа);
КонецПроцедуры


//====================================================
процедура устФлаг(ном=1, табл=1)
	если табл=1 тогда
		для каждого стр1 из ГруппаСкладов цикл
			стр1.флаг = ?(ном=1, Истина, ?(ном=0, ложь, не стр1.флаг));
		КонецЦикла;	
	иначе
		для каждого стр1 из Грузчики цикл
			стр1.флаг = ?(ном=1, Истина, ?(ном=0, ложь, не стр1.флаг));
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

Процедура КоманднаяПанель2Вкл(Кнопка)
	устФлаг(1);
КонецПроцедуры

Процедура КоманднаяПанель2Выкл(Кнопка)
	устФлаг(0);
КонецПроцедуры

Процедура КоманднаяПанель2Перекл(Кнопка)
	устФлаг(2);
КонецПроцедуры
//---------------------------------------------
Процедура КоманднаяПанель3Вкл(Кнопка)
	устФлаг(1, 2);
КонецПроцедуры

Процедура КоманднаяПанель3Выкл(Кнопка)
	устФлаг(0, 2);
КонецПроцедуры

Процедура КоманднаяПанель3Перекл(Кнопка)
	устФлаг(2, 2);
КонецПроцедуры

Процедура ПриОткрытии()
	Подразделение = глТекущийПользователь.ОсновноеПодразделение;
	если Подразделение.ОбособленноеПодразделение тогда
		ЭлементыФормы.Подразделение.Доступность = ложь;
	КонецЕсли;
	ПолучитьСписокГрупп();
КонецПроцедуры

Процедура ГруппаСкладовПриАктивизацииСтроки(Элемент)
	 текСтр = ЭлементыФормы.ГруппаСкладов.ТекущиеДанные;
	 если текСтр <> неопределено тогда
	 	ПолучитьГрузчиковГруппы(текСтр.Группа);
	 КонецЕсли;
КонецПроцедуры
