
Процедура ДатаНачалаПриИзменении(Элемент)
	УстановитьНастройки();
КонецПроцедуры

Процедура ДатаОкончанияПриИзменении(Элемент)
	УстановитьНастройки();
КонецПроцедуры

Процедура КнопкаВыбораПериодаНажатие(Элемент)

	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.УстановитьПериод(ДатаНачала, ?(ДатаОкончания='0001-01-01', ДатаОкончания, КонецДня(ДатаОкончания)));
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	Если НастройкаПериода.Редактировать() Тогда
		ДатаНачала = НастройкаПериода.ПолучитьДатуНачала();
		ДатаОкончания = НастройкаПериода.ПолучитьДатуОкончания();
		УстановитьНастройки();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтветственныйПриИзменении(Элемент)
	УстановитьНастройки();
КонецПроцедуры

Процедура ПроцентОтсеченияПриИзменении(Элемент)
	УстановитьНастройки();
КонецПроцедуры

Процедура ПроцентСНаценкиПриИзменении(Элемент)
	УстановитьНастройки();
КонецПроцедуры

Процедура ПроцентСОборотаПриИзменении(Элемент)
	УстановитьНастройки();
КонецПроцедуры
 
Процедура ПриОткрытии()
	
	Ответственный = Справочники.Пользователи.НайтиПоКоду("Вострилов А.В.");	
	ПроцентОтсечения = 10;
	ПроцентСНаценки = 2;
	ПроцентСОборота = 0.03;
	УстановитьНастройки();
		
КонецПроцедуры

Процедура УстановитьНастройки()
	
	ПараметрДанныхНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0];   
	ПараметрДанныхНачалоПериода.Значение = ДатаНачала;
	ПараметрДанныхНачалоПериода.Использование = Истина;
	
	ПараметрДанныхКонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1];   
	ПараметрДанныхКонецПериода.Значение = КонецДня(ДатаОкончания);
	ПараметрДанныхКонецПериода.Использование = Истина;
	
	ПараметрДанныхОтветственный = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[2];   
	ПараметрДанныхОтветственный.Значение = Ответственный;
	ПараметрДанныхОтветственный.Использование = Истина;
	
	ПараметрДанныхПроцентОтсечения = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[3];   
	ПараметрДанныхПроцентОтсечения.Значение = ПроцентОтсечения;
	ПараметрДанныхПроцентОтсечения.Использование = Истина;
	
	ПараметрДанныхПроцентСНаценки = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[4];   
	ПараметрДанныхПроцентСНаценки.Значение = ПроцентСНаценки;
	ПараметрДанныхПроцентСНаценки.Использование = Истина;
	
	ПараметрДанныхПроцентСОборота = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[5];   
	ПараметрДанныхПроцентСОборота.Значение = ПроцентСОборота;
	ПараметрДанныхПроцентСОборота.Использование = Истина;
	
КонецПроцедуры

