
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если Найти(строка(Расшифровка),",")>0 и Найти(строка(Расшифровка),".")=3 тогда
		
		СтандартнаяОбработка = ЛОЖЬ;
		
		Если Вопрос("Показать на карте?",РежимДиалогаВопрос.ДаНет,0)=КодВозвратаДиалога.Да тогда
		URL= "https://maps.yandex.ru/?ll="+Расшифровка
			+"&spn=2.124481,0.671008&z=12&l=map&pt="+Расшифровка+",pmrdm1"
		;
		ЗапуститьПриложение(URL);	
			
		Иначе Предупреждение("Координаты (Д,Ш) : "+Расшифровка);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(ДатаНач, ?(ДатаКон='0001-01-01', ДатаКон, КонецДня(ДатаКон)));
	Если НастройкаПериода.Редактировать() Тогда
		ДатаНач = НастройкаПериода.ПолучитьДатуНачала();
		ДатаКон = НастройкаПериода.ПолучитьДатуОкончания();
		
		ДатаНачПриИзменении(неопределено);
		ДатаКонПриИзменении(неопределено);

	КонецЕсли;
КонецПроцедуры


Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
		ДатаНач = НачалоНедели( ТекущаяДата() ) - 7*86400; //начало пред.недели
		ДатаКон = ТекущаяДата();
КонецПроцедуры

Процедура ДатаНачПриИзменении(Элемент)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = ДатаНач;
КонецПроцедуры

Процедура ДатаКонПриИзменении(Элемент)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = ДатаКон;
КонецПроцедуры
