
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ЗаказыПоставщикамСезонные.Записывать = Истина;
	Движения.ЗаказыПоставщикамСезонные.Очистить();
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ЗаказыПоставщикамСезонные.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.ЗаказПоставщикуСезонный = ТекСтрокаТовары.ЗаказПоставщикуСезонный;
		Если ТекСтрокаТовары.ЗаказПоставщикуСезонный.Дата >= Дата("20170101000000") Тогда
			Движение.Подразделение = ТекСтрокаТовары.ЗаказПоставщикуСезонный.Подразделение;
			Движение.ВЭД =  ТекСтрокаТовары.ЗаказПоставщикуСезонный.Подразделение.ВЭД;
		конецЕсли;	
		Движение.Дата = Дата;
	КонецЦикла;

КонецПроцедуры
