Перем ОписаниеСобытия;

Процедура КнопкаВыбораПериодаНажатие(Элемент)
	
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.УстановитьПериод(ДатаНачала, ?(ДатаОкончания='0001-01-01', ДатаОкончания, КонецДня(ДатаОкончания)));
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	Если НастройкаПериода.Редактировать() Тогда
		ДатаНачала = НастройкаПериода.ПолучитьДатуНачала();
		ДатаОкончания = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
	
	УстановитьНастройки();
	
КонецПроцедуры

Процедура ДатаНачалаПриИзменении(Элемент)
	
	УстановитьНастройки();
	
КонецПроцедуры

Процедура ДатаОкончанияПриИзменении(Элемент)
	
	УстановитьНастройки();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	УстановитьНастройки();
	
КонецПроцедуры

Процедура УстановитьНастройки()
	
	ПараметрДанныхНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0];
	ПараметрДанныхНачалоПериода.Значение = ДатаНачала;
	ПараметрДанныхНачалоПериода.Использование = Истина;
	
	ПараметрДанныхКонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1];
	ПараметрДанныхКонецПериода.Значение = КонецДня(ДатаОкончания);
	ПараметрДанныхКонецПериода.Использование = Истина;
	
	ПараметрДанныхКонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[2];
	ПараметрДанныхКонецПериода.Значение = ОписаниеСобытия;
	ПараметрДанныхКонецПериода.Использование = Истина;
	
КонецПроцедуры

ОписаниеСобытия = Новый СписокЗначений;
ОписаниеСобытия.Добавить("Закрытие заказов покупателей");
ОписаниеСобытия.Добавить("Письмо о возникновении ПДЗ");
ОписаниеСобытия.Добавить("Проверить крышки");
ОписаниеСобытия.Добавить("Недогруз по перемещениям по ТЕНДЕРАМ!");
ОписаниеСобытия.Добавить("Создан новый склад");
ОписаниеСобытия.Добавить("Согласование электронного документа");
ОписаниеСобытия.Добавить("Письмо о приближении срока оплаты");
ОписаниеСобытия.Добавить("Отказано в согласовании склада");
