
Процедура КнопкаВыполнитьНажатие(Кнопка)
Режим = РежимДиалогаВопрос.ДаНет;
Текст = "ru = ""Отмена действий будет невозможна!
			   |Вы уверены в необходимости выполнения?"";"
     + " en = ""Do you want to continue?""";
Ответ = Вопрос(НСтр(Текст), Режим, 0);
Если Ответ = КодВозвратаДиалога.Нет Тогда
    Возврат;
КонецЕсли;

Сообщить(Строка(ТекущаяДата())+" - обработка начало.");

для каждого стр1 из ТаблЗамены цикл
	
	Если стр1.Контрагент.Пустая() тогда
		Сообщить(строка(стр1.НомерСтроки)+") Нет контрагента!", СтатусСообщения.Внимание);
	    Продолжить;
	КонецЕсли;		
	
	
	Если Флажок1 тогда
		Если стр1.Контрагент.ОсновнойМенеджерКонтрагента = стр1.ПользовательНов тогда
			Сообщить(строка(стр1.НомерСтроки)+") "+строка(стр1.Контрагент)+" - не изменен.", СтатусСообщения.Обычное);
		иначе	
			КонтрОб = стр1.Контрагент.ПолучитьОбъект();
			КонтрОб.ОсновнойМенеджерКонтрагента = стр1.ПользовательНов;
			попытка
				КонтрОб.Записать();
				Сообщить(строка(стр1.НомерСтроки)+") "+строка(стр1.Контрагент)+" - изменен.", СтатусСообщения.Информация);
			исключение
				Сообщить(строка(стр1.НомерСтроки)+") "+строка(стр1.Контрагент)+" - Не удалось изменить Осн.мен.контр на "+строка(стр1.ПользовательНов), СтатусСообщения.Внимание);
			КонецПопытки;	
		КонецЕсли;	
	КонецЕсли;
	
	Если Флажок2 тогда
		стр1.дог1 = найтиДог(стр1.Контрагент, стр1.ПользовательСтар, НазвДоговора);
		если НЕ стр1.дог1.Пустая() тогда
			догОб = стр1.дог1.ПолучитьОбъект();
			догОб.ОтветственноеЛицо =  стр1.ПользовательНов;
			попытка
			догОб.Записать();
			Сообщить("    "+строка(стр1.Контрагент)+" - дог.№ "+строка(стр1.Дог1.Код)+" - изменен.", СтатусСообщения.Информация);
			исключение
			Сообщить("    "+строка(стр1.Контрагент)+" - дог.№ "+строка(стр1.Дог1.Код)+" - не удалось записать!", СтатусСообщения.Внимание);
			КонецПопытки;
		иначе
			стр1.дог1 = найтиДог(стр1.Контрагент, стр1.ПользовательНов, НазвДоговора);
			Сообщить(строка(стр1.НомерСтроки)+") "+строка(стр1.Контрагент)+" - дог.№ "+строка(стр1.Дог1.Код)+" - не изменен.", СтатусСообщения.Обычное);
		КонецЕсли;	
	КонецЕсли;	
	
	Если Флажок3 тогда
		стр1.дог2 = найтиДог(стр1.Контрагент, стр1.ПользовательСтар, НазвДоговора2);
		если НЕ стр1.дог2.Пустая() тогда
			догОб = стр1.дог2.ПолучитьОбъект();
			догОб.ОтветственноеЛицо =  стр1.ПользовательНов;
			попытка
			догОб.Записать();
			Сообщить(строка(стр1.НомерСтроки)+") "+строка(стр1.Контрагент)+" - дог.№ "+строка(стр1.Дог2)+" - изменен.", СтатусСообщения.Информация);
			исключение
			Сообщить(строка(стр1.НомерСтроки)+") "+строка(стр1.Контрагент)+" - дог.№ "+строка(стр1.Дог2)+" - не удалось записать!", СтатусСообщения.Внимание);
			КонецПопытки;
		иначе
			стр1.дог2 = найтиДог(стр1.Контрагент, стр1.ПользовательНов, НазвДоговора2);
			Сообщить(строка(стр1.НомерСтроки)+") "+строка(стр1.Контрагент)+" - дог.№ "+строка(стр1.Дог2.Код)+" - не изменен.", СтатусСообщения.Обычное);
		КонецЕсли;	
	КонецЕсли;	
	
	Если флажок4 тогда // замена осн.договора по менеджеру
		дог = стр1.Контрагент.ОсновнойДоговорКонтрагента;
		стр1.Дог1 = дог;
		мен = дог.ОтветственноеЛицо;
		стр1.ПользовательСтар = мен;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ОтветственноеЛицо = &ОтветственноеЛицо
		|	И ДоговорыКонтрагентов.Владелец = &Владелец
		|	И ДоговорыКонтрагентов.Наименование ПОДОБНО &Наименование";
		
		Запрос.УстановитьПараметр("Наименование", "%предоплаты"+?(найти(дог.наименование,"*")>0,"*","")+"%" );
		Запрос.УстановитьПараметр("Владелец",стр1.Контрагент);
		Запрос.УстановитьПараметр("ОтветственноеЛицо",мен);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		если Выборка.Следующий() тогда
		
		попытка 
			контрОб = стр1.Контрагент.ПолучитьОбъект();
			контрОб.ОсновнойДоговорКонтрагента = выборка.ссылка;
			контрОб.Записать();
		стр1.Дог2 = выборка.ссылка; 	
		стр1.ПользовательНов = мен;
		исключение
		сообщить("Ошибка при записи контр."+строка(стр1.Контрагент));
		КонецПопытки;
		
		КонецЕсли;
		
	КонецЕсли;	
		
КонецЦикла;	

Сообщить(Строка(ТекущаяДата())+" - обработка завершена.");


КонецПроцедуры


функция найтиДог(Контр, ОтветственноеЛицо, НазвДоговора="")
	
	Если ОтветственноеЛицо.Пустая() тогда
	  рез = справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	  возврат рез;
	КонецЕсли;
	  
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	ДоговорыКонтрагентов.Ссылка
	                |ИЗ
	                |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                |ГДЕ
	                |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	                |	И ДоговорыКонтрагентов.ОтветственноеЛицо = &ОтветственноеЛицо
	                |	И ДоговорыКонтрагентов.Наименование = &Наименование
	                |	И ДоговорыКонтрагентов.Владелец = &Контр
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ДоговорыКонтрагентов.Код УБЫВ
	                |АВТОУПОРЯДОЧИВАНИЕ";
	 
	 Запрос.УстановитьПараметр("ОтветственноеЛицо", ОтветственноеЛицо);
	 Запрос.УстановитьПараметр("Наименование", НазвДоговора);
	 Запрос.УстановитьПараметр("Контр", Контр);
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 Если Выборка.Следующий() тогда
		 рез = выборка.Ссылка;
	 Иначе	рез = справочники.ДоговорыКонтрагентов.ПустаяСсылка(); 
	 КонецЕсли;
	 
	 возврат рез;
КонецФункции	

Процедура КоманднаяПанель2Распознать(Кнопка)
	
	ТаблЗамены.Очистить();
	
	Для сч=НачСтр по ЭлементыФормы.ПолеТабличногоДокумента.ВысотаТаблицы Цикл
		
	ЗначениеЯчейки1 = ЭлементыФормы.ПолеТабличногоДокумента.Область("R"+Формат(сч,"ЧГ=0")+"C"+Строка(1)).Текст;		
	ЗначениеЯчейки2 = ЭлементыФормы.ПолеТабличногоДокумента.Область("R"+Формат(сч,"ЧГ=0")+"C"+Строка(2)).Текст;		
	ЗначениеЯчейки3 = ЭлементыФормы.ПолеТабличногоДокумента.Область("R"+Формат(сч,"ЧГ=0")+"C"+Строка(3)).Текст;		

	Контр = справочники.Контрагенты.НайтиПоНаименованию(ЗначениеЯчейки1);
	П1 = справочники.Пользователи.НайтиПоКоду(ЗначениеЯчейки2);
	П2 = справочники.Пользователи.НайтиПоКоду(ЗначениеЯчейки3);
	
	стр1 = ТаблЗамены.Добавить();
	стр1.НомерСтроки = сч;
	стр1.Контрагент  = Контр;
	стр1.ПользовательСтар = П1;
	стр1.ПользовательНов  = П2;
	КонецЦикла;

КонецПроцедуры

Процедура ПриОткрытии()
	НачСтр = 2;
	НазвДоговора  = "Договор продажи";
	НазвДоговора2 = "Договор продажи*";
КонецПроцедуры
