
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		Если не ЗначениеЗаполнено(РасчетныйСчетДт)и не касса тогда
		Сообщить("Не заполнен расчетный счет по продаже валюты!");
		отказ =Истина;
	конецЕсли;	
	Если не ЗначениеЗаполнено(РасчетныйСчетКт) и не касса тогда
		Сообщить("Не заполнен расчетный счет по покупке валюты!");
		отказ =Истина;
	конецЕсли;	

	Если не ЗначениеЗаполнено(КассаДт)и  касса тогда
		Сообщить("Не заполнена касса по продаже валюты!");
		отказ =Истина;
	конецЕсли;	
	Если не ЗначениеЗаполнено(КассаКт) и касса тогда
		Сообщить("Не заполнена касса по покупке валюты!");
		отказ =Истина;
	конецЕсли;	

	
	
	
	Если не отказ  тогда
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
	Движения.ДвиженияДенежныхСредств.Очистить();
	Движение = Движения.ДвиженияДенежныхСредств.Добавить();
	Движение.Период = Дата;
	Движение.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Расход;
	Движение.ДокументДвижения = Ссылка;
	Движение.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПеречислениеМеждуСчетами;

	Если Касса тогда
	Движение.ВидДенежныхСредств = Перечисления.ВидыДенежныхСредств.Наличные;
	Движение.БанковскийСчетКасса = КассаДт;
	иначе	
	Движение.ВидДенежныхСредств = Перечисления.ВидыДенежныхСредств.Безналичные;
	Движение.БанковскийСчетКасса = РасчетныйСчетДт;
	конецесли;
	Движение.Сумма = СуммаДт;
	Движение.СуммаУпр = СуммаУпрДт;

	Движение = Движения.ДвиженияДенежныхСредств.Добавить();
	Движение.Период = Дата;
	Движение.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Приход;
	Движение.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПеречислениеМеждуСчетами;
	Движение.ДокументДвижения = Ссылка;
	если касса тогда
	Движение.ВидДенежныхСредств = Перечисления.ВидыДенежныхСредств.Наличные;
	Движение.БанковскийСчетКасса = КассаКт;
	иначе	
	Движение.ВидДенежныхСредств = Перечисления.ВидыДенежныхСредств.Безналичные;
	Движение.БанковскийСчетКасса = РасчетныйСчетКт;
	конецесли;
	Движение.Сумма = СуммаКт;
	Движение.СуммаУпр = СуммаУпрКт;
	
	Движения.ДенежныеСредства.Записывать = Истина;
	Движения.ДенежныеСредства.Очистить();
	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	если касса тогда
	Движение.БанковскийСчетКасса = КассаДт;
	Движение.ВидДенежныхСредств = Перечисления.ВидыДенежныхСредств.Наличные;
	иначе
	Движение.БанковскийСчетКасса = РасчетныйСчетДт;
	Движение.ВидДенежныхСредств = Перечисления.ВидыДенежныхСредств.Безналичные;
	конецесли;
	Движение.Сумма = СуммаДт;
	Движение.СуммаУпр = СуммаУпрДт;

	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Если касса тогда
	Движение.БанковскийСчетКасса =КассаКт;
	Движение.ВидДенежныхСредств = Перечисления.ВидыДенежныхСредств.Наличные;
	иначе	
	Движение.БанковскийСчетКасса = РасчетныйСчетКт;
	Движение.ВидДенежныхСредств = Перечисления.ВидыДенежныхСредств.Безналичные;
	конецЕсли;
	Движение.Сумма = СуммаКт;
	Движение.СуммаУпр = СуммаУпрКт;

	конецЕсли;
КонецПроцедуры
  	
