
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Настройки = КомпоновщикНастроек.ПолучитьНастройки();  
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки);
    
    ДокументРезультат.Очистить();
    
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    
    ПроцессорВывода.НачатьВывод();
    
    Пока Истина Цикл
        
        ЭлементРезультата = ПроцессорКомпоновки.Следующий();
        
        Если ЭлементРезультата = Неопределено Тогда
            Прервать;
        КонецЕсли; 
        
        Если ЭлементРезультата.ЗначенияПараметров.Количество() > 0 Тогда 
            
            ИмяПараметра_СсылкаПредставление = Неопределено;
            
            // Поскольку имена параметров зашиты как "П1, П2..." то нужно понять какой из них нам нужен
            // Для этого идем в макеты и ищем имя параметра в выражении к параметру
            Для каждого ПараметрМакета Из МакетКомпоновки.Макеты[ЭлементРезультата.Макет].Параметры Цикл
                
                Если ТипЗнч(ПараметрМакета) = Тип("ПараметрОбластиВыражениеКомпоновкиДанных") Тогда
					
					Если Найти(ПараметрМакета.Выражение,"ПроверкаБлижайшейПартии") > 0 Тогда
						ИмяПараметра_ПроверкаБлижайшейПартии = ПараметрМакета.Имя;
					КонецЕсли; 
					
					Если Найти(ПараметрМакета.Выражение,"НомерКонтейнера") > 0 Тогда
						ИмяПараметра_НомерКонтейнера = ПараметрМакета.Имя;
					КонецЕсли; 
					
					Если Найти(ПараметрМакета.Выражение,"Код") > 0 Тогда
						ИмяПараметра_Код = ПараметрМакета.Имя;
					КонецЕсли; 
                    
                КонецЕсли;    
            
            КонецЦикла; 
            
			Если ИмяПараметра_НомерКонтейнера <> Неопределено Тогда
				// Заменяем значения полей на свои произвольные
				
				ЭлементРезультата.ЗначенияПараметров[ИмяПараметра_Код].Значение = "+";
				
			КонецЕсли; 
            
        КонецЕсли;
        
        ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
        
    КонецЦикла;   
        
    ПроцессорВывода.ЗакончитьВывод();
    ДокументРезультат.ОтображатьСетку=ложь;
    ДокументРезультат.ОтображатьЗаголовки=ложь;
    ДокументРезультат.ТолькоПросмотр = Истина;
    ДокументРезультат.Показать();
	
КонецПроцедуры
