 перем РедактируемыйДокумент;
 перем списокОтветственных;
 перем СЗКонтрагенты;
 
 Процедура КнопкаВыполнитьНажатие(Кнопка)
	 
	Дерево.Строки.Очистить();
	
	списокОтветственных = новый   СписокЗначений;
	СписокОтветственных.Добавить(глТекущийПользователь);
	
	Группа =  ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "ГруппаПользователейДляРаспределенияЗаказов");
	
	Если  ЗначениеЗаполнено(Группа) Тогда
		Для каждого ст из Группа.ПользователиГруппы	 Цикл
	      СписокОтветственных.Добавить(ст.Пользователь);
		конецЦикла;
	конецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	  "ВЫБРАТЬ РАЗЛИЧНЫЕ
	  |	ПродажиОбороты.ДоговорКонтрагента.Владелец
	  |ПОМЕСТИТЬ РазрешенныеКонтрагенты
	  |ИЗ
	  |	РегистрНакопления.Продажи.Обороты(&НачГода, &КонГода, , ДоговорКонтрагента.ОтветственноеЛицо В (&ОтветственноеЛицо)) КАК ПродажиОбороты
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ РАЗЛИЧНЫЕ
	  |	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Владелец
	  |ИЗ
	  |	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&КонДата, ДоговорКонтрагента.ОтветственноеЛицо В (&ОтветственноеЛицо)) КАК ВзаиморасчетыСКонтрагентамиОстатки
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВзаиморасчетыСКонтрагентамиОбороты.Регистратор,
	  |	ВзаиморасчетыСКонтрагентамиОбороты.Сделка,
	  |	ВзаиморасчетыСКонтрагентамиОбороты.СуммаВзаиморасчетовРасход КАК СуммаПлатежа,
	  |	ВзаиморасчетыСКонтрагентамиОбороты.ДоговорКонтрагента.Владелец,
	  |	ВзаиморасчетыСКонтрагентамиОбороты.ДоговорКонтрагента,
	  |	ВзаиморасчетыСКонтрагентамиОбороты.ДоговорКонтрагента.ОтветственноеЛицо,
	  |	ВЫБОР
	  |		КОГДА ВзаиморасчетыСКонтрагентамиОбороты.Сделка = НЕОПРЕДЕЛЕНО
	  |			ТОГДА ВзаиморасчетыСКонтрагентамиОбороты.СуммаВзаиморасчетовРасход
	  |		ИНАЧЕ 0
	  |	КОНЕЦ КАК СуммаНераспр
	  |ПОМЕСТИТЬ ВТ
	  |ИЗ
	  |	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(&начДата, &КонДата, Регистратор, ) КАК ВзаиморасчетыСКонтрагентамиОбороты
	  |ГДЕ
	  |	(ВзаиморасчетыСКонтрагентамиОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
	  |				И ВзаиморасчетыСКонтрагентамиОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя)
	  |			ИЛИ ВзаиморасчетыСКонтрагентамиОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	  |				И ВзаиморасчетыСКонтрагентамиОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ОплатаПокупателя))
	  |	И 99 = 99
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ РАЗЛИЧНЫЕ
	  |	ВТ.Регистратор
	  |ПОМЕСТИТЬ Нераспределенные
	  |ИЗ
	  |	ВТ КАК ВТ
	  |ГДЕ
	  |	ВТ.Сделка = НЕОПРЕДЕЛЕНО
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ РАЗЛИЧНЫЕ
	  |	ВТ.Регистратор
	  |ПОМЕСТИТЬ СДоговорамиПоЗаказам
	  |ИЗ
	  |	ВТ КАК ВТ
	  |ГДЕ
	  |	(ВТ.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам)
	  |			ИЛИ ВТ.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоРасчетнымДокументам))
	  |	И ВТ.ДоговорКонтрагентаВладелец В
	  |			(ВЫБРАТЬ
	  |				РазрешенныеКонтрагенты.ДоговорКонтрагентаВладелец
	  |			ИЗ
	  |				РазрешенныеКонтрагенты КАК РазрешенныеКонтрагенты)
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТ.Регистратор КАК Документ,
	  |	ВТ.Сделка,
	  |	ВТ.СуммаПлатежа КАК СуммаПлатежа,
	  |	ВТ.ДоговорКонтрагентаВладелец КАК Контрагент,
	  |	ВТ.ДоговорКонтрагента,
	  |	ВТ.ДоговорКонтрагентаОтветственноеЛицо КАК ОтветственноеЛицо,
	  |	ВТ.СуммаНераспр КАК СуммаНераспределено
	  |ИЗ
	  |	ВТ КАК ВТ
	  |ГДЕ
	  |	98 = 98
	  |	И ВТ.Регистратор В
	  |			(ВЫБРАТЬ
	  |				СДоговорамиПоЗаказам.Регистратор
	  |			ИЗ
	  |				СДоговорамиПоЗаказам КАК СДоговорамиПоЗаказам)
	  |
	  |УПОРЯДОЧИТЬ ПО
	  |	ВТ.ДоговорКонтрагентаВладелец.Наименование
	  |ИТОГИ
	  |	СУММА(СуммаПлатежа),
	  |	СУММА(СуммаНераспределено)
	  |ПО
	  |	Документ";
	
	
	  //Если ТолькоПоСвоимДоговорам Тогда
	  //    Запрос.Текст = СтрЗаменить(Запрос.Текст,"99 = 99","ВзаиморасчетыСКонтрагентамиОбороты.ДоговорКонтрагента.ОтветственноеЛицо = &ОтветственноеЛицо");
	  //    Запрос.УстановитьПараметр("ОтветственноеЛицо", глТекущийПользователь);
	  //иначе
		  Запрос.УстановитьПараметр("ОтветственноеЛицо", СписокОтветственных);	  
	  //конецЕсли;
	  Если ТолькоНераспределенныеПлатежи Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"98 = 98",  
	  "	ВТ.Регистратор В (ВЫБРАТЬ	Нераспределенные.Регистратор ИЗ	Нераспределенные КАК Нераспределенные)");
  конецЕсли;
  
   //+++Шарафутдинов по задаче 47131
   Если ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ЖурналыОтборПоРегиону")  Тогда
	   
		СЗКонтрагенты = ПолучитьСписокКонтрагентовМенеджераПоРегиону(СписокОтветственных);
		Запрос.УстановитьПараметр("Контрагент", СЗКонтрагенты);
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ДоговорКонтрагента.ОтветственноеЛицо В (&ОтветственноеЛицо)","ДоговорКонтрагента.Владелец В (&Контрагент)");
				
	КонецЕсли; 	
	//---Шарафутдинов по задаче 47131      
  
  
  
	Запрос.УстановитьПараметр("КонДата", КонПериода);
	Запрос.УстановитьПараметр("начДата", НачПериода);
	//Запрос.УстановитьПараметр("ОтветственноеЛицо", СписокОтветственных);
	Запрос.УстановитьПараметр("НачГода", ДобавитьМесяц(НачПериода,-12));
	Запрос.УстановитьПараметр("КонГода", НачПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокумент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокумент.Следующий() Цикл
		СтрокаКонтр = Дерево.Строки.Добавить();
		Строкаконтр.контрагент = ВыборкаДокумент.документ.контрагент;
		Строкаконтр.Документ = ВыборкаДокумент.документ;
		Строкаконтр.суммаплатежа = ВыборкаДокумент.СуммаПлатежа;
		Строкаконтр.сумманераспределено = ВыборкаДокумент.СуммаНераспределено;
		Если ТипЗнч(ВыборкаДокумент.документ)=Тип("ДокументСсылка.ПлатежноеПоручениеВходящее")тогда
			Строкаконтр.Сделка = ВыборкаДокумент.Документ.НазначениеПлатежа;
			Строкаконтр.Комментарий = ВыборкаДокумент.Документ.Комментарий;
		иначе
			Строкаконтр.Сделка = ВыборкаДокумент.Документ.Комментарий;
		конецЕсли;
		Выборка = ВыборкаДокумент.Выбрать();
		Пока Выборка.Следующий() Цикл
			Строка = СтрокаКонтр.Строки.Добавить();
			Строка.контрагент = Выборка.ДоговорКонтрагента;
			Строка.Документ = Выборка.ОтветственноеЛицо;
			Строка.сделка = Выборка.сделка;
			Строка.суммаплатежа = Выборка.СуммаПлатежа;
			Строка.сумманераспределено = Выборка.СуммаНераспределено;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
	ограничение = НачалоДня(ТекущаяДата())-6*24*60*60;
	Если НачПериода< ограничение Тогда
		Сообщить("Распределять деньги можно только за последню неделю!");
		НачПериода= Ограничение;
	конецЕсли;	
КонецПроцедуры

Процедура НачПериодаПриИзменении(Элемент)
	ограничение = НачалоДня(ТекущаяДата())-14*24*60*60;
	Если НачПериода< ограничение Тогда
		Сообщить("Распределять деньги можно только за последню неделю!");
		НачПериода= Ограничение;
	конецЕсли;	

КонецПроцедуры

Процедура ДеревоСделкаНачалоВыбора(Элемент, СтандартнаяОбработка)
	стандартнаяОбработка = Ложь;
	
		текКонтрагент = ЭлементыФормы.Дерево.ТекущиеДанные.родитель.контрагент;
		//ФормаВыб=Документы.ЗаказПокупателя.ПолучитьФормуВыбора();
		//формаВыб.РежимВыбора = Истина;
		//ФормаВыб.Отбор.Контрагент.Установить(текКонтрагент);
		//ФормаВыб.Отбор.Контрагент.использование = истина;
		//ВыбЗначение=ФормаВыб.ОткрытьМодально();
		 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента,
		|	ВзаиморасчетыСКонтрагентамиОстатки.Сделка,
		|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
		|			,
		|			ДоговорКонтрагента.Владелец = &Контрагент
		|				И ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам)
		|				И Сделка <> НЕОПРЕДЕЛЕНО
		|				И ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)) КАК ВзаиморасчетыСКонтрагентамиОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка,
		|	РеализацияТоваровУслуг.СуммаДокумента,
		|	РеализацияТоваровУслуг.Сделка
		|ПОМЕСТИТЬ Документы
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Сделка В
		|			(ВЫБРАТЬ
		|				Остатки.Сделка
		|			ИЗ
		|				Остатки КАК Остатки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателя.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ЗаказПокупателя.Ссылка КАК Заказ,
		|	NULL КАК Реализация,
		|	0 КАК СуммаДолга,
		|	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
		|	ЗаказПокупателя.Контрагент,
		|	ЗаказПокупателя.ДоговорКонтрагента.ОтветственноеЛицо КАК Ответственный,
		|	ЗаказПокупателя.ДатаОплаты
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Дата >= &Дата
		|	И НЕ ЗаказПокупателя.Ссылка В
		|				(ВЫБРАТЬ
		|					Остатки.Сделка
		|				ИЗ
		|					Остатки КАК Остатки)
		|	И ЗаказПокупателя.Контрагент = &Контрагент
		|	И ЗаказПокупателя.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Остатки.ДоговорКонтрагента,
		|	Остатки.Сделка,
		|	Документы.Ссылка,
		|	Остатки.СуммаВзаиморасчетовОстаток,
		|	Документы.СуммаДокумента,
		|	Остатки.ДоговорКонтрагента.Владелец,
		|	Остатки.ДоговорКонтрагента.ОтветственноеЛицо,
		|	Остатки.Сделка.ДатаОплаты
		|ИЗ
		|	Остатки КАК Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документы КАК Документы
		|		ПО Остатки.Сделка = Документы.Сделка
		|
		|УПОРЯДОЧИТЬ ПО
		|	СуммаДолга УБЫВ";

	Запрос.УстановитьПараметр("Дата", НачалоДня(Начпериода)-14*24*60*60);
	Запрос.УстановитьПараметр("Контрагент", текКонтрагент);

	   СписокЗаказов = Запрос.Выполнить().Выгрузить();
       //ВыбЗначение=списокЗаказов.ВыбратьСтроку("Выберите сделку",);
		ФормаВыб=получитьформу("ФормаВыбора",Элемент);
		формаВыб.РежимВыбора = Истина;
		формаВыб.таблицаВыбора = СписокЗаказов;
		ВыбЗначение=ФормаВыб.ОткрытьМодально();

		Если ВыбЗначение<> Неопределено тогда
			Если  ТипЗнч(ЭлементыФормы.Дерево.ТекущиеДанные.Родитель.Документ)=Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") и Найти(ВыбЗначение.Договорконтрагента,"*")<>0 Тогда
				Предупреждение("Нельзя в платежное поручение подбирать заказ с договором со ""*""");
			ИначеЕсли  ТипЗнч(ЭлементыФормы.Дерево.ТекущиеДанные.Родитель.Документ)=Тип("ДокументСсылка.ПриходныйКассовыйОрдер") и Найти(ВыбЗначение.Договорконтрагента,"*")=0 Тогда
				Предупреждение("Нельзя в ПКО подбирать заказ с договором без ""*""");
			иначе	
			ЭлементыФормы.Дерево.ТекущиеДанные.сделка = ВыбЗначение.Заказ;
			ЭлементыФормы.Дерево.ТекущиеДанные.Контрагент = ВыбЗначение.Договорконтрагента;
			ЭлементыФормы.Дерево.ТекущиеДанные.Документ  = ВыбЗначение.Договорконтрагента.ОтветственноеЛицо;
			конецЕсли;
		конецесли;	
	ПересчитатьНераспределено();
    ИзменитьДокумент();
КонецПроцедуры

Процедура ДеревоПриПолученииДанных(Элемент, ОформленияСтрок)
	для  каждого стр из ОформленияСтрок цикл
		Если ТипЗнч( стр.ДанныеСтроки.Документ)<> Тип("СправочникСсылка.Пользователи") Тогда
			стр.цветФона =  WebЦвета.Бежевый;
			Стр.Шрифт = новый Шрифт(Стр.Шрифт ,,,Истина); // Жирный
			стр.Ячейки.СуммаНеРаспределено.ЦветТекста = webЦвета.Красный;
			стр.Ячейки.СуммаПлатежа.ТолькоПросмотр = Истина;
			стр.Ячейки.СуммаНераспределено.ТолькоПросмотр = Истина;
			стр.Ячейки.Сделка.ТолькоПросмотр = Истина;
			стр.Ячейки.Контрагент.ТолькоПросмотр = Истина;
			
		конецЕсли;	
		Если ТипЗнч( стр.ДанныеСтроки.Контрагент)<> Тип("СправочникСсылка.Контрагенты") Тогда
			стр.Ячейки.контрагент.Выравнивание =  ГоризонтальноеПоложение.Право;
			стр.Ячейки.контрагент.толькоПросмотр =  Истина;
			Если ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ЖурналыОтборПоРегиону")  Тогда
				Если ЗначениеЗаполнено(стр.ДанныеСтроки.Сделка) и 	 СЗКонтрагенты.НайтиПоЗначению(стр.ДанныеСтроки.сделка.Договорконтрагента.Владелец)= Неопределено Тогда  //+++Шарафутдиноа
					стр.Ячейки.СуммаПлатежа.ТолькоПросмотр = Истина;
					стр.Ячейки.СуммаНераспределено.ТолькоПросмотр = Истина;
					стр.Ячейки.Сделка.ТолькоПросмотр = Истина;
					стр.Ячейки.Контрагент.ТолькоПросмотр = Истина;
				конецЕсли;	
			иначе			
				Если ЗначениеЗаполнено(стр.ДанныеСтроки.Сделка) и 	 списокОтветственных.НайтиПоЗначению(стр.ДанныеСтроки.сделка.Договорконтрагента.ОтветственноеЛицо)= Неопределено Тогда  
					стр.Ячейки.СуммаПлатежа.ТолькоПросмотр = Истина;
					стр.Ячейки.СуммаНераспределено.ТолькоПросмотр = Истина;
					стр.Ячейки.Сделка.ТолькоПросмотр = Истина;
					стр.Ячейки.Контрагент.ТолькоПросмотр = Истина;
				конецЕсли;	
			КонецЕсли;
		конецЕсли;
	конецЦикла;	
КонецПроцедуры

Процедура ДеревоСуммаПлатежаПриИзменении(Элемент)
	
	текСтрока = ЭлементыФормы.Дерево.ТекущиеДанные;	
суммаПлатежки = ЭлементыФормы.Дерево.ТекущиеДанные.родитель.Суммаплатежа;

СуммаРасшифровки = 0;
строкаРодитель = ЭлементыФормы.Дерево.ТекущиеДанные.родитель;
Для каждого стр из СтрокаРодитель.строки Цикл
	СуммаРасшифровки = СуммаРасшифровки+стр.СуммаПлатежа;	
конецЦикла;
Если СуммаПлатежки> СуммаРасшифровки Тогда
	строкаСПустойСделкой = СтрокаРодитель.Строки.Найти(неопределено,"Сделка",ложь );
	если СтрокаСПустойСделкой <> Неопределено Тогда 
		СтрокаСПустойСделкой.суммаплатежа=СтрокаСПустойСделкой.суммаплатежа+(СуммаПлатежки-СуммаРасшифровки);
		СтрокаСПустойСделкой.суммаНеРаспределено=СтрокаСПустойСделкой.суммаплатежа;
	иначе	
		НоваяСтрока= СтрокаРодитель.Строки.добавить();
		НоваяСтрока.Контрагент = ТекСтрока.контрагент;
		НоваяСтрока.Документ = ТекСтрока.Документ;
		НоваяСтрока.СуммаПлатежа = СуммаПлатежки-СуммаРасшифровки;
		НоваяСтрока.СуммаНеРаспределено = СуммаПлатежки-СуммаРасшифровки;
	конецЕсли;
иначеесли  СуммаПлатежки< СуммаРасшифровки Тогда
	переплата = (СуммаРасшифровки-СуммаПлатежки);
	строкаСПустойСделкой = СтрокаРодитель.Строки.Найти(Неопределено,"Сделка",ложь );
	если СтрокаСПустойСделкой <> Неопределено Тогда 
		Если  СтрокаСПустойСделкой.суммаплатежа> переплата Тогда
			СтрокаСПустойСделкой.суммаплатежа=СтрокаСПустойСделкой.суммаплатежа-переплата;
			СтрокаСПустойСделкой.суммаНеРаспределено=СтрокаСПустойСделкой.суммаплатежа;
		иначеесли СтрокаСПустойСделкой.суммаплатежа< переплата Тогда
			Предупреждение("Сумма расшифровки платежа превышает сумму документа!");
			ТекСтрока.СуммаПлатежа = ТекСтрока.СуммаПлатежа -(переплата-СтрокаСПустойСделкой.суммаплатежа);
			СтрокаРодитель.строки.Удалить(СтрокаСПустойСделкой);
		иначе
			СтрокаРодитель.строки.Удалить(СтрокаСПустойСделкой);
		конецЕсли;
	Иначе
			Предупреждение("Сумма расшифровки платежа превышает сумму документа!");
			ТекСтрока.СуммаПлатежа = ТекСтрока.СуммаПлатежа -переплата;
	конецЕсли;
конецЕсли;	
 ПересчитатьНераспределено();
 ИзменитьДокумент();

КонецПроцедуры


Процедура ДеревоСделкаПриИзменении(Элемент)
	ПересчитатьНераспределено();
	ИзменитьДокумент();
КонецПроцедуры

Процедура ПересчитатьНераспределено()
текСтрока = ЭлементыФормы.Дерево.ТекущиеДанные;	
Если ЗначениеЗаполнено(текСтрока.Сделка) Тогда
текСтрока.СуммаНераспределено=0;
иначе
текСтрока.СуммаНераспределено=текСтрока.СуммаПлатежа;
конецЕсли;	
строкаРодитель = ЭлементыФормы.Дерево.ТекущиеДанные.родитель;
распределено= 0 ;
Для каждого стр из СтрокаРодитель.строки Цикл
Если ЗначениеЗаполнено(стр.Сделка) Тогда
распределено = распределено+ стр.Суммаплатежа;
конецЕсли;
конецЦикла;
строкаРодитель.суммаНераспределено = СтрокаРодитель.суммаплатежа-распределено;	
конецпроцедуры	

Процедура ДеревоПередУдалением(Элемент, Отказ)
	Если ТипЗнч( ЭлементыФормы.Дерево.ТекущиеДанные.Документ)<> Тип("СправочникСсылка.Пользователи") Тогда
		Предупреждение("Нельзя удалять документ из обработки!");
		отказ= истина;
	иначеЕсли ЭлементыФормы.Дерево.ТекущиеДанные.родитель.Строки.Количество()=1 Тогда
		Предупреждение("Нельзя удалять единственную строку расшифровки платежа!");
		отказ= истина;
	иначе
	редактируемыйДокумент = ЭлементыФормы.Дерево.ТекущиеДанные.родитель;	
	КонецЕсли;

КонецПроцедуры

Процедура ДеревоПослеУдаления(Элемент)
СуммаРасшифровки = 0;
Для каждого стр из редактируемыйДокумент.строки Цикл
СуммаРасшифровки = СуммаРасшифровки+стр.СуммаПлатежа;	
конецЦикла;
Если редактируемыйДокумент.СуммаПлатежа> СуммаРасшифровки Тогда
НоваяСтрока= редактируемыйДокумент.Строки.добавить();
НоваяСтрока.Контрагент = редактируемыйДокумент.Строки[0].контрагент;
НоваяСтрока.Документ =  редактируемыйДокумент.Строки[0].Документ;
НоваяСтрока.СуммаПлатежа = редактируемыйДокумент.СуммаПлатежа-СуммаРасшифровки;
НоваяСтрока.СуммаНеРаспределено = редактируемыйДокумент.СуммаПлатежа-СуммаРасшифровки;
ЭлементыФормы.Дерево.ТекущаяСтрока = НоваяСтрока;
ПересчитатьНераспределено();
ИзменитьДокумент();

конецЕсли;
КонецПроцедуры

Процедура ДеревоСделкаОчистка(Элемент, СтандартнаяОбработка)
	ИзменитьДокумент();
КонецПроцедуры

процедура ИзменитьДокумент()
Документ = ЭлементыФормы.Дерево.ТекущиеДанные.родитель.Документ;
Расшифровка = Новый ТаблицаЗначений();
Расшифровка.колонки.Добавить("Договорконтрагента");
Расшифровка.Колонки.Добавить("Сделка");
Расшифровка.Колонки.Добавить("КурсВзаиморасчетов");
Расшифровка.Колонки.Добавить("СуммаПлатежа");
Расшифровка.Колонки.Добавить("КратностьВзаиморасчетов");
Расшифровка.Колонки.Добавить("СуммаВзаиморасчетов");
Расшифровка.Колонки.Добавить("СтавкаНДС");
Расшифровка.Колонки.Добавить("СуммаНДС");
Расшифровка.Колонки.Добавить("СтатьяДвиженияДенежныхСредств");
Для каждого стр из  ЭлементыФормы.Дерево.ТекущиеДанные.родитель.строки Цикл 
 новСтр = Расшифровка.Добавить();
 НовСтр.договорКонтрагента = Стр.Контрагент;
 НовСтр.Сделка = Стр.Сделка;
 НовСтр.КурсВзаиморасчетов = 1;
 НовСтр.СуммаПлатежа = Стр.СуммаПлатежа;
 НовСтр.КратностьВзаиморасчетов = 1;
 НовСтр.СуммаВзаиморасчетов = Стр.СуммаПлатежа;
 НовСтр.СтавкаНДС =перечисления.СтавкиНДС.НДС18;
 НовСтр.СуммаНДС = Окр(Стр.СуммаПлатежа/118*18,2);
 НовСтр.СтатьяДвиженияДенежныхСредств = справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("00002");
конецЦикла;
Если Документ.СуммаДокумента = Расшифровка.Итог("СуммаПлатежа") Тогда
ДокОбъект = Документ.получитьОбъект();
ДокОбъект.РасшифровкаПлатежа.Загрузить(Расшифровка);
ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
иначе
Сообщить("Не удалось изменить документ. Сумма документа не совпадает с суммой расшифровки!");
конецесли;
	
	
конецпроцедуры	