
Функция Печать() Экспорт
	
	Если СсылкаНаОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("91735") Тогда
		Макет = ПолучитьМакет("Прайс_FREEMAN");
	ИначеЕсли СсылкаНаОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("91535") Тогда
		Макет = ПолучитьМакет("Прайс_JIANGSU");
	Иначе
		Макет = ПолучитьМакет("Прайс_Общий");
	КонецЕсли;
	
	ТабДокумент  = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Прайс_ЗаказПоставщикуСезонный";
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПоставщикуСезонныйТовары.Цена,
	               |	ЗаказПоставщикуСезонныйТовары.Номенклатура.Типоразмер.Ширина КАК Ширина,
	               |	ЗаказПоставщикуСезонныйТовары.Номенклатура.Типоразмер.Высота КАК Высота,
	               |	ЗаказПоставщикуСезонныйТовары.Номенклатура.Типоразмер.Диаметр КАК Диаметр,
	               |	ЗаказПоставщикуСезонныйТовары.Номенклатура.Типоразмер.КоличествоОтверстий КАК КоличествоОтверстий,
	               |	ЗаказПоставщикуСезонныйТовары.Номенклатура.Типоразмер.PCD КАК PCD,
	               |	ЗаказПоставщикуСезонныйТовары.Номенклатура.Типоразмер.Вылет КАК Вылет,
	               |	ЗаказПоставщикуСезонныйТовары.Номенклатура.Типоразмер.ДиаметрСтупицы КАК ДиаметрСтупицы,
	               |	ЗначенияСвойствОбъектов.Значение КАК Цвет,
	               |	ЗаказПоставщикуСезонныйТовары.Номенклатура.Модель.Наименование КАК Модель
	               |ИЗ
	               |	Документ.ЗаказПоставщикуСезонный.Товары КАК ЗаказПоставщикуСезонныйТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |		ПО ЗаказПоставщикуСезонныйТовары.Номенклатура = ЗначенияСвойствОбъектов.Объект
	               |			И (ЗначенияСвойствОбъектов.Свойство = &Свойство)
	               |ГДЕ
	               |	ЗаказПоставщикуСезонныйТовары.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90166"));
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(Результат);
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьПодвал);	
		
	// Зададим параметры макета
	ТабДокумент.ПолеСверху              = 10;
	ТабДокумент.ПолеСлева               = 10;
	ТабДокумент.ПолеСнизу               = 10;
	ТабДокумент.ПолеСправа              = 10;
	ТабДокумент.РазмерКолонтитулаСверху = 0;
	ТабДокумент.РазмерКолонтитулаСнизу  = 0;
	ТабДокумент.АвтоМасштаб             = Истина;
	ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Портрет;
	
	Возврат ТабДокумент;
	
КонецФункции // Печать
