
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Если УзлыРегистрации.Количество() = 0 Тогда
	
		Предупреждение("Необходимо выбрать узлы обмена!", 5);
		Возврат;
	
	КонецЕсли; 
	
	Если СоставГрупп.Количество() > 0 Тогда
	
		Группы = СоставГрупп.ВыгрузитьКолонку("Номенклатура");
		
	Иначе 
		
		Группы = Новый Массив;
		Группы.Добавить(Справочники.Номенклатура.ПустаяСсылка());
	
	КонецЕсли; 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = Ложь
	|	И Номенклатура.Ссылка В ИЕРАРХИИ(&МассивГрупп)";
	
	Запрос.УстановитьПараметр("МассивГрупп", Группы);
	
	ВыборкаНоменклатуры = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаНоменклатуры.Следующий() Цикл
	
		
		Объект = ВыборкаНоменклатуры.Ссылка;
		
		Попытка
			
			Для каждого СтрокаУзлов Из УзлыРегистрации Цикл
				
				Если СтрокаУзлов.УзелПланаОбмена.Ссылка <> ПланыОбмена.РаспределеннаяИнформационнаяБаза.ЭтотУзел() Тогда
					
					ПланыОбмена.ЗарегистрироватьИзменения(СтрокаУзлов.УзелПланаОбмена.Ссылка, ВыборкаНоменклатуры.Ссылка); 
					Сообщить("Зарегистрировали объект: " + Строка(ВыборкаНоменклатуры.Ссылка) + " для узла " + Строка(СтрокаУзлов.УзелПланаОбмена.Ссылка), СтатусСообщения.Информация);
					
				КонецЕсли; 
			
			КонецЦикла; 
			
		
		Исключение
			
			Сообщить("Не удалось зарегистрировать объект: " + Строка(ВыборкаНоменклатуры.Ссылка) + "!", СтатусСообщения.Важное);
			
		КонецПопытки; 
		
	
	КонецЦикла; 
	
	
КонецПроцедуры
