Функция ВыбратьКонтрагентаДиадок(IDКонтрагентаДиадок, организация = Неопределено, Status="" ) Экспорт
	СписокКонтрагентов.Очистить();
	тз = ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ПолучитьТаблицуЯщиковДиадокОрганизации();
	Для каждого стрИсх Из тз Цикл
		Если организация=Неопределено или (Организация = стрИсх.Объект) Тогда
			box = Модуль_РаботаССерверомДиадок.ПолучитьЯщикДиадокДляОрганизации(стрИсх.Объект);
			//МенеджерКонтрагентов = box.GetCounteragentListManager();
			//мас = МенеджерКонтрагентов.GetCounteragents();
			CounteragentList = box.GetCounteragentListByStatus(Status);
			
			ВГраница= CounteragentList.count-1;
			Для ИндексЦикла= 0 ПО ВГраница Цикл 
				
				Counteragent = CounteragentList.GetItem(ИндексЦикла);
				НоваяСтрока = СписокКонтрагентов.Добавить();
				
				НоваяСтрока.Наименование= Counteragent.Name;
				НоваяСтрока.ID=  Counteragent.Id;
				НоваяСтрока.ИНН= Counteragent.Inn;
				НоваяСтрока.КПП= Counteragent.Kpp;
				
				Если ПустаяСтрока(НоваяСтрока.КПП) Тогда
					НоваяСтрока.ИННКПП = НоваяСтрока.ИНН;
				Иначе
					НоваяСтрока.ИННКПП = НоваяСтрока.ИНН + " / " + НоваяСтрока.КПП;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	
	СписокКонтрагентов.Свернуть("Наименование, ID, ИНН, КПП");
	СписокКонтрагентов.Сортировать("Наименование, ИНН, КПП");
	
	стр = СписокКонтрагентов.Найти(IDКонтрагентаДиадок, "ID");
	Если стр <> Неопределено Тогда
		ЭлементыФормы.СписокКонтрагентов.ТекущаяСтрока = стр;
	КонецЕсли;
	
	Возврат ОткрытьМодально();
	
КонецФункции

Процедура КнопкаВыполнитьНажатие(Кнопка)
	ЗавершитьВыбор();
КонецПроцедуры

Процедура СписокОрганизацийПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

Процедура СписокОрганизацийПередНачаломИзменения(Элемент, Отказ)
	ЗавершитьВыбор();
КонецПроцедуры

Процедура ЗавершитьВыбор()
	текДанные = ЭлементыФормы.СписокКонтрагентов.ТекущиеДанные;
	Если текДанные = Неопределено Тогда
		Предупреждение("Выберите контрагента.",, НаименованиеСистемы);
		Возврат;
	КонецЕсли;
	
	Закрыть(Новый Структура("ID, Наименование", текДанные.ID, текДанные.Наименование));
КонецПроцедуры

Процедура ПриОткрытии()
	КартинкаЗаголовка= ЭДО_БиблиотекаКартинок().КартинкаЗаголовка;
КонецПроцедуры
