
Процедура КнопкаСформироватьНажатие(Кнопка)
	ТабДок = Сформировать();
	ЭлементыФормы.ПолеТабличногоДокумента1.Очистить();
	ЭлементыФормы.ПолеТабличногоДокумента1.Вывести(ТабДок);
КонецПроцедуры

Процедура ДействияФормыОтменить(Кнопка)
	Если Найти(ПользователиИнформационнойБазы.ТекущийПользователь().Имя,"Пелевин") > 0 Тогда
		пам = ЭлементыФормы.ПолеТабличногоДокумента1.ВыделенныеОбласти[0].Расшифровка;
		Попытка
			Об = Пам.ПолучитьОбъект();
			об.статус = Перечисления.СтатусыЗаявокНаТранспорт.Отменен;
			об.Выполнил = глТекущийПользователь;
			Об.Записать();
		исключение
			
		КонецПопытки;
		
		ТабДок = Сформировать();
		ЭлементыФормы.ПолеТабличногоДокумента1.Очистить();
		ЭлементыФормы.ПолеТабличногоДокумента1.Вывести(ТабДок);
	КонецЕсли;
КонецПроцедуры
