
Процедура НачПериодаПриИзменении(Элемент)
	
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = НачПериода;
	
КонецПроцедуры

Процедура КонПериодаПриИзменении(Элемент)
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = КонецДня(КонПериода);
	
КонецПроцедуры

Процедура КнопкаВыбораПериодаНажатие(Элемент)
	
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = НачПериода;
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = КонПериода;
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ЭлементыФормы.КоманднаяПанель3.Кнопки.Настройка.Пометка = Истина;

	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СвойствоВажность");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90184");
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СвойствоАВСКлассЯр");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90262");
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СвойствоАВСКлассСПб");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90264");
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СвойствоАВСКлассРнД");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90265");
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СвойствоАВСКлассЕкб");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90266");
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СвойствоКатегорияПоАксам");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90235");
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ТипКИ");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = Перечисления.ТипыКонтактнойИнформации.Адрес;
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ВидКИ");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	
	Группировки.Очистить();
	
	НоваяГруппировка = Группировки.Добавить();
	НоваяГруппировка.Поле = "ОсновнойМенеджер";
	НоваяГруппировка.Представление = "Основной менеджер";
	НоваяГруппировка.ТипГруппировки = "Элементы";
	НоваяГруппировка.Использование = Истина;
	
	НоваяГруппировка = Группировки.Добавить();
	НоваяГруппировка.Поле = "Важность";
	НоваяГруппировка.Представление = "Важность";
	НоваяГруппировка.ТипГруппировки = "Элементы";                       
	
	НоваяГруппировка = Группировки.Добавить();
	НоваяГруппировка.Поле = "Регион";
	НоваяГруппировка.Представление = "Регион";
	НоваяГруппировка.ТипГруппировки = "Элементы";
	
	НоваяГруппировка = Группировки.Добавить();
	НоваяГруппировка.Поле = "ОсновноеНаправлениеПродаж";
	НоваяГруппировка.Представление = "Основное направление продаж";
	НоваяГруппировка.ТипГруппировки = "Элементы";
	
	НоваяГруппировка = Группировки.Добавить();
	НоваяГруппировка.Поле = "НаправлениеПродаж";
	НоваяГруппировка.Представление = "Направление продаж";
	НоваяГруппировка.ТипГруппировки = "Элементы";
	
	НоваяГруппировка = Группировки.Добавить();
	НоваяГруппировка.Поле = "АВСКлассЯрославль";
	НоваяГруппировка.Представление = "АВС-класс Яр";
	НоваяГруппировка.ТипГруппировки = "Элементы";
	
	НоваяГруппировка = Группировки.Добавить();
	НоваяГруппировка.Поле = "АВСКлассСПб";
	НоваяГруппировка.Представление = "АВС-класс СПб";
	НоваяГруппировка.ТипГруппировки = "Элементы";
	
	НоваяГруппировка = Группировки.Добавить();
	НоваяГруппировка.Поле = "АВСКлассРнД";
	НоваяГруппировка.Представление = "АВС-класс РнД";
	НоваяГруппировка.ТипГруппировки = "Элементы";
	
	НоваяГруппировка = Группировки.Добавить();
	НоваяГруппировка.Поле = "АВСКлассЕкб";
	НоваяГруппировка.Представление = "АВС-класс Екб";
	НоваяГруппировка.ТипГруппировки = "Элементы";
	
	НоваяГруппировка = Группировки.Добавить();
	НоваяГруппировка.Поле = "КатегорияПоАксам";
	НоваяГруппировка.Представление = "Категория по аксессуарам";
	НоваяГруппировка.ТипГруппировки = "Элементы";
	
КонецПроцедуры

Процедура ГруппировкаПриИзмененииФлажка(Элемент, Колонка)
	
	Если Элемент.ТекущаяСтрока.Использование Тогда
		Пока Группировки[Элемент.ТекущаяСтрока.НомерСтроки-2].Использование <> Истина Цикл
			Группировки.Сдвинуть(Элемент.ТекущаяСтрока, -1);
			Если Элемент.ТекущаяСтрока.НомерСтроки = 1 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Пока Группировки[Элемент.ТекущаяСтрока.НомерСтроки].Использование Цикл
			Группировки.Сдвинуть(Элемент.ТекущаяСтрока, 1);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//Процедура КоманднаяПанель3Настройка(Кнопка)
//	
//	Кнопка.Пометка = Не Кнопка.Пометка;
//		
//	Если Кнопка.Пометка тогда
//		ЭлементыФормы.Группировка.Свертка = РежимСверткиЭлементаУправления.Нет;
//		ЭлементыФормы.ВыбранныеПоля.Свертка = РежимСверткиЭлементаУправления.Нет;
//		ЭлементыФормы.Отборы.Свертка = РежимСверткиЭлементаУправления.Нет;
//		ЭлементыФормы.КоманднаяПанель1.Свертка = РежимСверткиЭлементаУправления.Нет;
//		ЭлементыФормы.КоманднаяПанель2.Свертка = РежимСверткиЭлементаУправления.Нет;
//		ЭлементыФормы.КоманднаяПанельГруппировка.Свертка = РежимСверткиЭлементаУправления.Нет;
//		ЭлементыФормы.Разделитель1.Свертка        = РежимСверткиЭлементаУправления.Нет;
//		ШиринаПанели = ЭлементыФормы.Группировка.Ширина;
//		Если ШиринаПанели / ЭтаФорма.Ширина > 0.5 тогда
//			ШиринаПанели = 306;
//			ЭлементыФормы.Группировка.Ширина = ШиринаПанели;
//			ЭлементыФормы.ВыбранныеПоля.Ширина = ШиринаПанели;
//			ЭлементыФормы.Отборы.Ширина = ШиринаПанели;
//			ЭлементыФормы.КоманднаяПанель1.Ширина = ШиринаПанели;
//			ЭлементыФормы.КоманднаяПанель2.Ширина = ШиринаПанели;
//			ЭлементыФормы.КоманднаяПанельГруппировка.Ширина = ШиринаПанели;
//			ЭлементыФормы.Группировка.Лево = ЭтаФорма.Ширина - ШиринаПанели -26;
//			ЭлементыФормы.ВыбранныеПоля.Лево = ЭтаФорма.Ширина - ШиринаПанели -26;
//			ЭлементыФормы.Отборы.Лево = ЭтаФорма.Ширина - ШиринаПанели -26;
//			ЭлементыФормы.КоманднаяПанель1.Лево = ЭтаФорма.Ширина - ШиринаПанели -26;
//			ЭлементыФормы.КоманднаяПанель2.Лево = ЭтаФорма.Ширина - ШиринаПанели -26;
//			ЭлементыФормы.КоманднаяПанельГруппировка.Лево = ЭтаФорма.Ширина - ШиринаПанели -26;
//		КонецЕсли;
//		ЭлементыФормы.Разделитель1.УстановитьПривязку(ГраницаЭлементаУправления.Право, , ГраницаЭлементаУправления.Право);
//		ЭлементыФормы.Группировка.УстановитьПривязку(ГраницаЭлементаУправления.Лево, ЭлементыФормы.Разделитель1, ГраницаЭлементаУправления.Право);
//		ЭлементыФормы.ВыбранныеПоля.УстановитьПривязку(ГраницаЭлементаУправления.Лево, ЭлементыФормы.Разделитель1, ГраницаЭлементаУправления.Право);
//		ЭлементыФормы.Отборы.УстановитьПривязку(ГраницаЭлементаУправления.Лево, ЭлементыФормы.Разделитель1, ГраницаЭлементаУправления.Право);
//		ЭлементыФормы.КоманднаяПанель1.УстановитьПривязку(ГраницаЭлементаУправления.Лево, ЭлементыФормы.Разделитель1, ГраницаЭлементаУправления.Право);
//		ЭлементыФормы.КоманднаяПанель2.УстановитьПривязку(ГраницаЭлементаУправления.Лево, ЭлементыФормы.Разделитель1, ГраницаЭлементаУправления.Право);
//		ЭлементыФормы.КоманднаяПанельГруппировка.УстановитьПривязку(ГраницаЭлементаУправления.Лево, ЭлементыФормы.Разделитель1, ГраницаЭлементаУправления.Право);
//		
//		ЭлементыФормы.Разделитель1.Лево = ЭтаФорма.Ширина - ШиринаПанели;// - 6;
//		ЭлементыФормы.Результат.Ширина = ЭтаФорма.Ширина - 6 - ШиринаПанели;
//	Иначе
//		ЭлементыФормы.Группировка.УстановитьПривязку(ГраницаЭлементаУправления.Лево);
//		ЭлементыФормы.Группировка.Свертка = РежимСверткиЭлементаУправления.Право;
//		ЭлементыФормы.ВыбранныеПоля.УстановитьПривязку(ГраницаЭлементаУправления.Лево);
//		ЭлементыФормы.ВыбранныеПоля.Свертка = РежимСверткиЭлементаУправления.Право;
//		ЭлементыФормы.Отборы.УстановитьПривязку(ГраницаЭлементаУправления.Лево);
//		ЭлементыФормы.Отборы.Свертка = РежимСверткиЭлементаУправления.Право;
//		ЭлементыФормы.КоманднаяПанель1.УстановитьПривязку(ГраницаЭлементаУправления.Лево);
//		ЭлементыФормы.КоманднаяПанель1.Свертка = РежимСверткиЭлементаУправления.Право;
//		ЭлементыФормы.КоманднаяПанель2.УстановитьПривязку(ГраницаЭлементаУправления.Лево);
//		ЭлементыФормы.КоманднаяПанель2.Свертка = РежимСверткиЭлементаУправления.Право;
//		ЭлементыФормы.КоманднаяПанельГруппировка.УстановитьПривязку(ГраницаЭлементаУправления.Лево);
//		ЭлементыФормы.КоманднаяПанельГруппировка.Свертка = РежимСверткиЭлементаУправления.Право;
//		ЭлементыФормы.Разделитель1.УстановитьПривязку(ГраницаЭлементаУправления.Право, , ГраницаЭлементаУправления.Лево);
//		ЭлементыФормы.Разделитель1.Свертка        = РежимСверткиЭлементаУправления.Право;
//	КонецЕсли;
//	
//КонецПроцедуры

