Процедура ДатаНачалаПриИзменении(Элемент)
	
	УстановитьДатуНачала();
	
КонецПроцедуры

Процедура ДатаКонцаПриИзменении(Элемент)
	
	УстановитьДатуКонца();
		
КонецПроцедуры

Процедура УстановитьДатуКонца()
	
	НП.УстановитьПериод(НачалоДня(НачалоПериода), КонецДня(КонецПериода));
	
	ПараметрДатаНачала = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ПараметрДатаКонца = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	ПараметрДатаНачала.Значение = НачалоДня(НачалоПериода);
	ПараметрДатаКонца.Значение = КонецДня(КонецПериода);
	
КонецПроцедуры

Процедура УстановитьДатуНачала()
	
	НП.УстановитьПериод(НачалоДня(НачалоПериода), КонецДня(КонецПериода));
	
	ПараметрДатаНачала = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ПараметрДатаКонца = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	ПараметрДатаНачала.Значение = НачалоДня(НачалоПериода);
	ПараметрДатаКонца.Значение = КонецДня(КонецПериода);	
	
КонецПроцедуры

Процедура КнопкаНастройкаПериодаНажатие(Элемент)
	
	Если НП.Редактировать() Тогда
		
		НачалоПериода = НП.ПолучитьДатуНачала();
		КонецПериода = НП.ПолучитьДатуОкончания();
		
		ПараметрДатаНачала = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
		ПараметрДатаКонца = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
		ПараметрДатаНачала.Значение = НачалоДня(НачалоПериода);
		ПараметрДатаКонца.Значение = КонецДня(КонецПериода);
		
	КонецЕсли;
	
КонецПроцедуры // КнопкаНастройкаПериодаНажатие()

Процедура ПриОткрытии()
	ПараметрВалюта = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВалютаДокумента"));
	ПараметрВалюта.Значение = Справочники.Валюты.НайтиПоКоду("840");
КонецПроцедуры
