
Процедура Печать() Экспорт
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.РеестрПечатныхФормДляПередачиВОфис.ПолучитьМакет("Печать");
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	область.Параметры.Заполнить(ЭтотОбъект);
	Область.параметры.Дата = Формат(Дата,"ДЛФ=DD");
	ТабДок.Вывести(Область);
	// Шапка
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(ЭтотОбъект);
	Шапка.параметры.ДатаОтправки = Формат(ДатаОтправки,"ДЛФ=DD");
	ТабДок.Вывести(Шапка);
	// Реестр
	Область = Макет.ПолучитьОбласть("РеестрШапка");
	ТабДок.Вывести(Область);
	ОбластьРеестр = Макет.ПолучитьОбласть("Реестр");
	Для Каждого ТекСтрокаРеестр Из Реестр Цикл
		ОбластьРеестр.Параметры.Заполнить(ТекСтрокаРеестр);
		КонтрагентНаименование = "";
		Если НЕ ТипЗнч(ТекСтрокаРеестр.СсылкаДок) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			КонтрагентНаименование = ТекСтрокаРеестр.СсылкаДок.Контрагент;
		Иначе
           Если НЕ ТекСтрокаРеестр.СсылкаДок.Пустая() Тогда
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ПеремещениеТоваров.ВнутреннийЗаказ.ДокументОснование.Контрагент.Наименование КАК КонтрагентНаименование
				|ИЗ
				|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
				|ГДЕ
				|	ПеремещениеТоваров.Ссылка = &ДокПеремещение";
				
				Запрос.УстановитьПараметр("ДокПеремещение", ТекСтрокаРеестр.СсылкаДок);
				Результат = Запрос.Выполнить();
				Если НЕ Результат.Пустой() Тогда
					Выборка = Результат.Выбрать();
					Выборка.Следующий();
					КонтрагентНаименование = Выборка.КонтрагентНаименование;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		ОбластьРеестр.Параметры.Контрагент = КонтрагентНаименование;
		ТабДок.Вывести(ОбластьРеестр);
	КонецЦикла;

	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}_КОНСТРУКТОР_ПЕЧАТИ_ЭЛЕМЕНТ
КонецПроцедуры


Процедура ПечатьПоменеджерам() Экспорт
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.РеестрПечатныхФормДляПередачиВОфис.ПолучитьМакет("Поменеджерам");
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	область.Параметры.Заполнить(ЭтотОбъект);
	Область.параметры.Дата = Формат(Дата,"ДЛФ=DD");
	ТабДок.Вывести(Область);
	// Шапка
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(ЭтотОбъект);
	Шапка.параметры.ДатаОтправки = Формат(ДатаОтправки,"ДЛФ=DD");
	ТабДок.Вывести(Шапка);
	// Реестр
	Область = Макет.ПолучитьОбласть("РеестрШапка");
	ТабДок.Вывести(Область);
	
	Табл = Реестр.Выгрузить();
	Табл.Колонки.Добавить("Менеджер");
	
	Для каждого стр из Табл Цикл
		попытка
		стр.менеджер = стр.СсылкаДок.ДоговорКонтрагента.ОтветственноеЛицо;
	    исключение
		конецпопытки;
	конецЦикла;
	
	Табл.Сортировать("Менеджер");
	текущийМенеджер = "";
	ОбластьМенеджер = Макет.ПолучитьОбласть("Менеджер");
	ОбластьРеестр = Макет.ПолучитьОбласть("Реестр");
	Для Каждого ТекСтрокаРеестр Из Табл Цикл
		Если  ТекСтрокаРеестр.Менеджер <> Текущийменеджер Тогда
			Областьменеджер.параметры.менеджер = ТекСтрокаРеестр.Менеджер;
			Областьменеджер.параметры.количество = Табл.НайтиСтроки(новый структура("менеджер",ТекСтрокаРеестр.Менеджер)).Количество();
			ТабДок.Вывести(ОбластьМенеджер);
       конецесли;
		текущийМенеджер = ТекСтрокаРеестр.Менеджер;	
		ОбластьРеестр.Параметры.Заполнить(ТекСтрокаРеестр);
		ОбластьРеестр.Параметры.Контрагент = ТекСтрокаРеестр.СсылкаДок.Контрагент;
		ТабДок.Вывести(ОбластьРеестр);
	КонецЦикла;

	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
КонецПроцедуры




Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	    Если не ЗначениеЗаполнено(ДатаОтправки)и не ЗначениеЗаполнено(Должность) и (не значениеЗаполнено(Водитель) и не значениеЗаполнено(Перевозчик) )тогда
		Сообщить("Заполните данные по отправке документов!");
		Отказ =Истина;
		конецЕсли;	
	    Передан = Истина;
		Записать();
	//проставляем отметку в пути
	Для Каждого Строка Из Реестр Цикл
		Если НЕ Строка.Статус = Справочники.СостояниеДокументов.Дубль Тогда
			НаборЗаписей = РегистрыСведений.ПечатныеФормыВНаличии.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Строка.ссылкаДок);
			НаборЗаписей.отбор.видПечатнойФормы.Установить(Строка.ВидПечатнойформы);
			НаборЗаписей.Прочитать(); 
			НаборЗаписей[0].ВПути = Истина;
			НаборЗаписей[0].ДатаПеремещения = НачалоДня(ТекущаяДата());
	        НаборЗаписей[0].Должность = Должность;
			НаборЗаписей.Записать();		
		КонецЕсли;
    КонецЦикла;
	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		//УстановитьНомерДокумента(ЭтотОбъект);
		Если Этоновый() Тогда
			Ответственный =  глТекущийПользователь;
		конецЕсли;
			Если не Отказ Тогда   
		Если сокрЛП(номер)="" Тогда
			СтрокаПрефикс = "ТК";
			Если подразделение.ПрефиксИБ<>"" Тогда
				СтрокаПрефикс = подразделение.ПрефиксИБ;
			КонецЕсли;	
			ЭтотОбъект.УстановитьНовыйНомер(СтрокаПрефикс);	
		КонецЕсли;	
	КонецЕсли;	

КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
			Префикс = "ТК";
			Если подразделение.ПрефиксИБ<>"" Тогда
				Префикс = подразделение.ПрефиксИБ;
			КонецЕсли;	
КонецПроцедуры
