
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
  
  Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Производитель"));
    Если Параметр <> Неопределено Тогда
        Параметр.Значение = Производитель;
        Параметр.Использование = Истина;
	КонецЕсли;

	
	
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Скидка"));
	Если Параметр <> Неопределено Тогда
		если Скидка<0 тогда //16.03.2018
        	Параметр.Значение = Скидка;   //отрицательная!
		иначе 
        	Параметр.Значение = -Скидка;  //написали как положительную
		КонецЕсли;
        Параметр.Использование = Истина;
	КонецЕсли;

	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидСравнения"));
    Если Параметр <> Неопределено Тогда
        Параметр.Значение = ВидСравнения;
        Параметр.Использование = Истина;
	КонецЕсли;

КонецПроцедуры
