Процедура Кнопка1Нажатие(Элемент)
	
	тпНоменклатура.Очистить();
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок = "Прочитать табличный документ из файла";
	ДиалогВыбораФайла.Фильтр    = "Лист Excel (*.xls)|*.xls";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		//		ТабличныйДокумент = ЭлементыФормы.ТабличныйДокумент;
		ФайлНаДиске = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
		Если нРег(ФайлНаДиске.Расширение) = ".xls" Тогда
			мПрочитатьТабличныйДокументИзExcel(ДиалогВыбораФайла.ПолноеИмяФайла,1);
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры


Функция мПрочитатьТабличныйДокументИзExcel( ИмяФайла, НомерЛистаExcel = 1) Экспорт
	найдено = 0;
	НачатьТранзакцию();
	
	xlLastCell = 11;
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		Сообщить("Файл не существует!");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист = Excel.Sheets(1);
	Исключение
		Сообщить("Ошибка. Возможно неверно указан номер листа книги Excel.");
		Возврат ложь;
		
	КонецПопытки;	
	
	ActiveCell = Excel.ActiveCell.SpecialCells(xlLastCell);
	RowCount = ActiveCell.Row;
	Если ЭлементыФормы.ПерваяСтрока.Значение > RowCount тогда
		ЭлементыФормы.ПерваяСтрока.Значение = RowCount;
	КонецЕсли;	
	
	
	ColumnCount = ActiveCell.Column;
	
	Сообщить("Найдено "+строка(RowCount)+" строк и "+строка(ColumnCount)+" столбцов");
		
	Если ЭлементыФормы.перваяСтрока.Значение = 0 тогда
		ЭлементыФормы.перваяСтрока.Значение = 2; 
	КонецЕсли;
	
	сообщить("Начало ----------"+строка(ТекущаяДата())+"---------" );
	
	Для Row = перваяСтрока По RowCount Цикл	
		нстр = тпНоменклатура.Добавить();
		нстр.НомерСтроки = Row;
		ОбработкаПрерыванияПользователя();
		// определяем номенклатуру
		
		
		//СтрокаA= ДопНазвание; //Строка(ExcelЛист.Cells(Row,1).Value);
		Состояние("Идет загрузка из Excel: "+строка(Row)+" / "+строка(RowCount)+" ("+строка(окр(Row*100/RowCount,1))+"%)");
		
		Производитель = СокрЛП(строка(ExcelЛист.Cells(Row,3).Value));
		Производитель = СокрЛП(Производитель);
		нстр.Производитель = Производитель;
		
		
		
		Если нрег(Производитель) = "нкшз" тогда
			Производитель = "";
		КонецЕсли;
		Если нрег(Производитель) = "BF GOODRICH" тогда
			Производитель = "BFGOODRICH";
		КонецЕсли;
		
		Если нрег(Производитель) = "Amtel" тогда
			Производитель = "";
		КонецЕсли;

		
		Модель = СокрЛП(строка(ExcelЛист.Cells(Row,2).Value));
		Модель = СокрЛП(Модель);
		
		нстр.Модель = Модель;
		
		Если Найти(Модель,"RUN FLAT")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"RUN FLAT",""));
		КонецЕсли;

		
		Если Модель = "GEOLANDER G051" тогда
			Модель = "Geolandar H/T-S G051";
		КонецЕсли;
		
		Если Найти(Модель,"BluEarth AE")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"BluEarth AE","BluEarth AE-"));
		КонецЕсли;
		
		Если Найти(Модель,"ContiPremium Contact")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"ContiPremium Contact","ContiPremiumContact"));
		КонецЕсли;
		
		Если Найти(Модель,"NORDMAN SZ XL")>0 тогда
			Модель = "NORDMAN SZ";
		КонецЕсли;
		
		Если Найти(Модель,"AVATYRE")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"AVATYRE",""));
		КонецЕсли;
		
		Если Найти(Модель,"GISLAVED")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"GISLAVED",""));
		КонецЕсли;
		Если Найти(Модель,"GIslaved")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"GIslaved",""));
		КонецЕсли;
		
		Если Найти(Модель,"Gislaved")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"Gislaved",""));
		КонецЕсли;
		
		
		Если Найти(Модель,"TURANZA")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"TURANZA",""));
			Модель = Модель+" TURANZA";
		КонецЕсли;	
		
		Если Модель="BLIZZAK Revo-GZ" тогда
			Модель="BLIZZAK Revo-GZ "; //у нас она с пробелом
		КонецЕсли;	
		                   
		Если Найти(Модель,"WINTER I'Pike ")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"WINTER I'Pike","WINTER I*Pike"))+" XL";
		КонецЕсли;
		
		Если Найти(Модель,"Winter I'Pike ")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"Winter I'Pike","WINTER I*Pike"))+" XL";
		КонецЕсли;
		
		Если Найти(Модель,"WINTER I'PIKE ")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"WINTER I'PIKE","WINTER I*Pike"))+" XL";
		КонецЕсли;

		
		Если Найти(Модель,"W-429")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"W-429","W429"));
		КонецЕсли;
		
		Если Найти(Модель,"Hectorra3")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"Hectorra3",""));
			Модель = Модель+" Hectorra 3";
		КонецЕсли;
		
		Если Найти(Модель,"CONQUERRA 2")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"CONQUERRA 2",""));
			Модель = Модель+" CONQUERRA 2";
		КонецЕсли;
		
		Если Найти(Модель,"NITTO")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"NITTO",""));
		КонецЕсли;

		Если Найти(Модель,"SAILUN")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"SAILUN",""));
		КонецЕсли;

		Если Найти(Модель,"TOYO")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"TOYO",""));
		КонецЕсли;
		
		Если Найти(Модель,"TRIANGLE")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"TRIANGLE",""));
		КонецЕсли;

		Если Найти(Модель,"VIATTI")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"VIATTI",""));
		КонецЕсли;

		Если Найти(Модель,"KAMA EURO")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"KAMA EURO","Кама EURO"));
		КонецЕсли;
		
		Если Найти(Модель,"FORWARD")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"FORWARD",""));
		КонецЕсли;

		Если Найти(Модель,"NORD FROST 100")>0 тогда  
        	Модель = СокрЛП(СтрЗаменить(Модель,"NORD FROST 100","NORD FROST 100 CD")+ " TL");
		КонецЕсли;
		
		Если Найти(Модель,"KL-78")>0 тогда  
        	Модель = СокрЛП(СтрЗаменить(Модель,"KL-78","Road Venture AT KL78")+ " TL");
		КонецЕсли;

		Если Найти(Модель,"MAXXIS")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"MAXXIS",""));
			Модель = СокрЛП(СтрЗаменить(Модель,"BRAVO",""));
		КонецЕсли;

		Если Найти(Модель,"CONTYRE")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"CONTYRE",""));
		КонецЕсли;

		Если Найти(Модель,"KW-31")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"KW-31","I'Zen KW31"));
		КонецЕсли;
		
		Если Найти(Модель,"KC-11")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"KC-11","Power Grip KC11"));
		КонецЕсли;

		Если Найти(Модель,"KW-23")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"KW-23","I'Zen KW23"));
		КонецЕсли;
		
		Если Найти(Модель,"KW-22")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"KW-22","I'Zen KW22"));
		КонецЕсли;
		
		Если Найти(Модель,"KC-15")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"KC-15","I'Zen RV KC15"));
		КонецЕсли;

		Если Найти(Модель,"KC-16")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"KC-16","I'Zen RV Stud KC16"));
		КонецЕсли;

		Если Найти(Модель,"KW-31")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"KW-31","I'Zen KW31"));
		КонецЕсли;
		
		Если Найти(Модель,"KU-31")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"KU-31","Ecsta SPT KU31"));
		КонецЕсли;
		
		Если Найти(Модель,"KC-53")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"KC-53","PorTran KC53"));
		КонецЕсли;

		Если Найти(Модель,"KL-71")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"KL-71","Road Venture MT KL71"));
		КонецЕсли;

        Если Найти(Модель,"KH-31")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"KH-31","KH31"));
		КонецЕсли;
		
		Если Найти(Модель,"HS-51")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"HS-51","KUMHO Ecsta HS51"));
		КонецЕсли;
		
		Если Найти(Модель,"KH-27")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель,"KH-27","Ecowing ES01 KH27"));
		КонецЕсли;
		
		XL ="";
		Если Найти(Модель," XL")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель," XL",""));
			XL =" XL";
		КонецЕсли;
		
		TL ="";
		Если Найти(Модель," TL")>0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель," TL",""));
			TL =" TL";
		КонецЕсли;

		FR ="";
		Если Найти(Модель," FR")>0 и Найти(Модель," FROST")=0 тогда
			Модель = СокрЛП(СтрЗаменить(Модель," FR",""));
			FR =" FR";
		КонецЕсли;
		
		ЕстьSUV = ложь;
		МодельSUV = "";
		suv = "";
		Если Найти(Модель,"SUV")>0 тогда
			ЕстьSUV = истина;
			suv = " SUV";
			МодельSUV = СокрЛП(СтрЗаменить(Модель,"SUV",""));
		КонецЕсли;
		
		Типоразмер = СокрЛП(строка(ExcelЛист.Cells(Row,1).Value));
		Типоразмер = СокрЛП(Типоразмер);
		
		нстр.Типоразмер = Типоразмер;
		
		Индекс = СокрЛП(строка(ExcelЛист.Cells(Row,7).Value));
		Индекс = СокрЛП(Индекс);
		нстр.Индексы = Индекс;
		
		Индекс = СтрЗаменить(Индекс," ","");
		
		
		Шип = СокрЛП(строка(ExcelЛист.Cells(Row,10).Value));
		Шип = СокрЛП(Шип);
		
		нстр.Шип = Шип;
		
		//Шип = "";
		Если Шип = "шип" тогда
			Шип = " шип.";
			Шип2 = " шип";
		Иначе
			Шип = "";
		КонецЕсли;
		
		Наименование  =	СокрЛП(Производитель+" "+Модель+" "+Типоразмер+" "+Индекс+TL+XL+FR+Шип);
		Наименование = стрЗаменить(Наименование,"  "," ");
		
		НаименованиеШип2  =	СокрЛП(Производитель+" "+Модель+" "+Типоразмер+" "+Индекс+TL+XL+FR+Шип2);
		НаименованиеШип2 = стрЗаменить(НаименованиеШип2,"  "," ");

		
		нстр.СтрокаДляПоиска = Наименование;
		//СтрокаНаименование = "Коврики в салон "+ Наименование+ " резиновые производитель СРТК";
		
		Код = Строка(ExcelЛист.Cells(Row,22).Value);
		Код = СтрЗаменить(Код," ","");
		СпрНом = справочники.Номенклатура.ПустаяСсылка();
		Если СокрЛП(Код)<>"" тогда
			СпрНом = Справочники.Номенклатура.НайтиПоКоду(Код);
		КонецЕсли;
		Если не ЗначениеЗаполнено(СпрНом) тогда
			СпрНом = Справочники.Номенклатура.НайтиПоНаименованию(Наименование);
			нстр.Номенклатура = СпрНом;
		КонецЕсли;
		
		Если не ЗначениеЗаполнено(СпрНом) тогда
			СпрНом = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеШип2);
			нстр.Номенклатура = СпрНом;
		КонецЕсли;

		
		Если ЗначениеЗаполнено(СпрНом) тогда
			//ExcelЛист.Cells(Row,22).Value = СпрНом.Код;
			//ExcelЛист.Cells(Row,23).Value = "";
            нстр.Номенклатура = СпрНом;
			Сообщить(СпрНом.Код);
			найдено = найдено+1;
		ИначеЕсли  ЕстьSUV тогда
			Наименование  =	СокрЛП(Производитель+" "+МодельSUV+" "+Типоразмер+" "+Индекс+SUV+TL+XL+FR+шип);
			Наименование = стрЗаменить(Наименование,"  "," ");
			СпрНом = Справочники.Номенклатура.НайтиПоНаименованию(Наименование);
			Если ЗначениеЗаполнено(СпрНом) тогда
				//ExcelЛист.Cells(Row,22).Value = СпрНом.Код;
				//ExcelЛист.Cells(Row,23).Value = "";
				Сообщить(СпрНом.Код);
				нстр.Номенклатура = СпрНом;

				найдено = найдено+1;
			КонецЕсли;
		Иначе
			//ExcelЛист.Cells(Row,22).Value = "Не найдено";
			//ExcelЛист.Cells(Row,23).Value = Наименование;
		КонецЕсли;
				
	КонецЦикла;
		
	//ОтменитьТранзакцию();
	//Excel.WorkBooks.Close();
	//Excel = 0;
	сообщить("Конец--------"+строка(ТекущаяДата())+"-------" );	
	Сообщить("Найдено "+найдено +" из "+ RowCount);
	Возврат истина;
	
КонецФункции // ()

Процедура ОсновныеДействияФормыОсновныеДействияФормыВыполнить(Кнопка)
	ExcelЛист = Excel.Sheets(1);
	Для каждого стр из тпНоменклатура цикл
		Если ЗначениеЗаполнено(стр.Номенклатура) тогда
			ExcelЛист.Cells(стр.НомерСтроки,22).Value = Строка(стр.Номенклатура.Код);
		КонецЕсли;
	КонецЦикла;
	Excel.WorkBooks.Close();
	Excel = 0
КонецПроцедуры

Процедура тпНоменклатураНоменклатураНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	нФормаВыбора = Справочники.Номенклатура.ПолучитьФормуВыбора(, Элемент);
	нФормаВыбора.Отбор.Типоразмер.ВидСравнения = ВидСравнения.Равно;
	нФормаВыбора.Отбор.Типоразмер.Значение = Справочники.Типоразмеры.НайтиПоНаименованию(ЭлементыФормы.тпНоменклатура.ТекущиеДанные.Типоразмер);
	нФормаВыбора.Отбор.Типоразмер.Использование = Истина;
	
	нФормаВыбора.Отбор.Производитель.ВидСравнения = ВидСравнения.Равно;
	нФормаВыбора.Отбор.Производитель.Значение = Справочники.Производители.НайтиПоНаименованию(ЭлементыФормы.тпНоменклатура.ТекущиеДанные.Производитель);
	нФормаВыбора.Отбор.Производитель.Использование = Истина;
	
	Если СокрЛП(ЭлементыФормы.тпНоменклатура.ТекущиеДанные.Индексы)<>"" тогда
				Индекс = СтрЗаменить(ЭлементыФормы.тпНоменклатура.ТекущиеДанные.Индексы," ","");

		нФормаВыбора.Отбор.НАИМЕНОВАНИЕ.ВидСравнения = ВидСравнения.Содержит;
		нФормаВыбора.Отбор.НАИМЕНОВАНИЕ.Значение = Индекс;
		нФормаВыбора.Отбор.НАИМЕНОВАНИЕ.Использование = Истина;
	КонецЕсли;

	нФормаВыбора.Открыть();
КонецПроцедуры

Процедура ПриЗакрытии()
		Excel.WorkBooks.Close();
	Excel = 0;

КонецПроцедуры
