
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
	Товары.Очистить();
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("НачДата",НачалоДня(КонДата));
	
	Если не Склад.Пустая() Тогда
		СтрокаСклад=	 " 	И ТоварыНаСкладахОстатки.Склад В ИЕРАРХИИ(&Склад)";
		Иначе
		СтрокаСклад="";
	КонецЕсли;

	
	
	

	 Запрос.Текст= "ВЫБРАТЬ
	 |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	 |	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КоличествоОстаток
	 |ИЗ
	 |	РегистрНакопления.ТоварыНаСкладах.Остатки(&НачДата) КАК ТоварыНаСкладахОстатки
	 |ГДЕ
	 |	ИСТИНА "+
	  СтрокаСклад+
	               " СГРУППИРОВАТЬ ПО
	 |	ТоварыНаСкладахОстатки.Номенклатура,
	 |	ТоварыНаСкладахОстатки.КоличествоОстаток
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	ТоварыНаСкладахОстатки.Номенклатура.Наименование"   ;
	 
	 Рез=Запрос.Выполнить().Выбрать();
	 
	 Пока Рез.Следующий() Цикл
		  Стр=Товары.Добавить();
		  Стр.Номенклатура=Рез.Номенклатура;
		  Стр.КонОстаток=Рез.КоличествоОстаток;
	 КонецЦикла;
	 
		 
	 
КонецПроцедуры

Процедура ОсновныеДействияФормыПартии(Кнопка)
	// Вставить содержимое обработчика.
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("Приход",ВидДвиженияНакопления.Приход);
	
	Если не Склад.Пустая() Тогда
		СтрокаСклад="	И ПартииТоваровНаСкладах.Склад в Иерархии (&Склад)";
		Иначе
		СтрокаСклад="";
	КонецЕсли;
	
	 Запрос.Текст=
	
				   
		   
		   
		    "ВЫБРАТЬ
		    |	ПартииТоваровНаСкладах.Регистратор,
		    |	ПартииТоваровНаСкладах.ВидДвижения,
		    |	ПартииТоваровНаСкладах.Номенклатура,
		    |	ПартииТоваровНаСкладах.НомерСтроки,
		    |	ПартииТоваровНаСкладах.Количество
		    |ИЗ
		    |	РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
		    |ГДЕ
		    |	ПартииТоваровНаСкладах.Номенклатура = &Номенклатура"+
		    СтрокаСклад+
		    "	И ПартииТоваровНаСкладах.Количество > 0
			| И (ПартииТоваровНаСкладах.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг или ПартииТоваровНаСкладах.Регистратор ССЫЛКА Документ.ОприходованиеТоваров)
			| И ПартииТоваровНаСкладах.ВидДвижения=&Приход";
		   
			   Док=Документы.ПоступлениеТоваровУслуг;
			   
			   
			   
			   
		  
			ном=0;
			НачатьТранзакцию();
			Для каждого стр из Товары Цикл
				ном=ном+1;
				Сообщить(ном);
				Если  стр.Проверено Тогда Продолжить; КонецЕсли;
			//	Если ном>500  Тогда Прервать; КонецЕсли;
				
				Запрос.УстановитьПараметр("Номенклатура",стр.Номенклатура);
				Выб=Запрос.Выполнить().Выбрать();	
				
				Пока Выб.Следующий() Цикл
					РегистраторОбъект=Выб.Регистратор.ПолучитьОбъект();
					
					ПараметрыОтбора = Новый Структура;
                    ПараметрыОтбора.Вставить("Номенклатура", Выб.Номенклатура);

					//Сообщить(СокрЛП(Выб.Номенклатура)+" "+ Строка(Выб.Регистратор)+ Строка(Выб.НомерСтроки));
					НайденыеСтроки=Выб.Регистратор.Товары.НайтиСтроки(ПараметрыОтбора);
					
					Для каждого Нстр из НайденыеСтроки Цикл
						Если ТипЗнч(Выб.Регистратор)=Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
							Если Нстр.Склад<>Неопределено Тогда
								Если НСтр.Склад.Принадлежитэлементу(Склад) или НСтр.Склад=Склад Тогда Иначе Продолжить;	КонецЕсли;	
							КонецЕсли;	
						КонецЕсли;		
						стрДок=РегистраторОбъект.Товары.Получить(Нстр.НомерСтроки-1);
						стрДок.ЦЕна=стр.Себестоимость;
						РассчитатьСуммуТабЧасти(стрДок,РегистраторОбъект);
						Если ТипЗнч(Выб.Регистратор)=Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
						РассчитатьСуммуНДСТабЧасти(стрДок, РегистраторОбъект);	
					    КонецЕсли;	

					КонецЦикла;	
										
									
				РегистраторОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
				КонецЦикла;
				стр.Проверено=Истина;
			КонецЦикла;	
            ЗафиксироватьТранзакцию();
			
			
	  КонецПроцедуры

	  Процедура ОсновныеДействияФормыЗагрузитьВФайл(Кнопка)
		  // Вставить содержимое обработчика.
		//д= Новый ДиалогВыбораФайла;
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
   ДиалогВыбораФайла.Заголовок        = "Выгрузить";
  ДиалогВыбораФайла.Расширение    = "txt";
  
  текст= Новый ТекстовыйДокумент;
	Если ДиалогВыбораФайла.Выбрать() Тогда
   	 ИмяФайла = ДиалогВыбораФайла.ПолноеИмяФайла;
	 //Файл        = Новый Файл(ИмяФайла);
	 Для каждого стр из Товары Цикл
		 Если стр.Себестоимость>0 Тогда
		 текст.ДобавитьСтроку(Строка(стр.Номенклатура.Код)+";"+Строка(стр.Себестоимость));
		 КонецЕсли;
	 КонецЦикла; 
	 текст.Записать(ИмяФайла);
    КонецЕсли;
		  
	  КонецПроцедуры

	  Процедура ОсновныеДействияФормыВосстановитьИзФайла(Кнопка)
		  // Вставить содержимое обработчика.
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
  ДиалогВыбораФайла.Заголовок        = "Загрузить";
  ДиалогВыбораФайла.Расширение    = "txt";
  текст= Новый ТекстовыйДокумент;
  Если ДиалогВыбораФайла.Выбрать() Тогда
	  ИмяФайла = ДиалогВыбораФайла.ПолноеИмяФайла;
	  текст= Новый ТекстовыйДокумент;
	  текст.Прочитать(ИмяФайла);
	  
	  Для ном=1 по Текст.КоличествоСтрок() Цикл
		  ПСтрока= Текст.ПолучитьСтроку(ном);
		  поз=Найти (ПСтрока,";");
		  Код=Лев(ПСтрока,поз-1);
		  Себестоимость=Сред(ПСтрока,поз+1,СтрДлина(ПСтрока)-поз);
		  НомСсылка=Справочники.Номенклатура.НайтиПоКоду(Код);
		  НайденнаяСтрока=Товары.Найти(НомСсылка,"Номенклатура");	
		  Если НайденнаяСтрока<>Неопределено Тогда
			  НайденнаяСтрока.Себестоимость=Себестоимость;
		  КонецЕсли;
		  //	Сообщить(Код);	
		  //	Сообщить(Себестоимость);	
	  КонецЦикла;	
	  
КонецЕсли;	  
  
  
		  
	  КонецПроцедуры

	  Процедура ОсновныеДействияФормыДействие(Кнопка)
		  // Вставить содержимое обработчика.
		  Для каждого стр из Товары Цикл
			  стр.Себестоимость=20;
		  КонецЦикла;	  
	  КонецПроцедуры

	  
	  Функция ПолучитьСебестоимостьПоСкладу()
		  ОбщаяСеб=0;
		  Для каждого стр из Товары Цикл
			  ОбщаяСеб=ОбщаяСеб+стр.КонОстаток*стр.Себестоимость;
		  КонецЦикла;
		  Возврат ОбщаяСеб;
			  
		  
			  
		  
	  КонецФункции	  

	  Процедура ОбновлениеОтображения()
		  ЭлементыФормы.Себестоимость.Заголовок=ПолучитьСебестоимостьПоСкладу();
	  КонецПроцедуры
