
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипЦен"));
		ПараметрСКД.Использование = истина ;
		ПараметрСКД.Значение  = ТипЦен;

	
	Если НомГруппы.Количество()>0 тогда
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокГрупп"));
		ПараметрСКД.Использование = истина ;
		ПараметрСКД.Значение  = НомГруппы.ВыгрузитьКолонку("Группа");
	конецЕсли;
	
    	КомпоновщикНастроек.Настройки.Структура[0].Строки[0].Структура[0].Отбор.Элементы.Очистить();
		Если Отбирать тогда
		ГруппаОтбора = КомпоновщикНастроек.Настройки.Структура[0].Строки[0].Структура[0].Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	    ГруппаОтбора.Использование  = Истина;
        ГруппаОтбора.ТипГруппы  = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;


			
        НовыйЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Процент"); 
		новыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных["Больше"];;
		НовыйЭлементОтбора.ПравоеЗначение = Процент;	
        НовыйЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Процент"); 
		новыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных["Меньше"];;
		НовыйЭлементОтбора.ПравоеЗначение = -Процент;	
        конецЕсли;




КонецПроцедуры
