Перем ТекстЛитые, ТекстШтамп;
Перем тзКолонки;
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Запрос=Новый Запрос;
	
	Запрос.УстановитьПараметр("КонПериода",КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("НачПериода",НачалоДня(ДобавитьМесяц(ТекущаяДата(),-МесяцевАнализа)));
	Запрос.УстановитьПараметр("Производитель",Производитель);
	Запрос.УстановитьПараметр("КолВоМесяцев",МесяцевАнализа);
	Запрос.УстановитьПараметр("МесяцевДляЗаказа",МесяцевДляЗаказа);
	Запрос.УстановитьПараметр("МесяцевПродаж",МесяцевДляПродажи);
    Запрос.УстановитьПараметр("ПорогСреднегоОборота",ПорогОборачиваемости);
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());

	Если Производитель=Справочники.Производители.НайтиПоКоду("597") тогда //trebl
		Запрос.Текст=ТекстШтамп;	
	Иначе
		Запрос.Текст=ТекстЛитые;	
	КонецЕсли;
	ТабличноеПоле1=Запрос.Выполнить().Выгрузить();
    ЭлементыФормы.ТабличноеПоле1.СоздатьКолонки();
	ПараметрыОтбора=Новый Структура("Имя");

	Для Каждого Колонка из  ЭлементыФормы.ТабличноеПоле1.Колонки цикл
		ПараметрыОтбора.Имя=Колонка.Имя;
		строки=тзКолонки.НайтиСтроки(ПараметрыОтбора);
		Если Строки.Количество()>0 Тогда
			ЗаполнитьЗначенияСвойств(Колонка,Строки[0]);
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

Процедура ПриОткрытии()
	МесяцевАнализа=6;
	ПорогОборачиваемости=80;
	МесяцевДляПродажи=2;
	МесяцевДляЗаказа=3;
КонецПроцедуры

Процедура ОсновныеДействияФормыСформироватьЗаказ(Кнопка)
	Если ТабличноеПоле1.Итог("Заказать")<>0 тогда
		ДокЗаказСезонный=Документы.ЗаказПоставщикуСезонный.СоздатьДокумент();
		ДокЗаказСезонный.Дата=ТекущаяДата();
		Товары=ДокЗаказСезонный.Товары;
		Для каждого стр из ТабличноеПоле1 Цикл
			Если Стр.Заказать>0 тогда
				стрТовары=Товары.Добавить();
				СтрТовары.Номенклатура=стр.Номенклатура;
				СтрТовары.ЕдиницаИзмерения=стр.Номенклатура.ЕдиницаХраненияОстатков;
				СтрТовары.Коэффициент=стр.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент;
				СтрТовары.Количество=стр.Заказать;
				СтрТовары.Вес=стр.Заказать*стр.Номенклатура.ЕдиницаХраненияОстатков.Вес;
			КонецЕсли;	
		КонецЦикла;	
		ДокЗаказСезонный.ПолучитьФорму().Открыть();
	Иначе
		Предупреждение("Номенклатуры для заказа не выбрано",60);
	КонецЕсли;	

КонецПроцедуры

ТекстЛитые="ВЫБРАТЬ
           |	ПродажиОбороты.Номенклатура,
           |	ПродажиОбороты.КоличествоОборот КАК Оборот,
           |	ПродажиОбороты.КоличествоОборот / &КолВоМесяцев КАК СреднийОборотЗаМесяц
           |ПОМЕСТИТЬ втОборот
           |ИЗ
           |	РегистрНакопления.Продажи.Обороты(
           |			&НачПериода,
           |			&КонПериода,
           |			,
           |			Номенклатура.Производитель = &Производитель
           |				И Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)) КАК ПродажиОбороты
           |;
           |
           |////////////////////////////////////////////////////////////////////////////////
           |ВЫБРАТЬ
           |	ТоварыНаСкладахОстатки.Номенклатура,
           |	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК Количество
           |ПОМЕСТИТЬ втОстатки
           |ИЗ
           |	РегистрНакопления.ТоварыНаСкладах.Остатки(
           |			,
           |			Номенклатура.Производитель = &Производитель
           |				И НЕ Склад.ЗапретитьИспользование
           |				И НЕ Склад.Транзитный
           |				И Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)) КАК ТоварыНаСкладахОстатки
           |ГДЕ
           |	ТоварыНаСкладахОстатки.КоличествоОстаток > 0
           |
           |СГРУППИРОВАТЬ ПО
           |	ТоварыНаСкладахОстатки.Номенклатура
           |;
           |
           |////////////////////////////////////////////////////////////////////////////////
           |ВЫБРАТЬ
           |	ЗаказыПокупателейОстатки.Номенклатура,
           |	ЗаказыПокупателейОстатки.КоличествоОстаток КАК Количество
           |ПОМЕСТИТЬ втЗаказыПокупателей
           |ИЗ
           |	РегистрНакопления.ЗаказыПокупателей.Остатки(
           |			,
           |			Номенклатура.Производитель = &Производитель
           |				И НЕ ЗаказПокупателя.Транзит
           |				И ЗаказПокупателя.Проверен
           |				И Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)) КАК ЗаказыПокупателейОстатки
           |;
           |
           |////////////////////////////////////////////////////////////////////////////////
           |ВЫБРАТЬ
           |	ЗаказыПоставщикамОстатки.Номенклатура,
           |	СУММА(ЗаказыПоставщикамОстатки.КоличествоОстаток) КАК Количество
           |ПОМЕСТИТЬ втВПути
           |ИЗ
           |	РегистрНакопления.ЗаказыПоставщикам.Остатки(
           |			,
           |			Номенклатура.Производитель = &Производитель
           |				И НЕ ЗаказПоставщику.Транзит
           |				И Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)) КАК ЗаказыПоставщикамОстатки
           |
           |СГРУППИРОВАТЬ ПО
           |	ЗаказыПоставщикамОстатки.Номенклатура
           |;
           |
           |////////////////////////////////////////////////////////////////////////////////
           |ВЫБРАТЬ
           |	ЗаказыПоставщикамСезонныеОстатки.Номенклатура,
           |	ЗаказыПоставщикамСезонныеОстатки.КоличествоОстаток КАК Количество
           |ПОМЕСТИТЬ втВПроизводстве
           |ИЗ
           |	РегистрНакопления.ЗаказыПоставщикамСезонные.Остатки(
           |			,
           |			Номенклатура.Производитель = &Производитель
           |				И НЕ ЗаказПоставщикуСезонный.Транзит
           |				И Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)
           |				И ЗаказПоставщикуСезонный.ДатаДействияПо >= &ТекДата) КАК ЗаказыПоставщикамСезонныеОстатки
           |ГДЕ
           |	ЗаказыПоставщикамСезонныеОстатки.КоличествоОстаток > 0
           |;
           |
           |////////////////////////////////////////////////////////////////////////////////
           |ВЫБРАТЬ
           |	втОборот.Номенклатура,
           |	ВЫРАЗИТЬ(ВЫБОР
           |			КОГДА втОборот.СреднийОборотЗаМесяц > &ПорогСреднегоОборота
           |					И втОборот.СреднийОборотЗаМесяц > (ЕСТЬNULL(втОстатки.Количество, 0) - ЕСТЬNULL(втЗаказыПокупателей.Количество, 0) + ЕСТЬNULL(втВПути.Количество, 0) + ЕСТЬNULL(втВПроизводстве.Количество, 0)) / &МесяцевПродаж
           |				ТОГДА ВЫБОР
           |						КОГДА втОборот.СреднийОборотЗаМесяц * &МесяцевДляЗаказа < 80
           |							ТОГДА 80
           |						ИНАЧЕ втОборот.СреднийОборотЗаМесяц * &МесяцевДляЗаказа
           |					КОНЕЦ
           |			КОГДА втОборот.СреднийОборотЗаМесяц <= &ПорогСреднегоОборота
           |					И втОборот.СреднийОборотЗаМесяц > (ЕСТЬNULL(втОстатки.Количество, 0) - ЕСТЬNULL(втЗаказыПокупателей.Количество, 0) + ЕСТЬNULL(втВПути.Количество, 0) + ЕСТЬNULL(втВПроизводстве.Количество, 0)) / &МесяцевПродаж
           |					И ЕСТЬNULL(втОстатки.Количество, 0) - ЕСТЬNULL(втЗаказыПокупателей.Количество, 0) < 60
           |				ТОГДА ВЫБОР
           |						КОГДА втОборот.СреднийОборотЗаМесяц * &МесяцевДляЗаказа < 80
           |							ТОГДА 80
           |						ИНАЧЕ втОборот.СреднийОборотЗаМесяц * &МесяцевДляЗаказа
           |					КОНЕЦ
           |			ИНАЧЕ 0
           |		КОНЕЦ КАК ЧИСЛО(4, 0)) КАК Заказать,
           |	ЕСТЬNULL(втОстатки.Количество, 0) КАК Остаток,
           |	ЕСТЬNULL(втОстатки.Количество, 0) - ЕСТЬNULL(втЗаказыПокупателей.Количество, 0) КАК СвободныйОстаток,
           |	ЕСТЬNULL(втВПути.Количество, 0) КАК ВПути,
           |	ЕСТЬNULL(втВПроизводстве.Количество, 0) КАК ВПроизводстве,
           |	втОборот.Оборот,
           |	ВЫРАЗИТЬ(втОборот.СреднийОборотЗаМесяц КАК ЧИСЛО(4, 0)) КАК СреднийОборотЗаМесяц
           |ИЗ
           |	втОборот КАК втОборот
           |		ЛЕВОЕ СОЕДИНЕНИЕ втОстатки КАК втОстатки
           |		ПО втОборот.Номенклатура = втОстатки.Номенклатура
           |		ЛЕВОЕ СОЕДИНЕНИЕ втВПроизводстве КАК втВПроизводстве
           |		ПО втОборот.Номенклатура = втВПроизводстве.Номенклатура
           |		ЛЕВОЕ СОЕДИНЕНИЕ втВПути КАК втВПути
           |		ПО втОборот.Номенклатура = втВПути.Номенклатура
           |		ЛЕВОЕ СОЕДИНЕНИЕ втЗаказыПокупателей КАК втЗаказыПокупателей
           |		ПО втОборот.Номенклатура = втЗаказыПокупателей.Номенклатура";
		   
ТекстШтамп="ВЫБРАТЬ
           |	ПродажиОбороты.Номенклатура,
           |	ПродажиОбороты.КоличествоОборот КАК Оборот,
           |	ПродажиОбороты.КоличествоОборот / &КолВоМесяцев КАК СреднийОборотЗаМесяц
           |ПОМЕСТИТЬ втОборот
           |ИЗ
           |	РегистрНакопления.Продажи.Обороты(
           |			&НачПериода,
           |			&КонПериода,
           |			,
           |			Номенклатура.Производитель = &Производитель
           |				И Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)) КАК ПродажиОбороты
           |;
           |
           |////////////////////////////////////////////////////////////////////////////////
           |ВЫБРАТЬ
           |	ТоварыНаСкладахОстатки.Номенклатура,
           |	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК Количество
           |ПОМЕСТИТЬ втОстатки
           |ИЗ
           |	РегистрНакопления.ТоварыНаСкладах.Остатки(
           |			,
           |			Номенклатура.Производитель = &Производитель
           |				И НЕ Склад.ЗапретитьИспользование
           |				И Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)) КАК ТоварыНаСкладахОстатки
           |ГДЕ
           |	ТоварыНаСкладахОстатки.КоличествоОстаток > 0
           |
           |СГРУППИРОВАТЬ ПО
           |	ТоварыНаСкладахОстатки.Номенклатура
           |;
           |
           |////////////////////////////////////////////////////////////////////////////////
           |ВЫБРАТЬ
           |	ЗаказыПокупателейОстатки.Номенклатура,
           |	ЗаказыПокупателейОстатки.КоличествоОстаток КАК Количество
           |ПОМЕСТИТЬ втЗаказыПокупателей
           |ИЗ
           |	РегистрНакопления.ЗаказыПокупателей.Остатки(
           |			,
           |			Номенклатура.Производитель = &Производитель
           |				И НЕ ЗаказПокупателя.Транзит
           |				И ЗаказПокупателя.Проверен
           |				И Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)) КАК ЗаказыПокупателейОстатки
           |;
           |
           |////////////////////////////////////////////////////////////////////////////////
           |ВЫБРАТЬ
           |	ЗаказыПоставщикамОстатки.Номенклатура,
           |	СУММА(ЗаказыПоставщикамОстатки.КоличествоОстаток) КАК Количество
           |ПОМЕСТИТЬ втВПути
           |ИЗ
           |	РегистрНакопления.ЗаказыПоставщикам.Остатки(
           |			,
           |			Номенклатура.Производитель = &Производитель
           |				И Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)) КАК ЗаказыПоставщикамОстатки
           |
           |СГРУППИРОВАТЬ ПО
           |	ЗаказыПоставщикамОстатки.Номенклатура
           |;
           |
           |////////////////////////////////////////////////////////////////////////////////
           |ВЫБРАТЬ
           |	ЗаказыПоставщикамСезонныеОстатки.Номенклатура,
           |	ЗаказыПоставщикамСезонныеОстатки.КоличествоОстаток КАК Количество
           |ПОМЕСТИТЬ втВПроизводстве
           |ИЗ
           |	РегистрНакопления.ЗаказыПоставщикамСезонные.Остатки(
           |			,
           |			Номенклатура.Производитель = &Производитель
           |				И Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)
           |				И ЗаказПоставщикуСезонный.ДатаДействияПо >= &ТекДата) КАК ЗаказыПоставщикамСезонныеОстатки
           |ГДЕ
           |	ЗаказыПоставщикамСезонныеОстатки.КоличествоОстаток > 0
           |;
           |
           |////////////////////////////////////////////////////////////////////////////////
           |ВЫБРАТЬ
           |	втОборот.Номенклатура,
           |	ВЫРАЗИТЬ(ВЫБОР
           |			КОГДА втОборот.СреднийОборотЗаМесяц > &ПорогСреднегоОборота
           |					И втОборот.СреднийОборотЗаМесяц > (ЕСТЬNULL(втОстатки.Количество, 0) - ЕСТЬNULL(втЗаказыПокупателей.Количество, 0) + ЕСТЬNULL(втВПути.Количество, 0) + ЕСТЬNULL(втВПроизводстве.Количество, 0)) / &МесяцевПродаж
           |				ТОГДА ВЫБОР
           |						КОГДА втОборот.СреднийОборотЗаМесяц * &МесяцевДляЗаказа < 80
           |							ТОГДА 80
           |						ИНАЧЕ втОборот.СреднийОборотЗаМесяц * &МесяцевДляЗаказа
           |					КОНЕЦ
           |			КОГДА втОборот.СреднийОборотЗаМесяц <= &ПорогСреднегоОборота
           |					И втОборот.СреднийОборотЗаМесяц > (ЕСТЬNULL(втОстатки.Количество, 0) - ЕСТЬNULL(втЗаказыПокупателей.Количество, 0) + ЕСТЬNULL(втВПути.Количество, 0) + ЕСТЬNULL(втВПроизводстве.Количество, 0)) / &МесяцевПродаж
           |					И ЕСТЬNULL(втОстатки.Количество, 0) - ЕСТЬNULL(втЗаказыПокупателей.Количество, 0) < 60
           |				ТОГДА ВЫБОР
           |						КОГДА втОборот.СреднийОборотЗаМесяц * &МесяцевДляЗаказа < 80
           |							ТОГДА 80
           |						ИНАЧЕ втОборот.СреднийОборотЗаМесяц * &МесяцевДляЗаказа
           |					КОНЕЦ
           |			ИНАЧЕ 0
           |		КОНЕЦ КАК ЧИСЛО(4, 0)) КАК Заказать,
           |	ЕСТЬNULL(втОстатки.Количество, 0) КАК Остаток,
           |	ЕСТЬNULL(втОстатки.Количество, 0) - ЕСТЬNULL(втЗаказыПокупателей.Количество, 0) КАК СвободныйОстаток,
           |	ЕСТЬNULL(втВПути.Количество, 0) КАК ВПути,
           |	ЕСТЬNULL(втВПроизводстве.Количество, 0) КАК ВПроизводстве,
           |	втОборот.Оборот,
           |	ВЫРАЗИТЬ(втОборот.СреднийОборотЗаМесяц КАК ЧИСЛО(5, 0)) КАК СреднийОборотЗаМесяц
           |ИЗ
           |	втОборот КАК втОборот
           |		ЛЕВОЕ СОЕДИНЕНИЕ втОстатки КАК втОстатки
           |		ПО втОборот.Номенклатура = втОстатки.Номенклатура
           |		ЛЕВОЕ СОЕДИНЕНИЕ втВПроизводстве КАК втВПроизводстве
           |		ПО втОборот.Номенклатура = втВПроизводстве.Номенклатура
           |		ЛЕВОЕ СОЕДИНЕНИЕ втВПути КАК втВПути
           |		ПО втОборот.Номенклатура = втВПути.Номенклатура
           |		ЛЕВОЕ СОЕДИНЕНИЕ втЗаказыПокупателей КАК втЗаказыПокупателей
           |		ПО втОборот.Номенклатура = втЗаказыПокупателей.Номенклатура";	
		   
тзКолонки=новый таблицаЗначений;
тзКолонки.Колонки.Добавить("Имя");
тзКолонки.Колонки.Добавить("ТекстШапки");
тзКолонки.Колонки.Добавить("Ширина");
тзКолонки.Колонки.Добавить("Видимость");
тзКолонки.Колонки.Добавить("ТолькоПросмотр");
нСтр=тзКолонки.Добавить();
нСтр.Имя="Код";
нСтр.ТекстШапки="Код";
нСтр.Ширина=10;
нСтр.Видимость=Истина;
нСтр.ТолькоПросмотр=Истина;

нСтр=тзКолонки.Добавить();
нСтр.Имя="Номенклатура";
нСтр.ТекстШапки="Номенклатура";
нСтр.Ширина=50;
нСтр.Видимость=Истина;
нСтр.ТолькоПросмотр=Истина;

нСтр=тзКолонки.Добавить();
нСтр.Имя="Оборот";
нСтр.ТекстШапки="Оборот";
нСтр.Ширина=10;
нСтр.Видимость=Истина;
нСтр.ТолькоПросмотр=Истина;

нСтр=тзКолонки.Добавить();
нСтр.Имя="СвободныйОстаток";
нСтр.ТекстШапки="Свободный остаток";
нСтр.Ширина=10;
нСтр.Видимость=Истина;
нСтр.ТолькоПросмотр=Истина;

нСтр=тзКолонки.Добавить();
нСтр.Имя="Остаток";
нСтр.ТекстШапки="Остаток";
нСтр.Ширина=10;
нСтр.Видимость=Истина;
нСтр.ТолькоПросмотр=Истина;

нСтр=тзКолонки.Добавить();
нСтр.Имя="ВПути";
нСтр.ТекстШапки="В пути";
нСтр.Ширина=10;
нСтр.Видимость=Истина;
нСтр.ТолькоПросмотр=Истина;

нСтр=тзКолонки.Добавить();
нСтр.Имя="ВПроизводстве";
нСтр.ТекстШапки="В производстве";
нСтр.Ширина=10;
нСтр.Видимость=Истина;
нСтр.ТолькоПросмотр=Истина;

нСтр=тзКолонки.Добавить();
нСтр.Имя="Заказать";
нСтр.ТекстШапки="Заказать";
нСтр.Ширина=10;
нСтр.Видимость=Истина;
нСтр.ТолькоПросмотр=Ложь;

нСтр=тзКолонки.Добавить();
нСтр.Имя="СреднийОборотЗаМесяц";
нСтр.ТекстШапки="Средний оборот";
нСтр.Ширина=10;
нСтр.Видимость=Истина;
нСтр.ТолькоПросмотр=Истина;   