
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("СписокЗаказов", Заказы.ВыгрузитьКолонку("ЗаказПоставщикуКрышки"));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказыПоставщикамКрышкиОстатки.Номенклатура,
	               |	ЗаказыПоставщикамКрышкиОстатки.КоличествоОстаток,
	               |	ЗаказыПоставщикамКрышкиОстатки.ЗаказПоставщикуКрышки
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПоставщикамКрышки.Остатки(, ЗаказПоставщикуКрышки В (&СписокЗаказов)) КАК ЗаказыПоставщикамКрышкиОстатки
	               |АВТОУПОРЯДОЧИВАНИЕ";
				   
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого СтрЗаказ ИЗ Заказы Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ЗаказПоставщикуКрышки", СтрЗаказ.ЗаказПоставщикуКрышки);
		СтрокиТЗ = Результат.НайтиСтроки(Отбор);
		Для Каждого СтрТЗ ИЗ СтрокиТЗ Цикл
			Движение = Движения.ЗаказыПоставщикамКрышки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата; 
			Движение.ЗаказПоставщикуКрышки = СтрЗаказ.ЗаказПоставщикуКрышки;
			Движение.Номенклатура = СтрТЗ.Номенклатура;
			Движение.Количество   = СтрТЗ.КоличествоОстаток * (-1); //сторно
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщикуКрышки") Тогда
		нстр = Заказы.Добавить();
		нстр.ЗаказПоставщикуКрышки = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
