// функции для совместимости кода 
&НаКлиенте
Функция сбисПолучитьФорму(ИмяФормы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Попытка
			ЭтотОбъект="";
		Исключение
		КонецПопытки;
		Возврат ПолучитьФорму("ВнешняяОбработка.СБИС.Форма."+ИмяФормы);
	КонецЕсли;
	Возврат ЭтотОбъект.ПолучитьФорму(ИмяФормы);
КонецФункции
//------------------------------------------------------

&НаКлиенте
Функция ПолучитьДанныеИзДокумента1С(Кэш,Контекст) Экспорт
// Функция формирует структуру выгружаемого файла и добавляет его в состав пакета
	Попытка	
				
		Док  = Новый Структура;
				
		Если Контекст.ФайлДанные.Свойство("мСторона") Тогда
			Для Каждого Параметр Из Контекст.ФайлДанные.мСторона Цикл
				Роль = Кэш.ОбщиеФункции.РассчитатьЗначение("Роль",Параметр.Значение,Кэш);
				Сторона = Кэш.ОбщиеФункции.ПолучитьСторону(Кэш,Параметр.Значение);  
				Если Роль = "Отправитель" Тогда
					Сертификат = Кэш.ОбщиеФункции.РассчитатьЗначение("Сертификат",Параметр.Значение,Кэш);
				КонецЕсли;
				Если Сторона<>Неопределено Тогда
					Если Сторона.Свойство("Подразделение") и Сторона.Подразделение.Свойство("Идентификатор") и Сторона.Свойство("СвЮЛ") Тогда
						Сторона.СвЮЛ.Вставить("КодФилиала", Сторона.Подразделение.Идентификатор);
					КонецЕсли;
					Док.Вставить(Роль,Сторона);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// Если грузополучатель является филиалом получателя, то получаетелем пакета ставим грузополучателя
		Если Док.Свойство("Грузополучатель") Тогда
			Если Док.Грузополучатель.Свойство("СвЮЛ") и Док.Получатель.Свойство("СвЮЛ") и Док.Грузополучатель.СвЮЛ.ИНН = Док.Получатель.СвЮЛ.ИНН и Док.Грузополучатель.СвЮЛ.КПП <> Док.Получатель.СвЮЛ.КПП Тогда
				//Попытка
				//	оГрузополучатель = Кэш.Интеграция.ПолучитьИнформациюОКонтрагенте(Кэш, Док.Грузополучатель);
				//	оПолучатель = Кэш.Интеграция.ПолучитьИнформациюОКонтрагенте(Кэш, Док.Получатель);
				//	Если оПолучатель.Идентификатор = оГрузополучатель.Идентификатор Тогда
						Док.Получатель = Док.Грузополучатель;
				//	КонецЕсли;
				//Исключение
				//КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		НеЗапускатьВДокументооборот = Кэш.ОбщиеФункции.РассчитатьЗначение("НеЗапускатьВДокументооборот", Контекст.ФайлДанные,Кэш);		
		Тип = Кэш.ОбщиеФункции.РассчитатьЗначение("Тип", Контекст.ФайлДанные,Кэш);
		ОтветственныйСтруктура = Кэш.ОбщиеФункции.ПолучитьСтруктуруОтветственного(Кэш,Контекст);
		ПодразделениеСтруктура = Кэш.ОбщиеФункции.ПолучитьСтруктуруПодразделения(Кэш,Контекст);
		РегламентСтруктура = Кэш.ОбщиеФункции.ПолучитьСтруктуруРегламента(Кэш,Контекст);
		ОснованияМассив = Кэш.ОбщиеФункции.ПолучитьМассивОснований(Кэш,Контекст);
		Примечание = Кэш.ОбщиеФункции.РассчитатьЗначение("Примечание", Контекст.ФайлДанные,Кэш);
		Дата = Кэш.ОбщиеФункции.РассчитатьЗначение("Документ_Дата", Контекст.ФайлДанные,Кэш);
		Номер = Кэш.ОбщиеФункции.РассчитатьЗначение("Документ_Номер", Контекст.ФайлДанные,Кэш);
					
		фрм = сбисПолучитьФорму("ФормаГлавноеОкно").сбисНайтиФормуФункции("сбисПослеФормированияДокумента","Файл_"+Контекст.ФайлДанные.Файл_Формат+"_"+СтрЗаменить(СтрЗаменить(Контекст.ФайлДанные.Файл_ВерсияФормата, ".", "_"), " ", ""),"Файл_Шаблон", Кэш);
		Если фрм<>Ложь Тогда
			фрм.сбисПослеФормированияДокумента(Док, Кэш, Контекст);	
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Сертификат) Тогда
			Сертификат = Новый Структура;	
		КонецЕсли;
		ИмяДокумента = Кэш.ОбщиеФункции.ПолучитьРеквизитМетаданныхОбъекта(Контекст.Документ, "Имя");
		ПользовательскийИдентификатор = ИмяДокумента+":"+строка(Контекст.Документ.УникальныйИдентификатор());
		Вложение = Новый Структура("НашаОрганизация,Контрагент,Ответственный,Подразделение,Регламент,Тип,ДокументОснование,Примечание,Сертификат,ПользовательскийИдентификатор,НеЗапускатьВДокументооборот,Дата,Номер", Док.Отправитель,Док.Получатель,ОтветственныйСтруктура,ПодразделениеСтруктура,РегламентСтруктура,Тип,ОснованияМассив, Примечание,Сертификат,ПользовательскийИдентификатор,НеЗапускатьВДокументооборот,Дата,Номер);
		Контекст.СоставПакета.Вставить("Конверт",Вложение);
		Возврат Истина;
		
	Исключение
		Если Кэш.Свойство("РезультатОтправки") Тогда
			Кэш.РезультатОтправки.НеСформировано = Кэш.РезультатОтправки.НеСформировано+1;
		КонецЕсли;
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
КонецФункции
