
Процедура ДействияФормыОтчетСформировать(Кнопка)
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	ТабДок = ЭлементыФормы.ПолеТабличногоДокумента;
	Отчет(ТабДок);

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА
КонецПроцедуры

Процедура Отчет(ТабДок) Экспорт
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Макет = ВнешнийОтчетОбъект.ПолучитьМакет("Отчет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестонахождениеОССрезПоследних.Местонахождение КАК Местонахождение,
	|	СтоимостьОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОСОстатки.СтоимостьОстаток КАК НачальначСтоимость,
	|	СтоимостьОСОстатки.АмортизацияОстаток КАК Амортизация,
	|	СтоимостьОСОстатки.СтоимостьОстаток - СтоимостьОСОстатки.АмортизацияОстаток КАК СтоимостьСАмортизацией
	|ИЗ
	|	РегистрНакопления.СтоимостьОС.Остатки КАК СтоимостьОСОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних КАК МестонахождениеОССрезПоследних
	|		ПО СтоимостьОСОстатки.ОсновноеСредство = МестонахождениеОССрезПоследних.ОсновноеСредство
	|
	|УПОРЯДОЧИТЬ ПО
	|	МестонахождениеОССрезПоследних.Местонахождение.Наименование,
	|	СтоимостьОСОстатки.ОсновноеСредство.Наименование
	|ИТОГИ
	|	СУММА(НачальначСтоимость),
	|	СУММА(Амортизация),
	|	СУММА(СтоимостьСАмортизацией)
	|ПО
	|	ОБЩИЕ,
	|	Местонахождение";

	Результат = Запрос.Выполнить();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьМестонахождение = Макет.ПолучитьОбласть("Местонахождение");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ОбластьЗаголовок.Параметры.КонДата= ТекущаяДата();
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ВыборкаОбщийИтог.Следующий();		// Общий итог
	ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
	ТабДок.Вывести(ОбластьОбщийИтог, ВыборкаОбщийИтог.Уровень());

	ВыборкаМестонахождение = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаМестонахождение.Следующий() Цикл
		ОбластьМестонахождение.Параметры.Заполнить(ВыборкаМестонахождение);
		ТабДок.Вывести(ОбластьМестонахождение, ВыборкаМестонахождение.Уровень());

		ВыборкаДетальныеЗаписи = ВыборкаМестонахождение.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
		КонецЦикла;
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ
КонецПроцедуры
