Перем НовыйДок экспорт;


Процедура УдалитьЧек(Чек) Экспорт
	
	МаркаИНомерАвтомобиля = НайтиЗаписьМаркиИНомера(Чек);
	
	Если (МаркаИНомерАвтомобиля = Справочники.МаркиИНомераАвтомобилей.ПустаяСсылка()) Тогда 
		
		Ответ = Вопрос("Не найдена запись в регистре статистики для чека " + Чек + " пометить его на удаление ?",РежимДиалогаВопрос.ДаНет);
		Если (Ответ = КодВозвратаДиалога.Да) Тогда 
			Объект = Чек.ПолучитьОбъект();
			Объект.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
		
	Иначе 
		
		Объект = МаркаИНомерАвтомобиля.ПолучитьОбъект();
		Объект.Удалить();
		
		ОбъектЧек = Чек.ПолучитьОбъект();
		ОбъектЧек.УстановитьПометкуУдаления(Истина);
		
		Предупреждение("ЧЕК ККМ успешно удален.");
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура УдалитьРеализацию(Реализация) Экспорт
	
	МаркаИНомерАвтомобиля = НайтиЗаписьМаркиИНомераРеализация(Реализация);
	Попытка 
		Если (МаркаИНомерАвтомобиля = Справочники.МаркиИНомераАвтомобилей.ПустаяСсылка()) Тогда 
			
			Ответ = Вопрос("Не найдена запись в регистре статистики для чека " + Реализация + " пометить его на удаление ?",РежимДиалогаВопрос.ДаНет);
			Если (Ответ = КодВозвратаДиалога.Да) Тогда 
				Объект = Реализация.ПолучитьОбъект();
				Объект.УстановитьПометкуУдаления(Истина);
			КонецЕсли;
			
		Иначе 
			
			Объект = МаркаИНомерАвтомобиля.ПолучитьОбъект();
			Объект.Удалить();
			
			ОбъектРеализация = Реализация.ПолучитьОбъект();
			ОбъектРеализация.УстановитьПометкуУдаления(Истина);
			
			Предупреждение("Реализация успешно удалена.");
			
		КонецЕсли;	
		
	Исключение
		Предупреждение("Возникли ошибки при удалении реализации.");	
	КонецПопытки;	
	
КонецПроцедуры

Функция НайтиЗаписьМаркиИНомера(Чек) Экспорт                          
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Дата",Чек.Дата);
	Запрос.УстановитьПараметр("Номер",Чек.Номер);
	Запрос.Текст = "
	|Выбрать МаркаИНомерАвтомобиля как МИН из РегистрСведений.СтатистикаПоУслугам
	|Где (Дата = &Дата) и (НомерЧека = &Номер)";
	
	Выб = Запрос.Выполнить().Выбрать();
	
	Если (Выб.Следующий()) Тогда 
		Возврат Выб.МИН; 	
	Иначе 
		Возврат Справочники.МаркиИНомераАвтомобилей.ПустаяСсылка();
	КонецЕсли;
		
КонецФункции

Функция НайтиЗаписьМаркиИНомераРеализация(Реализация) Экспорт 
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Дата",Реализация.Дата);
	Запрос.УстановитьПараметр("Номер",Реализация.Номер);
	Запрос.Текст = "
	|Выбрать МаркаИНомерАвтомобиля как МИН из РегистрСведений.СтатистикаПоУслугам
	|Где (Дата = &Дата) и (НомерЧека = &Номер)";
	
	Выб = Запрос.Выполнить().Выбрать();
	
	Если (Выб.Следующий()) Тогда 
		Возврат Выб.МИН; 	
	Иначе 
		Возврат Справочники.МаркиИНомераАвтомобилей.ПустаяСсылка();
	КонецЕсли;
	
	
КонецФункции
