

//1)------------находим поступления услуг по комментарию на Филиал-------------------
// ищем задание на отгрузку по машине и водителю за тек.дату
// перераспределяем услуги на Подразделение и Яршинторг
Процедура КнопкаВыполнитьНажатие(Кнопка)
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПоступлениеТоваровУслугУслуги.Ссылка КАК Документ,
	               |	ПоступлениеТоваровУслугУслуги.Ссылка.СуммаДокумента КАК Сумма,
	               |	ВЫРАЗИТЬ(ПоступлениеТоваровУслугУслуги.Ссылка.Комментарий КАК СТРОКА(1000)) КАК Комментарий
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |ГДЕ
	               |	ПоступлениеТоваровУслугУслуги.Номенклатура В(&СписокУслуг)
	               |	И ПоступлениеТоваровУслугУслуги.Ссылка.Проведен
	               |	И ПоступлениеТоваровУслугУслуги.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	               |	И ВЫРАЗИТЬ(ПоступлениеТоваровУслугУслуги.Ссылка.Комментарий КАК СТРОКА(1000)) ПОДОБНО &Филиал
	               |	И ВЫРАЗИТЬ(ПоступлениеТоваровУслугУслуги.Ссылка.Комментарий КАК СТРОКА(1000)) ПОДОБНО &Ярославль
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПоступлениеТоваровУслугУслуги.Ссылка.Дата
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаНач", НачПериода);
	Запрос.УстановитьПараметр("ДатаКон", КонПериода);
	
	Запрос.УстановитьПараметр("Ярославль","%Ярославль%");     // отгрузка с Ярославля !
	Запрос.УстановитьПараметр("Филиал", "%"+ФилиалТекст+"%");
	
СписокУслуг = новый СписокЗначений;
НоменклатураТрУсл = Справочники.Номенклатура.НайтиПоКоду("ЛН00039",,Справочники.Номенклатура.НайтиПоКоду("ЛН00001")); //Транспортные услуги 44-1 на затраты
СписокУслуг.Добавить( НоменклатураТрУсл );
//номУсл = Справочники.Номенклатура.НайтиПоКоду("ЛН00018",,Справочники.Номенклатура.НайтиПоКоду("ЛН00002")); //Транспортная услуга 44-ТР возмещаемые
//СписокУслуг.Добавить( номУсл );
Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
//СтатьяЗатратТрУсл = справочники.СтатьиЗатрат.НайтиПоКоду("К0115"); // Автоуслуги (грузовой транспорт)
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
Режим = РежимДиалогаВопрос.ДаНет;
Ответ = Вопрос("Найдено "+строка(выборка.Количество())+" поступлений.
				|Продолжить?", Режим, 0);
Если Ответ = КодВозвратаДиалога.Нет Тогда
    Возврат;
КонецЕсли;
 
//=======================Основной цикл===========================================================
ТабличноеПоле1.Очистить();
КолДокЗад = 0;    N = выборка.Количество();
Пока Выборка.Следующий() Цикл
	ОбработкаПрерыванияПользователя();
	
	стр1 = ТабличноеПоле1.Добавить();
	ЗаполнитьЗначенияСвойств(стр1, выборка);	
	
//----------------анализ комментария----------------------------	
//1) уже есть ссылка на Задание на отгрузку:
	i = Найти(Выборка.Комментарий, "# Задание "); //# Задание ТК027054 от 29 июня 2015 г.;
	Если i>0 тогда
	стрКом = СокрЛП( сред(Выборка.Комментарий, i+10, 9) ); 	
	док1 = Документы.ЗаданиеНаОтгрузку.НайтиПоНомеру(стрКом, Выборка.Документ.Дата );
	докЗад = новый СписокЗначений;
	докЗад.Добавить( док1 );
	Иначе //--------------анализ комментария - находим машину, номер, водителя и дату--------------
		стрКом = СокрЛП(Выборка.Комментарий); 	
		перевозчик = сокрЛП( Выборка.Документ.Контрагент.НаименованиеПолное );
		ДокЗад = найтиДокЗад(стрКом, перевозчик);	
	КонецЕсли;	
	
	Если докЗад<>неопределено тогда
		стр1.Флаг = истина;
		стр1.ЗаданияНаОтгрузку = докЗад;
		стр1.КолЗаданий = докЗад.Количество();
		КолДокЗад = КолДокЗад + 1;
	КонецЕсли;
	
	КонецЦикла;
	
Сообщить("За период "+формат(НачПериода,"ДЛФ=D")+" по "+формат(КонПериода,"ДЛФ=D")+" обработано "+строка(КолДокЗад)+" из "+строка(N)+" ("+формат(?(N>0,100*КолДокЗад/N,0),"ЧДЦ=0")+"%) поступлений.");

КонецПроцедуры


функция найтиДокЗад(стрКом="", Перевозчик="")
	рез =неопределено;
	если стрКом="" тогда
		возврат рез;
	КонецЕсли;
	
//---------------находим машину, номер, дату задания на отгрузку--------------	
//Транспортные услуги по маршруту Ярославль - Санкт-Петербург, а/м Хендай  Е 007 ВН 76, вод.  Холопов В.А. от 12.01.2015г	
i= найти(стрКом, "а/м ");
если i>0 тогда
	стрКом = прав( стрКом, стрДлина(стрКом) - i - 3); //Хендай  Е 007 ВН 76, вод.  Холопов В.А. от 12.01.2015г
КонецЕсли;

стрКом0 = стрКом;

i= Найти(стрКом, "вод. ");
Автомобиль = "---";
ГосНомер   = "---";
Если i>0 тогда
	АвтомобильНомер = СокрЛП( лев(стрКом, i-1) );    //"Хендай  Е 007 ВН 76,"
	стрКом = сокрЛП( прав( стрКом, стрДлина(стрКом) - i-4));  //"Холопов В.А. от 12.01.2015г"
	
	АвтомобильНомер= стрЗаменить(АвтомобильНомер,",","");
	j= найти(АвтомобильНомер," ");
	Автомобиль = СокрЛП(лев(АвтомобильНомер, j-1));
	ГосНомер   = СокрЛП(прав(АвтомобильНомер, стрДлина(АвтомобильНомер)-j));
КонецЕсли;

i= Найти(стрКом, "от ");
Водитель = "---";
датаФакт = '00010101';
Если i>0 тогда
	Водитель = СокрЛП( лев(стрКом, i-1) );    //"Холопов В.А."
	Если найти(Водитель,"/")>0 тогда
		 Водитель = лев(Водитель, найти(Водитель,"/")-1);
	КонецЕсли;	 
	Если найти(Водитель,"\")>0 тогда
		 Водитель = лев(Водитель, найти(Водитель,"\")-1);
	КонецЕсли;	 
	Если найти(Водитель," ")>0 тогда
		 Водитель = лев(Водитель, найти(Водитель," ")-1);
	КонецЕсли;	 
	 
	 стрКом   = сокрЛП( прав( стрКом, стрДлина(стрКом) - i-2));  //"12.01.2015г"
	
	ДатаДок  = лев(стрКом, Найти(стрКом, "г")-1);
	если стрДлина(ДатаДок)=10 тогда
		год = число(прав(ДатаДок,4)); мес = число(сред(ДатаДок,4,2)); день = лев(ДатаДок,2);
		датаФакт = дата(год, мес, день);
	КонецЕсли;	
иначе // водитель в конце
   Водитель = СокрЛП(стрКом);
	i= Найти(стрКом0, "от ");
	j= Найти(стрКом0, "вод. ");
	
	если j>0 тогда Водитель = СокрЛП( прав(стрКом0, стрДлина(стрКом0)-j-4) );
	КонецЕсли;	
	
	если i>0 и j>0 тогда
	ДатаДок  = СокрЛП( сред(стрКом0, i+2, j-i-2) );
	
	ДатаДок  = лев(ДатаДок, Найти(ДатаДок, "г")-1);
		если стрДлина(ДатаДок)=10 тогда
		год = число(прав(ДатаДок,4)); мес = число(сред(ДатаДок,4,2)); день = лев(ДатаДок,2);
		датаФакт = дата(год, мес, день);
		КонецЕсли;	
	КонецЕсли;
КонецЕсли;

Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
               |	ЗаданиеНаОтгрузку.Ссылка
               |ИЗ
               |	Документ.ЗаданиеНаОтгрузку КАК ЗаданиеНаОтгрузку
               |ГДЕ
               |	ЗаданиеНаОтгрузку.Перевозчик = &Перевозчик
               |"+?(флВодитель,"   И ЗаданиеНаОтгрузку.Водитель Подобно &Водитель", "")+"
			   |"+?(флАвтомобиль," И ЗаданиеНаОтгрузку.МаркаАвтомобиля = &Автомобиль","")+"
               |"+?(флГосНомер," И ЗаданиеНаОтгрузку.ГосНомерАвтомобиля = &ГосНомер","")+"
               |
			    |	И НАЧАЛОПЕРИОДА(ЗаданиеНаОтгрузку.Дата, ДЕНЬ) >= &НачДата
				
			   |	И (НАЧАЛОПЕРИОДА(ЗаданиеНаОтгрузку.Дата, ДЕНЬ) = &ФактДата
			   |	или  НАЧАЛОПЕРИОДА(ЗаданиеНаОтгрузку.ВремяНапоминания, ДЕНЬ) = &ФактДата )
               |
               |	И ЗаданиеНаОтгрузку.Проведен";

Запрос.УстановитьПараметр("Перевозчик", Перевозчик);
Запрос.УстановитьПараметр("Водитель", "%"+Водитель+"%");
Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
Запрос.УстановитьПараметр("ГосНомер", ГосНомер);
Запрос.УстановитьПараметр("ФактДата",датаФакт);
Запрос.УстановитьПараметр("НачДата", ДобавитьМесяц(НачПериода, -1) ); // отгрузка не ранее месяца!

Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
Если Выборка.Количество()=0 тогда
	сообщить("Не найден док. по параметрам "+стрКом0, СтатусСообщения.Внимание);	
ИначеЕсли Выборка.Количество()>=1 тогда
	
	рез = новый СписокЗначений;
	пока Выборка.Следующий() цикл
  		рез.Добавить( выборка.Ссылка );
	КонецЦикла;
КонецЕсли;

возврат рез;

КонецФункции	


Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

Процедура ОсновныеДействияФормыПерезаполнить(Кнопка)
	
НоменклатураТрУсл = Справочники.Номенклатура.НайтиПоКоду("ЛН00039",,Справочники.Номенклатура.НайтиПоКоду("ЛН00001")); //Транспортные услуги 44-1 на затраты
	
для каждого стр1 из ТабличноеПоле1 цикл
	
	ОбработкаПрерыванияПользователя();
		
	Если стр1.Флаг тогда
    //-------------Собираем списки реализаций и перемещений-----------------
	списПеремещ = новый СписокЗначений;	
	списРеализаций = новый СписокЗначений;	
	для каждого СтрДок из стр1.ЗаданияНаОтгрузку цикл
		для каждого стрЗад из СтрДок.Значение.ЗаказыПокупателей цикл
			Если ЗначениеЗаполнено(стрЗад.Реализация) тогда
				Если ТипЗнч(стрЗад.Реализация) = Тип("ДокументСсылка.ПеремещениеТоваров") тогда
				списПеремещ.Добавить(стрЗад.Реализация);
				Иначе	
				списРеализаций.Добавить(стрЗад.Реализация);
				КонецЕсли;	
			КонецЕсли;	
	     КонецЦикла;
	 КонецЦикла;
	Стр1.КолПеремещений = списПеремещ.Количество();
	Стр1.КолРеализаций  = списРеализаций.Количество();
	
	//----------------Распределение!-----------------
	таблУсл = стр1.Документ.Услуги.Выгрузить();
	таблУсл.Свернуть("Номенклатура, Содержание, СтатьяЗатрат", "Сумма, Количество");
	таблУсл.Сортировать("Номенклатура УБЫВ"); // НоменклатураТрУсл - первая!
	
	Если списПеремещ.Количество()=0 и списРеализаций.Количество()=0 тогда
		сообщить("Документ: "+строка(стр1.Документ)+" - нет ни реализаций ни перемещений!", СтатусСообщения.Внимание);
		продолжить;
	КонецЕсли;
		
	//-----------Находим объем по всем товарам-----------
	ТаблНомГрупп = новый ТаблицаЗначений;
	ТаблНомГрупп.Колонки.Добавить("НоменклатурнаяГруппа");
	ТаблНомГрупп.Колонки.Добавить("Подразделение");
	ТаблНомГрупп.Колонки.Добавить("Объем");
	для каждого док1 из списПеремещ цикл
		для каждого стрт из док1.Значение.Товары цикл
		  //Если ВесМакс>0 и ОбъемМакс>0 
		  //  	и стр2.Номенклатура.ВидТовара = перечисления.ВидыТоваров.АКБ Тогда
		  //   стр3.Объем = стр2.Количество * стр2.Номенклатура.ЕдиницаХраненияОстатков.Вес/1000 * ОбъемМакс/ВесМакс;
		  //  Иначе		
		   Объем = стрт.Номенклатура.ЕдиницаХраненияОстатков.Объем * стрт.Количество;
		 Если Объем>0 тогда  
		 стрНГ = ТаблНомГрупп.Добавить();
		 стрНГ.НоменклатурнаяГруппа = стрт.Номенклатура.НоменклатурнаяГруппа;
		 стрНГ.Объем     = Объем;
		 стрНГ.Подразделение = Подразделение; // ФИКС
	 	 КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ПодразделениеЯШТ = справочники.Подразделения.НайтиПоКоду("00005");
	для каждого док1 из списРеализаций цикл
		для каждого стрт из док1.Значение.Товары цикл
		  //Если ВесМакс>0 и ОбъемМакс>0 
		  //  	и стр2.Номенклатура.ВидТовара = перечисления.ВидыТоваров.АКБ Тогда
		  //   стр3.Объем = стр2.Количество * стр2.Номенклатура.ЕдиницаХраненияОстатков.Вес/1000 * ОбъемМакс/ВесМакс;
		  //  Иначе		
		   Объем = стрт.Номенклатура.ЕдиницаХраненияОстатков.Объем * стрт.Количество;
		 Если Объем>0 тогда  
		 стрНГ = ТаблНомГрупп.Добавить();
		 стрНГ.НоменклатурнаяГруппа = стрт.Номенклатура.НоменклатурнаяГруппа;
		 стрНГ.Объем     = Объем;
		 стрНГ.Подразделение = ПодразделениеЯШТ; // ФИКС
	 	 КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТаблНомГрупп.Свернуть("НоменклатурнаяГруппа, Подразделение", "Объем");
	ПолныйОбъем = ТаблНомГрупп.Итог("Объем");
	ПолнаяСумма = таблУсл[0].Сумма;
	
//================================ПЕРЕЗАПОЛНЕНИЕ ДОКУМЕНТА============================
	ДокОб = стр1.Документ.ПолучитьОбъект();
    ДокОб.Услуги.Очистить();
	СуммаЦен = 0; максЦена = 0; ii=0; номМакс = 0;
	для каждого стр2 из ТаблНомГрупп цикл
		стрУсл = ДокОб.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(стрУсл, таблУсл[0]);
		ЗаполнитьЗначенияСвойств(стрУсл, стр2 );
		
		Цена = Окр( ПолнаяСумма * стр2.Объем / ПолныйОбъем, 2);
		стрУсл.Цена  = Цена;
		стрУсл.Сумма = Цена;
		стрУсл.Количество = 1;
		стрУсл.СтавкаНДС = перечисления.СтавкиНДС.БезНДС;
		стрУсл.СуммаНДС  = 0;
		
	СуммаЦен = СуммаЦен + Цена;	
	Если Цена>максЦена тогда
		максЦена = Цена; номМакс = ii;
	КонецЕсли;	
	ii=ii+1;	
	КонецЦикла;

	delta = ПолнаяСумма - СуммаЦен;
	Если delta<>0 тогда
	сообщить("Доп.сумма "+формат(delta,"ЧДЦ=2")+"р. - отнесена на макс.строку № "+строка(номМакс +1) );
	ДокОб.Услуги[номМакс].Цена = ДокОб.Услуги[номМакс].Цена  + delta;
	ДокОб.Услуги[номМакс].Сумма = ДокОб.Услуги[номМакс].Сумма  + delta;
	КонецЕсли;

	//---------------другие услуги---------------------
	для i=1 по таблУсл.Количество()-1 цикл
		стрУсл = ДокОб.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(стрУсл, таблУсл[i]);
		стрУсл.Цена  = таблУсл[i].Сумма;
		стрУсл.Количество = 1;
		стрУсл.СтавкаНДС = перечисления.СтавкиНДС.БезНДС;
		стрУсл.СуммаНДС  = 0;
	сообщить("Добавлена услуга "+строка(таблУсл[i].Номенклатура)+" - "+строка( таблУсл[i].Сумма )+"р. в документ "+строка(ДокОб));	
	КонецЦикла;
		
	попытка
		ДокОб.Записать(РежимЗаписиДокумента.Проведение);
		сообщить("Успешно заполнен документ: "+строка(ДокОб), СтатусСообщения.Информация );
	исключение
		сообщить("Ошибка при записи "+строка(ДокОб)+" - "+ОписаниеОшибки(), СтатусСообщения.ОченьВажное );
	КонецПопытки;
	
	КонецЕсли; //Если стр1.Флаг 
КонецЦикла;//==================================================

КонецПроцедуры


Процедура КоманднаяПанель2ФлВыкл(Кнопка)
	флУстановить(0);
КонецПроцедуры

Процедура КоманднаяПанель2ФлВкл(Кнопка)
	флУстановить(1);
КонецПроцедуры

Процедура КоманднаяПанель2ФлПерекл(Кнопка)
	флУстановить(2);
КонецПроцедуры

процедура флУстановить(	вар=2 )
	для каждого стр111 из ТабличноеПоле1 цикл
		стр111.флаг = ?(вар=0, ЛОЖЬ,
		                      ?(вар=1, Истина, не стр111.флаг) );
	КонецЦикла;	
КонецПроцедуры	
