Функция Печать(мас) Экспорт
	
	ТабДокумент = ПечатьПоЗаказуПокупателя(мас);
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт; 
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
			
КонецФункции // Печать

Функция ПечатьПоЗаказуПокупателя(МАС)
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	Если МАС[0].поставщик = Справочники.Контрагенты.НайтиПоКоду("91735") тогда 
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Областьстроки = Макет.ПолучитьОбласть("Строка");
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	Областьпроверки = Макет.ПолучитьОбласть("Проверка");

    иначе
	Шапка = Макет.ПолучитьОбласть("Шапка1");
	Областьстроки = Макет.ПолучитьОбласть("Строка1");
	ОбластьИтого = Макет.ПолучитьОбласть("Итого1");
    КонецЕсли;	
	ОбластьКонтейнер = Макет.ПолучитьОбласть("Контейнер");
	Шапка.Параметры.Поставщик = МАС[0].Поставщик;
	//Шапка.Параметры.НомерКонтейнера = МАС[0].Контейнер;
		ТабДокумент.Вывести(Шапка);
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПровереннаяНагрузкаДисков.Номенклатура
		|ПОМЕСТИТЬ Нагрузка
		|ИЗ
		|	РегистрСведений.ПровереннаяНагрузкаДисков КАК ПровереннаяНагрузкаДисков
		|ГДЕ
		|	ПровереннаяНагрузкаДисков.Дата МЕЖДУ &ДатаН И &ДатаК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроверкаНагрузкиДисковТовары.Номенклатура.Код КАК Код,
		|	ПроверкаНагрузкиДисковТовары.Номенклатура КАК Номенклатура,
		|	ПроверкаНагрузкиДисковТовары.Количество КАК Количество,
		|	ПроверкаНагрузкиДисковТовары.Дата1,
		|	ПроверкаНагрузкиДисковТовары.Результат1,
		|	ПроверкаНагрузкиДисковТовары.ТестПройден1 КАК ТестПройден1,
		|	ПроверкаНагрузкиДисковТовары.Дата2,
		|	ПроверкаНагрузкиДисковТовары.Результат2,
		|	ПроверкаНагрузкиДисковТовары.ТестПройден2 КАК ТестПройден2,
		|	ПроверкаНагрузкиДисковТовары.Дата3,
		|	ПроверкаНагрузкиДисковТовары.Результат3,
		|	ПроверкаНагрузкиДисковТовары.ТестПройден3 КАК ТестПройден3,
		|	ПроверкаНагрузкиДисковТовары.Комментарий,
		|	ПроверкаНагрузкиДисковТовары.Цена,
		|	ПроверкаНагрузкиДисковТовары.СуммаКомпенсации,
		|	ВЫБОР
		|		КОГДА Нагрузка.Номенклатура ЕСТЬ NULL 
		|				ИЛИ Нагрузка.Номенклатура.Производитель В (&производители)
		|			ТОГДА ""Не проверялись ранее""
		|		ИНАЧЕ ""Проверялись ранее""
		|	КОНЕЦ КАК УжеПроверялись,
		|	ПроверкаНагрузкиДисковТовары.Ссылка.Контейнер КАК Контейнер
		|ИЗ
		|	Документ.ПроверкаНагрузкиДисков.Товары КАК ПроверкаНагрузкиДисковТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Нагрузка КАК Нагрузка
		|		ПО ПроверкаНагрузкиДисковТовары.Номенклатура = Нагрузка.Номенклатура
		|ГДЕ
		|	ПроверкаНагрузкиДисковТовары.Ссылка В(&Ссылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	УжеПроверялись,
		|	Контейнер,
		|	ТестПройден1,
		|	ТестПройден2,
		|	ТестПройден3";
		
	Запрос.УстановитьПараметр("Дата", МАС[0].ДокументОснование.Сделка.Дата);                                  
    Запрос.УстановитьПараметр("Ссылка", МАС); 
    Запрос.УстановитьПараметр("ДатаН", Дата('20180301'));                                  
    Запрос.УстановитьПараметр("ДатаК", МАС[0].Дата-45*24*60*60);                                  
	
	Производители =  Новый СписокЗначений;
	Производители.Добавить(Справочники.Производители.НайтиПоКоду("3485"));   //megami
	Производители.Добавить(Справочники.Производители.НайтиПоКоду("3291"));   //CROSSSTREET
    Запрос.УстановитьПараметр("Производители", Производители);                                  
	
	
	
	Результат = Запрос.Выполнить();                                                                        

	ВыборкаДетальныеЗаписи = Результат.Выгрузить();
	
	проверка="";
	итого = 0;
    Контейнер = "";
	Для каждого стр из ВыборкаДетальныеЗаписи Цикл
		    Если МАС[0].поставщик = Справочники.Контрагенты.НайтиПоКоду("91735") и проверка <> стр.УжеПроверялись тогда 
				ОбластьПроверки.параметры.Проверка =  стр.УжеПроверялись;
				ТабДокумент.Вывести(ОбластьПроверки);
			конецЕсли;
			
		    Если Контейнер <> стр.Контейнер тогда 
				ОбластьКонтейнер.параметры.номерКонтейнера =  стр.контейнер;
				ТабДокумент.Вывести(ОбластьКонтейнер);
			конецЕсли;
			
			проверка = стр.УжеПроверялись;
			Контейнер = стр.Контейнер;
			
			//ЗаполнитьЗначенияСвойств(Областьстроки, ВыборкаДетальныеЗаписи); 
			Областьстроки.Параметры.Заполнить(стр);			
			Областьстроки.Параметры.Код = стр.Код;
	       Если МАС[0].поставщик = Справочники.Контрагенты.НайтиПоКоду("91735") тогда 
			Областьстроки.Параметры.ЦенаФОБ8 =0;
			Областьстроки.Параметры.Штраф =0;
		   конецЕсли;
		
			Если стр.ТестПройден1 = Истина и ЗначениеЗаполнено(стр.Результат1) Тогда
				Областьстроки.Параметры.ТестПройден1 ="passed";
			иначеЕсли ЗначениеЗаполнено(стр.Результат1) Тогда
				Областьстроки.Параметры.ТестПройден1 ="no passed";
			иначе	
				Областьстроки.Параметры.ТестПройден1 ="";
			конецесли;
			
            Если стр.ТестПройден2 = Истина и ЗначениеЗаполнено(стр.Результат2) Тогда
				Областьстроки.Параметры.ТестПройден2 ="passed";
			иначеЕсли ЗначениеЗаполнено(стр.Результат2) Тогда
				Областьстроки.Параметры.ТестПройден2 ="no passed";
			иначе	
				Областьстроки.Параметры.ТестПройден2 ="";
			конецесли;
			Если стр.ТестПройден3 = Истина и ЗначениеЗаполнено(стр.Результат3) Тогда
				Областьстроки.Параметры.ТестПройден3 ="passed";
			иначеЕсли	ЗначениеЗаполнено(стр.Результат3) Тогда
				Областьстроки.Параметры.ТестПройден3 ="no passed";
			иначе	
				Областьстроки.Параметры.ТестПройден3 ="";
			конецесли;
			
			//для джангсу не показываем 3 успешное испытание, если предыдущие 2 были не успешными
			Если МАС[0].поставщик <> Справочники.Контрагенты.НайтиПоКоду("91735") И стр.ТестПройден3 = Истина и ЗначениеЗаполнено(стр.Результат3) И стр.ТестПройден2 = ЛОЖЬ тогда 
                Областьстроки.Параметры.ТестПройден3 ="no passed";
                Областьстроки.Параметры.Результат3 =стр.Результат2;
			КОНЕЦеСЛИ;
			
			
		   //Если СсылкаНаОбъект.поставщик = Справочники.Контрагенты.НайтиПоКоду("91735") тогда 
		   // 	Если (?(ЗначениеЗаполнено(стр.Результат1),стр.ТестПройден1,1)+?(ЗначениеЗаполнено(стр.Результат2),стр.ТестПройден2,1)+?(ЗначениеЗаполнено(стр.Результат3),стр.ТестПройден3,1)=2 или ?(ЗначениеЗаполнено(стр.Результат1),стр.ТестПройден1,1)+?(ЗначениеЗаполнено(стр.Результат2),стр.ТестПройден2,1)+?(ЗначениеЗаполнено(стр.Результат3),стр.ТестПройден3,1)=1)и СсылкаНаОбъект.поставщик = Справочники.Контрагенты.НайтиПоКоду("91735") тогда
		   // 		Если стр.количество>8 тогда   
		   // 			Областьстроки.Параметры.ЦенаФОБ8 =8*стр.цена;
		   // 			Областьстроки.Параметры.Штраф =(стр.количество-8)*5;
		   // 		иначе
		   // 			Областьстроки.Параметры.ЦенаФОБ8 =стр.количество*стр.цена;
		   // 			Областьстроки.Параметры.Штраф =0;
		   // 		конецЕсли;
		   // 	конецЕсли;
		   // конецЕсли;
			
			
		   Если ?(ЗначениеЗаполнено(стр.Результат1),стр.ТестПройден1,1)+?(ЗначениеЗаполнено(стр.Результат2),стр.ТестПройден2,1)+?(ЗначениеЗаполнено(стр.Результат3),стр.ТестПройден3,1)=2 и МАС[0].поставщик = Справочники.Контрагенты.НайтиПоКоду("91735") тогда
			   Если стр.количество>8 тогда   
				   Областьстроки.Параметры.ЦенаФОБ8 =8*стр.цена;
				   Областьстроки.Параметры.Штраф =(стр.количество-8)*5;
				    Областьстроки.Параметры.СуммаКомпенсации = 8*стр.цена+(стр.количество-8)*5;
				   итого = Итого+  8*стр.цена+(стр.количество-8)*5;
			   иначе
				   Областьстроки.Параметры.ЦенаФОБ8 =стр.количество*стр.цена;
				   Областьстроки.Параметры.Штраф =0;
				    Областьстроки.Параметры.СуммаКомпенсации =стр.количество*стр.цена;
				   итого = Итого+ стр.количество*стр.цена;
				   
			   конецЕсли;
		   иначеЕсли  стр.тестПройден1 = 0 тогда
			   Если МАС[0].поставщик = Справочники.Контрагенты.НайтиПоКоду("91735") тогда 
				   Областьстроки.Параметры.Штраф =стр.количество*стр.цена;
			   конецесли;
				    Областьстроки.Параметры.СуммаКомпенсации =стр.количество*стр.цена;
			   итого = Итого+ стр.количество*стр.цена;
		   конецЕсли;	  
		   
			ТабДокумент.Вывести(Областьстроки);
		
	КонецЦикла;
	
	        ОбластьИтого.Параметры.итого = итого;
			ТабДокумент.Вывести(ОбластьИтого);
	

Возврат ТабДокумент;	
	
КонецФункции