
Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Дата1");
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение  = ?(ЗначениеНеЗаполнено(НачПериода),Дата('00010101'),НачПериода);
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Дата2");
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение  = ?(ЗначениеНеЗаполнено(КонПериода),Дата('30991231'),КонецДня(КонПериода));
	КонецЕсли;

КонецПроцедуры

Процедура НачПериодаПриИзменении(Элемент)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Дата1");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = ?(ЗначениеНеЗаполнено(НачПериода),Дата('00010101'),НачПериода);
КонецПроцедуры

Процедура КонПериодаПриИзменении(Элемент)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Дата2");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = ?(ЗначениеНеЗаполнено(КонПериода),Дата('30991231'),КонецДня(КонПериода));
КонецПроцедуры

Процедура ПриОткрытии()
	Подразделение = Справочники.Подразделения.НайтиПоКоду("00112"); // по умолчанию отчет для СПБ
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Подразделение");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = Подразделение;

КонецПроцедуры

Процедура ПодразделениеПриИзменении(Элемент)
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Подразделение");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = Подразделение;
КонецПроцедуры
