
Процедура ОтправитьПисьмо(Ответственные,ДокументыПоступления)
	
	Если Ответственные.Количество() > 0 тогда
		
		Почта = Новый ИнтернетПочта;
		УЗ = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("no-reply@yst76.ru");
		ИПП = Новый ИнтернетПочтовыйПрофиль;
		ИПП.АдресСервераSMTP = УЗ.SMTPСервер;
		ИПП.ПортSMTP = УЗ.ПортSMTP;
		Если УЗ.ТребуетсяSMTPАутентификация Тогда
			ИПП.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
			ИПП.ПарольSMTP         = УЗ.ПарольSMTP;
			ИПП.ПользовательSMTP   = УЗ.ЛогинSMTP;
		Иначе
			ИПП.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
			ИПП.ПарольSMTP         = "";
			ИПП.ПользовательSMTP   = "";
		КонецЕсли;
		
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Письмо.Отправитель = УЗ.АдресЭлектроннойПочты;
		СтрАдреса = "";
		Для Каждого Ответственный ИЗ Ответственные Цикл
			Если Ответственный.EMail <> "" тогда
				СтрАдреса = СтрАдреса+?(СтрАдреса="","",", ")+Ответственный.EMail;
				Письмо.Получатели.Добавить(Ответственный.EMail);
			КонецЕсли;
		КонецЦикла;	
		
		
		Письмо.Тема				 = "Приход контейнера!";
		Письмо.ИмяОтправителя	 = "Робот";
		Письмо.Организация		 = "ТК ""Яршинторг""";
		
		Макет = ПолучитьМакет("Макет");
		ТабДокумент		 = Новый ТабличныйДокумент;
		ОбластьШапка	 = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока	 = Макет.ПолучитьОбласть("Строка");
		ОбластьИтоги	 = Макет.ПолучитьОбласть("Итоги");

		Если ДокументыПоступления.Количество() = 1 Тогда 
			ТекстПисьма = "Ожидается прибытие контейнера";
		Иначе
			ТекстПисьма = "Ожидается прибытие контейнеров:";
		КонецЕсли;
		
		Для каждого СтрТЗ ИЗ ДокументыПоступления Цикл 
			
			Товары = СтрТЗ.Документ.Товары;
			
			ОбластьШапка.Параметры.Документ = СтрТЗ.Документ;
			ОбластьШапка.Параметры.ДатаПрибытия = Формат(СтрТЗ.Документ.ДатаПоступления,"ДФ=dd.MM.yyyy");
			ОбластьШапка.Параметры.Получатель=?(ЗначениеЗаполнено(СтрТЗ.Документ.Грузополучатель), "("+СтрТЗ.Документ.Грузополучатель.Код+") "+ СтрТЗ.Документ.Грузополучатель, СтрТЗ.Документ.Подразделение);
			ОбластьШапка.Параметры.Контейнер = СтрТЗ.Документ.НомерКонтейнера;
			ТабДокумент.Вывести(ОбластьШапка);
			Для Каждого строкаТовары из Товары Цикл
				ОбластьСтрока.Параметры.Код = СтрокаТовары.Номенклатура.Код;
				ОбластьСтрока.Параметры.Номенклатура = СтрокаТовары.Номенклатура;
				ОбластьСтрока.Параметры.Количество = СтрокаТовары.Количество;
				ТабДокумент.Вывести(ОбластьСтрока);
			КонецЦикла;
			ОбластьИтоги.Параметры.КоличествоИтого = Товары.Итог("Количество");
			ТабДокумент.Вывести(ОбластьИтоги);
			
			ДнейДоПрибытияВПорт =(НачалоДня(СтрТЗ.Документ.ДатаПоступления)-НачалоДня(ТекущаяДата()))/(24*60*60);
			
			КоличестовоШтук=Товары.Итог("Количество");
			
			ТекстПисьма = ТекстПисьма + "<BR>" + СтрТЗ.Документ.НомерКонтейнера;			
						
		КонецЦикла;
		
		ТекстПисьма = ТекстПисьма + Символы.ПС + "<BR>Ожидаемая дата прибытия в порт "+ Формат(ДокументыПоступления[0].Документ.ДатаПоступления,"ДФ=dd.MM.yyyy")+", "+
		"<BR>Количество дней до прибытия в порт: <STRONG>"+ДнейДоПрибытияВПорт+"</STRONG>"+
		"<BR>Ассортимент и количество во вложении."; 
		
		ИмяФайла = ПолучитьИмяВременногоФайла("xls");
		ТабДокумент.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
		Письмо.Вложения.Добавить(ИмяФайла,"Поступление.xls");
		Письмо.Тексты.Добавить(ТекстПисьма,ТипТекстаПочтовогоСообщения.HTML);
		Письмо.ОбработатьТексты();
		
		//Попытка
			Почта.Подключиться(ИПП);
			Почта.Послать(Письмо);
			Почта.Отключиться();
			#Если Клиент Тогда
				сообщить(" >>>  Письмо отправлено на эл.адрес: "+СтрАдреса+".", СтатусСообщения.Информация);
			#КонецЕсли
		//Исключение
			//попытка
			//	Пауза(2);
			//	Почта.Подключиться(ИПП);
			//	Почта.Послать(Письмо);
			//	Почта.Отключиться();
			//	#Если Клиент Тогда
			//		сообщить(" >>>  Письмо отправлено на эл.адрес: "+СтрАдреса+". Со второй попытки", СтатусСообщения.Информация);
			//	#КонецЕсли
			//исключение
			//	#Если Клиент Тогда
			//		сообщить("xxxxx Ошибка при отправке письма на эл.адрес: "+СтрАдреса+" - "+ОписаниеОшибки()+" попробуем еще раз.", СтатусСообщения.Внимание);
			//	#КонецЕсли
			//конецПопытки;
		//КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура Пауза(Сек)
	scr = Новый COMОбъект("WScript.Shell");
	scr.Run("sleep "+СокрЛП(Число(Сек)),0,1);
КонецПроцедуры

Процедура ОповеститьОПриходе(ДатаОповещения = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗаказПоставщику.Ссылка КАК Документ,
	             |	ЗаказПоставщику.Грузополучатель.ОсновнойМенеджерКонтрагента КАК Менеджер,
	             |	ЗаказПоставщику.Грузополучатель.ОсновнойДоговорКонтрагента.ОтветственноеЛицо
	             |ПОМЕСТИТЬ втДокументы
	             |ИЗ
	             |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	             |ГДЕ
	             |	ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, 3) = НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ЗаказПоставщику.ДатаПоступления КАК ДАТА), ДЕНЬ)
	             |	И ЗаказПоставщику.Проведен = ИСТИНА
	             |	И ЗаказПоставщику.НомерКонтейнера <> """"
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	втДокументы.ГрузополучательОсновнойДоговорКонтрагентаОтветственноеЛицо КАК Менеджер,
	             |	ЕСТЬNULL(ВложенныйЗапрос.Представление, """") КАК EMail,
	             |	втДокументы.Документ КАК Документ
	             |ИЗ
	             |	втДокументы КАК втДокументы
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			КонтактнаяИнформация.Объект КАК Объект,
	             |			КонтактнаяИнформация.Представление КАК Представление
	             |		ИЗ
	             |			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	             |		ГДЕ
	             |			КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	             |			И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя)) КАК ВложенныйЗапрос
	             |		ПО втДокументы.ГрузополучательОсновнойДоговорКонтрагентаОтветственноеЛицо = ВложенныйЗапрос.Объект";
	
	Если ДатаОповещения=Неопределено тогда			 
		Запрос.УстановитьПараметр("ТекДата",НачалоДня(ТекущаяДата()));
	Иначе
		Запрос.УстановитьПараметр("ТекДата",ДатаОповещения);
	КонецЕсли;
	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	Рез = Результат.Выбрать();
	
	Если Рез.Количество() > 0 Тогда
		ТаблицаАдресовПолучателей = ЗаполнитьПолучателей();
		ОтправитьПисьмо(ТаблицаАдресовПолучателей, ТЗ);
	КонецЕсли;
	
КонецПроцедуры

функция ЗаполнитьПолучателей()
	
	СписокПолучателей = Новый СписокЗначений;
	
	//СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Смирнов Алексей Анатольевич",ИСТИНА));
	СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Малышев Егор Игоревич",ИСТИНА));
	СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Бондаренко Евгений Дмитриевич (снабжение)",ИСТИНА));
	
	//+++ 01.07.2016 - рассылка
	//СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Хачатурян Лусине Карленовна",ИСТИНА)); //  lusine@yst.ru
	//СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Трошин Денис Олегович",ИСТИНА));    // troshin@YST.RU
	//СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Грошко Михаил Анатольевич",Истина));   	//	roman_nr@YST.RU

	СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Марешева Ирина Германовна",ИСТИНА));
	СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Лигута Александр Сергеевич",ИСТИНА));
	СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Красюк Н.В.",ИСТИНА));
	//СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Киселева Е.Н.",ИСТИНА));
	//СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Горустович Татьяна Ивановна",ИСТИНА));
	СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Плешивцева Наталья Владимировна",ИСТИНА));
	СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Никитин Михаил",ИСТИНА));
	СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Антонов Алексей Вячеславович",ИСТИНА));
	//++++13.07.2016
	//СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Бармин В.В.",ИСТИНА));
	
	//++++07.02.2017
	СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Смирнов Юрий Александрович",ИСТИНА));
	СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Пефти Сергей",ИСТИНА));
	СписокПолучателей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Филатова Светлана Владимировна",ИСТИНА));

	
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Пользователи.Ссылка
	|ПОМЕСТИТЬ втПолучатели
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка В(&СписокПолучателей)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(А.EMail, """") КАК EMail,
	|	втПолучатели.Ссылка КАК Менеджер
	|ИЗ
	|	втПолучатели КАК втПолучатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КонтактнаяИнформация.Объект КАК Менеджер,
	|			КонтактнаяИнформация.Представление КАК EMail
	|		ИЗ
	|			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ГДЕ
	|			КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|			И КонтактнаяИнформация.Вид = &СлужебныйАдресЭлектроннойПочтыФизЛица
	|			И КонтактнаяИнформация.Объект В(&СписокПолучателей)) КАК А
	|		ПО втПолучатели.Ссылка = А.Менеджер";
	Запрос.УстановитьПараметр("СписокПолучателей",СписокПолучателей);
	Запрос.УстановитьПараметр("СлужебныйАдресЭлектроннойПочтыФизЛица",Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
	
	Получатели = Запрос.Выполнить().Выгрузить();
	врем = Получатели.Скопировать();
	врем.Очистить();
	
	Для каждого стр из Получатели Цикл
		массивАдресов = оРазложитьСтрокуВМассивПодстрок(стр.EMail,";");
		Для каждого эл из массивАдресов цикл
			Если СокрЛП(эл)<>"" тогда
				нстр = врем.Добавить();
				ЗаполнитьЗначенияСвойств(нстр,стр);
				нстр.EMail = эл;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//нстр = врем.Добавить();
	//нстр.EMail = "budanova@yst.ru";
	//+12.01.2018
	нстр = врем.Добавить();
	нстр.EMail = "roman_nr@yst.ru";
	//нстр = врем.Добавить();
	//нстр.EMail = "mikhail_zh@yst.ru";
	нстр = врем.Добавить();
	нстр.EMail = "klimovich@yst.ru";
	нстр = врем.Добавить();
	нстр.EMail = "yudin@yst.ru";
	//-12.01.2018
	//+23.01.2018
	нстр = врем.Добавить();
	нстр.EMail = "emelyanov@yst.ru";
	нстр = врем.Добавить();
	нстр.EMail = "gorelov@yst.ru";
	//-23.01.2018
	
	//добавлено 25.06.2018
	нстр = врем.Добавить();
	нстр.EMail = "shaburova@yst.ru";
	нстр = врем.Добавить();
	нстр.EMail = "bondarenko@yst.ru";
	нстр = врем.Добавить();
	нстр.EMail = "ivanov_ra@yst.ru";
	нстр = врем.Добавить();
	нстр.EMail = "rumyantseva@yst.ru";
	
	//добавлено 15.11.2018  по задаче 58576 
	нстр = врем.Добавить();
	нстр.EMail = "petrova@yst.ru";
	нстр = врем.Добавить();
	нстр.EMail = "Sekirov@yst.ru";
	нстр = врем.Добавить();
	нстр.EMail = "Lesnikov@yst.ru";
	нстр = врем.Добавить();
	нстр.EMail = "vorontsova@yst.ru";  	
	
	Возврат врем;
	
Конецфункции

Функция оРазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции