
Функция Печать() Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ВесИтого = 0;
	КоличествоИтого = 0;
	НомерПП = 0;
	Для каждого СтрТовар ИЗ Товары Цикл
		Если СтрТовар.Пометка Тогда
			НомерПП = НомерПП + 1;
			ОбластьСтрока.Параметры.НомерПП = НомерПП;
			ОбластьСтрока.Параметры.КодТовара = СтрТовар.Номенклатура.Код;
			ОбластьСтрока.Параметры.Наименование = СтрТовар.Номенклатура.НаименованиеПолное;
			ОбластьСтрока.Параметры.Количество = СтрТовар.Количество;
			ОбластьСтрока.Параметры.Вес = СтрТовар.Вес;
			ОбластьСтрока.Параметры.РезультатИспытаний = СтрТовар.РезультатИспытаний;
			ТабДок.Вывести(ОбластьСтрока);
			ВесИтого = ВесИтого + СтрТовар.Вес;
			КоличествоИтого = КоличествоИтого + СтрТовар.Количество;
		КонецЕсли;
	КонецЦикла;
	ОбластьИтоги.Параметры.КоличествоИтого = КоличествоИтого;
	ОбластьИтоги.Параметры.ВесИтого = ВесИтого;
	ТабДок.Вывести(ОбластьИтоги);
	
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();
	//Возврат(ТабДок);
	
КонецФункции