Перем тзМенеджерПомощник;

Процедура Пауза(Сек)
	Попытка
		scr = Новый COMОбъект("WScript.Shell");
		scr.Run("sleep "+СокрЛП(Число(Сек)),0,1);
	Исключение
	КонецПопытки;
КонецПроцедуры

Процедура ОповеститьПоПодразделениям(ДатаОпов=неопределено) Экспорт
	МВТ=Новый МенеджерВременныхТаблиц;
	Запрос= новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МВТ;
	НачДата=КонецМесяца(ТекущаяДата())+1;
	//НачДата=КонецМесяца(Дата(2014,6,1))+1;
	Если ДатаОпов=неопределено тогда
		ДатаОповещения=НачалоДня(ТекущаяДата());
	Иначе
		ДатаОповещения=НачалоДня(ДатаОпов);
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаН",ДатаОповещения);
	Запрос.УстановитьПараметр("ДатаК",КонецДня(ДатаОповещения));
	Ответственные = Новый Массив;
	Ответственные.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Жарикова Виктория",ИСТИНА));
	Ответственные.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Балдина Ольга Эдуардовна",ИСТИНА));
	Ответственные.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Беловошин Я.П.",ИСТИНА));
	Ответственные.Добавить(Справочники.Пользователи.НайтиПоКоду("Аверкин А. Р.",ИСТИНА));	
	//Ответственные.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Яхшиян Тигран",ИСТИНА));
	//Ответственные.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Горицкий Антон Игоревич",ИСТИНА));
	Запрос.УстановитьПараметр("Ответственный",Ответственные);
	Запрос.УстановитьПараметр("ПустаяДата",Дата(1,1,1));
	Запрос.УстановитьПараметр("Диски",Перечисления.ВидыТоваров.Диски);
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗаданиеНаОтгрузкуЗаказыПоставщикам.ЗаказПоставщику
	             |ПОМЕСТИТЬ втЗаказыПост
	             |ИЗ
	             |	Документ.ЗаданиеНаОтгрузку.ЗаказыПоставщикам КАК ЗаданиеНаОтгрузкуЗаказыПоставщикам
	             |ГДЕ
	             |	ЗаданиеНаОтгрузкуЗаказыПоставщикам.Ссылка.Ответственный В (&Ответственный)
	             |	И ЗаданиеНаОтгрузкуЗаказыПоставщикам.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК
	             |	И ЗаданиеНаОтгрузкуЗаказыПоставщикам.Ссылка.ПометкаУдаления = ЛОЖЬ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЗаказПоставщикуТовары.Номенклатура,
	             |	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество,
	             |	ЗаказПоставщикуТовары.Номенклатура.Производитель,
	             |	ЗаказПоставщикуТовары.Ссылка.Подразделение КАК Подразделение,
	             |	ЗаказПоставщикуТовары.Ссылка.НомерКонтейнера КАК НомерКонтейнера,
	             |	&ДатаН КАК ДатаПоступления,
	             |	ЗаказПоставщикуТовары.Ссылка.Грузополучатель КАК Грузополучатель,
	             |	ЗаказПоставщикуТовары.Ссылка.Транзит КАК Транзит,
	             |	ЗаказПоставщикуТовары.Ссылка.Грузополучатель.ОсновнойДоговорКонтрагента.ОтветственноеЛицо КАК ГрузополучательОсновнойДоговорКонтрагентаОтветственноеЛицо
	             |ПОМЕСТИТЬ втТЧ
	             |ИЗ
	             |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	             |ГДЕ
	             |	ЗаказПоставщикуТовары.Ссылка В
	             |			(ВЫБРАТЬ
	             |				втЗаказыПост.ЗаказПоставщику
	             |			ИЗ
	             |				втЗаказыПост КАК втЗаказыПост)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ЗаказПоставщикуТовары.Номенклатура,
	             |	ЗаказПоставщикуТовары.Номенклатура.Производитель,
	             |	ЗаказПоставщикуТовары.Ссылка.Подразделение,
	             |	ЗаказПоставщикуТовары.Ссылка.НомерКонтейнера,
	             |	ЗаказПоставщикуТовары.Ссылка.ДатаПоступления,
	             |	ЗаказПоставщикуТовары.Ссылка.Грузополучатель,
	             |	ЗаказПоставщикуТовары.Ссылка.Транзит,
	             |	ЗаказПоставщикуТовары.Ссылка.Грузополучатель.ОсновнойДоговорКонтрагента.ОтветственноеЛицо
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	КонтактнаяИнформация.Объект КАК Объект,
	             |	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(200)) КАК Представление
	             |ПОМЕСТИТЬ втАдреса
	             |ИЗ
	             |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	             |ГДЕ
	             |	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	             |	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	втТЧ.Номенклатура,
	             |	втТЧ.Количество,
	             |	втТЧ.НоменклатураПроизводитель,
	             |	втТЧ.Подразделение,
	             |	втТЧ.НомерКонтейнера,
	             |	втТЧ.ДатаПоступления,
	             |	втТЧ.Грузополучатель,
	             |	втТЧ.ГрузополучательОсновнойДоговорКонтрагентаОтветственноеЛицо,
	             |	ЕСТЬNULL(втАдреса.Представление, """") КАК Адрес,
	             |	втТЧ.Транзит
	             |ПОМЕСТИТЬ втОсноваОБЩ
	             |ИЗ
	             |	втТЧ КАК втТЧ
	             |		ЛЕВОЕ СОЕДИНЕНИЕ втАдреса КАК втАдреса
	             |		ПО втТЧ.ГрузополучательОсновнойДоговорКонтрагентаОтветственноеЛицо = втАдреса.Объект";
	
	Запрос.Выполнить();
	//Сначала посылаем информацию по подразделениям, потом по грузополучателям
	Адреса=Новый СписокЗначений;
	Адреса.Добавить("MALYSHEV@YST.RU");
//	Адреса.Добавить("BUROVA@YST.RU");
	Адреса.Добавить("novikova@YST.RU");
//	Адреса.Добавить("serebrennikovaa@mail.ru");
	Адреса.Добавить("antonov@yst.ru");
	Адреса.Добавить("fonchikova@yst.ru");
	Адреса.Добавить("200200140@yst.ru");
//	Адреса.Добавить("alaev@yst76.ru");
	Адреса.Добавить("bondarenko@yst.ru");
	Адреса.Добавить("budanova@yst.ru");
	
//	Адреса.Добавить("vinogradov@yst.ru");
	Адреса.Добавить("pankov@yst.ru");
	Адреса.Добавить("kuzmichova73@mail.ru");
	Адреса.Добавить("malyshev@yst.ru");
	Адреса.Добавить("maresheva@yst.ru");
	Адреса.Добавить("nikitin_m@yst.ru");
	Адреса.Добавить("pleshivtseva@yst.ru"); 
//	Адреса.Добавить("reykoles@yst.ru");
	Адреса.Добавить("serkov@yst.ru");
	Адреса.Добавить("200200143@yst.ru");
	Адреса.Добавить("200200152@yst.ru");
//	Адреса.Добавить("chistyakova@yst.ru");
//	Адреса.Добавить("burova@yst76.ru"); 
	//Адреса.Добавить("Andrey.m.29@gmail.com");
	//Адреса.Добавить("groshko@yst.ru");
	Адреса.Добавить("gorelov@yst.ru");
	Адреса.Добавить("liguta@yst.ru");
	//Адреса.Добавить("gti@yst.ru");
	Адреса.Добавить("krasyuk@yst.ru");
	Адреса.Добавить("emelyanov@yst.ru");
	//Адреса.Добавить("lusine@yst.ru ");
	//Адреса.Добавить("mikhail_zh@yst.ru ");
	Адреса.Добавить("roman_nr@yst.ru ");
	//Адреса.Добавить("barmin@yst.ru");
	//Адреса.Добавить("smirnov_ua@yst.ru");
	Адреса.Добавить("pefti@yst.ru");
	//+12.01.2018
	Адреса.Добавить("roman_nr@yst.ru");
	Адреса.Добавить("mikhail_zh@yst.ru");
	Адреса.Добавить("klimovich@yst.ru");
	Адреса.Добавить("yudin@yst.ru");
	//-12.01.2018
	//+23.01.2018
	Адреса.Добавить("emelyanov@yst.ru");
	Адреса.Добавить("gorelov@yst.ru");
	Адреса.Добавить("ivanov_ra@yst.ru");
	Адреса.Добавить("rumyantseva@yst.ru");
	
	//+++ 15.11.2018 по задаче 58576 
	Адреса.Добавить("petrova@yst.ru");
	Адреса.Добавить("Sekirov@yst.ru");
	Адреса.Добавить("Lesnikov@yst.ru");
	Адреса.Добавить("vorontsova@yst.ru");
	
	//--- 15.11.2018 по задаче 58576 
	//-23.01.2018
	СписокПодразделений=Новый СписокЗначений;
	СписокПодразделений.Добавить(Справочники.Подразделения.ПустаяСсылка()); //
	СписокПодразделений.Добавить(Справочники.Подразделения.НайтиПоКоду("00005")); //Головное подразделение Ярославль
	СписокПодразделений.Добавить(Справочники.Подразделения.НайтиПоКоду("00112")); //Подразделение Санкт-Петербург
	СписокПодразделений.Добавить(Справочники.Подразделения.НайтиПоКоду("00106")); //Подразделение Ростов на Дону
//16.09.2015 -	СписокПодразделений.Добавить(Справочники.Подразделения.НайтиПоКоду("00122")); //Подразделение Екатеринбург
	СписокПодразделений.Добавить(Справочники.Подразделения.НайтиПоКоду("00138")); //Подразделение Екатеринбург
	ОтправитьПисьмаПоПодразделениям(Адреса,СписокПодразделений,Запрос,ДатаОповещения);	
	
	///Теперь сформируем письма для менеджеров грузополучателей
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втОсноваОБЩ.ГрузополучательОсновнойДоговорКонтрагентаОтветственноеЛицо,
	|	втОсноваОБЩ.Адрес
	|ИЗ
	|	втОсноваОБЩ КАК втОсноваОБЩ
	|ГДЕ
	|	втОсноваОБЩ.Адрес <> """"
	|	И втОсноваОБЩ.Транзит";
	Рез=Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		//Если нрег(Рез.Адрес)="bondarenko@yst76.ru" тогда
			ОтправитьПисьмаПоМенеджерам(Рез.Адрес,Рез.ГрузополучательОсновнойДоговорКонтрагентаОтветственноеЛицо,Запрос,ДатаОповещения);
		//КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОтправитьПисьмаПоПодразделениям(Адресаты,СписокПодразделений,Запрос,НачДата)
	Вложение1=ПолучитьИмяВременногоФайла("xls");
	Вложение2=ПолучитьИмяВременногоФайла("xls");
	Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
	Запрос.Текст="Выбрать * Поместить втОснова из втОсноваОБЩ как втОсноваОБЩ где втОсноваОБЩ.Подразделение в (&СписокПодразделений)";
	Запрос.Выполнить();
	
	Запрос.Текст="ВЫБРАТЬ
	|	втОснова.Подразделение КАК Подразделение,
	|	втОснова.НоменклатураПроизводитель КАК НоменклатураПроизводитель,
	|	СУММА(втОснова.Количество) КАК Количество
	|ИЗ
	|	втОснова КАК втОснова
	|
	|СГРУППИРОВАТЬ ПО
	|	втОснова.Подразделение,
	|	втОснова.НоменклатураПроизводитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение.Наименование,
	|	НоменклатураПроизводитель.Наименование
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Подразделение,
	|	НоменклатураПроизводитель";
	//ВремФайл=ПолучитьИмяВременногоФайла("txt");
	ТекстПисьма = "";//Новый ЗаписьТекста(ВремФайл);
	ТекстПисьма="Поступление на склад "+Формат(НачДата,"ДФ=dd.MM.yyyy")+Символы.ПС;
	ВыборкаПодразделение=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПодразделение.Следующий() Цикл
		//ТекстПисьма.ЗаписатьСтроку("Подразделение: "+ВыборкаПодразделение.Подразделение);
		ТекстПисьма=ТекстПисьма+"Подразделение: "+ВыборкаПодразделение.Подразделение+Символы.ПС;
		ВыборкаБренд=ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаБренд.Следующий() Цикл
			Стр=""+ВыборкаБренд.НоменклатураПроизводитель;
			ТекстПисьма=ТекстПисьма+"              "+ДополнитьСтрокуЯ(стр,30," ",1)+"	"+ВыборкаБренд.Количество+Символы.ПС;
		КонецЦикла;
		стр="Итого по "+ВыборкаПодразделение.Подразделение;
		ТекстПисьма=ТекстПисьма+ДополнитьСтрокуЯ(стр,45," ",1)+"	"+ВыборкаПодразделение.Количество+Символы.ПС;
		ТекстПисьма=ТекстПисьма+"____________________________________________________________"+символы.ПС;
	КонецЦикла;
	//ТекстПисьма.Закрыть();
	
	Запрос.Текст="ВЫБРАТЬ
	|	втОснова.Подразделение КАК Подразделение,
	|	втОснова.Номенклатура КАК Номенклатура,
	|	втОснова.Номенклатура.Код КАК Код,
	|	втОснова.НомерКонтейнера КАК НомерКонтейнера,
	|	втОснова.ДатаПоступления КАК ДатаПоступления,
	|	СУММА(втОснова.Количество) КАК Количество
	|ИЗ
	|	втОснова КАК втОснова
	|
	|СГРУППИРОВАТЬ ПО
	|	втОснова.ДатаПоступления,
	|	втОснова.НомерКонтейнера,
	|	втОснова.Номенклатура,
	|	втОснова.Подразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение.Наименование,
	|	ДатаПоступления,
	|  НомерКонтейнера,
	|	Номенклатура.Наименование
	|ИТОГИ
	|МАКСИМУМ(ДатаПоступления),
	|	СУММА(Количество)
	|ПО
	|	Подразделение,
	|	НомерКонтейнера";
	
	ТабДок=Новый ТабличныйДокумент;
	Макет=ПолучитьМакет("МакетВложение1");
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ОбластьКонтейнер=Макет.ПолучитьОбласть("СтрокаКонтейнер");
	ОбластьНоменклатура=Макет.ПолучитьОбласть("СтрокаНоменклатура");
	ОбластьИтог=Макет.ПолучитьОбласть("Подвал");
	ТабДок.НачатьАвтогруппировкуСтрок();
	ВыборкаПодразделение=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПодразделение.Следующий() цикл
		ОбластьШапка.Параметры.Подразделение=ВыборкаПодразделение.Подразделение;
		ОбластьИтог.Параметры.Количество=ВыборкаПодразделение.Количество;
		
		ТабДок.Вывести(ОбластьШапка,1);
		ВыборкаКонтейнер=ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКонтейнер.Следующий() Цикл
			ОбластьКонтейнер.Параметры.ДатаПоступления=ВыборкаКонтейнер.ДатаПоступления;
			ОбластьКонтейнер.Параметры.НомерКонтейнера=ВыборкаКонтейнер.НомерКонтейнера;
			ОбластьКонтейнер.Параметры.Количество=ВыборкаКонтейнер.Количество;
			ТабДок.Вывести(ОбластьКонтейнер,2);
			ВыборкаНоменклатура=ВыборкаКонтейнер.Выбрать();
			Пока ВыборкаНоменклатура.Следующий() Цикл
				ОбластьНоменклатура.Параметры.Номенклатура	=ВыборкаНоменклатура.Номенклатура;
				ОбластьНоменклатура.Параметры.Код	=ВыборкаНоменклатура.Код;
				ОбластьНоменклатура.Параметры.Количество=ВыборкаНоменклатура.Количество;
				ТабДок.Вывести(ОбластьНоменклатура,3);
			КонецЦикла;
		КонецЦикла;
		ТабДок.Вывести(ОбластьИтог,1);
	КонецЦикла;
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.ПоказатьУровеньГруппировокСтрок(2);
	табДок.Записать(Вложение1, ТипФайлаТабличногоДокумента.XLS);
	
	Вложение1ZIP=КаталогВременныхФайлов()+"\Вложение1.zip";
	Архив = Новый ЗаписьZIPФайла(Вложение1ZIP,,,
	МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный, МетодШифрованияZIP.Zip20);
	Архив.Добавить(Вложение1, РежимСохраненияПутейZIP.НеСохранятьПути);
	Архив.Записать();
	
	Дата20=КонецДня(Дата(Год(НачДата),Месяц(НачДата),20));
	Запрос.УстановитьПараметр("Дата20",Дата20);
	Запрос.Текст="ВЫБРАТЬ
	|	втОснова.Номенклатура,
	|	втОснова.Номенклатура.Код КАК Код,
	|	втОснова.НоменклатураПроизводитель КАК Производитель,
	|	втОснова.Подразделение КАК Подразделение,
	|	СУММА(ВЫБОР
	|			КОГДА втОснова.ДатаПоступления <= &Дата20
	|				ТОГДА втОснова.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоДо20,
	|	СУММА(ВЫБОР
	|			КОГДА втОснова.ДатаПоступления > &Дата20
	|				ТОГДА втОснова.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПосле20
	|ИЗ
	|	втОснова КАК втОснова
	|
	|СГРУППИРОВАТЬ ПО
	|	втОснова.НоменклатураПроизводитель,
	|	втОснова.Подразделение,
	|	втОснова.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	втОснова.Подразделение.Наименование,
	|	втОснова.НоменклатураПроизводитель.Наименование,
	|	втОснова.Номенклатура.Наименование
	|ИТОГИ
	|	СУММА(КоличествоДо20),
	|	СУММА(КоличествоПосле20)
	|ПО
	|	Подразделение,
	|	НоменклатураПроизводитель";
	
	ТабДок=Новый ТабличныйДокумент;
	Макет=ПолучитьМакет("МакетВложение2");
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ОбластьПроизводитель=Макет.ПолучитьОбласть("СтрокаПроизводитель");
	ОбластьНоменклатура=Макет.ПолучитьОбласть("СтрокаНоменклатура");
	ОбластьИтог=Макет.ПолучитьОбласть("Подвал");
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	
	ВыборкаПодразделение=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	 
	Пока ВыборкаПодразделение.Следующий() Цикл
		ОбластьШапка.Параметры.Подразделение=ВыборкаПодразделение.Подразделение;
		ТабДок.Вывести(ОбластьШапка,1);
		ВыборкаПроизводитель=ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПроизводитель.Следующий() Цикл
			ОбластьПроизводитель.Параметры.Производитель=ВыборкаПроизводитель.Производитель;
			ОбластьПроизводитель.Параметры.КоличествоДо20=ВыборкаПроизводитель.КоличествоДо20;
			ОбластьПроизводитель.Параметры.КоличествоПосле20=ВыборкаПроизводитель.КоличествоПосле20;
			ТабДок.Вывести(ОбластьПроизводитель,2);
			ВыборкаНоменклатура=ВыборкаПроизводитель.Выбрать();
			Пока ВыборкаНоменклатура.Следующий() Цикл
				ОбластьНоменклатура.Параметры.Номенклатура=ВыборкаНоменклатура.Номенклатура;
				ОбластьНоменклатура.Параметры.Код=ВыборкаНоменклатура.Код;
				ОбластьНоменклатура.Параметры.КоличествоДо20=ВыборкаНоменклатура.КоличествоДо20;
				ОбластьНоменклатура.Параметры.КоличествоПосле20=ВыборкаНоменклатура.КоличествоПосле20;
				ТабДок.Вывести(ОбластьНоменклатура,3);
			КонецЦикла;
		КонецЦикла;
		ОбластьИтог.Параметры.КоличествоДо20=ВыборкаПодразделение.КоличествоДо20;
		ОбластьИтог.Параметры.КоличествоПосле20=ВыборкаПодразделение.КоличествоПосле20;
		ТабДок.Вывести(ОбластьИтог,1);
	КонецЦикла;
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.ПоказатьУровеньГруппировокСтрок(2);
	табДок.Записать(Вложение2, ТипФайлаТабличногоДокумента.XLS);
	
	Вложение2ZIP=КаталогВременныхФайлов()+"\Вложение2.zip";
	Архив = Новый ЗаписьZIPФайла(Вложение2ZIP,,,
	МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный, МетодШифрованияZIP.Zip20);
	Архив.Добавить(Вложение2, РежимСохраненияПутейZIP.НеСохранятьПути);
	Архив.Записать();
	
	Если ВыборкаПодразделение.Количество()>0 тогда
		
		Профиль = Новый ИнтернетПочтовыйПрофиль;
		Профиль.АдресСервераSMTP   = "mail.yst76.ru";
		Профиль.ПортSMTP		   = 25;
		Профиль.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
		Профиль.ПарольSMTP         = "";
		Профиль.ПользовательSMTP   = "";
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Письмо.Отправитель = "no-reply@yst76.ru";
		Для каждого Адр из Адресаты Цикл
			Письмо.Получатели.Добавить(Адр.Значение);
		КонецЦикла;
		
		Письмо.Получатели.Добавить("smirnov@yst.ru");
		//Письмо.Получатели.Добавить("MALYSHEV@YST76.RU");
		//Письмо.Получатели.Добавить("smirnov@yst.ru");
		//Письмо.Получатели.Добавить("serebrennikovaa@mail.ru");
		//Письмо.Получатели.Добавить("budanova@yst.ru");
		Письмо.Получатели.Добавить("shaburova@yst.ru");
		
		Письмо.Вложения.Добавить(Вложение1ZIP,"Вложение 1");
		Письмо.Вложения.Добавить(Вложение2ZIP,"Вложение 2");
		Письмо.Тема = "Поступление на склад "+Формат(НачДата,"ДФ=dd.MM.yyyy");
		Письмо.Тексты.Добавить(ТекстПисьма,ТипТекстаПочтовогоСообщения.ПростойТекст);
		Почта = Новый ИнтернетПочта;
		
		Попытка
			Почта.Подключиться(Профиль);
			Почта.Послать(Письмо);
			Почта.Отключиться();
		Исключение
			Пауза(3);
			Почта.Подключиться(Профиль);
			Почта.Послать(Письмо);
			Почта.Отключиться();
		КонецПопытки;
	КонецЕсли;
	Запрос.Текст="УНИЧТОЖИТЬ втОснова";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ОтправитьПисьмаПоМенеджерам(Адрес,Менеджер,Запрос,НачДата)
	Вложение1=ПолучитьИмяВременногоФайла("xls");
	Вложение2=ПолучитьИмяВременногоФайла("xls");
	Запрос.УстановитьПараметр("Менеджер",Менеджер);
	Запрос.Текст="ВЫБРАТЬ * 
	|				ПОМЕСТИТЬ втОснова 
	|				ИЗ втОсноваОБЩ 
	|				КАК втОсноваОБЩ 
	|				ГДЕ втОсноваОБЩ.ГрузополучательОсновнойДоговорКонтрагентаОтветственноеЛицо=&Менеджер
	|					и втОсноваОБЩ.Грузополучатель<>Значение(Справочник.Контрагенты.ПустаяСсылка)";
	
	Запрос.Выполнить();
	
	Запрос.Текст="ВЫБРАТЬ
	|	втОснова.Грузополучатель КАК Грузополучатель,
	|	втОснова.НоменклатураПроизводитель КАК НоменклатураПроизводитель,
	|	СУММА(втОснова.Количество) КАК Количество
	|ИЗ
	|	втОснова КАК втОснова
	|
	|СГРУППИРОВАТЬ ПО
	|	втОснова.Грузополучатель,
	|	втОснова.НоменклатураПроизводитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Грузополучатель.Наименование,
	|	НоменклатураПроизводитель.Наименование
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Грузополучатель,
	|	НоменклатураПроизводитель";
	//ВремФайл=ПолучитьИмяВременногоФайла("txt");
	ТекстПисьма = "";//Новый ЗаписьТекста(ВремФайл);
	ТекстПисьма="Поступление на склад "+Формат(НачДата,"ДФ=dd.MM.yyyy")+Символы.ПС;
	ВыборкаГрузополучатель=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГрузополучатель.Следующий() Цикл
		//ТекстПисьма.ЗаписатьСтроку("Подразделение: "+ВыборкаПодразделение.Подразделение);
		ТекстПисьма=ТекстПисьма+"Грузополучатель: "+ВыборкаГрузополучатель.Грузополучатель+Символы.ПС;
		ВыборкаБренд=ВыборкаГрузополучатель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаБренд.Следующий() Цикл
			Стр=""+ВыборкаБренд.НоменклатураПроизводитель;
			ТекстПисьма=ТекстПисьма+"              "+ДополнитьСтрокуЯ(стр,30," ",1)+"	"+ВыборкаБренд.Количество+Символы.ПС;
		КонецЦикла;
		стр="Итого по "+ВыборкаГрузополучатель.Грузополучатель;
		ТекстПисьма=ТекстПисьма+ДополнитьСтрокуЯ(стр,45," ",1)+"	"+ВыборкаГрузополучатель.Количество+Символы.ПС;
		ТекстПисьма=ТекстПисьма+"____________________________________________________________"+символы.ПС;
	КонецЦикла;
	//ТекстПисьма.Закрыть();
	
	Запрос.Текст="ВЫБРАТЬ
	|	втОснова.Грузополучатель КАК Грузополучатель,
	|	втОснова.Номенклатура КАК Номенклатура,
	|	втОснова.Номенклатура.Код КАК Код,
	|	втОснова.НомерКонтейнера КАК НомерКонтейнера,
	|	втОснова.ДатаПоступления КАК ДатаПоступления,
	|	СУММА(втОснова.Количество) КАК Количество
	|ИЗ
	|	втОснова КАК втОснова
	|
	|СГРУППИРОВАТЬ ПО
	|	втОснова.ДатаПоступления,
	|	втОснова.НомерКонтейнера,
	|	втОснова.Номенклатура,
	|	втОснова.Грузополучатель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Грузополучатель.Наименование,
	|	ДатаПоступления,
	|   НомерКонтейнера,
	|	Номенклатура.Наименование
	|ИТОГИ
	|МАКСИМУМ(ДатаПоступления),
	|	СУММА(Количество)
	|ПО
	|	Грузополучатель,
	|	НомерКонтейнера";
	
	ТабДок=Новый ТабличныйДокумент;
	Макет=ПолучитьМакет("МакетВложение1");
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ОбластьКонтейнер=Макет.ПолучитьОбласть("СтрокаКонтейнер");
	ОбластьНоменклатура=Макет.ПолучитьОбласть("СтрокаНоменклатура");
	ОбластьИтог=Макет.ПолучитьОбласть("Подвал");
	ТабДок.НачатьАвтогруппировкуСтрок();
	ВыборкаГрузополучатель=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГрузополучатель.Следующий() цикл
		ОбластьШапка.Параметры.Подразделение=ВыборкаГрузополучатель.Грузополучатель;
		ОбластьИтог.Параметры.Количество=ВыборкаГрузополучатель.Количество;
		
		ТабДок.Вывести(ОбластьШапка,1);
		ВыборкаКонтейнер=ВыборкаГрузополучатель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКонтейнер.Следующий() Цикл
			ОбластьКонтейнер.Параметры.ДатаПоступления=ВыборкаКонтейнер.ДатаПоступления;
			ОбластьКонтейнер.Параметры.НомерКонтейнера=ВыборкаКонтейнер.НомерКонтейнера;
			ОбластьКонтейнер.Параметры.Количество=ВыборкаКонтейнер.Количество;
			ТабДок.Вывести(ОбластьКонтейнер,2);
			ВыборкаНоменклатура=ВыборкаКонтейнер.Выбрать();
			Пока ВыборкаНоменклатура.Следующий() Цикл
				ОбластьНоменклатура.Параметры.Номенклатура	=ВыборкаНоменклатура.Номенклатура;
				ОбластьНоменклатура.Параметры.Код	=ВыборкаНоменклатура.Код;
				ОбластьНоменклатура.Параметры.Количество=ВыборкаНоменклатура.Количество;
				ТабДок.Вывести(ОбластьНоменклатура,3);
			КонецЦикла;
		КонецЦикла;
		ТабДок.Вывести(ОбластьИтог,1);
	КонецЦикла;
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.ПоказатьУровеньГруппировокСтрок(2);
	табДок.Записать(Вложение1, ТипФайлаТабличногоДокумента.XLS);
	
	Вложение1ZIP=КаталогВременныхФайлов()+"\Вложение1.zip";
	Архив = Новый ЗаписьZIPФайла(Вложение1ZIP,,,
	МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный, МетодШифрованияZIP.Zip20);
	Архив.Добавить(Вложение1, РежимСохраненияПутейZIP.НеСохранятьПути);
	Архив.Записать();
	
	Дата20=КонецДня(Дата(Год(НачДата),Месяц(НачДата),20));
	Запрос.УстановитьПараметр("Дата20",Дата20);
	Запрос.Текст="ВЫБРАТЬ
	|	втОснова.Номенклатура,
	|	втОснова.Номенклатура.Код КАК Код,
	|	втОснова.НоменклатураПроизводитель КАК Производитель,
	|	втОснова.Грузополучатель КАК Грузополучатель,
	|	СУММА(ВЫБОР
	|			КОГДА втОснова.ДатаПоступления <= &Дата20
	|				ТОГДА втОснова.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоДо20,
	|	СУММА(ВЫБОР
	|			КОГДА втОснова.ДатаПоступления > &Дата20
	|				ТОГДА втОснова.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПосле20
	|ИЗ
	|	втОснова КАК втОснова
	|
	|СГРУППИРОВАТЬ ПО
	|	втОснова.НоменклатураПроизводитель,
	|	втОснова.Грузополучатель,
	|	втОснова.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	втОснова.Грузополучатель.Наименование,
	|	втОснова.НоменклатураПроизводитель.Наименование,
	|	втОснова.Номенклатура.Наименование
	|ИТОГИ
	|	СУММА(КоличествоДо20),
	|	СУММА(КоличествоПосле20)
	|ПО
	|	Грузополучатель,
	|	НоменклатураПроизводитель";
	
	ТабДок=Новый ТабличныйДокумент;
	Макет=ПолучитьМакет("МакетВложение2");
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ОбластьПроизводитель=Макет.ПолучитьОбласть("СтрокаПроизводитель");
	ОбластьНоменклатура=Макет.ПолучитьОбласть("СтрокаНоменклатура");
	ОбластьИтог=Макет.ПолучитьОбласть("Подвал");
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	
	ВыборкаГрузополучатель=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	 
	Пока ВыборкаГрузополучатель.Следующий() Цикл
		ОбластьШапка.Параметры.Подразделение=ВыборкаГрузополучатель.Грузополучатель;
		ТабДок.Вывести(ОбластьШапка,1);
		ВыборкаПроизводитель=ВыборкаГрузополучатель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПроизводитель.Следующий() Цикл
			ОбластьПроизводитель.Параметры.Производитель=ВыборкаПроизводитель.Производитель;
			ОбластьПроизводитель.Параметры.КоличествоДо20=ВыборкаПроизводитель.КоличествоДо20;
			ОбластьПроизводитель.Параметры.КоличествоПосле20=ВыборкаПроизводитель.КоличествоПосле20;
			ТабДок.Вывести(ОбластьПроизводитель,2);
			ВыборкаНоменклатура=ВыборкаПроизводитель.Выбрать();
			Пока ВыборкаНоменклатура.Следующий() Цикл
				ОбластьНоменклатура.Параметры.Номенклатура=ВыборкаНоменклатура.Номенклатура;
				ОбластьНоменклатура.Параметры.Код=ВыборкаНоменклатура.Код;
				ОбластьНоменклатура.Параметры.КоличествоДо20=ВыборкаНоменклатура.КоличествоДо20;
				ОбластьНоменклатура.Параметры.КоличествоПосле20=ВыборкаНоменклатура.КоличествоПосле20;
				ТабДок.Вывести(ОбластьНоменклатура,3);
			КонецЦикла;
		КонецЦикла;
		ОбластьИтог.Параметры.КоличествоДо20=ВыборкаГрузополучатель.КоличествоДо20;
		ОбластьИтог.Параметры.КоличествоПосле20=ВыборкаГрузополучатель.КоличествоПосле20;
		ТабДок.Вывести(ОбластьИтог,1);
	КонецЦикла;
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.ПоказатьУровеньГруппировокСтрок(2);
	табДок.Записать(Вложение2, ТипФайлаТабличногоДокумента.XLS);
	
	Вложение2ZIP=КаталогВременныхФайлов()+"\Вложение2.zip";
	Архив = Новый ЗаписьZIPФайла(Вложение2ZIP,,,
	МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный, МетодШифрованияZIP.Zip20);
	Архив.Добавить(Вложение2, РежимСохраненияПутейZIP.НеСохранятьПути);
	Архив.Записать();
	
	
	Если ВыборкаГрузополучатель.Количество()>0 тогда
		
		
		Профиль = Новый ИнтернетПочтовыйПрофиль;
		Профиль.АдресСервераSMTP   = "mail.yst76.ru";
		Профиль.ПортSMTP		   = 25;
		Профиль.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
		Профиль.ПарольSMTP         = "";
		Профиль.ПользовательSMTP   = "";
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Письмо.Отправитель = "no-reply@yst76.ru";
		ДобавитьПолучателей(Письмо,Адрес,Менеджер); //менеджер контрагента+его помощники
		Письмо.Получатели.Добавить(Адрес);
		
		Письмо.Получатели.Добавить("smirnov@yst.ru");
//+++ 19.02.2018 - ВЫКЛЮЧЕНО!		Письмо.Получатели.Добавить("budanova@yst.ru");
		
		Письмо.Вложения.Добавить(Вложение1ZIP,"Вложение 1");
		Письмо.Вложения.Добавить(Вложение2ZIP,"Вложение 2");
		Письмо.Тема = "Поступление на склад "+Формат(НачДата,"ДФ=dd.MM.yyyy");
		Письмо.Тексты.Добавить(ТекстПисьма,ТипТекстаПочтовогоСообщения.ПростойТекст);
		Почта = Новый ИнтернетПочта;
		
		Попытка
			Почта.Подключиться(Профиль);
			Почта.Послать(Письмо);
			Почта.Отключиться();
		Исключение
			Пауза(10);
			Почта.Подключиться(Профиль);
			Почта.Послать(Письмо);
			Почта.Отключиться();
		КонецПопытки;
	КонецЕсли;
	Запрос.Текст="УНИЧТОЖИТЬ втОснова";
	Запрос.Выполнить();
КонецПроцедуры	

Процедура ДобавитьПолучателей(Письмо,Адрес,Менеджер)
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект КАК Объект,
	|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(200)) КАК Адрес
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя)
	|	И КонтактнаяИнформация.Объект = &Менеджер";
	
	Письмо.Получатели.Добавить(Адрес);
	Помощники=тзМенеджерПомощник.НайтиСтроки(новый Структура("Менеджер",Менеджер));
	Для Каждого Пом из Помощники цикл
		Запрос.УстановитьПараметр("Менеджер",Пом.Помощник);
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			//Сообщить(Рез.Адрес);
			массивАдресов = оРазложитьСтрокуВМассивПодстрок(Рез.Адрес,";");
			Для каждого эл из массивАдресов цикл
				Если СокрЛП(эл)<>"" тогда
					Письмо.Получатели.Добавить(эл);
				КонецЕсли;
			КонецЦикла;
			//Письмо.Получатели.Добавить(Рез.Адрес);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция оРазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Функция ДополнитьСтрокуЯ(Знач Стр, Длина, Чем=" ", Режим = 0) Экспорт
	
	СимволовДополнить = Длина -  СтрДлина(Стр);
	Добавок = "";
	Для Н=1 по СимволовДополнить Цикл
		Добавок =	Добавок + Чем;
	КонецЦикла;
	Возврат ?(Режим=0, Добавок + Стр, Стр + Добавок);
	
КонецФункции


тзМенеджерПомощник = новый ТаблицаЗначений;
тзМенеджерПомощник.Колонки.Добавить("Менеджер");
тзМенеджерПомощник.Колонки.Добавить("Помощник");
нстр=тзМенеджерПомощник.Добавить();
нстр.Менеджер=Справочники.Пользователи.НайтиПоНаименованию("Бондаренко Евгений",ИСТИНА);
//нстр.Помощник=Справочники.Пользователи.НайтиПоНаименованию("Горюшкина Екатерина Александровна",ИСТИНА);
//+++ 01.07.2016 - рассылка
нстр.Помощник = Справочники.Пользователи.НайтиПоНаименованию("Хачатурян Лусине Карленовна",ИСТИНА); //  lusine@

//+++ 19.02.2018
нстр=тзМенеджерПомощник.Добавить();
//нстр.Менеджер = Справочники.Пользователи.НайтиПоНаименованию("Трошин Денис Олегович",ИСТИНА);     // troshin@YST.RU
//нстр.Помощник = Справочники.Пользователи.НайтиПоНаименованию("Грошко Михаил Анатольевич",Истина); //  roman_nr@YST.RU
нстр.Менеджер = Справочники.Пользователи.НайтиПоНаименованию("Иванов Р.А",Истина);//ivanov_ra@yst.ru 
нстр.Помощник = Справочники.Пользователи.НайтиПоНаименованию("Румянцева Наталья Валерьевна", Истина);// rumyantseva@yst.ru

нстр=тзМенеджерПомощник.Добавить();
нстр.Менеджер=Справочники.Пользователи.НайтиПоНаименованию("Малышев Егор Игоревич",ИСТИНА);
нстр.Помощник=Справочники.Пользователи.НайтиПоНаименованию("Бурова Наталья Ивановна",ИСТИНА);

нстр.Менеджер=Справочники.Пользователи.НайтиПоНаименованию("Никитин Михаил",ИСТИНА);
нстр.Помощник=Справочники.Пользователи.НайтиПоНаименованию("Челышева Татьяна Александровна",ИСТИНА);

нстр.Менеджер=Справочники.Пользователи.НайтиПоНаименованию("Плешивцева Наталья Владимировна",ИСТИНА);
нстр.Помощник=Справочники.Пользователи.НайтиПоНаименованию("Антонов Алексей Вячеславович",ИСТИНА);

нстр.Менеджер=Справочники.Пользователи.НайтиПоНаименованию("Филатова Светлана Владимировна",ИСТИНА);