
Процедура ПриОткрытии()
//Если ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "УчетТолькоПоПодразделениюПользователя") Тогда
//ЭлементОтбора = ЭтотОбъект.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Документ.Подразделение");
//ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
//ЭлементОтбора.ПравоеЗначение =ПараметрыСеанса.ТекущийПользователь.ОсновноеПодразделение;
//ЭлементОтбора.Использование=Истина;
//ЭлементОтбора.РежимОтображения=РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
//конецЕсли;
УстановитьВариантыНастроек();

	Отказать = Неопределено;
	КоллекцияПараметров = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	Недооформлен = Справочники.ЗначенияСвойствОбъектов.НайтиПоКоду("b0170");
	УстановитьПараметрСКД(КоллекцияПараметров, "Недооформлен", Недооформлен, Отказать);

	Электронный = Справочники.ЗначенияСвойствОбъектов.НайтиПоКоду("b0167");
	УстановитьПараметрСКД(КоллекцияПараметров, "Электронный", Электронный, Отказать);
	
КонецПроцедуры

Процедура _СменаВариантаНастройки (Элемент)

Для каждого Настройка Из СхемаКомпоновкиДанных.ВариантыНастроек Цикл

Если Элемент.Текст = Настройка.Представление тогда

КомпоновщикНастроек.ЗагрузитьНастройки(Настройка.Настройки);
ЭлементыФормы.ДействияФормы.Кнопки._ВариантыОтчетов.Текст= Настройка.Представление;
Прервать;

КонецЕсли;

КонецЦикла;

КонецПроцедуры

Процедура УстановитьВариантыНастроек()

КП = ЭлементыФормы.ДействияФормы;
НоваяКнопка = КП.Кнопки.Вставить(1,"_ВариантыОтчетов", ТипКнопкиКоманднойПанели.Подменю, "Ответственные", );
НовоеДействие = Новый Действие("_СменаВариантаНастройки"); ч = 1;

Для каждого Настройка Из СхемаКомпоновкиДанных.ВариантыНастроек Цикл

НоваяКнопка = КП.Кнопки._ВариантыОтчетов.Кнопки.Добавить("Вариант"+Строка(ч), ТипКнопкиКоманднойПанели.Действие, Настройка.Представление, НовоеДействие); ч = ч + 1;

КонецЦикла;

КонецПроцедуры


Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	    	Перем ВыполненноеДействие;

	
	    ЭлементРасшифровкиДанных = ДанныеРасшифровки.Элементы[Расшифровка];
        ЭлементРасшифровкиДанныхПоля = ЭлементРасшифровкиДанных.ПолучитьПоля()[0];
		Если  ЭлементРасшифровкиДанныхПоля.Поле = "Документ"  тогда
			ДокРеализация = ЭлементРасшифровкиДанныхПоля.Значение;

			ЭлементРасшифровки = ДанныеРасшифровки.Элементы[Расшифровка+1];
            ЭлементРасшифровкиДанных = ЭлементРасшифровки.ПолучитьПоля()[0];
            ВидПечатнойФормы = ЭлементРасшифровкиДанных.Значение;

			
			
			СтандартнаяОбработка = Ложь;
			СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
			
			ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
			
			ДоступныеДействия = Новый Массив();
			ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
			
			// Добавляем собственные действия 
			Нов = Новый СписокЗначений;
			Нов.Добавить("Добавить комментарий");
			
			Настройки = ОбработкаРасшифровки.Выполнить(Расшифровка, ВыполненноеДействие, ДоступныеДействия,Нов);
			
			Если ВыполненноеДействие = "Добавить комментарий" Тогда
				Форма = получитьформу("Форма");
				Форма.Документ = ДокРеализация;
				Форма.ВидПечатнойФормы = ВидПечатнойФормы;
				форма.Открыть();
			Иначе
				ЭлементРасшифровкиДанных = ДанныеРасшифровки.Элементы[Расшифровка];
				ЭлементРасшифровкиДанныхПоля = ЭлементРасшифровкиДанных.ПолучитьПоля()[0];
				ОбработкаРасшифровки.ОткрытьЗначение(ЭлементРасшифровкиДанных.Идентификатор, новый ПолеКомпоновкиДанных(ЭлементРасшифровкиДанныхПоля.Поле));
			КонецЕсли;

			
		иначе
			Стандартнаяобработка = Истина;
		конецЕсли;	
	
	
КонецПроцедуры

Процедура УстановитьПараметрСКД(КоллекцияПараметров, ИмяПараметра, ЗначениеПараметра, Отказать)
	
	Парам = Новый ПараметрКомпоновкиДанных(ИмяПараметра);
	
	ПараметрСКД = КоллекцияПараметров.Найти(Парам);
	Если НЕ ПараметрСКД = Неопределено Тогда
		ПараметрСКД.Значение = ЗначениеПараметра;
		ПараметрСКД.Использование = ИСТИНА;
	Иначе
		Отказать = ИСТИНА;
		Сообщить("Не удалось обнаружить параметр """ + ИмяПараметра + """ при заполнении данных общего случая");
	КонецЕсли;
	
КонецПроцедуры // УстановитьПараметрСКД()

