
Процедура ДействияФормыСводПоСертификатам(Кнопка)
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет1");
	Запрос = Новый Запрос;
	Если НачалоГода(ПериодГод) < Дата('20180101000000') Тогда
		//Миронычев
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодаркиКлиентамСрезПоследних.Контрагент.НаименованиеПолное КАК Контрагент,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ПодаркиКлиентамСрезПоследних.VIPСертификат ПОДОБНО ""%#СертификатШиныVIP%""
		|				ТОГДА """"
		|			КОГДА ПодаркиКлиентамСрезПоследних.Сертификат ПОДОБНО ""%#СертификатШины%""
		|				ТОГДА ""автомобильных шин""
		|			ИНАЧЕ """"
		|		КОНЕЦ, """") КАК СертификатШины,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ПодаркиКлиентамСрезПоследних.Сертификат ПОДОБНО ""%#СертификатДискиVIP%""
		|				ТОГДА """"
		|			КОГДА ПодаркиКлиентамСрезПоследних.Сертификат ПОДОБНО ""%#СертификатДиски%""
		|				ТОГДА ""колесных дисков""
		|			ИНАЧЕ """"
		|		КОНЕЦ, """") КАК СертификатДиски,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ПодаркиКлиентамСрезПоследних.Сертификат ПОДОБНО ""%#СертификатАКБVIP%""
		|				ТОГДА """"
		|			КОГДА ПодаркиКлиентамСрезПоследних.Сертификат ПОДОБНО ""%#СертификатАКБ%""
		|				ТОГДА ""аккумуляторных батарей""
		|			ИНАЧЕ """"
		|		КОНЕЦ, """") КАК СертификатАКБ,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ПодаркиКлиентамСрезПоследних.Сертификат ПОДОБНО ""%#СертификатАКСVIP%""
		|				ТОГДА """"
		|			КОГДА ПодаркиКлиентамСрезПоследних.Сертификат ПОДОБНО ""%#СертификатАКС%""
		|				ТОГДА ""аксессуаров""
		|			ИНАЧЕ """"
		|		КОНЕЦ, """") КАК СертификатАКС,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ПодаркиКлиентамСрезПоследних.VIPСертификат ПОДОБНО ""%#СертификатШиныVIP%""
		|				ТОГДА ""автомобильных шин""
		|			ИНАЧЕ """"
		|		КОНЕЦ, """") КАК СертификатШиныVIP,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ПодаркиКлиентамСрезПоследних.VIPСертификат ПОДОБНО ""%#СертификатДискиVIP%""
		|				ТОГДА ""колесных дисков""
		|			ИНАЧЕ """"
		|		КОНЕЦ, """") КАК СертификатДискиVIP,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ПодаркиКлиентамСрезПоследних.VIPСертификат ПОДОБНО ""%#СертификатАКБVIP%""
		|				ТОГДА ""аккумуляторных батарей""
		|			ИНАЧЕ """"
		|		КОНЕЦ, """") КАК СертификатАКБVIP,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ПодаркиКлиентамСрезПоследних.VIPСертификат ПОДОБНО ""%#СертификатАКСVIP%""
		|				ТОГДА ""аксессуаров""
		|			ИНАЧЕ """"
		|		КОНЕЦ, """") КАК СертификатАКСVIP,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВложенныйЗапрос.Поле2, 0) = 0
		|			ТОГДА ВложенныйЗапрос1.Поле2
		|		ИНАЧЕ ВложенныйЗапрос.Поле2
		|	КОНЕЦ КАК Регион,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВложенныйЗапрос.Поле3, 0) = 0
		|			ТОГДА ВложенныйЗапрос1.Поле4
		|		ИНАЧЕ ВложенныйЗапрос.Поле3
		|	КОНЕЦ КАК Город,
		|	ПодаркиКлиентамСрезПоследних.Контрагент.ОсновнойМенеджерКонтрагента КАК ОсновнойМенеджерКонтрагента
		|ПОМЕСТИТЬ Список
		|ИЗ
		|	РегистрСведений.ПодаркиКлиентам КАК ПодаркиКлиентамСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			КонтактнаяИнформация.Объект КАК Объект,
		|			КонтактнаяИнформация.Поле2 КАК Поле2,
		|			КонтактнаяИнформация.Поле4 КАК Поле3
		|		ИЗ
		|			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ГДЕ
		|			КонтактнаяИнформация.Тип = &Тип
		|			И КонтактнаяИнформация.Вид = &Вид) КАК ВложенныйЗапрос
		|		ПО ПодаркиКлиентамСрезПоследних.Контрагент = ВложенныйЗапрос.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			КонтактнаяИнформация.Объект КАК Объект,
		|			КонтактнаяИнформация.Поле2 КАК Поле2,
		|			КонтактнаяИнформация.Поле4 КАК Поле4
		|		ИЗ
		|			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ГДЕ
		|			КонтактнаяИнформация.Тип = &Тип
		|			И КонтактнаяИнформация.Вид = &ВидФ) КАК ВложенныйЗапрос1
		|		ПО ПодаркиКлиентамСрезПоследних.Контрагент = ВложенныйЗапрос1.Объект
		|ГДЕ
		|	ПодаркиКлиентамСрезПоследних.Период МЕЖДУ &НачГода И &КонГода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Список.Контрагент,
		|	Список.Регион,
		|	Список.Город,
		|	ВЫБОР
		|		КОГДА Список.СертификатШины <> """"
		|				И Список.СертификатДиски <> """"
		|				И Список.СертификатАКБ <> """"
		|				И Список.СертификатАКС <> """"
		|			ТОГДА Список.СертификатШины + "" , "" + Список.СертификатДиски + "" , "" + Список.СертификатАКБ + "" и "" + Список.СертификатАКС
		|		КОГДА Список.СертификатШины <> """"
		|				И Список.СертификатДиски <> """"
		|				И Список.СертификатАКБ <> """"
		|				И Список.СертификатАКС = """"
		|			ТОГДА Список.СертификатШины + "" , "" + Список.СертификатДиски + "" и "" + Список.СертификатАКБ
		|		КОГДА Список.СертификатШины <> """"
		|				И Список.СертификатДиски <> """"
		|				И Список.СертификатАКБ = """"
		|				И Список.СертификатАКС = """"
		|			ТОГДА Список.СертификатШины + "" и "" + Список.СертификатДиски
		|		КОГДА Список.СертификатШины <> """"
		|				И Список.СертификатДиски = """"
		|				И Список.СертификатАКБ = """"
		|				И Список.СертификатАКС = """"
		|			ТОГДА Список.СертификатШины
		|		КОГДА Список.СертификатШины <> """"
		|				И Список.СертификатДиски <> """"
		|				И Список.СертификатАКБ = """"
		|				И Список.СертификатАКС <> """"
		|			ТОГДА Список.СертификатШины + "" , "" + Список.СертификатДиски + "" и "" + Список.СертификатАКС
		|		КОГДА Список.СертификатШины <> """"
		|				И Список.СертификатДиски = """"
		|				И Список.СертификатАКБ = """"
		|				И Список.СертификатАКС <> """"
		|			ТОГДА Список.СертификатШины + "" и "" + Список.СертификатАКС
		|		КОГДА Список.СертификатШины = """"
		|				И Список.СертификатДиски = """"
		|				И Список.СертификатАКБ = """"
		|				И Список.СертификатАКС <> """"
		|			ТОГДА Список.СертификатАКС
		|		КОГДА Список.СертификатШины <> """"
		|				И Список.СертификатДиски = """"
		|				И Список.СертификатАКБ <> """"
		|				И Список.СертификатАКС = """"
		|			ТОГДА Список.СертификатШины + "" и "" + Список.СертификатАКБ
		|		КОГДА Список.СертификатШины = """"
		|				И Список.СертификатДиски = """"
		|				И Список.СертификатАКБ <> """"
		|				И Список.СертификатАКС = """"
		|			ТОГДА Список.СертификатАКБ
		|		КОГДА Список.СертификатШины = """"
		|				И Список.СертификатДиски <> """"
		|				И Список.СертификатАКБ = """"
		|				И Список.СертификатАКС = """"
		|			ТОГДА Список.СертификатДиски
		|	КОНЕЦ КАК Сертификат,
		|	ВЫБОР
		|		КОГДА Список.СертификатШиныVIP <> """"
		|				И Список.СертификатДискиVIP <> """"
		|				И Список.СертификатАКБVIP <> """"
		|				И Список.СертификатАКСVIP <> """"
		|			ТОГДА Список.СертификатШиныVIP + "" , "" + Список.СертификатДискиVIP + "" , "" + Список.СертификатАКБVIP + "" и "" + Список.СертификатАКСVIP
		|		КОГДА Список.СертификатШиныVIP <> """"
		|				И Список.СертификатДискиVIP <> """"
		|				И Список.СертификатАКБVIP <> """"
		|				И Список.СертификатАКСVIP = """"
		|			ТОГДА Список.СертификатШиныVIP + "" , "" + Список.СертификатДискиVIP + "" и "" + Список.СертификатАКБVIP
		|		КОГДА Список.СертификатШиныVIP <> """"
		|				И Список.СертификатДискиVIP <> """"
		|				И Список.СертификатАКБVIP = """"
		|				И Список.СертификатАКСVIP = """"
		|			ТОГДА Список.СертификатШиныVIP + "" и "" + Список.СертификатДискиVIP
		|		КОГДА Список.СертификатШиныVIP <> """"
		|				И Список.СертификатДискиVIP = """"
		|				И Список.СертификатАКБVIP = """"
		|				И Список.СертификатАКСVIP = """"
		|			ТОГДА Список.СертификатШиныVIP
		|		КОГДА Список.СертификатШиныVIP <> """"
		|				И Список.СертификатДискиVIP <> """"
		|				И Список.СертификатАКБVIP = """"
		|				И Список.СертификатАКСVIP <> """"
		|			ТОГДА Список.СертификатШиныVIP + "" , "" + Список.СертификатДискиVIP + "" и "" + Список.СертификатАКСVIP
		|		КОГДА Список.СертификатШиныVIP <> """"
		|				И Список.СертификатДискиVIP = """"
		|				И Список.СертификатАКБVIP = """"
		|				И Список.СертификатАКСVIP <> """"
		|			ТОГДА Список.СертификатШиныVIP + "" и "" + Список.СертификатАКСVIP
		|		КОГДА Список.СертификатШиныVIP = """"
		|				И Список.СертификатДискиVIP = """"
		|				И Список.СертификатАКБVIP = """"
		|				И Список.СертификатАКСVIP <> """"
		|			ТОГДА Список.СертификатАКСVIP
		|		КОГДА Список.СертификатШиныVIP <> """"
		|				И Список.СертификатДискиVIP = """"
		|				И Список.СертификатАКБVIP <> """"
		|				И Список.СертификатАКСVIP = """"
		|			ТОГДА Список.СертификатШиныVIP + "" и "" + Список.СертификатАКБVIP
		|		КОГДА Список.СертификатШиныVIP = """"
		|				И Список.СертификатДискиVIP = """"
		|				И Список.СертификатАКБVIP <> """"
		|				И Список.СертификатАКСVIP = """"
		|			ТОГДА Список.СертификатАКБVIP
		|		КОГДА Список.СертификатШиныVIP = """"
		|				И Список.СертификатДискиVIP <> """"
		|				И Список.СертификатАКБVIP = """"
		|				И Список.СертификатАКСVIP = """"
		|			ТОГДА Список.СертификатДискиVIP
		|	КОНЕЦ КАК СертификатVIP,
		|	Список.ОсновнойМенеджерКонтрагента
		|ПОМЕСТИТЬ Свод
		|ИЗ
		|	Список КАК Список
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Свод.Контрагент,
		|	Свод.Регион,
		|	Свод.Город,
		|	Свод.Сертификат КАК Сертификат,
		|	Свод.СертификатVIP КАК СертификатVIP,
		|	Свод.ОсновнойМенеджерКонтрагента КАК Менеджер
		|ИЗ
		|	Свод КАК Свод
		|ГДЕ
		|	(Свод.Сертификат <> """"
		|			ИЛИ Свод.СертификатVIP <> """")
		|ИТОГИ
		|	КОЛИЧЕСТВО(Сертификат),
		|	КОЛИЧЕСТВО(СертификатVIP)
		|ПО
		|	Менеджер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Список";
		Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
		Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
		Запрос.УстановитьПараметр("ВидФ", Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
		Запрос.УстановитьПараметр("КонецПериода", КонецГода(ТекущаяДата()));
		Запрос.УстановитьПараметр("НачГода", НачалоГода(ПериодГод));
		Запрос.УстановитьПараметр("КонГода", КонецГода(ПериодГод));
	Иначе
		Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПериодГод));
		Запрос.УстановитьПараметр("КонецПериода", КонецГода(ПериодГод));
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПодаркиКлиентамСрезПоследних.Менеджер,
		               |	ПодаркиКлиентамСрезПоследних.Контрагент КАК КонтрагентСсылка,
		               |	КИ.Регион,
		               |	КИ.Город,
		               |	ВЫБОР
		               |		КОГДА ПодаркиКлиентамСрезПоследних.СертификатШины > 0
		               |			ТОГДА ""автомобильных шин""
		               |		ИНАЧЕ """"
		               |	КОНЕЦ КАК СертификатШины,
		               |	ВЫБОР
		               |		КОГДА ПодаркиКлиентамСрезПоследних.СертификатДиски > 0
		               |			ТОГДА ""колесных дисков""
		               |		ИНАЧЕ """"
		               |	КОНЕЦ КАК СертификатДиски,
		               |	ВЫБОР
		               |		КОГДА ПодаркиКлиентамСрезПоследних.СертификатАксессуары > 0
		               |			ТОГДА ""аксессуаров""
		               |		ИНАЧЕ """"
		               |	КОНЕЦ КАК СертификатАКС,
		               |	ВЫБОР
		               |		КОГДА ПодаркиКлиентамСрезПоследних.СертификатШиныVIP > 0
		               |			ТОГДА ""автомобильных шин""
		               |		ИНАЧЕ """"
		               |	КОНЕЦ КАК СертификатШиныVIP,
		               |	ВЫБОР
		               |		КОГДА ПодаркиКлиентамСрезПоследних.СертификатДискиVIP > 0
		               |			ТОГДА ""колесных дисков""
		               |		ИНАЧЕ """"
		               |	КОНЕЦ КАК СертификатДискиVIP,
		               |	ВЫБОР
		               |		КОГДА ПодаркиКлиентамСрезПоследних.СертификатАксессуарыVIP > 0
		               |			ТОГДА ""аксессуаров""
		               |		ИНАЧЕ """"
		               |	КОНЕЦ КАК СертификатАКСVIP,
		               |	ПодаркиКлиентамСрезПоследних.Контрагент.НаименованиеПолное КАК Контрагент,
		               |	ПодаркиКлиентамСрезПоследних.БрендыСертификатаДиски,
		               |	ПодаркиКлиентамСрезПоследних.СертификатШины КАК КоличествоШины,
		               |	ПодаркиКлиентамСрезПоследних.СертификатДиски КАК КоличествоДиски,
		               |	ПодаркиКлиентамСрезПоследних.СертификатАксессуары КАК КоличествоАксессуары,
		               |	ПодаркиКлиентамСрезПоследних.СертификатШиныVIP КАК КоличествоШиныVIP,
		               |	ПодаркиКлиентамСрезПоследних.СертификатДискиVIP КАК КоличествоДискиVIP,
		               |	ПодаркиКлиентамСрезПоследних.СертификатАксессуарыVIP КАК КоличествоАксессуарыVIP
		               |ИЗ
		               |	РегистрСведений.ПодаркиКлиентам.СрезПоследних(, ) КАК ПодаркиКлиентамСрезПоследних
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ЮрКИ.Объект КАК Объект,
		               |			ВЫБОР
		               |				КОГДА ПОДСТРОКА(ЮрКИ.Регион, 1, 1) = """"
		               |					ТОГДА ФактКИ.Поле2
		               |				ИНАЧЕ ЮрКИ.Регион
		               |			КОНЕЦ КАК Регион,
		               |			ВЫБОР
		               |				КОГДА ПОДСТРОКА(ЮрКИ.Город, 1, 1) = """"
		               |					ТОГДА ФактКИ.Поле4
		               |				ИНАЧЕ ЮрКИ.Город
		               |			КОНЕЦ КАК Город
		               |		ИЗ
		               |			(ВЫБРАТЬ
		               |				КонтактнаяИнформация.Объект КАК Объект,
		               |				КонтактнаяИнформация.Поле2 КАК Регион,
		               |				КонтактнаяИнформация.Поле4 КАК Город
		               |			ИЗ
		               |				РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		               |			ГДЕ
		               |				КонтактнаяИнформация.Вид.Код = ""00001"") КАК ЮрКИ
		               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ФактКИ
		               |				ПО ЮрКИ.Объект = ФактКИ.Объект
		               |					И (ФактКИ.Вид.Код = ""00002"")) КАК КИ
		               |		ПО ПодаркиКлиентамСрезПоследних.Контрагент = КИ.Объект
		               |ГДЕ
		               |	ПодаркиКлиентамСрезПоследних.Период МЕЖДУ &НачалоПериода И &КонецПериода";
	КонецЕсли;
	Результат = Запрос.Выполнить();

	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Контрагент = "";
		Регион = "";
		Город = "";
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		Контрагент = СтрЗаменить(ВыборкаДетальныеЗаписи.Контрагент,"Индивидуальный предприниматель", "ИП");
		Контрагент = СтрЗаменить(Контрагент,"Индивидуалный Предприниматель", "ИП");
		Контрагент = СтрЗаменить(Контрагент,"Индивидуальный Предприниматель", "ИП");
		Контрагент = СтрЗаменить(Контрагент,"Общество с ограниченнной ответственностью", "ООО");
		Контрагент = СтрЗаменить(Контрагент,"Общество с ограниченной ответственностью", "ООО");
		ОбластьДетальныхЗаписей.Параметры.Контрагент = Контрагент;
		Регион = СтрЗаменить(ВыборкаДетальныеЗаписи.Регион, " обл", " область");
		Регион = СтрЗаменить(Регион, " г", "");
		Если Найти(Регион, " Респ" ) > 0 тогда
			Регион = СтрЗаменить(Регион, " Респ", "");
			Регион = "Республика " + Регион;
		КонецЕсли;
		Регион = СтрЗаменить(Регион, "Севастополь г", "Республика Крым");
		Регион = СтрЗаменить(Регион, "Москва г", "Московская область");
		Регион = СтрЗаменить(Регион, "Санкт-Петербург г", "Ленинградская область");
		ОбластьДетальныхЗаписей.Параметры.Регион = ?(Регион = "", "", "в регионе: " + Регион);
		Если ВыборкаДетальныеЗаписи.Город = "" Тогда
			Если ВыборкаДетальныеЗаписи.Регион = "Санкт-Петербург г" 
				ИЛИ ВыборкаДетальныеЗаписи.Регион = "Москва г"
				ИЛИ ВыборкаДетальныеЗаписи.Регион = "Севастополь г"
				Тогда
				Город = ВыборкаДетальныеЗаписи.Регион;
			КонецЕсли;
		Иначе
			Город = ВыборкаДетальныеЗаписи.Город;
		КонецЕсли;
		Город = СтрЗаменить(Город, " г", "");
		ОбластьДетальныхЗаписей.Параметры.Город = ?(Город = "", "","г. " + Город); 
		
		Если НачалоГода(ПериодГод) >= Дата('20180101000000') Тогда
			
			КоличествоСертификатов = 0;
			КоличествоСертификатов = Макс(ВыборкаДетальныеЗаписи.КоличествоШины, ВыборкаДетальныеЗаписи.КоличествоДиски, ВыборкаДетальныеЗаписи.КоличествоАксессуары);
			
			Сертификат = "";
			Если СтрДлина(ВыборкаДетальныеЗаписи.СертификатШины) > 0 Тогда
				Сертификат = Сертификат + ВыборкаДетальныеЗаписи.СертификатШины;
			КонецЕсли;
			Если СтрДлина(ВыборкаДетальныеЗаписи.СертификатДиски) > 0 Тогда
				Сертификат = Сертификат + ?(СтрДлина(Сертификат) > 0, ", ", "") + ВыборкаДетальныеЗаписи.СертификатДиски;
				Если СтрДлина(ВыборкаДетальныеЗаписи.БрендыСертификатаДиски) > 0 Тогда
					Сертификат = Сертификат + " " + СокрЛП(ВыборкаДетальныеЗаписи.БрендыСертификатаДиски);
				КонецЕсли;
			КонецЕсли;
			Если СтрДлина(ВыборкаДетальныеЗаписи.СертификатАКС) > 0 Тогда
				Сертификат = Сертификат + ?(СтрДлина(Сертификат) > 0, ", ", "") + ВыборкаДетальныеЗаписи.СертификатАКС;
			КонецЕсли;
			ОбластьДетальныхЗаписей.Параметры.Сертификат = Сертификат;
			
			Для i=1 ПО КоличествоСертификатов Цикл
				ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
			КонецЦикла;
			
			
			КоличествоСертификатовVIP = 0;
			КоличествоСертификатовVIP = Макс(ВыборкаДетальныеЗаписи.КоличествоШиныVIP, ВыборкаДетальныеЗаписи.КоличествоДискиVIP, ВыборкаДетальныеЗаписи.КоличествоАксессуарыVIP);
			
			ОбластьДетальныхЗаписей.Параметры.Сертификат = "";
			СертификатVIP = "";
			Если СтрДлина(ВыборкаДетальныеЗаписи.СертификатШиныVIP) > 0 Тогда
				СертификатVIP = СертификатVIP + ВыборкаДетальныеЗаписи.СертификатШиныVIP;
			КонецЕсли;
			Если СтрДлина(ВыборкаДетальныеЗаписи.СертификатДискиVIP) > 0 Тогда
				СертификатVIP = СертификатVIP + ?(СтрДлина(СертификатVIP) > 0, ", ", "") + ВыборкаДетальныеЗаписи.СертификатДискиVIP;
				Если СтрДлина(ВыборкаДетальныеЗаписи.БрендыСертификатаДиски) > 0 Тогда
					СертификатVIP = СертификатVIP + " " + СокрЛП(ВыборкаДетальныеЗаписи.БрендыСертификатаДиски);
				КонецЕсли;
			КонецЕсли;
			Если СтрДлина(ВыборкаДетальныеЗаписи.СертификатАКСVIP) > 0 Тогда
				СертификатVIP = СертификатVIP + ?(СтрДлина(СертификатVIP) > 0, ", ", "") + ВыборкаДетальныеЗаписи.СертификатАКСVIP;
			КонецЕсли;
			ОбластьДетальныхЗаписей.Параметры.СертификатVIP = СертификатVIP;
			
			Для i=1 ПО КоличествоСертификатовVIP Цикл
				ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
			КонецЦикла;
		Иначе
			ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
		КонецЕсли;
			
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
	ТабДок.Показать();

КонецПроцедуры


Процедура ПриОткрытии()
	
	ПериодГод = НачалоГода(ТекущаяДата());
	
КонецПроцедуры

