Функция Печать() Экспорт
	
	Если Не Метаданные.Имя = "УправлениеТорговлей" Тогда
		Сообщить("Печатная форма предназначена для использования в конфигурации ""Управление торговлей""", СтатусСообщения.Внимание);
		возврат неопределено;
	КонецЕсли;
	
	
	Если СсылкаНаОбъект.Склад.Родитель <> справочники.Склады.НайтиПоКоду("01441") тогда
		Сообщить("Данная печатная форма предназначена только для Списания со складов рекламной продукции!");
		возврат неопределено;
	КонецЕсли;
	
		возврат ПечатьЗаявкиАкта(СсылкаНаОбъект, "Заявка");
	//	Возврат ПечатьЗаявкиАкта(СсылкаНаОбъект, "Акт");
	
КонецФункции // Печать

Функция ПечатьЗаявкиАкта(СсылкаНаОбъект, ИмяМакета="Заявка")
			
			
	ТабДокумент  = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Спецификация_"+ИмяМакета; //+++ 21.01.2015

	Макет = ПолучитьМакет(ИмяМакета);	
	
ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Дата  	 = Формат(СсылкаНаОбъект.Дата, "ДЛФ=DDT");
	ОбластьШапка.Параметры.Номер  	 = СокрЛП(СсылкаНаОбъект.Номер);
	
Если ИмяМакета="Заявка"	тогда
	ОбластьШапка.Параметры.ТекстВодитель  = СокрЛП(СсылкаНаОбъект.МаркаАвтомобиля)+" "+СокрЛП(СсылкаНаОбъект.ГосНомерАвтомобиля)
											+" "+СокрЛП(СсылкаНаОбъект.Водитель) //+ " "+СокрЛП(СсылкаНаОбъект.ТелефонВодителя)
											;
//+++ Штрих-Код номера документа - февраль 2012
	// требуется установленная компонента 1CBarCode.exe
	#Если Клиент тогда
    	ОбШтрихКодСообщение = глТорговоеОборудование.ПолучитьШтрихКодПоДокументу(СсылкаНаОбъект);
		попытка
		ОбШтрихКод=ОбластьШапка.Рисунки.ШК.Объект;
		ОбШтрихКод.Сообщение = ОбШтрихКодСообщение; 
		ОбШтрихКод.ТекстКода = ОбШтрихКодСообщение; 
		//ОбШтрихКод.ВидимостьКС = ЛОЖЬ; // не показывать контрольныйСимвол в тексте
		исключение
		 //нет компоненты 1CBarCode.exe
	    КонецПопытки; 
	#КонецЕсли 
Иначе
	ОбластьШапка.Параметры.Контрагент = СсылкаНаОбъект.Контрагент.НаименованиеПолное;
КонецЕсли;	

ТабДокумент.Вывести(ОбластьШапка);

Если ИмяМакета="Заявка"	тогда
 ОбластьПокупатель = Макет.ПолучитьОбласть("Покупатель");
	СведенияОПокупателе       = СведенияОЮрФизЛице(СсылкаНаОбъект.Контрагент,       СсылкаНаОбъект.Дата);
	#Если Клиент тогда
	ОбластьПокупатель.Параметры.РеквизитыПокупателя  = ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,ФактическийАдрес,Телефоны,"); 
	#КонецЕсли
	ТабДокумент.Вывести(ОбластьПокупатель);
	
КонецЕсли;
 
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьИтоги = Макет.ПолучитьОбласть("СтрокаИтоги");
	ОбластьИтоги.Параметры.Количество = СсылкаНаОбъект.Товары.Итог("Количество");		
	
//------------------------------------------------------------------------	
	ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаТаблицы");
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	СписаниеТоваровТовары.НомерСтроки,
               |	СписаниеТоваровТовары.Номенклатура.Код как Код,
			   |	СписаниеТоваровТовары.Номенклатура,
               |	СписаниеТоваровТовары.Количество,
               |	СписаниеТоваровТовары.ЕдиницаИзмерения,
               |	СписаниеТоваровТовары.Склад,
               |	ЕстьNull(ТоварыНаСкладахОстатки.КоличествоОстаток,0) как КоличествоОстаток
               |ИЗ
               |	(ВЫБРАТЬ
              |		Товары.НомерСтроки КАК НомерСтроки,
                |		Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
               |		Товары.Количество КАК Количество,
                 |		Товары.Номенклатура КАК Номенклатура,
				    |		Товары.Ссылка.Склад как Склад
			   //|		, Товары.СерияНоменклатуры КАК СерияНоменклатуры,
			   //|		Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			   //|		Товары.Вес КАК Вес,
			   
			   //|		Товары.Цена КАК Цена,
               //|		Товары.Сумма КАК Сумма
			   |	ИЗ
               |		Документ.СписаниеТоваров.Товары КАК Товары
               |	ГДЕ
               |		Товары.Ссылка = &ТекДок) КАК СписаниеТоваровТовары
               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
               |		ПО СписаниеТоваровТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
               |			И СписаниеТоваровТовары.Склад = ТоварыНаСкладахОстатки.Склад";

Запрос.УстановитьПараметр("ТекДок", СсылкаНаОбъект);

Результат = Запрос.Выполнить();
ТабЧасть = Результат.Выбрать();

  Пока ТабЧасть.Следующий() Цикл
//для каждого ТабЧасть из СсылкаНаОбъект.Товары Цикл
ОбластьСтроки.Параметры.Заполнить( ТабЧасть );

//++Смирнов для Лагерной и Радуга Питер убираем LegeArtis
		Если СсылкаНаОбъект.Контрагент.Код="93136  " или  СсылкаНаОбъект.Контрагент.Код="91777  " тогда
			ОбластьСтроки.Параметры.Номенклатура = СтрЗаменить(ТабЧасть.Номенклатура,"LegeArtis","");
		Иначе
			ОбластьСтроки.Параметры.Номенклатура = ТабЧасть.Номенклатура.НаименованиеПолное;
		КонецЕсли;
	
		ТабДокумент.Вывести(ОбластьСтроки);
	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьИтоги);

//--------------------------------------------------------------------------------------------	
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьПодвал.Параметры.Водитель = ?( СокрЛП(СсылкаНаОбъект.Водитель)="", "/______________/", СокрЛП(СсылкаНаОбъект.Водитель));
	
	//Только для Акта
	Если  ИмяМакета="Акт" тогда
	//СведенияОбОрганизации     = СведенияОЮрФизЛице(СсылкаНаОбъект.Организация,      СсылкаНаОбъект.Дата);	
	СведенияОПокупателе       = СведенияОЮрФизЛице(СсылкаНаОбъект.Контрагент,       СсылкаНаОбъект.Дата);
	#Если Клиент тогда
	//ОбластьПодвал.Параметры.РеквизитыОрганизации = ОписаниеОрганизации(СведенияОбОрганизации,"ПолноеНаименование,ИНН,КПП,ОГРН,ЮридическийАдрес,Телефоны,"); 
	ОбластьПодвал.Параметры.РеквизитыПокупателя  = ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,ИНН,КПП,ОГРН,ФактическийАдрес,Телефоны,"); 
	//+++
	//СуммаКПрописи = ОбластьИтоги.Параметры.Сумма; // + ОбластьИтоги.СуммаНДС;
	//СуммаНДС      = ОбластьИтоги.Параметры.СуммаНДС;
	//ОбластьПодвал.Параметры.СуммаПрописью ="Всего наименований " + ТабЧасть.Количество()
											//+ ", на сумму " + ФорматСумм(СуммаКПрописи, справочники.Валюты.НайтиПоКоду(643))+
											//" "+СформироватьСуммуПрописью(СуммаКПрописи,  справочники.Валюты.НайтиПоКоду(643))+
											//" (в т.ч. НДС "+ ФорматСумм(СуммаНДС, справочники.Валюты.НайтиПоКоду(643))+
											//" "+СформироватьСуммуПрописью(СуммаНДС,  справочники.Валюты.НайтиПоКоду(643))+")";
	#КонецЕсли
	КонецЕсли;
 	ТабДокумент.Вывести(ОбластьПодвал);
	
	
//---------------04.06.2014----------------------------
ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
ТабДокумент.АвтоМасштаб = Истина; // по ширине Страницы
	
	Возврат ТабДокумент;

КонецФункции 	