
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("началоПериода1"));
    Если Параметр <> Неопределено Тогда
        Параметр.Значение = Дата1;
        Параметр.Использование = Истина;
	КонецЕсли;
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода1"));
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = КонецДня(Дата2);
		Параметр.Использование = Истина;
	КонецЕсли;
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаТ"));
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Дата("20160101000000");
		Параметр.Использование = Истина;
	КонецЕсли;
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Диски"));
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Перечисления.ВидыТоваров.Диски;
		Параметр.Использование = Истина;
	КонецЕсли;
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("АнгарИ"));
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Справочники.Склады.НайтиПоКоду("01475");
		Параметр.Использование = Истина;
	КонецЕсли;
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокСкладов"));
	Если Параметр <> Неопределено Тогда
		Список = Новый СписокЗначений;
		список.Добавить(Справочники.Склады.НайтиПоКоду("02162"));
		список.Добавить(Справочники.Склады.НайтиПоКоду("01167"));
        Параметр.Значение = список;
        Параметр.Использование = Истина;
	КонецЕсли;
	
	//Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("началоПериода"));
	//Если Параметр <> Неопределено Тогда
	//	Параметр.Значение = дата("20150101000000");
	//	Параметр.Использование = Истина;
	//КонецЕсли;
	//
	//Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	//Если Параметр <> Неопределено Тогда
	//	Параметр.Значение = дата("20161231000000");;
	//	Параметр.Использование = Истина;
	//КонецЕсли;


КонецПроцедуры
