// функции для совместимости кода 
&НаКлиенте
Функция сбисПолучитьФорму(ИмяФормы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Попытка
			ЭтотОбъект="";
		Исключение
		КонецПопытки;
		Возврат ПолучитьФорму("ВнешняяОбработка.СБИС.Форма."+ИмяФормы);
	КонецЕсли;
	Возврат ЭтотОбъект.ПолучитьФорму(ИмяФормы);
КонецФункции
&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы[ИмяЭлемента];
	КонецЕсли;
	Возврат Форма.ЭлементыФормы[ИмяЭлемента];
КонецФункции
&НаКлиенте
Функция сбисПолучитьСтраницу(Элемент, ИмяСтраницы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Элемент.ПодчиненныеЭлементы[ИмяСтраницы];
	КонецЕсли;
	Возврат Элемент.Страницы[ИмяСтраницы];
КонецФункции
&НаКлиенте
Функция сбисУстановитьКонтекстноеМеню(Форма, Элемент, ИмяМеню)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Для Каждого ЭлементМеню Из Элемент.КонтекстноеМеню.ПодчиненныеЭлементы Цикл
			Если ЭлементМеню.Имя = ИмяМеню	Тогда 
				ЭлементМеню.Видимость = Истина;
			Иначе
				ЭлементМеню.Видимость = Ложь;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Элемент.КонтекстноеМеню=Форма.ЭлементыФормы[ИмяМеню];
	КонецЕсли;

КонецФункции
//------------------------------------------------------

&НаКлиенте
Функция ОбновитьКонтент(Кэш) Экспорт
// Функция выполняет переход в первый подраздел раздела Продажа	
	Возврат Кэш.ГлавноеОкно.ПерейтиВРаздел("АккордеонСправочникиДок066");
КонецФункции
&НаКлиенте
Процедура НаСменуРаздела(Кэш) Экспорт
// Процедура обновляет панель массовых операций, панель фильтра, контекстное меню при смене раздела		
	//СписокСостояний = Новый СписокЗначений();
	//СписокСостояний.Добавить("Все документы");
	//СписокСостояний.Добавить("Недоставленные");
	//СписокСостояний.Добавить("Не получен ответ");
	//СписокСостояний.Добавить("Утвержденные");
	//СписокСостояний.Добавить("Отклоненные");
	//СписокСостояний.Добавить("С ошибками");
	//СписокСостояний.Добавить("Удаленные");
	//СписокСостояний.Добавить("Удалено контрагентом");
	//СписокСостояний.Добавить("Несопоставленные");
	//
	ГлавноеОкно = сбисПолучитьФорму("ФормаГлавноеОкно");
	//ГлавноеОкно.СписокСостояний = СписокСостояний;
	//ФильтрОчистить(Кэш);

	//ГлавноеОкно.ФильтрОбновитьПанель();

	//сбисУстановитьКонтекстноеМеню(ГлавноеОкно, сбисЭлементФормы(ГлавноеОкно,"Таблица_РеестрДокументов"), "КонтекстноеМенюПродажа");
	//ПанельМассовыхОпераций = сбисЭлементФормы(ГлавноеОкно,"ПанельМассовыхОпераций");
	//ПанельМассовыхОпераций.ТекущаяСтраница = сбисПолучитьСтраницу(ПанельМассовыхОпераций,"Справочники");
		
	//сбисЭлементФормы(ГлавноеОкно,"Таблица_РеестрДокументов").ПодчиненныеЭлементы.Таблица_РеестрДокументовОтмечен.Видимость = Истина;
	
	сбисЭлементФормы(ГлавноеОкно,"ПанельТулбар").Видимость = Истина;
	сбисЭлементФормы(ГлавноеОкно,"ПанельФильтра").Видимость = Ложь;
	сбисЭлементФормы(ГлавноеОкно,"ПоказатьПанельФильтра").Видимость = Ложь;
КонецПроцедуры
&НаКлиенте
Процедура НавигацияУстановитьПанель() Экспорт
// Процедура устанавливает панель навигации на 1ую страницу и скрывает панель	
	ГлавноеОкно = сбисПолучитьФорму("ФормаГлавноеОкно");
	ГлавноеОкно.ФильтрСтраница=1;
	сбисЭлементФормы(ГлавноеОкно,"ПанельНавигации").Видимость=Ложь;
	сбисЭлементФормы(ГлавноеОкно,"ЗаписейНаСтранице1С").Видимость=Ложь;
	сбисЭлементФормы(ГлавноеОкно,"ЗаписейНаСтранице").Видимость=Ложь;
КонецПроцедуры	
&НаКлиенте
Процедура ФильтрОчистить(Кэш) Экспорт
// Процедура устанавливает значения фильтра по-умолчанию для текущего раздела	
КонецПроцедуры