перем Параметр экспорт;

Процедура ДействияФормыкнСформировать(Док) экспорт
	Настройки = КомпоновщикНастроек.Настройки;
	
	Если Док<>Документы.ЗаданиеНаЗаказПоставщику.ПустаяСсылка() тогда
		
		Отбор = Настройки.Отбор;
		отбор.Элементы.Очистить();
		
		НовыйЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ПолеОтбора = Новый ПолеКомпоновкиДанных("ЗаданиеНаЗаказПоставщику");
		НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
		НовыйЭлементОтбора.Использование  = Истина;
		НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение = Док;
		
		НовыйЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ПолеОтбора = Новый ПолеКомпоновкиДанных("Разница");
		НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
		НовыйЭлементОтбора.Использование  = Истина;
		НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;
		НовыйЭлементОтбора.ПравоеЗначение = 0;
		
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
	Настройки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	Результат = ЭлементыФормы.Результат;
	Результат.Очистить();
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	Результат.ОтображатьСетку = ложь;
	Результат.ОтображатьЗаголовки = ложь;
	Результат.Показать();
	
	Параметр = неопределено;
	
	ЭтаФорма.Закрыть();
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	Если Параметр <>неопределено тогда
		Форма = ПолучитьФорму("ФормаОтчета");
		Если НЕ Форма.Открыта() Тогда
			Форма.Открыть();
			Форма.ДействияФормыкнСформировать(Параметр);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
