
Процедура КнопкаСформироватьНажатие(Кнопка)
///////////////
Если СокрЛП(ПочтовыйАдрес) <> "" Тогда
	МенеджерКонтрагент=РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	МенеджерКонтрагент.Объект = Контрагент;
	МенеджерКонтрагент.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
	МенеджерКонтрагент.Вид = Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("00015"); // почтовый адрес
	
	//МенеджерКонтрагент.Прочитать();
	
	МенеджерКонтрагент.Представление = ПочтовыйАдрес;
	МенеджерКонтрагент.Записать();
КонецЕсли;
	
КонецПроцедуры
