
Перем мДлинаСуток;

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		ОсновноеИзображение = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	// Вставить содержимое обработчика.
	Если Не (ПараметрыСеанса.ИдетОбменФизЛицКонтрагентов) и Не (Константы.ЗапретРедактированияФизическогоЛица.Получить())Тогда 
		Сообщить("В данной конфигурации редактирование справочника ""Физ.лица"" запрещено.");
		Отказ = Истина;
	КонецЕсли;
	
	//Миронычев
	Если РольДоступна("Логисты") тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФизическиеЛица.Ссылка
			|ИЗ
			|	Справочник.ФизическиеЛица КАК ФизическиеЛица
			|ГДЕ
			|	ФизическиеЛица.ДатаРождения = &ДатаРождения
			|	И ФизическиеЛица.Наименование = &Наименование
			|	И ФизическиеЛица.Ссылка В ИЕРАРХИИ(&Ссылка)";

		Запрос.УстановитьПараметр("ДатаРождения", ДатаРождения);
		Запрос.УстановитьПараметр("Наименование", Наименование);
	    Запрос.УстановитьПараметр("Ссылка", Справочники.ФизическиеЛица.НайтиПоНаименованию("Водители"));

		Результат = Запрос.Выполнить().Выгрузить();

		Если Результат.Количество() > 1 Тогда 
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//КонецМиронычев
	
	Если НЕ Отказ Тогда
	
		обЗаписатьПротоколИзменений(ЭтотОбъект);
	
	КонецЕсли; 

	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мДлинаСуток = 86400;
