
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа И НЕ ОбменДанными.Загрузка Тогда
	
		СтрокаОшибки = "Элемент справочника ""Банки"" " + Наименование + " не записан!";
		
		Если ЕстьНеЦифры(КоррСчет) Тогда
			СообщитьОбОшибке("В составе Корр.счета банка должны быть только цифры.",, СтрокаОшибки);
			Отказ = Истина;
		КонецЕсли; 
	
		Если ЕстьНеЦифры(Код) Тогда
			СообщитьОбОшибке("В составе БИК банка должны быть только цифры.",, СтрокаОшибки);
			Отказ = Истина;
		КонецЕсли; 
	
	КонецЕсли;
	
	Если НЕ Отказ Тогда
	
		обЗаписатьПротоколИзменений(ЭтотОбъект);
	
	КонецЕсли; 
	
КонецПроцедуры

