
Процедура ДействияФормыкнСформировать(Кнопка)
	ЭлементыФормы.Результат.Очистить();
    СкомпоноватьРезультат(ЭлементыФормы.Результат);
	//ЭлементыФормы.Результат.ПоказатьУровеньГруппировокСтрок(1); //что б нижняя тоже была свернутая
   // ЭлементыФормы.Результат.ПоказатьУровеньГруппировокСтрок(0);
   
   У = ЭлементыФормы.Результат.КоличествоУровнейГруппировокСтрок() - 1;
    Пока У > 0 Цикл
        ЭлементыФормы.Результат.ПоказатьУровеньГруппировокСтрок(У);
        У = У - 1;
    КонецЦикла;
    ЭлементыФормы.Результат.ПоказатьУровеньГруппировокСтрок(0);

КонецПроцедуры
