
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	парамЗапроса = "выгрузка "+?(отборПоШинам,"шин,","")+?(отборПоДискам,"дисков,","")
	+?(ЕстьОтборПоПроизводителю и списокПроизводителей.Количество()>0," по списку производителей:"+строка(списокПроизводителей),"")
	+?(Флажок1," на FTP для сайта yst76.ru"," только во временный файл XML");
	t=ТекущаяДата();
	Сообщить(строка(t)+" --- начата "+парамЗапроса+" --- ");	
	запрос = новый Запрос;
	
	запрос.УстановитьПараметр("ТипЦенБазовая", справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00008") );//Базовая-8, Кр.Опт-5			   
	запрос.УстановитьПараметр("ТипЦенКрОпт", справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00005") );//Базовая-8, Кр.Опт-5			   
	
	запрос.УстановитьПараметр("ВидШины",   перечисления.ВидыТоваров.Шины  );  			   
	запрос.УстановитьПараметр("ВидДиски",  перечисления.ВидыТоваров.Диски );	
	Запрос.УстановитьПараметр("НкШЗ", Справочники.Производители.НайтиПоКоду("39"));
	
	запрос.Текст = "ВЫБРАТЬ
	|	ТоварыОстатки.Номенклатура КАК Name1,
	|	ТоварыОстатки.Номенклатура.Код КАК Code1,
	|	Выбор 
	|	КОГДА ТоварыОстатки.Номенклатура.ВидТовара = &ВидДиски и ЦеныНоменклатурыСрезПоследних.ТипЦен=&ТипЦенБазовая 
	|		ТОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) 
	|	КОГДА ТоварыОстатки.Номенклатура.ВидТовара = &ВидШины и ЦеныНоменклатурыСрезПоследних.ТипЦен=&ТипЦенКрОпт
	|		ТОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) 
	|	Иначе 0 Конец КАК Price1,
	|	ТоварыОстатки.КоличествоОстаток - ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) КАК Rest1
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			 (НЕ Склад.Транзитный)
	|			И (НЕ Склад.ЗапретитьИспользование 
	|			И (НЕ Номенклатура.Производитель = &НкШЗ))
	|//отборПоПроизводителю		И	Номенклатура.Производитель В (&Список)
	|//отборПоДискам  И	Номенклатура.ВидТовара = &ВидДиски
	|//отборПоШинам   И	Номенклатура.ВидТовара = &ВидШины
	|//шиныИдиски   И (Номенклатура.ВидТовара =&ВидДиски ИЛИ Номенклатура.ВидТовара =&ВидШины) 
	|) КАК ТоварыОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				,
	|//отборПоДискам (ТипЦен = &ТипЦенБазовая)
	|//отборПоШинам  (ТипЦен = &ТипЦенКрОпт)
	|//шиныИдиски (ТипЦен = &ТипЦенБазовая или ТипЦен = &ТипЦенКрОпт)
	|
	|//отборПоПроизводителю		И Номенклатура.Производитель В (&Список)
	|//отборПоДискам  И Номенклатура.ВидТовара = &ВидДиски
	|//отборПоШинам   И Номенклатура.ВидТовара = &ВидШины
	|//шиныИдиски   И (Номенклатура.ВидТовара =&ВидДиски ИЛИ Номенклатура.ВидТовара =&ВидШины) 
	|) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ТоварыОстатки.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(, 
	| (не ЗаказПокупателя.Транзит) и ЗаказПокупателя.Проверен И (НЕ Номенклатура.Производитель = &НкШЗ)
	|//отборПоПроизводителю	 И Номенклатура.Производитель В (&Список)
	|//отборПоДискам  И	Номенклатура.ВидТовара = &ВидДиски
	|//отборПоШинам   И	Номенклатура.ВидТовара = &ВидШины
	|//шиныИдиски   И (Номенклатура.ВидТовара =&ВидДиски ИЛИ Номенклатура.ВидТовара =&ВидШины) 
	|) КАК ЗаказыПокупателейОстатки
	|		ПО ТоварыОстатки.Номенклатура = ЗаказыПокупателейОстатки.Номенклатура
	|ГДЕ
	|	ТоварыОстатки.КоличествоОстаток - ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) > 0";
	
	Если ЕстьОтборПоПроизводителю и списокПроизводителей.Количество()>0 тогда
		запрос.Текст = стрЗаменить(запрос.Текст, "//отборПоПроизводителю","");
		запрос.УстановитьПараметр("Список", списокПроизводителей);			   
	КонецЕсли;  
	
	Если отборПоДискам и не отборПоШинам тогда
		запрос.Текст = стрЗаменить(запрос.Текст, "//отборПоДискам","");
	ИначеЕсли отборПоШинам и не отборПоДискам тогда
		запрос.Текст = стрЗаменить(запрос.Текст, "//отборПоШинам","");
	ИначеЕсли отборПоШинам и отборПоДискам тогда
		запрос.Текст = стрЗаменить(запрос.Текст, "//шиныИдиски","");
	КонецЕсли; 
	
	
	Состояние("Выполняется запрос к базе данных по свободным остаткам и цене...");
	
	Выборка = запрос.Выполнить().Выбрать();
	
	
	//=============================Заголовок XML=======================================
	
	//Формирование файлов XML полностью переделала Федорова Ек.
	//Заменила "ТекстВФайл" на "ЗаписьXML"
	
	//ТекстВфайл = "<?xml version=""1.0"" encoding=""UTF-8"" standalone=""yes""?>
	//|
	//|<data>
	//|
	////Дата и время выгрузки
	//|<updates>"+Формат(ТекущаяДата(),"ДФ='yyyy-MM-dd hh:mm:ss'; ДЛФ=")+"</updates>
	//|";
	//
	//
	//N =  выборка.Количество(); i=0;
	//проц = мин(100, окр(N/100, 0) );
	//
	//Состояние("Выполняется формирование временного файла XML...");
	//
	//Пока выборка.Следующий() цикл
	//	ОбработкаПрерыванияПользователя();
	//	i=i+1;
		
		//==========================================ВШД=========================================================
	//	Если ВариантФорматаXML=0 тогда
	//		ТекстВфайл = ТекстВфайл +"	<wheel> 
	//		|";
	//		ТекстВфайл = ТекстВфайл +"		<code>" +выборка.code1 +"</code>
	//		|		<price>"+Формат(выборка.price1,"ЧГ=0")+"</price>
	//		|		<rest>" +Формат( ?(выборка.Rest1>12,"*",выборка.Rest1),"ЧГ=0") +"</rest>
	//		|		<name>" +выборка.name1 +"</name>
	//		|";
	//		ТекстВфайл = ТекстВфайл +"	</wheel> 
	//		|";
	//		
	//	Иначе	 //Если ВариантФорматаXML=1 тогда
	//		//======================http://www.kolesa-darom.ru===================================
	//		типоразрмер = выборка.Name1.Типоразмер;
	//		
	//		// цвет в конце названия, отделен пробелом
	//		назв = СокрЛП(выборка.Name1); 
	//		~111: i=1; 
	//		Цвет = прав(назв,i); симв=лев( прав(назв,i+1), 1); 
	//		Пока симв<>" " цикл
	//			i=i+1;	
	//			Цвет = прав(назв,i); симв=лев( прав(назв,i+1), 1);
	//		КонецЦикла;
	//		
	//		Если нрег(Цвет) = "legeartis" 
	//			или Найти(нрег(Цвет),"new")>0
	//			или Найти(нрег(Цвет),"укомп")>0
	//			или Найти(нрег(Цвет), "шип")>0 тогда
	//			назв = лев(назв, стрДлина(назв) - i);
	//			перейти ~111;
	//		КонецЕсли;	
	//		
	//		
	//		// двойные размеры отверстий, количество отверстий /2
	//		PCD  = ""; PCD2 = ""; КолОтв="";
	//		Если ЗначениеЗаполнено(типоразрмер) тогда
	//			PCD  = СокрЛП(типоразрмер.PCD);  PCD2 = ""; 
	//			КолОтв  = типоразрмер.КоличествоОтверстий;
	//			КолОтвЧ = число(?(КолОтв="","0",КолОтв));
	//			масРазд = новый массив;
	//			масРазд.Добавить("*"); масРазд.Добавить("x"); масРазд.Добавить("х"); 
	//			//масРазд.Добавить("/"); масРазд.Добавить("\"); 
	//			для i=0 по 2 цикл
	//				j=Найти(PCD,масРазд[i]);
	//				Если j>0 тогда
	//					PCD2 = прав(PCD, стрДлина(PCD) - j);
	//					PCD = лев(PCD, j-1);
	//					КолОтв = ?(КолОтвЧ>7, строка(КолОтвЧ/2), КолОтв );
	//				КонецЕсли;
	//			КонецЦикла;
	//		КонецЕсли;
	//		Replica = справочники.Производители.НайтиПоКоду(65);
	//		ReplicaYST = справочники.Производители.НайтиПоКоду(3072);
	//		текстТовара = "	<gd>
	//		|	<code>" +выборка.code1 +"</code>
	//		//|	<name>" +выборка.name1 +"</name>
	//		|	<brand>"+ ?(выборка.Name1.Модель.Производитель=Replica или выборка.Name1.Модель.Производитель=ReplicaYST, "REPLICA", выборка.Name1.Модель.Производитель)+"</brand>
	//		|	<model>"+(выборка.Name1.Модель)+?(выборка.Name1.Модель.Производитель=Replica или выборка.Name1.Модель.Производитель=ReplicaYST," (L.A.)","")+"</model>
	//		|	<color>"+Цвет+"</color>
	//		|	<width>"+СокрЛП(типоразрмер.Ширина)+"</width>
	//		|	<diameter>"+СокрЛП(типоразрмер.Диаметр)+"</diameter>
	//		|	<bolts_count>"+КолОтв+"</bolts_count>
	//		|	<bolts_spacing>"+PCD+"</bolts_spacing>
	//		|	<bolts_spacing2>"+PCD2+"</bolts_spacing2>
	//		|	<fix></fix>
	//		|	<et>"+СокрЛП(типоразрмер.Вылет)+"</et>
	//		|	<dia>"+СокрЛП(типоразрмер.ДиаметрСтупицы)+"</dia>
	//		|	<price>"+Формат(выборка.price1,"ЧДЦ=2; ЧГ=0")+"</price>
	//		|	<count>"+Формат( ?(выборка.Rest1>12,"*",выборка.Rest1),"ЧГ=0")+"</count>
	//		|</gd>
	//		|";
	//		текстТовара = стрЗаменить(текстТовара,".", ",");
	//		текстТовара = стрЗаменить(текстТовара,"L,A,", "L.A.");
	//		
	//		ТекстВфайл = ТекстВфайл + текстТовара;
	//		
	//	КонецЕсли;
	//	
	//	Если i%проц=0 тогда
	//		Состояние("выгружено "+строка(окр(i*100/N,0))+"% - "+выборка.code1+" : "+выборка.name1+" "+выборка.rest1+"шт. "+выборка.price1+"р.");
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//ТекстВфайл = ТекстВфайл + "</data>";
	//
	//Тфайл = новый ТекстовыйДокумент;
	//Тфайл.УстановитьТекст(ТекстВфайл); 
	//Если имяФайла="" тогда
	ИмяФайла = КаталогВременныхФайлов()+"price_yst76ru.xml";
	//КонецЕсли;
	//Сообщить(строка(ТекущаяДата())+" Данные XML выгружены во временный файл: "+ИмяФайла);
	//
	//Тфайл.Записать(ИмяФайла, КодировкаТекста.UTF8);
	
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяФайла);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("data");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("updates");
	ЗаписьXML.ЗаписатьТекст(Формат(ТекущаяДата(),"ДФ='yyyy-MM-dd hh:mm:ss'; ДЛФ=")); 
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ФормироватьОтдельныйФайлШины = Ложь;
	Если отборПоШинам И ВариантФорматаXML = 1 Тогда
		ФормироватьОтдельныйФайлШины = Истина;
		ЗаписьXMLШины = Новый ЗаписьXML;
		ЗаписьXMLШины.ОткрытьФайл(КаталогВременныхФайлов()+"price_yst76ru_tyre.xml");
		ЗаписьXMLШины.ЗаписатьОбъявлениеXML();
		ЗаписьXMLШины.ЗаписатьНачалоЭлемента("data");
		
		ЗаписьXMLШины.ЗаписатьНачалоЭлемента("updates");
		ЗаписьXMLШины.ЗаписатьТекст(Формат(ТекущаяДата(),"ДФ='yyyy-MM-dd hh:mm:ss'; ДЛФ=")); 
		ЗаписьXMLШины.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Состояние("Выполняется формирование временного файла XML...");
	
	Пока Выборка.Следующий() Цикл
		ОбработкаПрерыванияПользователя();
		
		Если ВариантФорматаXML = 0 тогда  //ВШД
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("wheel");
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("code");
			ЗаписьXML.ЗаписатьТекст(Выборка.code1);
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("price");
			ЗаписьXML.ЗаписатьТекст(Формат(Выборка.price1,"ЧГ=0"));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("rest");
			ЗаписьXML.ЗаписатьТекст(Формат(?(Выборка.Rest1>12,"*",Выборка.Rest1),"ЧГ=0"));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("name");
			ЗаписьXML.ЗаписатьТекст(Строка(выборка.name1));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		Иначе //kolesa-darom
			
			Если выборка.name1.ВидТовара = Перечисления.ВидыТоваров.Диски Тогда
				
				СтруктураРазмеров = ПолучитьРазмерыДиска(выборка.name1.Типоразмер);
				
				//Цвет
				i = 1;
				Пока i <= СтрДлина(выборка.name1.Наименование) Цикл
					Если Лев(Прав(выборка.name1.Наименование, i) ,1) = " " Тогда
						Цвет = Прав(выборка.name1.Наименование, i-1);
						Прервать;
					КонецЕсли;
					i= i + 1;
				КонецЦикла;
				
				Replica = справочники.Производители.НайтиПоКоду(65);
				ReplicaYST = справочники.Производители.НайтиПоКоду(3072);
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("gd");
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("code");
				ЗаписьXML.ЗаписатьТекст(выборка.code1);
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("brand");
				Если Найти(Строка(выборка.Name1.Производитель), "Распр") = 0 Тогда 
					ЗаписьXML.ЗаписатьТекст(?(выборка.Name1.Производитель=Replica или выборка.Name1.Производитель=ReplicaYST, "REPLICA", Строка(выборка.Name1.Производитель)));
				КонецЕсли;
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("model");
				ЗаписьXML.ЗаписатьТекст(Строка(выборка.Name1.Модель));
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("color");
				Если НЕ СтрДлина(Цвет)>7 Тогда
					ЗаписьXML.ЗаписатьТекст(Цвет);
				КонецЕсли;
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				Если СтруктураРазмеров <> Неопределено Тогда
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("width");
					ЗаписьXML.ЗаписатьТекст(СтруктураРазмеров.Ширина);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("diameter");
					//Если НЕ СтрДлина(СтруктураРазмеров.Диаметр)>2 Тогда
					ЗаписьXML.ЗаписатьТекст(СтруктураРазмеров.Диаметр);
					//КонецЕсли;
					ЗаписьXML.ЗаписатьКонецЭлемента();
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("bolts_count");
					ЗаписьXML.ЗаписатьТекст(СтруктураРазмеров.Сверловка);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("bolts_spacing");
					Если НЕ СтрДлина(СтруктураРазмеров.ET_Вылет)>6 Тогда
						ЗаписьXML.ЗаписатьТекст(СтруктураРазмеров.ДиаметрОтверстия);
					КонецЕсли;
					ЗаписьXML.ЗаписатьКонецЭлемента();
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("bolts_spacing2");
					ЗаписьXML.ЗаписатьКонецЭлемента();
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("fix");
					ЗаписьXML.ЗаписатьКонецЭлемента();
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("et");
					Если НЕ СтрДлина(СтруктураРазмеров.ET_Вылет)>4 Тогда
						ЗаписьXML.ЗаписатьТекст(СтруктураРазмеров.ET_Вылет);
					КонецЕсли;
					ЗаписьXML.ЗаписатьКонецЭлемента();
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("dia");
					ЗаписьXML.ЗаписатьТекст(СтруктураРазмеров.Ступица);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("ins");
					ЗаписьXML.ЗаписатьКонецЭлемента();
					
				КонецЕсли;
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("price");
				ЗаписьXML.ЗаписатьТекст(Формат(выборка.price1,"ЧДЦ=2; ЧГ=0"));
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("count");
				ЗаписьXML.ЗаписатьТекст(Формат(?(Выборка.Rest1>12,"*",Выборка.Rest1),"ЧГ=0"));
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
			ИначеЕсли выборка.name1.ВидТовара = Перечисления.ВидыТоваров.Шины Тогда
				
				Если ФормироватьОтдельныйФайлШины Тогда
					
					ЗаписьXMLШины.ЗаписатьНачалоЭлемента("gd");
					
					ЗаписьXMLШины.ЗаписатьНачалоЭлемента("code");
					ЗаписьXMLШины.ЗаписатьТекст(выборка.code1);
					ЗаписьXMLШины.ЗаписатьКонецЭлемента();
					
					ЗаписьXMLШины.ЗаписатьНачалоЭлемента("brand");
					ЗаписьXMLШины.ЗаписатьТекст(Строка(выборка.Name1.Производитель));
					ЗаписьXMLШины.ЗаписатьКонецЭлемента();
					
					ЗаписьXMLШины.ЗаписатьНачалоЭлемента("model");
					ЗаписьXMLШины.ЗаписатьТекст(Строка(выборка.Name1.Модель));
					ЗаписьXMLШины.ЗаписатьКонецЭлемента();
					
					СтруктураРазмеров = ПолучитьРазмерыШины(выборка.Name1.Типоразмер);
					
					Если СтруктураРазмеров <> Неопределено Тогда
						
						ЗаписьXMLШины.ЗаписатьНачалоЭлемента("width");
						ЗаписьXMLШины.ЗаписатьТекст(СтруктураРазмеров.Ширина);
						ЗаписьXMLШины.ЗаписатьКонецЭлемента();
						
						ЗаписьXMLШины.ЗаписатьНачалоЭлемента("height");
						ЗаписьXMLШины.ЗаписатьТекст(СтруктураРазмеров.Высота);
						ЗаписьXMLШины.ЗаписатьКонецЭлемента();
						
						ЗаписьXMLШины.ЗаписатьНачалоЭлемента("diameter");
						ЗаписьXMLШины.ЗаписатьТекст(СтруктураРазмеров.Диаметр);
						ЗаписьXMLШины.ЗаписатьКонецЭлемента();
						
					КонецЕсли;
										
					//Индексы
					Если Прав(выборка.Name1.Наименование, 1) = "N" 
						ИЛИ Прав(выборка.Name1.Наименование, 1) = "P"
						ИЛИ Прав(выборка.Name1.Наименование, 1) = "Q"
						ИЛИ Прав(выборка.Name1.Наименование, 1) = "R"
						ИЛИ Прав(выборка.Name1.Наименование, 1) = "S"
						ИЛИ Прав(выборка.Name1.Наименование, 1) = "T"
						ИЛИ Прав(выборка.Name1.Наименование, 1) = "U"
						ИЛИ Прав(выборка.Name1.Наименование, 1) = "H"
						ИЛИ Прав(выборка.Name1.Наименование, 1) = "V"
						ИЛИ Прав(выборка.Name1.Наименование, 1) = "W"
						ИЛИ Прав(выборка.Name1.Наименование, 1) = "Y"
						ИЛИ Прав(выборка.Name1.Наименование, 1) = "Z" Тогда
						i = 1;
						Пока i <= СтрДлина(выборка.Name1.Наименование) Цикл
							Если Лев(Прав(выборка.Name1.Наименование, i) ,1) = " " Тогда
								Индексы = Прав(выборка.Name1.Наименование, i-1);
								Прервать;
							КонецЕсли;
							i= i + 1;
						КонецЦикла;
						
						ЗаписьXMLШины.ЗаписатьНачалоЭлемента("speed_index");
						ЗаписьXMLШины.ЗаписатьТекст(Прав(Индексы, 1));
						ЗаписьXMLШины.ЗаписатьКонецЭлемента();
						
						ЗаписьXMLШины.ЗаписатьНачалоЭлемента("load_index");
						ЗаписьXMLШины.ЗаписатьТекст(Лев(Индексы, СтрДлина(Индексы)-1));
						ЗаписьXMLШины.ЗаписатьКонецЭлемента();
						
					Иначе
						
						ЗаписьXMLШины.ЗаписатьНачалоЭлемента("speed_index");
						ЗаписьXMLШины.ЗаписатьКонецЭлемента();
						
						ЗаписьXMLШины.ЗаписатьНачалоЭлемента("load_index");
						ЗаписьXMLШины.ЗаписатьКонецЭлемента();
						
					КонецЕсли;
					
					ЗаписьXMLШины.ЗаписатьНачалоЭлемента("thorn");
					Если Найти(Строка(выборка.Name1.Наименование), "шип") = 0 Тогда
						ЗаписьXMLШины.ЗаписатьТекст("0");
					Иначе
						ЗаписьXMLШины.ЗаписатьТекст("1");
					КонецЕсли;
					ЗаписьXMLШины.ЗаписатьКонецЭлемента();
				
					ЗаписьXMLШины.ЗаписатьНачалоЭлемента("price");
					ЗаписьXMLШины.ЗаписатьТекст(Формат(выборка.price1,"ЧДЦ=2; ЧГ=0"));
					ЗаписьXMLШины.ЗаписатьКонецЭлемента();
					
					ЗаписьXMLШины.ЗаписатьНачалоЭлемента("count");
					ЗаписьXMLШины.ЗаписатьТекст(Формат(?(Выборка.Rest1>12,"*",Выборка.Rest1),"ЧГ=0"));
					ЗаписьXMLШины.ЗаписатьКонецЭлемента();
					
					ЗаписьXMLШины.ЗаписатьКонецЭлемента();
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();
	
	Если ФормироватьОтдельныйФайлШины Тогда
		ЗаписьXMLШины.ЗаписатьКонецЭлемента();
		ЗаписьXMLШины.Закрыть();
		Сообщить(строка(ТекущаяДата())+" Данные XML выгружены во временный файл: " + КаталогВременныхФайлов()+"price_yst76ru_tyre.xml");
	КонецЕсли;
	
	Сообщить(строка(ТекущаяДата())+" Данные XML выгружены во временный файл: "+ИмяФайла);
	
	
	Если Флажок1 тогда	
		Состояние("Идет соединение с FTP...");
		врФТП = Новый FTPСоединение("yst.ru",,"dc140403_yst", "scdi7kRU",, Истина );
		
		//ИмяФайлаСообщения = "price_yst76ru.xml";
		
		Если врФТП = Неопределено Тогда
			Сообщить( "Во время обмена данными произошла ошибка при подключении	к FTP. " + ОписаниеОшибки(), СтатусСообщения.Внимание);
			возврат;
		КонецЕсли;
		
		Состояние("Идет запись файла XML на FTP...");
		
		//  врФТП.Записать("c:\"+ИмяФайлаСообщения , "data/"+ИмяФайлаСообщения);
		врФТП.Записать(ИмяФайла, "public_html/data/"+ИмяФайлаСообщения);
		
		Если ФормироватьОтдельныйФайлШины Тогда
			врФТП.Записать(КаталогВременныхФайлов()+"price_yst76ru_tyre.xml", "public_html/data/"+ИмяФайлаСообщения+"tyre");
		КонецЕсли;
		
		ЭлементыФормы.Надпись2.Заголовок = "http://www.yst.ru/data/"+ИмяФайлаСообщения;
		
		Сообщить(строка(ТекущаяДата())+" Данные XML выгружены на сайт: "+ЭлементыФормы.Надпись2.Заголовок);
		
	Иначе
		ЭлементыФормы.Надпись2.Заголовок = ИмяФайла;
	КонецЕсли;	
	
	Состояние(" ");
	
	ВремяВыполнения = ТекущаяДата() - t; 			   
	Если ВремяВыполнения>0 и Флажок1 тогда
		//общий модуль:  яштПрочее.ЗаписатьВЖурналИзмененийВремяВыполненияВнешнейОбработки(
		ЗаписатьВЖурналИзмененийВремяВыполненияВнешнейОбработки( 243, ВремяВыполнения, "Выгрузка на сайт: www.yst.ru/data/"+ИмяФайлаСообщения+" - "+парамЗапроса+" ("+строка(ВремяВыполнения)+" Сек.)" ); //!!!!
	КонецЕсли;				   
	
	//Предупреждение("Выгружено "+строка(N)+" товаров 
	//|"+?(Флажок1, "на сайт: "+ЭлементыФормы.Надпись2.Заголовок, "в файл:"+имяФайла), 60);
	
КонецПроцедуры


Процедура ИмяФайлаСообщенияПриИзменении(Элемент)
	Если нрег(Прав(ИмяФайлаСообщения,4))<>".xml" тогда
		ИмяФайлаСообщения = ИмяФайлаСообщения+".xml";
	КонецЕсли;
	
	Если Флажок1 Тогда
		ЭлементыФормы.Надпись2.Заголовок = "http://www.yst.ru/data/"+ИмяФайлаСообщения;
	Иначе
		ЭлементыФормы.Надпись2.Заголовок = КаталогВременныхФайлов()+"price_yst76ru.xml";
	КонецЕсли;
КонецПроцедуры


Процедура Надпись2Нажатие(Элемент)
	ЗапуститьПриложение(ЭлементыФормы.Надпись2.Заголовок);	
КонецПроцедуры


Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	списокПроизводителей = новый СписокЗначений;
	списокПроизводителей.Добавить( справочники.Производители.НайтиПоКоду(100) );//НайтиПоНазванию("Alcasta") );
	списокПроизводителей.Добавить( справочники.Производители.НайтиПоКоду(517) );//НайтиПоНазванию("NZ") );
	списокПроизводителей.Добавить( справочники.Производители.НайтиПоКоду(597) );//НайтиПоНазванию("TREBL") );
	
	ЕстьОтборПоПроизводителю = истина;
	отборПоДискам = истина;
	ИмяФайлаСообщения = "price_yst76ru.xml";
	Флажок1 = ложь;
	ЭлементыФормы.Надпись2.Заголовок = КаталогВременныхФайлов()+ИмяФайлаСообщения;
	
КонецПроцедуры


Процедура списокПроизводителейПриИзменении(Элемент)
	ЕстьОтборПоПроизводителю = ( списокПроизводителей.Количество()>0 );
КонецПроцедуры


Процедура ВариантФорматаXMLПриИзменении(Элемент)
	Если ВариантФорматаXML=1 тогда
		ИмяФайлаСообщения = "priceKD_yst76ru.xml";
	иначе	
		ИмяФайлаСообщения = "price_yst76ru.xml";
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьРазмерыДиска(Типоразмер)
	
	//Разбор диска на размеры 
	//6x15/5x112 ET37 D57.1
	
	СтруктураРазмеров = Новый Структура("Ширина,Диаметр,Сверловка,ET_Вылет,Ступица,ДиаметрОтверстия");
	
	НачалоДиаметра 			= Найти(Типоразмер,"x");
	НачалоШирины 			= 1;
	НачалоСверловки			= Найти(Типоразмер,"/");
	НачалоДиаметраОтверстия = Найти(Сред(Типоразмер, НачалоСверловки, СтрДлина(Типоразмер)-НачалоСверловки), "x")+НачалоСверловки-1;
	НачалоВылета 			= Найти(Типоразмер,"ET");
	НачалоСтупицы 			= Найти(Типоразмер,"D");
	
	СтруктураРазмеров.Диаметр = Сред(Типоразмер,НачалоДиаметра+1,НачалоСверловки-НачалоДиаметра-1);
	СтруктураРазмеров.Ширина = Сред(Типоразмер, НачалоШирины,НачалоДиаметра-НачалоШирины);
	СтруктураРазмеров.Сверловка = Сред(Типоразмер,НачалоСверловки+1,1);
	СтруктураРазмеров.ДиаметрОтверстия = Сред(Типоразмер,НачалоДиаметраОтверстия+1,НачалоВылета-НачалоДиаметраОтверстия-2);
	СтруктураРазмеров.ET_Вылет = Сред(Типоразмер,НачалоВылета+2,НачалоСтупицы-НачалоВылета-3);
	СтруктураРазмеров.Ступица = Сред(Типоразмер,НачалоСтупицы+1);
	
	Возврат СтруктураРазмеров;
	
КонецФункции

Функция ПолучитьРазмерыШины(Типоразмер)
	
	СтруктураРазмеров = Новый Структура("Ширина,Высота,Диаметр");
	Если Сред(Типоразмер,4,1)<>"/" или Сред(Типоразмер,7,1)<>"R" Тогда
		Возврат Неопределено;
	Иначе
		СтруктураРазмеров.Диаметр = Сред(Типоразмер,8);
		СтруктураРазмеров.Ширина = Лев(Типоразмер,3);
		СтруктураРазмеров.Высота = Сред(Типоразмер,5,2);
	КонецЕсли;
	Возврат СтруктураРазмеров;
	
КонецФункции
