
Процедура ПриОткрытии()
	
		
	ТекДата=НачалоДня(ТекущаяДата());
	
	Компоновщик = ЭтотОбъект.КомпоновщикНастроек;
НачПериода=Компоновщик.Настройки.ПараметрыДанных.НайтиЗначениеПараметра( Новый ПараметрКомпоновкиДанных("НачалоПериода") );
НачПериода.Значение=НачалоГода(НачалоГода(ТекДата)-1);
НачПериода.Использование=Истина;

КонПериода=Компоновщик.Настройки.ПараметрыДанных.НайтиЗначениеПараметра( Новый ПараметрКомпоновкиДанных("КонецПериода") );
КонПериода.Значение=КонецГода(НачалоГода(ТекДата)-1);
КонПериода.Использование=Истина;

КонецПроцедуры
