Перем СписокАктивныхКонтрагентов; 

Функция ВыбратьКонтрагента(ЯщикОрганизации, ИННКонтрагента = "", подбор = Ложь) Экспорт
	ящикДиадокОрганизации = ЯщикОрганизации ;
	ИНН =  ИННКонтрагента;
	ОрганизацияНаименование = "Организация """ + ящикДиадокОрганизации.Name + """"+?( ИННКонтрагента = "", "", ", ИНН контрагента "+ИННКонтрагента);
	Заголовок = "Выбор контрагента по организации """ + ящикДиадокОрганизации.Name+ """";
	КонтекстПодбора = подбор;
	
	//Если  ИННКонтрагента="" Тогда
	//	//прочитаем с сервера список активных контрагентов
	//	СписокКонтрагентов1 = ящикДиадокОрганизации.GetCounteragentListByStatus("IsMyCounteragent");
	//	СписокКонтрагентов2 = ящикДиадокОрганизации.GetCounteragentListByStatus("Inviting");
	//	СписокКонтрагентов3 = ящикДиадокОрганизации.GetCounteragentListByStatus("IsInvited");
	//	
	//	СписокАктивныхКонтрагентов = Новый СписокЗначений;
	//	СписокАктивныхКонтрагентов.ЗагрузитьЗначения(СписокКонтрагентов1);
	//	СписокАктивныхКонтрагентов.ЗагрузитьЗначения(СписокКонтрагентов2);
	//	СписокАктивныхКонтрагентов.ЗагрузитьЗначения(СписокКонтрагентов3);
	//Иначе 
	//	 counteragentList = ящикДиадокОрганизации.GetCounteragentListByInnKpp(ИННКонтрагента);
	// 	 СписокАктивныхКонтрагентов = Новый СписокЗначений;
	//	 СписокАктивныхКонтрагентов.ЗагрузитьЗначения(counteragentList);
	//КонецЕсли;	
	//Для каждого Эл из СписокКонтрагентов цикл 
	//		Если Эл.GetStatus() <> "Denied" Тогда 
	//			СписокАктивныхКонтрагентов.Добавить(Эл.INN);
	//		КонецЕсли;	
	//	КонецЦикла;
	Если КонтекстПодбора Тогда
	 	Открыть();
		Возврат Истина;
	Иначе 
		Возврат ОткрытьМодально();
	КонецЕсли;	

	
КонецФункции

Процедура СправочникСписокПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущаяСтрока <> Неопределено Тогда
		Если Элемент.ОформлениеСтроки(Элемент.ТекущаяСтрока).ЦветТекста = WEBЦвета.СветлоСерый
			ИЛИ Элемент.ТекущаяСтрока.ЭтоГруппа Тогда
			ЭлементыФормы.ДействияФормы.Кнопки.Выбрать.Доступность = Ложь;
		Иначе
			ЭлементыФормы.ДействияФормы.Кнопки.Выбрать.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура СправочникСписокПриПолученииДанных(Элемент, ОформленияСтрок)
	// Для каждого контрагента
	Для каждого ОформлениеСтроки Из ОформленияСтрок Цикл
		Стр = ОформлениеСтроки.ДанныеСтроки;
		Если НЕ Стр.ЭтоГруппа Тогда
			стСтатус = ОпределитьСтатусОтношенийВДиадоке(стр.Ссылка);
			ОформлениеСтроки.Ячейки.Статус.УстановитьТекст(стСтатус.Текст);
			Если стСтатус.Текст <> "" Тогда
				ОформлениеСтроки.ЦветТекста = WEBЦвета.Серый;
			Иначе
				ОформлениеСтроки.Ячейки.Статус.УстановитьТекст("Подключен к "+НаименованиеСистемы);
			КонецЕсли;
			
			ИННВалидный = ?(ПолучитьМодульПрог("Модуль_Логика_ПрофилиКонфигурации").ИННВалидный(стр.Ссылка) = Неопределено, Истина,ПолучитьМодульПрог("Модуль_Логика_ПрофилиКонфигурации").ИННВалидный(стр.Ссылка));
			Если стСтатус.ПроверятьИНН И НЕ ИННВалидный Тогда
				//ОформлениеСтроки.ЦветТекста = WEBЦвета.СветлоСерый;
				ОформлениеСтроки.Ячейки.Статус.ЦветТекста = WEBЦвета.Красный;
				ОформлениеСтроки.Ячейки.ИНН.ЦветТекста = WEBЦвета.Красный;
				ОформлениеСтроки.Ячейки.Статус.УстановитьТекст("ИНН не правильный");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ОпределитьСтатусОтношенийВДиадоке(КонтрагентСсылка)
	КонтрагентID = ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").Контрагент_2_CounteragentBoxID(КонтрагентСсылка,  ящикДиадокОрганизации.id);
	//Если ЗначениеЗаполнено(КонтрагентID) и (СписокАктивныхКонтрагентов.НайтиПоЗначению(КонтрагентСсылка.ИНН)<>Неопределено) Тогда
	//	Возврат Новый Структура("Текст, ПроверятьИНН", "Добавлен", Ложь);
	//КонецЕсли;
	
	масЯщики = Модуль_РаботаССерверомДиадок.получитьМассивЯщиковДиадокПоИНН(ящикДиадокОрганизации, КонтрагентСсылка.ИНН); 
	Если масЯщики <> Неопределено Тогда
		Если масЯщики.Количество() > 0 Тогда
			Возврат Новый Структура("Текст, ПроверятьИНН", "", Ложь);
		Иначе
			Возврат Новый Структура("Текст, ПроверятьИНН", "Нет в "+КраткоеНаименованиеСистемы, Истина);
		КонецЕсли;
	Иначе
		Возврат Новый Структура("Текст, ПроверятьИНН", "Не подключена ни одна организация", Ложь);
	КонецЕсли;
КонецФункции

Процедура ДействияФормыВыбрать(Кнопка)
	ТекДанные = ЭлементыФормы.СправочникСписок.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Предупреждение("Выберите контрагента",, НаименованиеСистемы);
		Возврат;
	КонецЕсли;
	Если ТекДанные <> Неопределено Тогда
		Если ТекДанные.ЭтоГруппа Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭлементыФормы.СправочникСписок.ОформлениеСтроки(ЭлементыФормы.СправочникСписок.ТекущаяСтрока).ЦветТекста = WEBЦвета.Серый Тогда
		Предупреждение("Невозможно выбрать данного контрагента",, НаименованиеСистемы);
		Возврат;
	ИначеЕсли  не КонтекстПодбора  Тогда
		//закрываем форму, возвращаем контрагента
		Закрыть(ЭлементыФормы.СправочникСписок.ТекущиеДанные.Ссылка);
	Иначе
		//контекст подбора - оповестим форму 
		оповестить("ОтправкаЗапросаКонтрагенту", ЭлементыФормы.СправочникСписок.ТекущиеДанные.Ссылка);
		
	 //   контрагент =  ЭлементыФормы.СправочникСписок.ТекущиеДанные.Ссылка;
	 //   КонтрагентВДиадокеНаименование = "";
	 //   КонтрагентID = "";
	 //   Если НЕ Контрагент.Пустая() Тогда
	 //   	стКонтрагентДиадок = ПолучитьФорму("ФормаПолученияЯщикаКонтрагентаПоИНН").ВыбратьЯщик(ЯщикДиадокОрганизации, Контрагент);
	 //   	Если стКонтрагентДиадок <> Неопределено Тогда
	 //   		КонтрагентВДиадокеНаименование = стКонтрагентДиадок.Наименование;
	 //   		КонтрагентID = стКонтрагентДиадок.ID;
	 //   	КонецЕсли;
	 //   
	 //   	Если КонтрагентID = "" Тогда
	 //   		Предупреждение("Не выбран ящик контрагента",, НаименованиеСистемы);
	 //   		Возврат 
	 //   	КонецЕсли;
	 //   Иначе
	 //   	ЯщикаКонтрагента = "";
	 //   КонецЕсли;
	 //
	 //	фрм = ПолучитьФорму("ФормаЗапросаКонтрагенту", ЭтаФорма);
	 //   ЗапросОтправлен = фрм.ОтправитьЗапросКонтрагенту(ящикДиадокОрганизации,контрагент, КонтрагентВДиадокеНаименование, КонтрагентID);
	КонецЕсли;
КонецПроцедуры

Процедура СправочникСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	ТекДанные = ЭлементыФормы.СправочникСписок.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если ТекДанные.ЭтоГруппа Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ДействияФормыВыбрать("");
КонецПроцедуры

Процедура ПриОткрытии()
	КартинкаЗаголовка= ЭДО_БиблиотекаКартинок().КартинкаЗаголовка;
	Если ЗначениеЗаполнено(ИНН) Тогда 
		СправочникСписокПоПользователю.Отбор.ИНН.Установить(ИНН);
		Элементыформы.СправочникСписок.НастройкаОтбора.инн.доступность = Ложь;
		ЭлементыФормы.СправочникСписок.ИерархическийПросмотр = Ложь;
	КонецЕсли;	
КонецПроцедуры
