
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Для Каждого ТекСтрокаСвойстваОбъектов Из СвойстваОбъектов Цикл
		// регистр КоэффициентыСвойствОбъектов 
		Движение = Движения.КоэффициентыСвойствОбъектов.Добавить();
		Движение.Период = Дата;
		Движение.Свойство = ТекСтрокаСвойстваОбъектов.Свойство;
		Движение.ЗначениеСвойства = ТекСтрокаСвойстваОбъектов.ЗначениеСвойства;
		Движение.Коэффициент = ТекСтрокаСвойстваОбъектов.Коэффициент;
	КонецЦикла;
	// записываем движения регистров
	Движения.КоэффициентыСвойствОбъектов.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
