&НаКлиенте
Перем МестныйКэш Экспорт;
&НаКлиенте
Функция Показать(Кэш, Пакет, ВыбранноеДействие=Неопределено) Экспорт
// Процедура открывает форму просмотра пакета документов	
	СоставПакета = Пакет;
	Переходы.Очистить();
	Заголовок = СоставПакета.Этап[0].Название;
	МестныйКэш = Кэш;
	Если ЗначениеЗаполнено(ВыбранноеДействие) Тогда
		Переходы.Добавить(ВыбранноеДействие, ВыбранноеДействие.Название);	
	Иначе
		Для Каждого Действие Из СоставПакета.Этап[0].Действие Цикл
			Переходы.Добавить(Действие, Действие.Название);
		КонецЦикла;
	КонецЕсли;
	Возврат ЭтаФорма.ОткрытьМодально();
КонецФункции

&НаКлиенте
Процедура ПереходыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ЭтаФорма.Закрыть(Новый Структура("Действие,Комментарий",Элемент.ТекущиеДанные.Значение, Комментарий));
КонецПроцедуры
