
Процедура ПриЗаписи(Отказ, Замещение)
	#Если Клиент Тогда
	Если Замещение или ЭтотОбъект.Количество() > 0 Тогда
		Попытка
	    Набор = РегистрыСведений.ЖурналИзменений.СоздатьМенеджерЗаписи();
		Набор.Период = ТекущаяДата();
		Набор.Активность = Истина;
		Набор.Пользователь= глТекущийПользователь;
		Набор.Объект = ЭтотОбъект.Отбор.Контрагент.Значение;
		Набор.НомерЗаписи = 1;
		Набор.Компьютер = ИмяКомпьютера();
		Набор.Событие = "Произошло удаление или замещение записей регистра по контрагенту " + ЭтотОбъект.Отбор.Контрагент.Значение.Наименование + " с приоритетом " + ЭтотОбъект.Отбор.Приоритет.Значение;
		Набор.Комментарий = "Удаление";
		Набор.ОбъектМетаданных = "Удаление";
		Набор.Записать();
	    Исключение
		КонецПопытки;
	КонецЕсли;
    #КонецЕсли
КонецПроцедуры


Процедура ПередЗаписью(Отказ, Замещение)
	
	//ТЗ = ЭтотОбъект.Выгрузить();   //пересчет бонусных правил по изменившимся скидкам
	//
	//Для каждого стр из ЭтотОбъект цикл
	//	Если стр.Бонус > 0 Тогда
	//		ОтборСтр = Новый Структура;
	//		ОтборСтр.Вставить("ID",стр.ID);
	//		ОтборСтр.Вставить("Бонус",0);
	//		Строки = тз.НайтиСтроки(ОтборСтр);
	//		Если Строки <> Неопределено Тогда
	//			Если Строки.Количество() > 0 Тогда
	//				 НоваяСкидка = Строки[0].СкидкаНаценка;
	//				 стр.СкидкаНаценка = ((НоваяСкидка+100)/100*стр.Бонус*стр.Коэффициент)+НоваяСкидка;
	//				 Сообщить("!!!>>>> Пересчитана скидка/наценка по правилу с БОНУСОМ № "+ Строка(стр.Приоритет)+", ID = "+ Строка(стр.ID) +" для контрагента "+Стр.Контрагент.Наименование+", т.к. поменялась скидка в изначальном правиле!!!");
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры

