
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказПоставщикуПлановыеДопРасходы.Номенклатура = ""FOB""
		|				ТОГДА ЗаказПоставщикуПлановыеДопРасходы.СуммаФакт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК FOB,
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказПоставщикуПлановыеДопРасходы.Номенклатура <> ""FOB""
		|				ТОГДА ЗаказПоставщикуПлановыеДопРасходы.СуммаФакт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДопРасходыСумма,
		|	ЗаказПоставщикуПлановыеДопРасходы.Ссылка
		|ПОМЕСТИТЬ ДопРасходы
		|ИЗ
		|	Документ.ЗаказПоставщику.ПлановыеДопРасходы КАК ЗаказПоставщикуПлановыеДопРасходы
		|ГДЕ
		|	ЗаказПоставщикуПлановыеДопРасходы.Ссылка.Контрагент = &Контрагент
		|	И ЗаказПоставщикуПлановыеДопРасходы.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ЗаказПоставщикуПлановыеДопРасходы.Ссылка.ВидЗаказа = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПоставщикуПлановыеДопРасходы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Ссылка,
		|	СУММА(ЗаказПоставщикуТовары.Цена * ЗаказПоставщикуТовары.Количество) КАК ЦенаFOB,
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказПоставщикуТовары.ЦенаБ = 0
		|				ТОГДА 0
		|			ИНАЧЕ (ЕСТЬNULL(ЗаказПоставщикуТовары.ЦенаБ, 0) - ЗаказПоставщикуТовары.Цена) * ЗаказПоставщикуТовары.Количество
		|		КОНЕЦ) КАК Разница
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка.Контрагент = &Контрагент
		|	И ЗаказПоставщикуТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ЗаказПоставщикуТовары.Ссылка.ВидЗаказа = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПоставщикуТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка,
		|	ПоступлениеТоваровУслуг.СуммаДокумента,
		|	ПоступлениеТоваровУслуг.Сделка
		|ПОМЕСТИТЬ Поступления
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Сделка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				Товары.Ссылка
		|			ИЗ
		|				Товары КАК Товары)
		|	И ПоступлениеТоваровУслуг.ПометкаУдаления = ЛОЖЬ
		|	И ПоступлениеТоваровУслуг.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеДопРасходовТовары.ДокументПартии,
		|	СРЕДНЕЕ(ПоступлениеДопРасходовТовары.Ссылка.Сумма) КАК Сумма1,
		|	ПоступлениеДопРасходовТовары.Ссылка
		|ПОМЕСТИТЬ ДопРасходыДок
		|ИЗ
		|	Документ.ПоступлениеДопРасходов.Товары КАК ПоступлениеДопРасходовТовары
		|ГДЕ
		|	ПоступлениеДопРасходовТовары.ДокументПартии В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				Поступления.Ссылка
		|			ИЗ
		|				Поступления КАК Поступления)
		|	И ПоступлениеДопРасходовТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ПоступлениеДопРасходовТовары.Ссылка.Контрагент = &Контрагент
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеДопРасходовТовары.ДокументПартии,
		|	ПоступлениеДопРасходовТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеДопРасходовТовары.ДокументПартии,
		|	СРЕДНЕЕ(ПоступлениеДопРасходовТовары.Ссылка.Сумма) КАК Сумма1,
		|	ПоступлениеДопРасходовТовары.Ссылка
		|ПОМЕСТИТЬ ДопРасходыДокР
		|ИЗ
		|	Документ.ПоступлениеДопРасходов.Товары КАК ПоступлениеДопРасходовТовары
		|ГДЕ
		|	ПоступлениеДопРасходовТовары.ДокументПартии В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				Поступления.Ссылка
		|			ИЗ
		|				Поступления КАК Поступления)
		|	И ПоступлениеДопРасходовТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ПоступлениеДопРасходовТовары.Ссылка.Контрагент <> &Контрагент
		|	И ПоступлениеДопРасходовТовары.Ссылка.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеДопРасходовТовары.ДокументПартии,
		|	ПоступлениеДопРасходовТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПереносДЗКЗпоПерегрузамИНедогрузамТовары.Ссылка.Основание,
		|	СУММА(ВЫБОР
		|			КОГДА ПереносДЗКЗпоПерегрузамИНедогрузамТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПерегрузНедогруз.Перегруз)
		|				ТОГДА -ПереносДЗКЗпоПерегрузамИНедогрузамТовары.Сумма
		|			ИНАЧЕ ПереносДЗКЗпоПерегрузамИНедогрузамТовары.Сумма
		|		КОНЕЦ) КАК Сумма
		|ПОМЕСТИТЬ перегрузыНедогрузы
		|ИЗ
		|	Документ.ПереносДЗКЗпоПерегрузамИНедогрузам.Товары КАК ПереносДЗКЗпоПерегрузамИНедогрузамТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ПереносДЗКЗпоПерегрузамИНедогрузамТовары.Ссылка.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Ссылка КАК Заказ,
		|	Товары.Ссылка.СуммаДокумента КАК СуммаДокумента,
		|	Товары.ЦенаFOB КАК СуммаFOB,
		|	Товары.Разница,
		|	ДопРасходы.FOB,
		|	Поступления.СуммаДокумента КАК СуммаПоступления,
		|	Поступления.Ссылка КАК Поступление,
		|	ДопРасходы.ДопРасходыСумма,
		|	Поступления.Ссылка.Контрагент КАК КонтрагентПоступление,
		|	ВложенныйЗапрос.Сумма1 КАК СуммаДопРасходовИзДокумента,
		|	ВложенныйЗапрос1.Сумма1 КАК СуммаДопРасходовИзДокументаР,
		|	перегрузыНедогрузы.Сумма КАК ПерегрузыНедогрузы,
		|	ВложенныйЗапрос.Сумма1 + ЕСТЬNULL(перегрузыНедогрузы.Сумма, 0) + Поступления.СуммаДокумента КАК ИтогоПоПоступлению
		|ИЗ
		|	Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДопРасходы КАК ДопРасходы
		|		ПО Товары.Ссылка = ДопРасходы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Поступления КАК Поступления
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ДопРасходыДок.ДокументПартии КАК ДокументПартии,
		|				СУММА(ДопРасходыДок.Сумма1) КАК Сумма1
		|			ИЗ
		|				ДопРасходыДок КАК ДопРасходыДок
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ДопРасходыДок.ДокументПартии) КАК ВложенныйЗапрос
		|			ПО Поступления.Ссылка = ВложенныйЗапрос.ДокументПартии
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ДопРасходыДокР.ДокументПартии КАК ДокументПартии,
		|				СУММА(ДопРасходыДокР.Сумма1) КАК Сумма1
		|			ИЗ
		|				ДопРасходыДокР КАК ДопРасходыДокР
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ДопРасходыДокР.ДокументПартии) КАК ВложенныйЗапрос1
		|			ПО Поступления.Ссылка = ВложенныйЗапрос1.ДокументПартии
		|		ПО Товары.Ссылка = Поступления.Сделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ перегрузыНедогрузы КАК перегрузыНедогрузы
		|		ПО Товары.Ссылка = перегрузыНедогрузы.Основание";

		Запрос.УстановитьПараметр("Контрагент",Справочники.Контрагенты.НайтиПоКоду("95728"));
		Результат = Запрос.Выполнить();

	СписокЗаказов = Результат.Выгрузить();


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеДопРасходовТовары.ДокументПартии.Сделка КАК Заказ,
		|	ПоступлениеДопРасходовТовары.Ссылка КАК ПоступлениеДопРасходов,
		|	ПоступлениеДопРасходовТовары.Ссылка.Сумма,
		|	ПоступлениеДопРасходовТовары.Ссылка.Контрагент,
		|	ПоступлениеДопРасходовТовары.Ссылка.Проведен
		|ИЗ
		|	Документ.ПоступлениеДопРасходов.Товары КАК ПоступлениеДопРасходовТовары
		|ГДЕ
		|	ПоступлениеДопРасходовТовары.ДокументПартии.Контрагент = &Контрагент";

	Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.НайтиПоКоду("95728"));

	Результат = Запрос.Выполнить();

	СписокДопРасходов.Загрузить(Результат.Выгрузить());
	
	
КонецПроцедуры

Процедура СписокЗаказовПриПолученииДанных(Элемент, ОформленияСтрок)
	Для каждого стр из ОформленияСтрок цикл
		Если стр.ДанныеСтроки.FOB <> стр.ДанныеСтроки.СуммаFOB или
			 стр.ДанныеСтроки.ДопРасходыСумма<> стр.ДанныеСтроки.Разница тогда
			 стр.ЦветФона = WebЦвета.СветлоРозовый;
	    конецЕсли;
	конецЦикла;	
	
	Значение  = Элементыформы.СписокЗаказов.ТекущиеДанные;
	ЭлементыФормы.СписокДопРасходов.ОтборСтрок.Заказ.Установить(Значение.Заказ);
	
	
КонецПроцедуры

Процедура СписокДопРасходовПриПолученииДанных(Элемент, ОформленияСтрок)

КонецПроцедуры

Процедура СписокЗаказовПриАктивизацииСтроки(Элемент)
	Значение  = Элементыформы.СписокЗаказов.ТекущиеДанные;
	ЭлементыФормы.СписокДопРасходов.ОтборСтрок.Заказ.Установить(Значение.Заказ);
КонецПроцедуры
