Функция Печать() Экспорт
	
	//Если Не Метаданные.Имя = "УправлениеТорговлей" Тогда
	//	Сообщить("Печатная форма предназначена для использования в конфигурации ""Управление торговлей""", СтатусСообщения.Внимание);
	//КонецЕсли;
	Ответ = Вопрос("Рассчитать себестоимость с учетом бонусов?", РежимДиалогаВопрос.ДаНет);
	Если ответ = КодВозвратаДиалога.да тогда
		СБонусами = истина;
	иначе
		СБонусами = ложь
	КонецЕсли;
	Возврат ПечатьРеализации(СБонусами);
	
КонецФункции // Печать

Функция ПечатьРеализации(СБонусами=ложь) 
	ТабНом = СсылкаНаОбъект.Товары.ВыгрузитьКолонку("Номенклатура");
	тзБонусы =  ПолучитьБонусы(СБонусами, , ТекущаяДата(), ТабНом).ТаблицаБонусов;
	
	ТабДок=Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ОтчетРеализация");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тзБонусы",тзБонусы);
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	Запрос.УстановитьПараметр("ТекДатаМесяц",НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("ТабНом",ТабНом);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	тзБонусы.Ссылка КАК Номенклатура,
	|	тзБонусы.Бонус,
	|	тзБонусы.Период
	|ПОМЕСТИТЬ втБонусыСПериодами
	|ИЗ
	|	&тзБонусы КАК тзБонусы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втБонусыСПериодами.Номенклатура,
	|	МАКСИМУМ(втБонусыСПериодами.Период) КАК Период
	|ПОМЕСТИТЬ втБонусы2
	|ИЗ
	|	втБонусыСПериодами КАК втБонусыСПериодами
	|ГДЕ
	|	втБонусыСПериодами.Период <= &ТекДатаМесяц
	|
	|СГРУППИРОВАТЬ ПО
	|	втБонусыСПериодами.Номенклатура
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втБонусыСПериодами.Номенклатура,
	|	втБонусыСПериодами.Бонус
	|ПОМЕСТИТЬ втБонусы
	|ИЗ
	|	втБонусыСПериодами КАК втБонусыСПериодами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втБонусы2 КАК втБонусы2
	|		ПО втБонусыСПериодами.Номенклатура = втБонусы2.Номенклатура
	|			И втБонусыСПериодами.Период = втБонусы2.Период
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяТовары.Количество КАК Количество,
	|	ЗаказПокупателяТовары.Цена * ЗаказПокупателяТовары.Ссылка.КурсВзаиморасчетов * ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.Ссылка.ДоговорКонтрагента.ТипДоговора = ЗНАЧЕНИЕ(Справочник.ТипыДоговоров.ШинтрейдЯрославль)
	|			ТОГДА 1.18
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Цена,
	|	ЗаказПокупателяТовары.Сумма * ЗаказПокупателяТовары.Ссылка.КурсВзаиморасчетов * ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.Ссылка.ДоговорКонтрагента.ТипДоговора = ЗНАЧЕНИЕ(Справочник.ТипыДоговоров.ШинтрейдЯрославль)
	|			ТОГДА 1.18
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Сумма,
	|	ЗаказПокупателяТовары.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ втЗаказПокупателяТовары
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка = &Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартииТоваровНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток,
	|	СУММА(ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.СтоимостьОстаток, 0)) КАК СтоимостьОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.КоличествоОстаток, 0) > 0
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.СтоимостьОстаток, 0) / ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.КоличествоОстаток, 0) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СебестоимостьШтуки
	|ПОМЕСТИТЬ втПартииТоваровНаСкладахОстатки
	|ИЗ
	|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	|			&ДатаДок,
	|			НЕ Склад.ЗапретитьИспользование
	|				И Номенклатура В (&ТабНом)
	|				И НЕ Склад.Транзитный) КАК ПартииТоваровНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаказПокупателяТовары.Номенклатура.Код КАК Код,
	|	втЗаказПокупателяТовары.Номенклатура,
	|	втЗаказПокупателяТовары.Количество,
	|	втПартииТоваровНаСкладахОстатки.СебестоимостьШтуки КАК СебестоимостьШтуки,
	|	втЗаказПокупателяТовары.Цена,
	|	втЗаказПокупателяТовары.Сумма,
	|	(втЗаказПокупателяТовары.Цена - втПартииТоваровНаСкладахОстатки.СебестоимостьШтуки) * втЗаказПокупателяТовары.Количество КАК ВаловаяПрибыль,
	|	ВЫБОР
	|		КОГДА втПартииТоваровНаСкладахОстатки.СебестоимостьШтуки > 0
	|			ТОГДА ВЫРАЗИТЬ(100 * (втЗаказПокупателяТовары.Цена / втПартииТоваровНаСкладахОстатки.СебестоимостьШтуки - 1) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентНаценки,
	|	(втЗаказПокупателяТовары.Цена - (ЕСТЬNULL(втПартииТоваровНаСкладахОстатки.СебестоимостьШтуки, 0) - ЕСТЬNULL(втПартииТоваровНаСкладахОстатки.СебестоимостьШтуки, 0) / 1.18 * ЕСТЬNULL(втБонусы.Бонус, 0) / 100)) * втЗаказПокупателяТовары.Количество КАК ВаловаяПрибыльСУчетомБонуса,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втПартииТоваровНаСкладахОстатки.СебестоимостьШтуки, 0) - ЕСТЬNULL(втПартииТоваровНаСкладахОстатки.СебестоимостьШтуки, 0) / 1.18 * ЕСТЬNULL(втБонусы.Бонус, 0) / 100 > 0
	|			ТОГДА ВЫРАЗИТЬ(100 * (втЗаказПокупателяТовары.Цена / (ЕСТЬNULL(втПартииТоваровНаСкладахОстатки.СебестоимостьШтуки, 0) - ЕСТЬNULL(втПартииТоваровНаСкладахОстатки.СебестоимостьШтуки, 0) / 1.18 * ЕСТЬNULL(втБонусы.Бонус, 0) / 100) - 1) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентНаценкиСУчетомБонуса
	|ИЗ
	|	втЗаказПокупателяТовары КАК втЗаказПокупателяТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПартииТоваровНаСкладахОстатки КАК втПартииТоваровНаСкладахОстатки
	|		ПО втЗаказПокупателяТовары.Номенклатура = втПартииТоваровНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втБонусы КАК втБонусы
	|		ПО втЗаказПокупателяТовары.Номенклатура = втБонусы.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	втЗаказПокупателяТовары.НомерСтроки";
	
	//+++ 01.08.2014 - ВАЖНО на дату документа!
	грДок = Новый Граница(СсылкаНаОбъект.Дата, ВидГраницы.Исключая);
	Запрос.УстановитьПараметр("ДатаДок", грДок ); // граница на начало документа
	
	//+++(26.06.2013	
	Если ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "УчетТолькоПоПодразделениюПользователя") 
		И НЕ ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "СтаршийМенеджерПодразделения") Тогда
		
		//Предупреждение("У вас недостаточно прав для просмотра данного отчета!",60);
		//Возврат неопределено;
		
		Запрос.Текст ="ВЫБРАТЬ
		              |	тзБонусы.Номенклатура,
		              |	тзБонусы.Бонус,
		              |	тзБонусы.Период
		              |ПОМЕСТИТЬ втБонусыСПериодами
		              |ИЗ
		              |	&тзБонусы КАК тзБонусы
		              |;
		              |
		              |////////////////////////////////////////////////////////////////////////////////
		              |ВЫБРАТЬ
		              |	втБонусыСПериодами.Номенклатура,
		              |	МАКСИМУМ(втБонусыСПериодами.Период) КАК Период
		              |ПОМЕСТИТЬ втБонусы2
		              |ИЗ
		              |	втБонусыСПериодами КАК втБонусыСПериодами
		              |ГДЕ
		              |	втБонусыСПериодами.Период <= &ТекДатаМесяц
		              |
		              |СГРУППИРОВАТЬ ПО
		              |	втБонусыСПериодами.Номенклатура
		              |;
		              |
		              |////////////////////////////////////////////////////////////////////////////////
		              |ВЫБРАТЬ
		              |	втБонусыСПериодами.Номенклатура,
		              |	втБонусыСПериодами.Бонус
		              |ПОМЕСТИТЬ втБонусы
		              |ИЗ
		              |	втБонусыСПериодами КАК втБонусыСПериодами
		              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втБонусы2 КАК втБонусы2
		              |		ПО втБонусыСПериодами.Номенклатура = втБонусы2.Номенклатура
		              |			И втБонусыСПериодами.Период = втБонусы2.Период
		              |;
		              |
		              |////////////////////////////////////////////////////////////////////////////////
		              |ВЫБРАТЬ
		              |	ЗаказПокупателяТовары.НомерСтроки КАК НомерСтроки,
		              |	ЗаказПокупателяТовары.Номенклатура.Код КАК Код,
		              |	ЗаказПокупателяТовары.Номенклатура,
		              |	ЗаказПокупателяТовары.Количество,
		              |	ЦеныНом.СебестоимостьШтуки КАК СебестоимостьШтуки,
		              |	ЗаказПокупателяТовары.Цена,
					  //+++ 09.11.2018 -> BugFix: Задача № 58659, 58842, 58871 п.1
					  |	ЗаказПокупателяТовары.Цена * ЗаказПокупателяТовары.Количество как Сумма,
					  
		              |	(ЗаказПокупателяТовары.Цена - ЦеныНом.СебестоимостьШтуки) * ЗаказПокупателяТовары.Количество КАК ВаловаяПрибыль,
		              |	ВЫБОР
		              |		КОГДА ЦеныНом.СебестоимостьШтуки > 0
		              |			ТОГДА ВЫРАЗИТЬ(100 * (ЗаказПокупателяТовары.Цена / ЦеныНом.СебестоимостьШтуки - 1) КАК ЧИСЛО(15, 1))
		              |		ИНАЧЕ 0
		              |	КОНЕЦ КАК ПроцентНаценки,
		              |	(ЗаказПокупателяТовары.Цена - (ЕСТЬNULL(ЦеныНом.СебестоимостьШтуки, 0) - ЕСТЬNULL(ЦеныНом.СебестоимостьШтуки, 0) / 1.18 * ЕСТЬNULL(втБонусы.Бонус, 0) / 100)) * ЗаказПокупателяТовары.Количество КАК ВаловаяПрибыльСУчетомБонуса,
		              |	ВЫБОР
		              |		КОГДА ЗаказПокупателяТовары.Цена - ЕСТЬNULL(ЦеныНом.СебестоимостьШтуки, 0) - ЕСТЬNULL(ЦеныНом.СебестоимостьШтуки, 0) / 1.18 * ЕСТЬNULL(втБонусы.Бонус, 0) / 100 > 0
		              |			ТОГДА ВЫРАЗИТЬ(100 * (ЗаказПокупателяТовары.Цена / (ЗаказПокупателяТовары.Цена - ЕСТЬNULL(ЦеныНом.СебестоимостьШтуки, 0) - ЕСТЬNULL(ЦеныНом.СебестоимостьШтуки, 0) / 1.18 * ЕСТЬNULL(втБонусы.Бонус, 0) / 100) - 1) КАК ЧИСЛО(15, 1))
		              |		ИНАЧЕ 0
		              |	КОНЕЦ КАК ПроцентНаценкиСУчетомБонуса
		              |ИЗ
		              |	(ВЫБРАТЬ
		              |		ЗаказПокупателяТовары.НомерСтроки КАК НомерСтроки,
		              |		ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
		              |		ЗаказПокупателяТовары.Количество КАК Количество,
		              |		ЗаказПокупателяТовары.Цена * ЗаказПокупателяТовары.Ссылка.КурсВзаиморасчетов * ВЫБОР
		              |			КОГДА ЗаказПокупателяТовары.Ссылка.ДоговорКонтрагента.ТипДоговора = ЗНАЧЕНИЕ(Справочник.ТипыДоговоров.ШинтрейдЯрославль)
		              |				ТОГДА 1.18
		              |			ИНАЧЕ 1
		              |		КОНЕЦ КАК Цена,
		              |		ЗаказПокупателяТовары.Сумма * ЗаказПокупателяТовары.Ссылка.КурсВзаиморасчетов * ВЫБОР
		              |			КОГДА ЗаказПокупателяТовары.Ссылка.ДоговорКонтрагента.ТипДоговора = ЗНАЧЕНИЕ(Справочник.ТипыДоговоров.ШинтрейдЯрославль)
		              |				ТОГДА 1.18
		              |			ИНАЧЕ 1
		              |		КОНЕЦ КАК Сумма
		              |	ИЗ
		              |		Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		              |	ГДЕ
		              |		ЗаказПокупателяТовары.Ссылка = &Ссылка) КАК ЗаказПокупателяТовары
		              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		              |			ПартииТоваровНаСкладахОстатки.Номенклатура КАК Номенклатура,
		              |			ПартииТоваровНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		              |			ПартииТоваровНаСкладахОстатки.СтоимостьОстаток КАК СтоимостьОстаток,
		              |			ВЫБОР
		              |				КОГДА ПартииТоваровНаСкладахОстатки.КоличествоОстаток > 0
		              |					ТОГДА ВЫРАЗИТЬ(ПартииТоваровНаСкладахОстатки.СтоимостьОстаток / ПартииТоваровНаСкладахОстатки.КоличествоОстаток КАК ЧИСЛО(15, 2))
		              |				ИНАЧЕ 0
		              |			КОНЕЦ КАК СебестоимостьШтуки
		              |		ИЗ
		              |			РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
		              |					&ДатаДок,
		              |					НЕ Склад.ЗапретитьИспользование
		              |						И Номенклатура В (&СписокНом)
		              |						И 99 = 99) КАК ПартииТоваровНаСкладахОстатки) КАК ПартииТоваровНаСкладахОстатки
		              |		ПО ЗаказПокупателяТовары.Номенклатура = ПартииТоваровНаСкладахОстатки.Номенклатура
		              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		              |			регСв.Номенклатура КАК Номенклатура,
		              |			ЕСТЬNULL(регСв.Цена, 0) КАК СебестоимостьШтуки
		              |		ИЗ
		              |			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		              |					&ДатаЦен,
		              |					ТипЦен = &ТипЦен
		              |						И Номенклатура В (&СписокНом)) КАК регСв) КАК ЦеныНом
		              |		ПО ЗаказПокупателяТовары.Номенклатура = ЦеныНом.Номенклатура
		              |		ЛЕВОЕ СОЕДИНЕНИЕ втБонусы КАК втБонусы
		              |		ПО ЗаказПокупателяТовары.Номенклатура = втБонусы.Номенклатура
		              |
		              |УПОРЯДОЧИТЬ ПО
		              |	НомерСтроки";
		
		
		//-----------------------------3 раза используется-----------------------------				  
		запрос1=новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Номенклатура
		|	ИЗ
		|		Документ.ЗаказПокупателя.Товары
		|	ГДЕ
		|		Документ.ЗаказПокупателя.Товары.Ссылка = &Ссылка");
		запрос1.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
		СписокНом = новый СписокЗначений;
		СписокНом.ЗагрузитьЗначения( запрос1.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура"));
		Запрос.Параметры.Вставить("СписокНом", СписокНом);
		
		Запрос.Параметры.Вставить("ДатаЦен",СсылкаНаОбъект.Дата);
		Запрос.Параметры.Вставить("ТипЦен", справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00008") ); //Базовая - 00008, Крупный опт - 00005
		
		Запрос.Текст = стрЗаменить(Запрос.Текст , "ЦеныНом.СебестоимостьШтуки", 
		"ВЫБОР 
		|КОГДА ПартииТоваровНаСкладахОстатки.НОМЕНКЛАТУРА.ВидТовара = &Диски ТОГДА
		|	ВЫБОР КОГДА ПартииТоваровНаСкладахОстатки.НОМЕНКЛАТУРА.производитель В (&СписокПроизводителей1) 
		|		ТОГДА Выразить( ЦеныНом.СебестоимостьШтуки*(1-0.47) как число(15,2))
		|        КОГДА	ПартииТоваровНаСкладахОстатки.НОМЕНКЛАТУРА.производитель=&Производитель2
		|		ТОГДА Выразить( ЦеныНом.СебестоимостьШтуки*(1-0.30) как число(15,2))
		|        КОГДА	ПартииТоваровНаСкладахОстатки.НОМЕНКЛАТУРА.производитель = &Производитель3
		|		ТОГДА Выразить( ЦеныНом.СебестоимостьШтуки*(1-0.18) как число(15,2))
		|		  ИНАЧЕ 
		|			ЦеныНом.СебестоимостьШтуки
		//|			Выразить( ПартииТоваровНаСкладах.Стоимость*(1-0.18) как число(15,2))
		|	КОНЕЦ
		|ИНАЧЕ ПартииТоваровНаСкладахОстатки.СебестоимостьШтуки
		|Конец");
		
		Запрос.Параметры.Вставить("Диски",Перечисления.ВидыТоваров.Диски);
		
		СписокПроизводителей1 = новый СписокЗначений;  //LegeArtis, NZ
		СписокПроизводителей1.Добавить(справочники.Производители.НайтиПоКоду(3072) );
		СписокПроизводителей1.Добавить(справочники.Производители.НайтиПоКоду(65) );
		СписокПроизводителей1.Добавить(справочники.Производители.НайтиПоКоду(68) );
		СписокПроизводителей1.Добавить(справочники.Производители.НайтиПоКоду(517) );//NZ
		Запрос.УстановитьПараметр("СписокПроизводителей1", СписокПроизводителей1); // -47%
		//TREBL
		Запрос.УстановитьПараметр("Производитель2", справочники.Производители.НайтиПоКоду(597) ); // -30%
		//ALCASTA
		Запрос.УстановитьПараметр("Производитель3", справочники.Производители.НайтиПоКоду(100) ); // -18%
	КонецЕсли;
	//+++)
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	Если ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "УчетТолькоПоПодразделениюПользователя") тогда
		
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"И 99 = 99",
		"И Склад.Транзитный"+?(ПараметрыСеанса.ТекущийПользователь.ОсновноеПодразделение.ОбособленноеПодразделение,"","=ЛОЖЬ")+" И Склад.Подразделение=&Подразделение");
		Запрос.УстановитьПараметр("Подразделение",ПараметрыСеанса.ТекущийПользователь.ОсновноеПодразделение); //только по своему подразделению
		
	Иначе
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"И 99 = 99"," И Склад.Транзитный"+?(СсылкаНаОбъект.транзит,"=Истина","=ЛОЖЬ")+"
		| И Склад.Подразделение=&ПодразделениеСклад" );	
		
		Если СсылкаНаОбъект.Транзит тогда
			Запрос.УстановитьПараметр("ПодразделениеСклад",СсылкаНаОбъект.Подразделение);
		иначе //ярославские склады - БЕЗ подразделения!
			Запрос.УстановитьПараметр("ПодразделениеСклад", справочники.Подразделения.ПустаяСсылка() );
		КонецЕсли;
		
	КонецЕсли;	
	
	Результат = Запрос.Выполнить();
	//тзРезультат	 = Результат.Выгрузить().ВыбратьСтроку();
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	
	ТабДок.Очистить();
	ОбластьЗаголовок.Параметры.Ссылка = Строка(СсылкаНаОбъект) ;
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	ВыборкаДетали = Результат.Выбрать();
	
	ИтогКоличество = 0;
	ИтогСумма = 0;
	ИтогВаловаяПрибыль = 0;
	ИтогПроцентНаценки = 0;
	ИтогВаловаяПрибыльСУчетомБонуса = 0;
	ИтогПроцентНаценкиСУчетомБонуса = 0;                                
	
	Пока ВыборкаДетали.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
		
		ИтогКоличество = ИтогКоличество+ВыборкаДетали.Количество;
		ИтогСумма = ИтогСумма + ВыборкаДетали.Сумма;  //+++ 09.11.2018 BugFix:  Поле объекта не обнаружено (Сумма) 
		ИтогВаловаяПрибыль = ИтогВаловаяПрибыль+?(ВыборкаДетали.ВаловаяПрибыль=Null,0,ВыборкаДетали.ВаловаяПрибыль);
		ИтогВаловаяПрибыльСУчетомБонуса = ИтогВаловаяПрибыльСУчетомБонуса+?(ВыборкаДетали.ВаловаяПрибыльСУчетомБонуса=Null,0,ВыборкаДетали.ВаловаяПрибыльСУчетомБонуса);
	КонецЦикла;
	
	ОбластьПодвалТаблицы.Параметры.ИтогКоличество = ИтогКоличество;
	ОбластьПодвалТаблицы.Параметры.ИтогСумма = ИтогСумма;
	ОбластьПодвалТаблицы.Параметры.ИтогВаловаяПрибыль = ИтогВаловаяПрибыль;
	ОбластьПодвалТаблицы.Параметры.ИтогВаловаяПрибыльСУчетомБонуса = ИтогВаловаяПрибыльСУчетомБонуса;
	
	ОбластьПодвалТаблицы.Параметры.ИтогПроцентНаценки = ?((ИтогСумма-ИтогВаловаяПрибыль)<>0, (ИтогСумма/(ИтогСумма-ИтогВаловаяПрибыль)-1)*100 ,0) ;
	ОбластьПодвалТаблицы.Параметры.ИтогПроцентНаценкиСУчетомБонуса = ?((ИтогСумма-ИтогВаловаяПрибыльСУчетомБонуса)<>0, (ИтогСумма/(ИтогСумма-ИтогВаловаяПрибыльСУчетомБонуса)-1)*100 ,0) ;
	
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	
	Возврат ТабДок;
КонецФункции