
Процедура ПередЗаписью(Отказ, Замещение)
	#Если Клиент Тогда
		Если НЕ Замещение и ЭтотОбъект.Количество() > 0 Тогда //Это новая запись
			
			Попытка	
				
				Для каждого стр из ЭтотОбъект Цикл	
					Набор = РегистрыСведений.ЖурналИзменений.СоздатьМенеджерЗаписи();
					Набор.Период = ТекущаяДата()+1;
					Набор.Активность = Истина;
					Набор.Пользователь= глТекущийПользователь;
					Набор.Объект = ЭтотОбъект.Отбор.Номенклатура.Значение;
					Набор.НомерЗаписи = 1;
					Набор.Компьютер = ИмяКомпьютера();
					
					Набор.Событие = "Добавление новой записи";
					Набор.Комментарий = "Стало: Дата: "+стр.Дата+" ; Тест пройден: "+стр.ТестПройден+" ; Прошедшая нагрузка: "+стр.ПрошедшаяНагрузка;
					Набор.ОбъектМетаданных = "Добавление новой записи";
					Набор.Записать();
				КонецЦикла;
			Исключение
				
			КонецПопытки;
			
		ИначеЕсли Замещение и ЭтотОбъект.Количество() = 0 Тогда //Удаление
			
			ЭтотОбъект.Прочитать();
			
			Попытка	
				
				Для каждого стр из ЭтотОбъект Цикл	
					Набор = РегистрыСведений.ЖурналИзменений.СоздатьМенеджерЗаписи();
					Набор.Период = ТекущаяДата();
					Набор.Активность = Истина;
					Набор.Пользователь= глТекущийПользователь;
					Набор.Объект = ЭтотОбъект.Отбор.Номенклатура.Значение;
					Набор.НомерЗаписи = 1;
					Набор.Компьютер = ИмяКомпьютера();
					
					Набор.Событие = "Удаление записи";
					Набор.Комментарий = "Было:   Дата: "+стр.Дата+" ; Тест пройден: "+стр.ТестПройден+" ; Прошедшая нагрузка: "+стр.ПрошедшаяНагрузка;
					Набор.ОбъектМетаданных = "Удаление записи";
					Набор.Записать();
				КонецЦикла;
				
			Исключение
				
			КонецПопытки;
			
			ЭтотОбъект.Очистить();
			
		Иначе 
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры
