
Функция Печать() Экспорт
	
	ЕдиницаИзмеренияВеса = Константы.ЕдиницаИзмеренияВеса.Получить();
    ИтогоМассаБрутто = 0; ИтогоКоличество=0; ИтогоМест=0;  КоличествоСтрок=0; ИтогоСуммаСНДС=0;
	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ТоварКод = "Артикул";
	Иначе
		ТоварКод = "Код";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза",          СсылкаНаОбъект.Дата);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СсылкаНаОбъект.Склад);
	Запрос.УстановитьПараметр("ТекущийДокумент",    СсылкаНаОбъект.Ссылка);
	Запрос.УстановитьПараметр("ПустойКонтрагент",    Справочники.Контрагенты.ПустаяСсылка());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.Дата КАК ДатаДокумента,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация КАК ЮрФизЛицо,
	|	РеализацияТоваровУслуг.Организация КАК Поставщик,
	|	РеализацияТоваровУслуг.Организация КАК Контрагент,
	|	РеализацияТоваровУслуг.Организация КАК Руководители,
	|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = &ПустойКонтрагент
	|			ТОГДА ВЫБОР
	|					КОГДА РеализацияТоваровУслуг.КонтрагентДляПечати = &ПустойКонтрагент
	|						ТОГДА РеализацияТоваровУслуг.Контрагент
	|					ИНАЧЕ РеализацияТоваровУслуг.КонтрагентДляПечати
	|				КОНЕЦ
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = &ПустойКонтрагент
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации КАК БанковскийСчет,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.КонтрагентДляПечати = &ПустойКонтрагент
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.КонтрагентДляПечати
	|	КОНЕЦ КАК Покупатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.КонтрагентДляПечати = &ПустойКонтрагент
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.КонтрагентДляПечати
	|	КОНЕЦ КАК Плательщик,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.Представление КАК Основание,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВедениеВзаиморасчетов КАК ВедениеВзаиморасчетов,
	|	ОтветственныеЛица.ФизическоеЛицо КАК ОтветственноеЛицо,
	|	РеализацияТоваровУслуг.Подразделение,
	|	РеализацияТоваровУслуг.ВалютаДокумента,
	|	РеализацияТоваровУслуг.КурсВзаиморасчетов КАК Курс,
	|	РеализацияТоваровУслуг.КратностьВзаиморасчетов КАК Кратность,
	|	РеализацияТоваровУслуг.УчитыватьНДС,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС,
	//+++  21.11.2012  РеализацияТоваровУслуг.ЧерезТК,  - "вдруг" исчезло...
	|	ЛОЖЬ как ЧерезТК,
	|	РеализацияТоваровУслуг.ОтгрузкаЧерезЧП,
	|	РеализацияТоваровУслуг.НомерДоверенности,
	|	РеализацияТоваровУслуг.ДатаДоверенности,
	|	РеализацияТоваровУслуг.ОрганизацияВыдавшаяДоверенность,
	|	РеализацияТоваровУслуг.ФизЛицоДоверенности,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.Дата,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.Номер
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛица.СрезПоследних(&ДатаСреза, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ОтветственныеЛица
	|		ПО (ОтветственныеЛица.СтруктурнаяЕдиница = РеализацияТоваровУслуг.Склад)
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект.Ссылка);

	Если СсылкаНаОбъект.ВалютаДокумента = СсылкаНаОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов Тогда
		// Документ оформлен в валюте взаиморасчетов
		Запрос.УстановитьПараметр("Курс", СсылкаНаОбъект.КурсВзаиморасчетов);
		Запрос.УстановитьПараметр("Кратность", СсылкаНаОбъект.КратностьВзаиморасчетов);
	Иначе
		// Документ оформлен в валюте регламентированного учета
		Запрос.УстановитьПараметр("Курс", 1);
		Запрос.УстановитьПараметр("Кратность", 1);
	КонецЕсли;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура                                  КАК Номенклатура,
	|	ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК Строка(1000)) КАК ТоварНаименование,
	|	ВложенныйЗапрос.Номенклатура." + ТоварКод + "                 КАК ТоварКод,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Представление                КАК БазоваяЕдиницаНаименование,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код  КАК БазоваяЕдиницаКодПоОКЕИ,
	|	ВложенныйЗапрос.ЕдиницаИзмерения     КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.ЕдиницаИзмеренияМест.Представление            КАК ВидУпаковки,
	|	ВложенныйЗапрос.КоэффициентМест / ВложенныйЗапрос.Коэффициент КАК КоличествоВОдномМесте,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.КоличествоМест > 0 ТОГДА ВложенныйЗапрос.КоличествоМест * ВложенныйЗапрос.ЕдиницаИзмеренияМест.Вес
	|		ИНАЧЕ ВложенныйЗапрос.Количество * ВложенныйЗапрос.ЕдиницаИзмерения.Вес
	|	КОНЕЦ КАК МассаБрутто,
	|	ВложенныйЗапрос.Характеристика       КАК Характеристика,
	|	ВложенныйЗапрос.Серия                КАК Серия,
	|	ВложенныйЗапрос.СтавкаНДС            КАК СтавкаНДС,
	|	ВложенныйЗапрос.Цена                 КАК Цена,
	|	ВложенныйЗапрос.Количество           КАК Количество,
	|	ВложенныйЗапрос.КоличествоМест       КАК КоличествоМест,
	|	ВложенныйЗапрос.Сумма                КАК Сумма,
	|	ВложенныйЗапрос.СуммаНДС             КАК СуммаНДС,
	|	ВложенныйЗапрос.НомерСтроки          КАК НомерСтроки,
	|	ВложенныйЗапрос.Метка                КАК Метка
	|ИЗ
	|
	|	(
	|	ВЫБРАТЬ
	|		РеализацияТоваровУслуг.Номенклатура,
	|		РеализацияТоваровУслуг.Коэффициент,
	|		РеализацияТоваровУслуг.ЕдиницаИзмерения,
	|		РеализацияТоваровУслуг.ЕдиницаИзмеренияМест,
	|		РеализацияТоваровУслуг.ЕдиницаИзмеренияМест.Коэффициент     КАК КоэффициентМест,
	|		РеализацияТоваровУслуг.ХарактеристикаНоменклатуры           КАК Характеристика,
	|		РеализацияТоваровУслуг.СерияНоменклатуры                    КАК Серия,
	|		РеализацияТоваровУслуг.СтавкаНДС,
	|		РеализацияТоваровУслуг.Цена * &Курс / &Кратность            КАК Цена,
	|		СУММА(РеализацияТоваровУслуг.Количество)                    КАК Количество,
	|		СУММА(РеализацияТоваровУслуг.КоличествоМест)                КАК КоличествоМест,
	|		СУММА(РеализацияТоваровУслуг.Сумма    * &Курс / &Кратность) КАК Сумма,
	|		СУММА(РеализацияТоваровУслуг.СуммаНДС * &Курс / &Кратность) КАК СуммаНДС,
	|		МИНИМУМ(РеализацияТоваровУслуг.НомерСтроки)                 КАК НомерСтроки,
	|		0                                                           КАК Метка
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслуг
	|	ГДЕ
	|		РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|		РеализацияТоваровУслуг.Номенклатура,
	|		РеализацияТоваровУслуг.Коэффициент,
	|		РеализацияТоваровУслуг.ЕдиницаИзмерения,
	|		РеализацияТоваровУслуг.ЕдиницаИзмеренияМест,
	|		РеализацияТоваровУслуг.ХарактеристикаНоменклатуры,
	|		РеализацияТоваровУслуг.СерияНоменклатуры,
	|		РеализацияТоваровУслуг.СтавкаНДС,
	|		РеализацияТоваровУслуг.Цена
	|
	|	) КАК ВложенныйЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Номенклатура                  КАК Номенклатура,
	|	РеализацияТоваровУслуг.Содержание                    КАК ТоварНаименование,
	|	РеализацияТоваровУслуг.Номенклатура." + ТоварКод + " КАК ТоварКод,
	|	РеализацияТоваровУслуг.Номенклатура.ЕдиницаХраненияОстатков.Представление КАК БазоваяЕдиницаНаименование,
	|	РеализацияТоваровУслуг.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код КАК БазоваяЕдиницаКодПоОКЕИ,
	|	РеализацияТоваровУслуг.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|	NULL                                                 КАК ВидУпаковки,
	|	NULL                                                 КАК КоличествоВОдномМесте,
	|	0                                                    КАК МассаБрутто,
	|	NULL                                                 КАК Характеристика,
	|	NULL                                                 КАК Серия,
	|	РеализацияТоваровУслуг.СтавкаНДС                     КАК СтавкаНДС,
	|	РеализацияТоваровУслуг.Цена * &Курс / &Кратность     КАК Цена,
	|	РеализацияТоваровУслуг.Количество                    КАК Количество,
	|	NULL                                                 КАК КоличествоМест,
	|	РеализацияТоваровУслуг.Сумма    * &Курс / &Кратность КАК Сумма,
	|	РеализацияТоваровУслуг.СуммаНДС * &Курс / &Кратность КАК СуммаНДС,
	|	РеализацияТоваровУслуг.НомерСтроки                   КАК НомерСтроки,
	|	1                                                    КАК Метка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслуг
	|
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Номенклатура                    КАК Номенклатура,
	|	ВЫРАЗИТЬ(РеализацияТоваровУслуг.Номенклатура.НаименованиеПолное КАК Строка(1000)) КАК ТоварНаименование,
	|	РеализацияТоваровУслуг.Номенклатура." + ТоварКод + "   КАК ТоварКод,
	|	РеализацияТоваровУслуг.Номенклатура.ЕдиницаХраненияОстатков.Представление               КАК БазоваяЕдиницаНаименование,
	|	РеализацияТоваровУслуг.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код КАК БазоваяЕдиницаКодПоОКЕИ,
	|	РеализацияТоваровУслуг.Номенклатура.ЕдиницаХраненияОстатков                             КАК ЕдиницаИзмерения,
	|	NULL                                                  КАК ВидУпаковки,
	|	NULL                                                  КАК КоличествоВОдномМесте,
	|	РеализацияТоваровУслуг.Количество * РеализацияТоваровУслуг.Номенклатура.ЕдиницаХраненияОстатков.Вес КАК МассаБрутто,
	|	NULL                                                  КАК Характеристика,
	|	NULL                                                  КАК Серия,
	|	""Без НДС""                                           КАК СтавкаНДС,
	|	РеализацияТоваровУслуг.Цена * &Курс / &Кратность      КАК Цена,
	|	РеализацияТоваровУслуг.Количество                     КАК Количество,
	|	NULL                                                  КАК КоличествоМест,
	|	РеализацияТоваровУслуг.Сумма * &Курс / &Кратность     КАК Сумма,
	|	0                                                     КАК СуммаНДС,
	|	РеализацияТоваровУслуг.НомерСтроки                    КАК НомерСтроки,
	|	2                                                     КАК Метка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВозвратнаяТара КАК РеализацияТоваровУслуг
	|
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО Метка ВОЗР, НомерСтроки ВОЗР
	|
	|";
	ЗапросТовары = Запрос.Выполнить().Выгрузить();
	ТабДокумент  = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_ТОРГ12";

	Макет = ПолучитьМакет("ТОРГ12");

	// Выводим общие реквизиты шапки
	
	Если НЕ Шапка.ОтгрузкаЧерезЧП Тогда
	
		СведенияОПоставщике       = СведенияОЮрФизЛице(Шапка.ЮрФизЛицо,        Шапка.ДатаДокумента,, Шапка.БанковскийСчет);	
		
	Иначе 
		
		Если НЕ ЗначениеНеЗаполнено(Константы.ПродажиЧерезЧПОрганизацияДляПечати.Получить()) Тогда
		
			СведенияОПоставщике		  = СведенияОЮрФизЛице(Константы.ПродажиЧерезЧПОрганизацияДляПечати.Получить(),        Шапка.ДатаДокумента,, Константы.ПродажиЧерезЧПОрганизацияДляПечати.Получить().ОсновнойБанковскийСчет);		
			
		Иначе 
			
			СведенияОПоставщике       = СведенияОЮрФизЛице(Шапка.ЮрФизЛицо,        Шапка.ДатаДокумента,, Шапка.БанковскийСчет);		
		
		КонецЕсли; 
		
		
	КонецЕсли; 
	
	
	
	Если НЕ Шапка.ЧерезТК Тогда 
		СведенияОПокупателе       	  = СведенияОЮрФизЛице(Шапка.Покупатель,       Шапка.ДатаДокумента);
	Иначе
		Если Константы.ТорговаяКомпания.Получить() <> Справочники.Контрагенты.ПустаяСсылка() Тогда 
			СведенияОПокупателе       = СведенияОЮрФизЛице(Константы.ТорговаяКомпания.Получить(),       Шапка.ДатаДокумента);
		Иначе
			СведенияОПокупателе       = СведенияОЮрФизЛице(Шапка.Покупатель,       Шапка.ДатаДокумента);
	    КонецЕсли;
	КонецЕсли;
	
	СведенияОГрузополучателе  = СведенияОЮрФизЛице(Шапка.Грузополучатель,  Шапка.ДатаДокумента);
	
	Если Шапка.ОтгрузкаЧерезЧП Тогда
		
		Если Шапка.ЮрФизЛицо = Шапка.Грузоотправитель Тогда
			
			СведенияОГрузоотправитель = СведенияОЮрФизЛице(Константы.ПродажиЧерезЧПОрганизацияДляПечати.Получить(),        Шапка.ДатаДокумента);	
			
		Иначе
			
			СведенияОГрузоотправитель = СведенияОЮрФизЛице(Шапка.Грузоотправитель, Шапка.ДатаДокумента);	
			
		КонецЕсли; 
		
	Иначе
		
		СведенияОГрузоотправитель = СведенияОЮрФизЛице(Шапка.Грузоотправитель, Шапка.ДатаДокумента);	
		
	КонецЕсли; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.НомерДокумента = ПолучитьНомерНаПечать(Шапка);
	ОбластьМакета.Параметры.ДатаДокумента  = Шапка.ДатаДокумента;

Если Найти(ссылкаНаОбъект.ДоговорКонтрагента.Наименование,"*")=0 тогда	//*
	
	ОбластьМакета.Параметры.текстПереходаПрава = "Право денежного требования по оплате нижеуказанного товара уступлено Поставщиком (Продавцом) ОАО Ярославский филиал ""Промсвязьбанк"". Покупатель уведомлен об уступке прав требования и необходимости оплаты нижеуказанного товара исключительно по реквизитам: счет ОАО Ярославский филиал ""Промсвязьбанк"" 47402810672000845601, к/с 30101810300000000760 в ГРКЦ ГУ Банка России по Ярославской обл., г.Ярославль, БИК 047888760, ИНН 7744000912, КПП 760402001. В случае возникновения каких-либо вопросов по порядку расчетов Покупатель обязан обратиться в ОАО Ярославский филиал ""Промсвязьбанк"" по телефону (4852) 78-18-11, 71-34-87";
	
	//Доверенность
	ОбластьМакета.Параметры.НомерДоверенности = Шапка.НомерДоверенности;
	ОбластьМакета.Параметры.ДатаДоверенности  = Шапка.ДатаДоверенности;
	ОбластьМакета.Параметры.КемВыдана 		  = Шапка.ОрганизацияВыдавшаяДоверенность.НаименованиеПолное;
	ОбластьМакета.Параметры.КомуВыдана 		  = Шапка.ФизЛицоДоверенности;
	
	Руководители = ОтветственныеЛицаОрганизации(Шапка.Руководители, Шапка.ДатаДокумента,);
	Руководитель = Руководители.Руководитель;
	Бухгалтер    = Руководители.ГлавныйБухгалтер;
	
	
	//	ОбластьМакета.Параметры.ФИОРуководителя       = Руководитель;
	//	ОбластьМакета.Параметры.ФИОГлавБухгалтера     = Бухгалтер;
	
	ОбластьМакета.Параметры.ДатаДокумента=Формат(Шапка.ДатаДокумента,"ДЛФ=DD");
	
	ОбластьМакета.Параметры.ДолжностьРуководителя = Руководители.РуководительДолжность;	
	
	
	ФамилияИмяОтчествоФизЛица                     = ФамилияИмяОтчество(Шапка.ОтветственноеЛицо, Шапка.ДатаДокумента);
	//	ФамилияИмяОтчествоКладовщика                  = ФамилияИмяОтчествоФизЛица.Фамилия + " " + ФамилияИмяОтчествоФизЛица.Имя + " " + ФамилияИмяОтчествоФизЛица.Отчество;
	//	ОбластьМакета.Параметры.ФИОКладовщика         = ФамилияИнициалыФизЛица(ФамилияИмяОтчествоКладовщика);
	
	//+++ 30.03.2012
	
	Если  СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.ФормулаАвтоПлюс Тогда 
			
		Ответств = СсылкаНаОбъект.Ответственный;
		ОбластьМакета.Параметры.ФИОразрешил = Ответств;
		ОбластьМакета.Параметры.ДолжностьРуководителя = "";
		
		ОбластьМакета.Параметры.ФИОпроизвел = Ответств;
		ОбластьМакета.Параметры.ДолжностьКладовщика = "";
		
		ОбластьМакета.Параметры.Доверенность1 = "Имеет право подписи:"; // бух = рук
		ОбластьМакета.Параметры.Доверенность2 = "Невежина Ирина Николаевна по доверенности № 30 от 05.12.2016";
		Если СсылкаНаОбъект.Дата > Дата('20171106000000') Тогда //Лукьяненков 06.11.2017
			ОбластьМакета.Параметры.Доверенность3 = "Ловыгина Елена Игоревна по доверенности № 611 от 02.11.2017";
		Иначе
			ОбластьМакета.Параметры.Доверенность3 = "Рыгачева Татьяна Николаевна по доверенности № 29 от 05.12.2016";
		КонецЕсли;
		
	ИначеЕсли ( СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00107") )
		или ( СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00107") ) тогда
		//ПредставлениеПодразделения
		ОбластьМакета.Параметры.ФИОразрешил = "Войновская Н.Р.";
		ОбластьМакета.Параметры.ФИОглБух	= "Войновская Н.Р.";
		ОбластьМакета.Параметры.ФИОпроизвел = "Войновская Н.Р.";
		ОбластьМакета.Параметры.Доверенность1 = "Руководитель обособленного подразделения г.Москва Войновская Н.Р. на основании приказа по ЗАО ТК ""Яршинторг"" №______ от ___.____._____г.";
		ОбластьМакета.Параметры.Доверенность2 = "";
		ОбластьМакета.Параметры.Доверенность3 = "";
	иначеЕсли ( СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00106") ) //рнд
		или ( СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00106") ) тогда   //+++ 13.08.2012
		//ПредставлениеПодразделения
		Отбор1 = новый Структура;
		Отбор1.Вставить("Подразделение",справочники.Подразделения.НайтиПоКоду("00106"));
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Руководитель);
		регСведРук = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
		регСведГлБух = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		ОбластьМакета.Параметры.ФИОразрешил = регСведГлБух.ФизическоеЛицо; //Жилин А.В.";      
		ОбластьМакета.Параметры.ДолжностьРуководителя = регСведГлБух.Должность;//"Глав.бух.ф-ла г. Ростов-на-Дону";
		
		ОбластьМакета.Параметры.ФИОглБух	= регСведГлБух.ФизическоеЛицо; //Иноземцева Н.И.";
		ОбластьМакета.Параметры.ФИОпроизвел = регСведГлБух.ФизическоеЛицо; //Жилин А.В.";
		ОбластьМакета.Параметры.Доверенность1 = регСведРук.Должность+" "+строка(регСведРук.ФизическоеЛицо)+", действующий  на основании "+регСведРук.Доверенность; // 186 от 10 августа 2012
		ОбластьМакета.Параметры.Доверенность2 = регСведГлБух.Должность+" "+строка(регСведГлБух.ФизическоеЛицо)+", действующий  на основании "+регСведГлБух.Доверенность;
		ОбластьМакета.Параметры.ДолжностьКладовщика = регСведГлБух.Должность;
		
	//+++( 26.11.2013 - по ответственному 
		//Если СсылкаНаОбъект.Дата>='20131031' и СсылкаНаОбъект.Ответственный = Справочники.Пользователи.НайтиПоКоду("Михалева Е. А.") Тогда
		//ОбластьМакета.Параметры.Доверенность3 = "Оператор ПК-менеджер филиала в г. Ростов-На-Дону Михалева Е.А., действующий на основании Доверенности №253 от 31 октября 2013г.";
		//	ОбластьМакета.Параметры.ФИОразрешил = "Михалева Е.А.";
		//	ОбластьМакета.Параметры.ФИОглБух    = "Михалева Е.А.";
		//	ОбластьМакета.Параметры.ФИОпроизвел = "Михалева Е.А.";
		//	ОбластьМакета.Параметры.ДолжностьРуководителя = "Оператор ПК-менеджер";
		//	ОбластьМакета.Параметры.ДолжностьКладовщика   = "Оператор ПК-менеджер";
		//КонецЕсли;
		Если СсылкаНаОбъект.Дата>='20131031' Тогда // ТРОЕ - каждый - за всех!
			
			Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Кассир);
			регСведКассир = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
			
			//			"Оператор ПК-менеджер филиала в г. Ростов-На-Дону Михалева Е.А., действующий на основании Доверенности №253 от 31 октября 2013г.";
			ОбластьМакета.Параметры.Доверенность3 = регСведКассир.Должность+" "+строка(регСведКассир.ФизическоеЛицо)+", действующий  на основании "+регСведКассир.Доверенность;
			
			Если регСведРук.ФизическоеЛицо = СсылкаНаОбъект.Ответственный.ФизЛицо тогда
				регСведРнД = регСведРук;
			ИначеЕсли регСведГлБух.ФизическоеЛицо = СсылкаНаОбъект.Ответственный.ФизЛицо тогда
				регСведРнД = регСведГлБух;
			ИначеЕсли регСведКассир.ФизическоеЛицо = СсылкаНаОбъект.Ответственный.ФизЛицо тогда
				регСведРнД = регСведКассир;
			Иначе
				регСведРнД = новый Структура("ФизическоеЛицо, Должность, Доверенность","","",""); 
			КонецЕсли;
			// 1 за всех 
			Если НЕ регСведРнД.ФизическоеЛицо = "" Тогда  //***2016.04.18 добавлено условие
				ОбластьМакета.Параметры.ФИОразрешил = регСведРнД.ФизическоеЛицо.Наименование;
				ОбластьМакета.Параметры.ФИОглБух    = регСведРнД.ФизическоеЛицо.Наименование;
				ОбластьМакета.Параметры.ФИОпроизвел = регСведРнД.ФизическоеЛицо.Наименование;
			КонецЕсли;
			ОбластьМакета.Параметры.ДолжностьРуководителя = регСведРнД.Должность;
			ОбластьМакета.Параметры.ДолжностьКладовщика   = регСведРнД.Должность;
		КонецЕсли;
		//+++)

	иначеЕсли  СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00112") 
		или  СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00112") тогда   //+++ 30.07.2013
		//ПредставлениеПодразделения
		Отбор1 = новый Структура;
		Отбор1.Вставить("Подразделение",справочники.Подразделения.НайтиПоКоду("00112"));
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Руководитель);
		регСведРук = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Кассир);
		регСведГлБух = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		ОбластьМакета.Параметры.ФИОразрешил = регСведРук.ФизическоеЛицо; //Жилин А.В.";      
		ОбластьМакета.Параметры.ДолжностьРуководителя = регСведРук.Должность;
		
		ОбластьМакета.Параметры.ФИОглБух	= регСведРук.ФизическоеЛицо; 
		
		//Кладовщик = ПолучитьКладовщика(); //+++ 01.08.2013
		ОбластьМакета.Параметры.ФИОпроизвел = строка(регСведГлБух.ФизическоеЛицо);
		ОбластьМакета.Параметры.ДолжностьКладовщика = регСведГлБух.Должность;
		
		ОбластьМакета.Параметры.Доверенность1 = регСведРук.Должность+" "+строка(регСведРук.ФизическоеЛицо)+", действующий  на основании "+регСведРук.Доверенность;
		ОбластьМакета.Параметры.Доверенность2 = регСведГлБух.Должность+" "+строка(регСведГлБух.ФизическоеЛицо)+", действующий  на основании "+регСведГлБух.Доверенность;
		ОбластьМакета.Параметры.Доверенность3 = "";
		
ИначеЕсли  СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00122")
			Или СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00122") тогда // 23.07.2014
			
		//ПредставлениеПодразделения
		Отбор1 = новый Структура;
		Отбор1.Вставить("Подразделение",справочники.Подразделения.НайтиПоКоду("00122"));
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Руководитель);
		регСведРук = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
		регСведГлБух = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Кассир);
		регСведКладовщик = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
	
		ОбластьМакета.Параметры.ФИОразрешил = регСведРук.ФизическоеЛицо; //Жилин А.В.";      
		ОбластьМакета.Параметры.ДолжностьРуководителя = регСведРук.Должность;//"Глав.бух.ф-ла г. Ростов-на-Дону";
		
		ОбластьМакета.Параметры.ФИОглБух	= регСведГлБух.ФизическоеЛицо; 
		
		ОбластьМакета.Параметры.ДолжностьКладовщика = регСведКладовщик.Должность;
		ОбластьМакета.Параметры.ФИОпроизвел = регСведКладовщик.ФизическоеЛицо; 
		
		ОбластьМакета.Параметры.Доверенность1 = ""; // бух = рук
	//	ОбластьМакета.Параметры.Доверенность1 = регСведРук.Должность+" "+строка(регСведРук.ФизическоеЛицо)+", действующий  на основании "+регСведРук.Доверенность; 
		ОбластьМакета.Параметры.Доверенность2 = регСведГлБух.Должность+" "+строка(регСведГлБух.ФизическоеЛицо)+", действующий  на основании "+регСведГлБух.Доверенность;
		ОбластьМакета.Параметры.Доверенность3 = регСведКладовщик.Должность+" "+строка(регСведКладовщик.ФизическоеЛицо)+", действующий  на основании "+регСведКладовщик.Доверенность;
		
//01.06.15	
ИначеЕсли  СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00138")
			Или СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00138") тогда // 23.07.2014
			
		//ПредставлениеПодразделения
		Отбор1 = новый Структура;
		Отбор1.Вставить("Подразделение",справочники.Подразделения.НайтиПоКоду("00138"));
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Руководитель);
		регСведРук = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
		регСведГлБух = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Кассир);
		регСведКладовщик = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
	
		ОбластьМакета.Параметры.ФИОразрешил = регСведРук.ФизическоеЛицо; //Жилин А.В.";      
		ОбластьМакета.Параметры.ДолжностьРуководителя = регСведРук.Должность;//"Глав.бух.ф-ла г. Ростов-на-Дону";
		
		ОбластьМакета.Параметры.ФИОглБух	= регСведГлБух.ФизическоеЛицо; 
		
		ОбластьМакета.Параметры.ДолжностьКладовщика = регСведКладовщик.Должность;
		ОбластьМакета.Параметры.ФИОпроизвел = регСведКладовщик.ФизическоеЛицо; 
		
		ОбластьМакета.Параметры.Доверенность1 = ""; // бух = рук
	//	ОбластьМакета.Параметры.Доверенность1 = регСведРук.Должность+" "+строка(регСведРук.ФизическоеЛицо)+", действующий  на основании "+регСведРук.Доверенность; 
		ОбластьМакета.Параметры.Доверенность2 = регСведГлБух.Должность+" "+строка(регСведГлБух.ФизическоеЛицо)+", действующий  на основании "+регСведГлБух.Доверенность;
		ОбластьМакета.Параметры.Доверенность3 = регСведКладовщик.Должность+" "+строка(регСведКладовщик.ФизическоеЛицо)+", действующий  на основании "+регСведКладовщик.Доверенность;
		
		
//05.11.14	Смирнов
ИначеЕсли  СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00133")
			Или СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00133") тогда 
			
		//ПредставлениеПодразделения
		Отбор1 = новый Структура;
		Отбор1.Вставить("Подразделение",справочники.Подразделения.НайтиПоКоду("00133"));
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Руководитель);
		регСведРук = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
		регСведГлБух = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Кассир);
		регСведКладовщик = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
	
		ОбластьМакета.Параметры.ФИОразрешил = регСведРук.ФизическоеЛицо; ;      
		ОбластьМакета.Параметры.ДолжностьРуководителя = регСведРук.Должность;
		
		ОбластьМакета.Параметры.ФИОглБух	= регСведГлБух.ФизическоеЛицо; 
		
		ОбластьМакета.Параметры.ДолжностьКладовщика = регСведКладовщик.Должность;
		ОбластьМакета.Параметры.ФИОпроизвел = регСведКладовщик.ФизическоеЛицо; 
		
		ОбластьМакета.Параметры.Доверенность1 = ""; // бух = рук
	//	ОбластьМакета.Параметры.Доверенность1 = регСведРук.Должность+" "+строка(регСведРук.ФизическоеЛицо)+", действующий  на основании "+регСведРук.Доверенность; 
		ОбластьМакета.Параметры.Доверенность2 = регСведГлБух.Должность+" "+строка(регСведГлБух.ФизическоеЛицо)+", действующий  на основании "+регСведГлБух.Доверенность;
		ОбластьМакета.Параметры.Доверенность3 = регСведКладовщик.Должность+" "+строка(регСведКладовщик.ФизическоеЛицо)+", действующий  на основании "+регСведКладовщик.Доверенность;	

	иначе //Яршинторг	
		ОбластьМакета.Параметры.ФИОразрешил = "Фролов А.И.";
		//ОбластьМакета.Параметры.Доверенность1 = "Зав.складом Фролов А.И. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/21 от 01.07.2009 г.";
		ОбластьМакета.Параметры.Доверенность1 = "Зав.складом Фролов А.И. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/20/2 от 26.07.2011 г.";
		
		ОбластьМакета.Параметры.ФИОглБух	= "Короткова Е.Ю.";
		//ОбластьМакета.Параметры.Доверенность2 = "Бухгалтер Короткова Е.Ю. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/09 от 29.03.2010 г.";
		ОбластьМакета.Параметры.Доверенность2 = "Бухгалтер Короткова Е.Ю. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/20/2 от 26.07.2011 г.";
		
		Если СсылкаНаОбъект.Дата >= '20150902' Тогда  //+++ 07.09.2015 - без Коротковой со 02.09.2015г.
			ОбластьМакета.Параметры.ФИОглБух	= ""; 
			ОбластьМакета.Параметры.Доверенность2 = "";
		КонецЕсли;	
		
		
		
		//Орлов ++
		Если СсылкаНаОбъект.Дата < Дата("20130401000000") Тогда
			//ОбластьМакета.Параметры.Доверенность3 = "Старший кладовщик Гаричев Д.Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/37 от 01.12.2010 г.";	
			ОбластьМакета.Параметры.Доверенность3 = "Старший кладовщик Гаричев Д.Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/20/2 от 26.07.2011 г.";
		ИначеЕсли СсылкаНаОбъект.Дата < Дата("20160211000000") Тогда
			ОбластьМакета.Параметры.ФИОглБух1	= "Невежина И. Н.";
			ОбластьМакета.Параметры.Доверенность3 = "Бухгалтер Невежина И. Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/19 от 01.04.2013 г.";
			ОбластьМакета.Параметры.Доверенность4 = "Старший кладовщик Гаричев Д.Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/20/2 от 26.07.2011 г.";
			ОбластьМакета.Параметры.ФИОглБух2   = "Князева И. И.";
			ОбластьМакета.Параметры.Доверенность5 = "Старший кладовщик Цверава В.У. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/25/1 от 31.05.2013 г.";
			ОбластьМакета.Параметры.Доверенность6 = "Бухгалтер Князева И. И. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/62 от 13.12.2013 г.";
		Иначе //+++ 11.02.2016 //Лукьяненков 06.11.2017
			
			Если СсылкаНаОбъект.Дата > Дата('20171106000000') Тогда
				ОбластьМакета.Параметры.ФИОглБух	= "Ловыгина Е.И.";
			Иначе
				ОбластьМакета.Параметры.ФИОглБух	= "Рыгачева Т.Н.";
			КонецЕсли;
			
			ОбластьМакета.Параметры.ФИОглБух1	= "Невежина И. Н.";
			Если СсылкаНаОбъект.Дата > Дата('20171106000000') Тогда
				ОбластьМакета.Параметры.Доверенность2 = "Менеджер по транспорту Ловыгина Е.И. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/67 от 02.11.2017 г.";
			Иначе
				ОбластьМакета.Параметры.Доверенность2 = "Менеджер по транспорту Рыгачева Т.Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/35 от 16.05.2016 г.";
			КонецЕсли;
			ОбластьМакета.Параметры.Доверенность3 = "Оператор ПК Невежина И. Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/9 от 10.02.2016 г.";
			ОбластьМакета.Параметры.Доверенность4 = "Старший кладовщик Гаричев Д.Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/20/2 от 26.07.2011 г.";
			ОбластьМакета.Параметры.ФИОглБух2   = "Князева И. И.";
			ОбластьМакета.Параметры.Доверенность5 = "Старший кладовщик Цверава В.У. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/9 от 31.05.2013 г.";
			ОбластьМакета.Параметры.Доверенность6 = "Оператор ПК Князева И. И. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/9 от 10.02.2016 г.";
		КонецЕсли;
		//КонецЕсли;
		ОбластьМакета.Параметры.ФИОпроизвел = "Фролов А.И.";
	КонецЕсли;
	
	//2013.11.14
	Если СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.НайтиПоКоду("Я0004") Тогда //ФормулаАвто
		ОбластьМакета.Параметры.ДолжностьРуководителя = "Генеральный директор";
		ОбластьМакета.Параметры.ФИОразрешил = "Зайцева Н.С.";  
		ОбластьМакета.Параметры.ФИОглБух = "Зайцева Н.С.";
		//+++ 23.03.2017
		//ОбластьМакета.Параметры.ФИОглБух1 = "";
		//ОбластьМакета.Параметры.ФИОглБух2 = "";
		//ОбластьМакета.Параметры.ФИОпроизвел = "";
		//ОбластьМакета.Параметры.Доверенность1 = "";
		//ОбластьМакета.Параметры.Доверенность2 = "";
		//ОбластьМакета.Параметры.Доверенность3 = "";
		//ОбластьМакета.Параметры.Доверенность4 = "";
		//ОбластьМакета.Параметры.Доверенность5 = "";
		//ОбластьМакета.Параметры.Доверенность6 = "";
	//А.А.	
	ИначеЕсли СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.ФормулаАвтоПлюс Тогда //ФормулаАвтоПлюс
		//ОбластьМакета.Параметры.ДолжностьРуководителя = "Генеральный директор";
		//ОбластьМакета.Параметры.ФИОразрешил = "Курапова Е.А.";  
		//ОбластьМакета.Параметры.ФИОглБух = "Курапова Е.А.";
		//ОбластьМакета.Параметры.ФИОглБух1 = "";
		//ОбластьМакета.Параметры.ФИОглБух2 = "";
		//ОбластьМакета.Параметры.ФИОпроизвел = "";
		//ОбластьМакета.Параметры.Доверенность1 = "";
		//ОбластьМакета.Параметры.Доверенность2 = "";
		//ОбластьМакета.Параметры.Доверенность3 = "";
		//ОбластьМакета.Параметры.Доверенность4 = "";
		//ОбластьМакета.Параметры.Доверенность5 = "";
		//ОбластьМакета.Параметры.Доверенность6 = "";
	//ОЛ 29.01.2015 для экспорта
	ИначеЕсли СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.ШинтрейдЯрославль Тогда //ФормулаАвто
		ОбластьМакета.Параметры.ДолжностьРуководителя = "Директор";
		ОбластьМакета.Параметры.ФИОразрешил = "Захаров В.В.";  
		ОбластьМакета.Параметры.ФИОглБух = "Захаров В.В.";
		//ОбластьМакета.Параметры.ФИОглБух1 = "";
		//ОбластьМакета.Параметры.ФИОглБух2 = "";
		ОбластьМакета.Параметры.ФИОпроизвел = "";
		ОбластьМакета.Параметры.Доверенность1 = "";
		ОбластьМакета.Параметры.Доверенность2 = "";
		ОбластьМакета.Параметры.Доверенность3 = "";
		//ОбластьМакета.Параметры.Доверенность4 = "";
		//ОбластьМакета.Параметры.Доверенность5 = "";
		//ОбластьМакета.Параметры.Доверенность6 = "";
	КонецЕсли;
	
	Если НЕ ЗначениеНеЗаполнено(ЕдиницаИзмеренияВеса) И ИтогоМассаБрутто > 0 Тогда
		Если ЕдиницаИзмеренияВеса.Наименование = "кг" Тогда
			ВесКгГрамм="кг.,кг.,кг.,,гр.,гр.,гр.,,3";
			
			ОбластьМакета.Параметры.МассаГрузаПрописью = ЧислоПрописью(ИтогоМассаБрутто,"ДП = Истина",ВесКгГрамм);
			
			//+Лукьяненков 28.08.2017
			Если СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.ШинтрейдЯрославль И ИтогоКоличество > 0 Тогда
				//ОбластьМакета.Параметры.КоличествоПрописью = ЧислоПрописью(ИтогоКоличество,"ДП = Истина",ВесКгГрамм);
			КонецЕсли;
		Иначе
			ОбластьМакета.Параметры.МассаГрузаПрописью = ЧислоПрописью(ИтогоМассаБрутто, ,",,,,,,,,0")+ " " +ЕдиницаИзмеренияВеса.Наименование + ".";
		КонецЕсли;
	КонецЕсли;
	
	Если ИтогоМест > 0 Тогда
		ОбластьМакета.Параметры.ВсегоМестПрописью = ЧислоПрописью(ИтогоМест,,",,,,,,,,0");
	КонецЕсли;
	
	ОбластьМакета.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоСтрок, ,",,,,,,,,0");
	мВалютаРегламентированногоУчета   = Константы.ВалютаРегламентированногоУчета.Получить();
	ОбластьМакета.Параметры.СуммаПрописью = СформироватьСуммуПрописью(ИтогоСуммаСНДС, мВалютаРегламентированногоУчета);
	
	//+++
	ОбластьМакета.Параметры.АвтомобильТелефон = ?(СокрЛП(ссылкаНаОбъект.МаркаАвтомобиля)="" и СокрЛП(ссылкаНаОбъект.ГосНомерАвтомобиля)="", "",
	СокрЛП(ссылкаНаОбъект.МаркаАвтомобиля)+" "+СокрЛП(ссылкаНаОбъект.ГосНомерАвтомобиля)+",")
	+?(СокрЛП(Шапка.ФизЛицоДоверенности)="","", " Водитель: "+СокрЛП(Шапка.ФизЛицоДоверенности)+",")
	+?(сокрЛП(ссылкаНаОбъект.ВидПеревозки)="", "", " тел.:"+СокрЛП(ссылкаНаОбъект.ВидПеревозки));
	
	Если Шапка.ЮрФизЛицо = Шапка.Грузоотправитель Тогда
		ОбластьМакета.Параметры.ПредставлениеОрганизации = ОписаниеОрганизации(СведенияОПоставщике);
	Иначе
		ОбластьМакета.Параметры.ПредставлениеОрганизации = ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	КонецЕсли;

	ОбластьМакета.Параметры.ПредставлениеПодразделения = Шапка.Подразделение;

			Если СокрЛП(Шапка.АдресДоставки) <> "" Тогда
			ПредставлениеГрузополучателяДоАдреса    = ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ИНН,");
			ПредставлениеГрузополучателяПослеАдреса = ОписаниеОрганизации(СведенияОГрузополучателе, "Телефоны,НомерСчета,Банк,БИК,КоррСчет,");
			ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ?(СокрЛП(ПредставлениеГрузополучателяДоАдреса) = "", "", ПредставлениеГрузополучателяДоАдреса+", ") + Шапка.АдресДоставки+?(СокрЛП(ПредставлениеГрузополучателяПослеАдреса)="", "", ", "+ПредставлениеГрузополучателяПослеАдреса);
			Иначе
				ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
			КонецЕсли;

		ОбластьМакета.Параметры.ПредставлениеПоставщика  = ОписаниеОрганизации(СведенияОПоставщике);
		ОбластьМакета.Параметры.ПредставлениеПлательщика = ОписаниеОрганизации(СведенияОПокупателе);

		//+++ 24.11.2014 - название договора - комиссии, поставки или для прочего - название...!
		назвДог = ?(СсылкаНаОбъект.ДоговорКонтрагента.ВидДоговора = перечисления.ВидыДоговоровКонтрагентов.СКомиссионером,"Договор комиссии",
				?(СсылкаНаОбъект.ДоговорКонтрагента.ВидДоговора = перечисления.ВидыДоговоровКонтрагентов.Прочее, 
				     СсылкаНаОбъект.ДоговорКонтрагента.Наименование, "Договор поставки"));
		ОбластьМакета.Параметры.Основание = назвДог+" №"+Шапка.ДоговорКонтрагентаНомер+" от "+Формат(Шапка.ДоговорКонтрагентаДата,"ДФ=dd.MM.yyyy; ДП=-");
	
	// Выводим всевозможные коды
	ОбластьМакета.Параметры.ОрганизацияПоОКПО     = СведенияОПоставщике.КодПоОКПО;
	ОбластьМакета.Параметры.ВидДеятельностиПоОКДП = "";
	ОбластьМакета.Параметры.ГрузополучательПоОКПО = СведенияОПокупателе.КодПоОКПО;
	ОбластьМакета.Параметры.ПоставщикПоОКПО       = СведенияОПоставщике.КодПоОКПО;
	ОбластьМакета.Параметры.ПлательщикПоОКПО      = СведенияОПокупателе.КодПоОКПО;
	ОбластьМакета.Параметры.ОснованиеНомер        = "";
	ОбластьМакета.Параметры.ОснованиеДата         = "";
	ОбластьМакета.Параметры.ТранспортнаяНакладнаяНомер = "";
	ОбластьМакета.Параметры.ТранспортнаяНакладнаяДата  = "";
 КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);

	СтрокНаСтранице = 20;
	СтрокШапки      = 10;
	СтрокПодвала    = 9;
	НомерСтраницы   = 1;

	// Выводим заголовок таблицы
	ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаб");
	ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
	ТабДокумент.Вывести(ЗаголовокТаблицы);

	КоличествоСтрок = ЗапросТовары.Количество();

	Если КоличествоСтрок <= 2 Тогда
		ПереноситьПоследнююСтроку = 0;
	Иначе
		ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
		ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
		ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
	КонецЕсли;

	// инициализация итогов по странице
	ИтогоМассаБруттоНаСтранице = 0;
	ИтогоМестНаСтранице        = 0;
	ИтогоКоличествоНаСтранице  = 0;
	ИтогоСуммаНаСтранице       = 0;
	ИтогоНДСНаСтранице         = 0;
	ИтогоСуммаСНДСНаСтранице   = 0;

	// инициализация итогов по документу
	ИтогоМассаБрутто = 0;
	ИтогоМест        = 0;
	ИтогоКоличество  = 0;
	ИтогоСуммаСНДС   = 0;
	ИтогоСумма       = 0;
	ИтогоНДС         = 0;
	Ном              = 0;

	// Выводим многострочную часть докмента
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	Для Каждого ВыборкаСтрок Из ЗапросТовары Цикл

		Если ЗначениеНеЗаполнено(ВыборкаСтрок.Номенклатура) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		Ном           = Ном + 1;
		ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;

		Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
		 или ((ПереноситьПоследнююСтроку = 1) и (Ном = КоличествоСтрок)) Тогда

			ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");

			ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице = ИтогоМассаБруттоНаСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогМестПоСтранице        = ИтогоМестНаСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоПоСтранице  = ИтогоКоличествоНаСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице       = ИтогоСуммаНаСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогНДСПоСтранице         = ИтогоНДСНаСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогСуммыСНДСПоСтранице   = ИтогоСуммаСНДСНаСтранице;

			ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
			
			// очистим итоги по странице
			ИтогоМассаБруттоНаСтранице = 0;
			ИтогоМестНаСтранице        = 0;
			ИтогоКоличествоНаСтранице  = 0;
			ИтогоСуммаНаСтранице       = 0;
			ИтогоНДСНаСтранице         = 0;
			ИтогоСуммаСНДСНаСтранице   = 0;

			НомерСтраницы = НомерСтраницы + 1;
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
			ТабДокумент.Вывести(ЗаголовокТаблицы);

		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрок);
		ОбластьМакета.Параметры.Номер             = ЗапросТовары.Индекс(ВыборкаСтрок) + 1;
		ОбластьМакета.Параметры.ТоварНаименование = СокрЛП(ВыборкаСтрок.ТоварНаименование)
		                                          + ПредставлениеСерий(ВыборкаСтрок)
		                                          + ?(ВыборкаСтрок.Метка = 2, " (возвратная тара)", "");

		Если ЗначениеНеЗаполнено(ЕдиницаИзмеренияВеса) Тогда
			МассаБрутто = 0;
		Иначе
			МассаБрутто = ВыборкаСтрок.МассаБрутто;
			МассаБрутто = ?(МассаБрутто <> Неопределено И МассаБрутто <> NULL, МассаБрутто, 0);
		КонецЕсли;

		Мест        = ВыборкаСтрок.КоличествоМест;
		Мест        = ?(Мест <> Неопределено И Мест <> NULL, Мест, 0);

		Количество  = ВыборкаСтрок.Количество;
		СуммаСНДС   = (ВыборкаСтрок.Сумма + ?(Шапка.СуммаВключаетНДС, 0, ВыборкаСтрок.СуммаНДС));
		СуммаНДС    = ВыборкаСтрок.СуммаНДС;
		СуммаБезНДС = СуммаСНДС  - СуммаНДС;

		ОбластьМакета.Параметры.МассаБрутто = МассаБрутто;
		ОбластьМакета.Параметры.СуммаСНДС   = СуммаСНДС;
		ОбластьМакета.Параметры.СуммаНДС    = СуммаНДС;
		ОбластьМакета.Параметры.СтавкаНДС   = ВыборкаСтрок.СтавкаНДС;
		ОбластьМакета.Параметры.СуммаБезНДС = СуммаБезНДС;
		ОбластьМакета.Параметры.Цена        = СуммаБезНДС / ?(Количество = 0, 1, Количество);

		ТабДокумент.Вывести(ОбластьМакета);

		// увеличим итоги по странице
		ИтогоМассаБруттоНаСтранице = ИтогоМассаБруттоНаСтранице + МассаБрутто;
		ИтогоМестНаСтранице        = ИтогоМестНаСтранице        + Мест;
		ИтогоКоличествоНаСтранице  = ИтогоКоличествоНаСтранице  + Количество;
		ИтогоСуммаНаСтранице       = ИтогоСуммаНаСтранице       + СуммаБезНДС;
		ИтогоНДСНаСтранице         = ИтогоНДСНаСтранице         + СуммаНДС;
		ИтогоСуммаСНДСНаСтранице   = ИтогоСуммаСНДСНаСтранице   + СуммаСНДС;

		// увеличим итоги по дукументу
		ИтогоМассаБрутто = ИтогоМассаБрутто + МассаБрутто;
		ИтогоМест        = ИтогоМест        + Мест;
		ИтогоКоличество  = ИтогоКоличество  + Количество;
		ИтогоСумма       = ИтогоСумма       + СуммаБезНДС;
		ИтогоНДС         = ИтогоНДС         + СуммаНДС;
		ИтогоСуммаСНДС   = ИтогоСуммаСНДС   + СуммаСНДС;

	КонецЦикла;

	// Выводим итоги по последней странице
	ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице = ИтогоМассаБруттоНаСтранице;
	ОбластьИтоговПоСтранице.Параметры.ИтогМестПоСтранице        = ИтогоМестНаСтранице;
	ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоПоСтранице  = ИтогоКоличествоНаСтранице;
	ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице       = ИтогоСуммаНаСтранице;
	ОбластьИтоговПоСтранице.Параметры.ИтогНДСПоСтранице         = ИтогоНДСНаСтранице;
	ОбластьИтоговПоСтранице.Параметры.ИтогСуммыСНДСПоСтранице   = ИтогоСуммаСНДСНаСтранице;

	ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
	
	// Выводим итоги по документу в целом
	ОбластьМакета = Макет.ПолучитьОбласть("Всего");
	ОбластьМакета.Параметры.ИтогМассаБрутто = ИтогоМассаБрутто;
	ОбластьМакета.Параметры.ИтогМест        = ИтогоМест;
	ОбластьМакета.Параметры.ИтогКоличество  = ИтогоКоличество;
	ОбластьМакета.Параметры.ИтогСуммы       = ИтогоСумма;
	ОбластьМакета.Параметры.ИтогНДС         = ИтогоНДС;
	ОбластьМакета.Параметры.ИтогСуммыСНДС   = ИтогоСуммаСНДС;

	ТабДокумент.Вывести(ОбластьМакета);

	// Выводим подвал документа
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
Если Найти(ссылкаНаОбъект.ДоговорКонтрагента.Наименование,"*")=0 тогда	//*
	//Доверенность
	ОбластьМакета.Параметры.НомерДоверенности = Шапка.НомерДоверенности;
	ОбластьМакета.Параметры.ДатаДоверенности  = Шапка.ДатаДоверенности;
	ОбластьМакета.Параметры.КемВыдана 		  = Шапка.ОрганизацияВыдавшаяДоверенность.НаименованиеПолное;
	ОбластьМакета.Параметры.КомуВыдана 		  = Шапка.ФизЛицоДоверенности;
	
	ОбластьМакета.Параметры.ДатаДокумента  = Шапка.ДатаДокумента;

	   Если НЕ Шапка.ОтгрузкаЧерезЧП Тогда
		Руководители = ОтветственныеЛицаОрганизации(Шапка.Руководители, Шапка.ДатаДокумента,);
		Руководитель = Руководители.Руководитель;
		Бухгалтер    = Руководители.ГлавныйБухгалтер;
		Иначе
		Руководители = "";
		Руководитель = "";
		Бухгалтер    = "";
		КонецЕсли; 
	
	Если НЕ Шапка.ОтгрузкаЧерезЧП Тогда
	
		ОбластьМакета.Параметры.ДолжностьРуководителя ="Зав.складом"; //"Нач.отдела продаж";//Руководители.РуководительДолжность;	
	
	КонецЕсли; 
	
	ФамилияИмяОтчествоФизЛица                     = ФамилияИмяОтчество(Шапка.ОтветственноеЛицо, Шапка.ДатаДокумента);
	ФамилияИмяОтчествоКладовщика                  = ФамилияИмяОтчествоФизЛица.Фамилия + " " + ФамилияИмяОтчествоФизЛица.Имя + " " + ФамилияИмяОтчествоФизЛица.Отчество;
	//ОбластьМакета.Параметры.ФИОКладовщика         = ФамилияИнициалыФизЛица(ФамилияИмяОтчествоКладовщика);
	
	Если ( СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00107") )
		или ( СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00107") ) тогда
		//ПредставлениеПодразделения
		ОбластьМакета.Параметры.ФИОразрешил = "Войновская Н.Р.";
		ОбластьМакета.Параметры.ФИОглБух	= "Войновская Н.Р.";
		ОбластьМакета.Параметры.ФИОпроизвел = "Войновская Н.Р.";
		ОбластьМакета.Параметры.Доверенность1 = "Руководитель обособленного подразделения г.Москва Войновская Н.Р. на основании приказа по ЗАО ТК ""Яршинторг"" №______ от ___.____._____г.";
		ОбластьМакета.Параметры.Доверенность2 = "";
		ОбластьМакета.Параметры.Доверенность3 = "";
	иначеЕсли ( СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00106") ) //рнд
		или ( СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00106") ) тогда   //+++ 13.08.2012
		//ПредставлениеПодразделения
		Отбор1 = новый Структура;
		Отбор1.Вставить("Подразделение",справочники.Подразделения.НайтиПоКоду("00106"));
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Руководитель);
		регСведРук = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
		регСведГлБух = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		ОбластьМакета.Параметры.ФИОразрешил = регСведГлБух.ФизическоеЛицо; //Жилин А.В.";      
		ОбластьМакета.Параметры.ДолжностьРуководителя = регСведГлБух.Должность;//"Глав.бух.ф-ла г. Ростов-на-Дону";
		
		ОбластьМакета.Параметры.ФИОглБух	= регСведГлБух.ФизическоеЛицо; //Иноземцева Н.И.";
		ОбластьМакета.Параметры.ФИОпроизвел = регСведГлБух.ФизическоеЛицо; //Жилин А.В.";
		ОбластьМакета.Параметры.Доверенность1 = регСведРук.Должность+" "+строка(регСведРук.ФизическоеЛицо)+", действующий  на основании "+регСведРук.Доверенность; // 186 от 10 августа 2012
		ОбластьМакета.Параметры.Доверенность2 = регСведГлБух.Должность+" "+строка(регСведГлБух.ФизическоеЛицо)+", действующий  на основании "+регСведГлБух.Доверенность;
		ОбластьМакета.Параметры.ДолжностьКладовщика = регСведГлБух.Должность;
		
		Если СсылкаНаОбъект.Дата>='20131031' Тогда // ТРОЕ - каждый - за всех!
			
			Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Кассир);
			регСведКассир = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
			
			//			"Оператор ПК-менеджер филиала в г. Ростов-На-Дону Михалева Е.А., действующий на основании Доверенности №253 от 31 октября 2013г.";
			ОбластьМакета.Параметры.Доверенность3 = регСведКассир.Должность+" "+строка(регСведКассир.ФизическоеЛицо)+", действующий  на основании "+регСведКассир.Доверенность;
			
			Если регСведРук.ФизическоеЛицо = СсылкаНаОбъект.Ответственный.ФизЛицо тогда
				регСведРнД = регСведРук;
			ИначеЕсли регСведГлБух.ФизическоеЛицо = СсылкаНаОбъект.Ответственный.ФизЛицо тогда
				регСведРнД = регСведГлБух;
			ИначеЕсли регСведКассир.ФизическоеЛицо = СсылкаНаОбъект.Ответственный.ФизЛицо тогда
				регСведРнД = регСведКассир;
			Иначе
				регСведРнД = новый Структура("ФизическоеЛицо, Должность, Доверенность","","",""); 
			КонецЕсли;
			// 1 за всех 
			ОбластьМакета.Параметры.ФИОразрешил = регСведРнД.ФизическоеЛицо.Наименование;
			ОбластьМакета.Параметры.ФИОглБух    = регСведРнД.ФизическоеЛицо.Наименование;
			ОбластьМакета.Параметры.ФИОпроизвел = регСведРнД.ФизическоеЛицо.Наименование;
			ОбластьМакета.Параметры.ДолжностьРуководителя = регСведРнД.Должность;
			ОбластьМакета.Параметры.ДолжностьКладовщика   = регСведРнД.Должность;
		КонецЕсли;
		//+++)
		
	иначеЕсли  СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00112") 
		или  СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00112") тогда   //+++ 30.07.2013
		//ПредставлениеПодразделения
		Отбор1 = новый Структура;
		Отбор1.Вставить("Подразделение",справочники.Подразделения.НайтиПоКоду("00112"));
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Руководитель);
		регСведРук = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Кассир);
		регСведГлБух = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		ОбластьМакета.Параметры.ФИОразрешил = регСведРук.ФизическоеЛицо; //Жилин А.В.";      
		ОбластьМакета.Параметры.ДолжностьРуководителя = регСведРук.Должность;
		
		ОбластьМакета.Параметры.ФИОглБух	= регСведРук.ФизическоеЛицо; 
		
		//Кладовщик = ПолучитьКладовщика(); //+++ 01.08.2013
		ОбластьМакета.Параметры.ФИОпроизвел = строка(регСведГлБух.ФизическоеЛицо);
		ОбластьМакета.Параметры.ДолжностьКладовщика = регСведГлБух.Должность;
		
		ОбластьМакета.Параметры.Доверенность1 = регСведРук.Должность+" "+строка(регСведРук.ФизическоеЛицо)+", действующий  на основании "+регСведРук.Доверенность;
		ОбластьМакета.Параметры.Доверенность2 = регСведГлБух.Должность+" "+строка(регСведГлБух.ФизическоеЛицо)+", действующий  на основании "+регСведГлБух.Доверенность;
		ОбластьМакета.Параметры.Доверенность3 = "";
		
	ИначеЕсли  СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00122")
		Или СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00122")
		
		или  СсылкаНаОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("00138")
		Или СсылкаНаОбъект.Сделка.Подразделение = справочники.Подразделения.НайтиПоКоду("00138") тогда // 23.07.2014
		
		//ПредставлениеПодразделения
		Отбор1 = новый Структура;
		Отбор1.Вставить("Подразделение",справочники.Подразделения.НайтиПоКоду("00122"));
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Руководитель);
		регСведРук = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
		регСведГлБух = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		Отбор1.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Кассир);
		регСведКладовщик = РегистрыСведений.ОтветственныеЛицаПодразделений.ПолучитьПоследнее(СсылкаНаОбъект.Дата, Отбор1);
		
		ОбластьМакета.Параметры.ФИОразрешил = регСведРук.ФизическоеЛицо; //Жилин А.В.";      
		ОбластьМакета.Параметры.ДолжностьРуководителя = регСведРук.Должность;//"Глав.бух.ф-ла г. Ростов-на-Дону";
		
		ОбластьМакета.Параметры.ФИОглБух	= регСведГлБух.ФизическоеЛицо; 
		
		ОбластьМакета.Параметры.ДолжностьКладовщика = регСведКладовщик.Должность;
		ОбластьМакета.Параметры.ФИОпроизвел = регСведКладовщик.ФизическоеЛицо; 
		
		ОбластьМакета.Параметры.Доверенность1 = ""; // бух = рук
		//	ОбластьМакета.Параметры.Доверенность1 = регСведРук.Должность+" "+строка(регСведРук.ФизическоеЛицо)+", действующий  на основании "+регСведРук.Доверенность; 
		ОбластьМакета.Параметры.Доверенность2 = регСведГлБух.Должность+" "+строка(регСведГлБух.ФизическоеЛицо)+", действующий  на основании "+регСведГлБух.Доверенность;
		ОбластьМакета.Параметры.Доверенность3 = регСведКладовщик.Должность+" "+строка(регСведКладовщик.ФизическоеЛицо)+", действующий  на основании "+регСведКладовщик.Доверенность;
		
		
	иначе //Яршинторг	
		ОбластьМакета.Параметры.ФИОразрешил = "Фролов А.И.";
		//ОбластьМакета.Параметры.Доверенность1 = "Зав.складом Фролов А.И. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/21 от 01.07.2009 г.";
		ОбластьМакета.Параметры.Доверенность1 = "Зав.складом Фролов А.И. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/20/2 от 26.07.2011 г.";
		
		ОбластьМакета.Параметры.ФИОглБух	= "Короткова Е.Ю.";
		//ОбластьМакета.Параметры.Доверенность2 = "Бухгалтер Короткова Е.Ю. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/09 от 29.03.2010 г.";
		ОбластьМакета.Параметры.Доверенность2 = "Бухгалтер Короткова Е.Ю. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/20/2 от 26.07.2011 г.";
		//Орлов ++
		//Если СсылкаНаОбъект.Дата < Дата("20130401000000") Тогда
		//	//ОбластьМакета.Параметры.Доверенность3 = "Старший кладовщик Гаричев Д.Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/37 от 01.12.2010 г.";	
		//	ОбластьМакета.Параметры.Доверенность3 = "Старший кладовщик Гаричев Д.Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/20/2 от 26.07.2011 г.";
		//Иначе
		//	ОбластьМакета.Параметры.ФИОглБух1	= "Невежина И. Н.";
		//	ОбластьМакета.Параметры.Доверенность3 = "Бухгалтер Невежина И. Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/19 от 01.04.2013 г.";
		//	ОбластьМакета.Параметры.Доверенность4 = "Старший кладовщик Гаричев Д.Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/20/2 от 26.07.2011 г.";
		//КонецЕсли;
		//Орлов --
		ОбластьМакета.Параметры.ФИОглБух2   = "Князева И. И.";
		ОбластьМакета.Параметры.ФИОпроизвел = "Фролов А.И.";
		Если СсылкаНаОбъект.Дата < Дата("20130401000000") Тогда
			//ОбластьМакета.Параметры.Доверенность3 = "Старший кладовщик Гаричев Д.Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/37 от 01.12.2010 г.";	
			ОбластьМакета.Параметры.Доверенность3 = "Старший кладовщик Гаричев Д.Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/20/2 от 26.07.2011 г.";
		ИначеЕсли СсылкаНаОбъект.Дата < Дата("20160211000000") Тогда
			ОбластьМакета.Параметры.ФИОглБух	= "Чистякова Н.А.";
			ОбластьМакета.Параметры.ФИОглБух1	= "Невежина И. Н.";
			ОбластьМакета.Параметры.Доверенность2 = "Менеджер по транспорту Чистякова Н.А. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/24 от 08.04.2016 г.";
			ОбластьМакета.Параметры.Доверенность3 = "Бухгалтер Невежина И. Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/19 от 01.04.2013 г.";
			ОбластьМакета.Параметры.Доверенность4 = "Старший кладовщик Гаричев Д.Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/20/2 от 26.07.2011 г.";
			ОбластьМакета.Параметры.ФИОглБух2   = "Князева И. И.";
			ОбластьМакета.Параметры.Доверенность5 = "Старший кладовщик Цверава В.У. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/25/1 от 31.05.2013 г.";
			ОбластьМакета.Параметры.Доверенность6 = "Бухгалтер Князева И. И. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/62 от 13.12.2013 г.";
		Иначе //+++ 11.02.2016
			ОбластьМакета.Параметры.ФИОглБух	= "Чистякова Н.А.";
			ОбластьМакета.Параметры.Доверенность2 = "Менеджер по транспорту Чистякова Н.А. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/24 от 08.04.2016 г.";
			ОбластьМакета.Параметры.ФИОглБух1	= "Невежина И. Н.";
			ОбластьМакета.Параметры.Доверенность3 = "Оператор ПК Невежина И. Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/9 от 10.02.2016 г.";
			ОбластьМакета.Параметры.Доверенность4 = "Старший кладовщик Гаричев Д.Н. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/20/2 от 26.07.2011 г.";
			ОбластьМакета.Параметры.ФИОглБух2   = "Князева И. И.";
			ОбластьМакета.Параметры.Доверенность5 = "Старший кладовщик Цверава В.У. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/9 от 31.05.2013 г.";
			ОбластьМакета.Параметры.Доверенность6 = "Оператор ПК Князева И. И. на основании приказа по ЗАО ТК ""Яршинторг"" №01-03/9 от 10.02.2016 г.";

		КонецЕсли;

	КонецЕсли;
	
	//2013.11.14
	Если СсылкаНаОбъект.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.НайтиПоКоду("Я0004") Тогда //ФормулаАвто
		ОбластьМакета.Параметры.ДолжностьРуководителя = "Генеральный директор";
		ОбластьМакета.Параметры.ФИОразрешил = "Зайцева Н.С.";  
		ОбластьМакета.Параметры.ФИОглБух = "Зайцева Н.С.";
		ОбластьМакета.Параметры.ФИОглБух1 = "";
		ОбластьМакета.Параметры.ФИОглБух2 = "";
		ОбластьМакета.Параметры.ФИОпроизвел = "";
		ОбластьМакета.Параметры.Доверенность1 = "";
		ОбластьМакета.Параметры.Доверенность2 = "";
		ОбластьМакета.Параметры.Доверенность3 = "";
		ОбластьМакета.Параметры.Доверенность4 = "";
		ОбластьМакета.Параметры.Доверенность5 = "";
		ОбластьМакета.Параметры.Доверенность6 = "";
	КонецЕсли;
	
	
	Если НЕ ЗначениеНеЗаполнено(ЕдиницаИзмеренияВеса) И ИтогоМассаБрутто > 0 Тогда
		ОбластьМакета.Параметры.МассаГрузаПрописью = ЧислоПрописью(ИтогоМассаБрутто, ,",,,,,,,,0")+ " " +ЕдиницаИзмеренияВеса.Наименование + ".";
	КонецЕсли;

	Если ИтогоМест > 0 Тогда
		ОбластьМакета.Параметры.ВсегоМестПрописью = ЧислоПрописью(ИтогоМест, ,",,,,,,,,0");
	КонецЕсли;

	ОбластьМакета.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоСтрок, ,",,,,,,,,0");
	ОбластьМакета.Параметры.СуммаПрописью = СформироватьСуммуПрописью(ИтогоСуммаСНДС, Константы.ВалютаРегламентированногоУчета.Получить());
	
	ОбластьМакета.Параметры.АвтомобильТелефон = ?(СокрЛП(ссылкаНаОбъект.МаркаАвтомобиля)="" и СокрЛП(ссылкаНаОбъект.ГосНомерАвтомобиля)="", "",
	СокрЛП(ссылкаНаОбъект.МаркаАвтомобиля)+" "+СокрЛП(ссылкаНаОбъект.ГосНомерАвтомобиля)+",")
	+?(СокрЛП(Шапка.ФизЛицоДоверенности)="","", " Водитель: "+СокрЛП(Шапка.ФизЛицоДоверенности)+",")
	+?(сокрЛП(ссылкаНаОбъект.ВидПеревозки)="", "", " тел.:"+СокрЛП(ссылкаНаОбъект.ВидПеревозки));
КонецЕсли;
ТабДокумент.Вывести(ОбластьМакета);

	// Зададим параметры макета
	ТабДокумент.ПолеСверху              = 0;
	ТабДокумент.ПолеСлева               = 0;
	ТабДокумент.ПолеСнизу               = 0;
	ТабДокумент.ПолеСправа              = 0;
	ТабДокумент.РазмерКолонтитулаСверху = 0;
	ТабДокумент.РазмерКолонтитулаСнизу  = 0;
	ТабДокумент.АвтоМасштаб             = Истина;
	ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;

	Возврат ТабДокумент;

	
КонецФункции // Печать
