



Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачДата, ?(КонДата='0001-01-01', КонДата, КонецДня(КонДата)));
	Если НастройкаПериода.Редактировать() Тогда
		НачДата = НастройкаПериода.ПолучитьДатуНачала();
		КонДата = НастройкаПериода.ПолучитьДатуОкончания();
		НачДатаПриИзменении(неопределено);
		КонДатаПриИзменении(неопределено);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОткрытии()
	НачДата = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1].Значение.Дата;
	КонДата = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение.Дата;
КонецПроцедуры

Процедура НачДатаПриИзменении(Элемент)
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1].Значение.Вариант = ВариантСтандартнойДатыНачала.ПроизвольнаяДата;
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1].Значение.Дата = НачДата;
КонецПроцедуры

Процедура КонДатаПриИзменении(Элемент)
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение.Вариант = ВариантСтандартнойДатыНачала.ПроизвольнаяДата;
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение.Дата = КонДата;
КонецПроцедуры
