
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Сообщить(строка(ТекущаяДата())+" - начало выгрузки прайсов "+строка(Контр.Количество())+" клиентов =============");
	
	for i=0 to Контр.Количество()-1 цикл
	ТаблицаЦен = ПолучитьЦеныПоВсемТоварамКлиента(Контр[i].Значение.Код);
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(КаталогВременныхФайлов()+"document.xml");
	ЗаписьXML.ЗаписатьОбъявлениеXML();  
	ЗаписьXML.ЗаписатьНачалоЭлемента("Root");  
	ЗаписьXML.ЗаписатьНачалоЭлемента("PartnerId");
	ЗаписьXML.ЗаписатьТекст(Контр[i].Значение.Код);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Prices");  
	
	Для Каждого Строка Из таблицаЦен Цикл
		Если строка.цена <>0 Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Item");
			
ЗаписьXML.ЗаписатьАтрибут("ProductId", строка.Код);
ЗаписьXML.ЗаписатьАтрибут("Price", Строка(Формат(строка.Цена,"ЧРД=.; ЧГ=0"))); 
	ЗаписьXML.ЗаписатьКонецЭлемента();
	 КонецЕсли;
	КонецЦикла;  
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.Закрыть();
	сообщить(КаталогВременныхФайлов()+"document.xml");
	
	Если Store тогда
		удачно = ОбменСУТИнтернетМагазин.SIM_ВыгрузитьФайлНаСервер(КаталогВременныхФайлов()+"document.xml","importpricesforoneclient",Ложь,"store.yst.ru"); // выгружаем, 
		Если удачно Тогда
			Сообщить(строка(i)+") Выгрузка в Store прайса - прошла успешно для клиента: "+строка(Контр[i].Значение), СтатусСообщения.Информация);
		иначе
			Сообщить(строка(i)+") Ошибка при выгрузке в Store для клиента: "+строка(Контр[i].Значение), СтатусСообщения.Внимание);
		конецЕсли;	
	КонецЕсли;
	
	Если Terminal тогда
		удачно = ОбменСУТИнтернетМагазин.SIM_ВыгрузитьФайлНаСервер(КаталогВременныхФайлов()+"document.xml","importpricesforoneclient",Ложь,"terminal.yst.ru"); // выгружаем, 
		Если удачно Тогда
			Сообщить(строка(i)+")   Выгрузка в Terminal прайса - прошла успешно для клиента: "+строка(Контр[i].Значение), СтатусСообщения.Информация);
		иначе
			Сообщить(строка(i)+")   Ошибка при выгрузке в Terminal для клиента: "+строка(Контр[i].Значение), СтатусСообщения.Внимание);
		конецЕсли;	
    КонецЕсли;
   
КонецЦикла; // по всем Контр
	Сообщить(строка(ТекущаяДата())+" - выгрузка прайсов "+строка(Контр.Количество())+" клиентов - завершена.");
	
КонецПроцедуры

Процедура Флажок1ПриИзменении(Элемент)
	Контр.Очистить();
	
	Если Флажок1 тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Экспорт
		|	И Контрагенты.ОсновнойДоговорКонтрагента.ВалютаВзаиморасчетов <> &ВалютаРуб";
		
		Запрос.УстановитьПараметр("ВалютаРуб", справочники.Валюты.НайтиПоКоду("643") );
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Контр.Добавить(выборка.ссылка);
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры
