////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ПередЗаписью" формы.
//
Процедура ПередЗаписью(Отказ)

	// среди всех типов цен одного контрагента не может быть более одного,
	// ссылающегося на данный тип цен компании
	Если НЕ ОбменДанными.Загрузка И Не ЗначениеНеЗаполнено(ТипЦеныНоменклатуры) Тогда
		Отбор = Новый Структура("ТипЦеныНоменклатуры",ТипЦеныНоменклатуры);
		Выборка = Справочники.ТипыЦенНоменклатурыКонтрагентов.Выбрать(,Владелец,Отбор,);
		Пока Выборка.Следующий() Цикл
			Если Ссылка <> Выборка.Ссылка Тогда
				#Если Клиент Тогда
				// такой тип цен уже встречался
					Предупреждение("Тип цен номенклатуры "+Выборка.ТипЦеныНоменклатуры.Наименование+" уже использовался "
					              +"в типе цен номенклатуры контрагента "+Выборка.Наименование+"!");
				#КонецЕсли
				Отказ = Истина;
				Возврат;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
	
		обЗаписатьПротоколИзменений(ЭтотОбъект);
	
	КонецЕсли; 

КонецПроцедуры // ПередЗаписью()
