
Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачалоПериода, ?(КонецПериода='0001-01-01', КонецПериода, КонецДня(КонецПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачалоПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонецПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
	
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение  = КонецДня(КонецПериода);

		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение  = НачалоПериода;
	
	
КонецПроцедуры

Процедура НачалоПериодаПриИзменении(Элемент)
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение  = НачалоПериода;
КонецПроцедуры

Процедура КонецПериодаПриИзменении(Элемент)
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение  = КонецДня(КонецПериода);
КонецПроцедуры
