

Процедура ПриОткрытии()
	
	НормыЗагрузки.Отбор.ВидПродукции.ВидСравнения = ВидСравнения.ВСписке;
	СписЗнач = новый СписокЗначений;
	СписЗнач.Добавить(Перечисления.ВидыТоваров.Шины);
	СписЗнач.Добавить(Перечисления.ВидыТоваров.Диски);
	НормыЗагрузки.Отбор.ВидПродукции.Значение  = СписЗнач;
	НормыЗагрузки.Отбор.ВидПродукции.Использование = Истина;
	
	//НормыЗагрузки.Порядок.Добавить("Типоразмер","Типоразмер","Типоразмер");
	//НормыЗагрузки.Порядок.Добавить("ВидПродукции","ВидПродукции","ВидПродукции");
	НормыЗагрузки.Порядок.Установить("ВидПродукции Возр, Типоразмер Возр"); // по алф.
КонецПроцедуры

Процедура НормыЗагрузкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока и НЕ Копирование тогда
	стр1 = ЭлементыФормы.НормыЗагрузки.ТекущиеДанные;
	стр1.ВидПродукции = Перечисления.ВидыТоваров.Шины;
	КонецЕсли;

КонецПроцедуры

Процедура НормыЗагрузкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НоваяСтрока и НЕ ОтменаРедактирования тогда
	стр1 = ЭлементыФормы.НормыЗагрузки.ТекущиеДанные;
	стр1.Наименование = стр1.ВидПродукции+" "+стр1.Типоразмер;
	КонецЕсли;

КонецПроцедуры




