
Процедура ПриОткрытии()
	ПроцентПросрочки = 15;
	ПроцентЗаКороткуюОтсрочку =9;
	ПроцентЗаДлительнуюОтсрочку =15;
	ПроцентПремии =0.2;
	
	стр = Отсечки.Добавить();
	стр.видТовара = перечисления.ВидыТоваров.Диски;
	стр.отсечка = 12;
	стр.процент = 5;
	стр = Отсечки.Добавить();
	
	стр.видТовара = перечисления.ВидыТоваров.Шины;
	стр.отсечка = 5;
	стр.процент = 5;
	стр = Отсечки.Добавить();
	
	стр.видТовара = перечисления.ВидыТоваров.Шины;
	стр.Номенклатурнаягруппа = справочники.НоменклатурныеГруппы.НайтиПоКоду("00017");//импорт лето
	стр.отсечка = 8;
	стр.процент = 5;
	
	стр = Отсечки.Добавить();
	стр.видТовара = перечисления.ВидыТоваров.Шины;
	стр.Номенклатурнаягруппа = справочники.НоменклатурныеГруппы.НайтиПоКоду("00016");//импорт зима
	стр.отсечка = 8;
	стр.процент = 5;
	стр = Отсечки.Добавить();
	
	
	
	
	стр.видТовара = перечисления.ВидыТоваров.АКБ;
	стр.отсечка = 12;
	стр.процент = 5;
	стр = Отсечки.Добавить();
	
	стр.видТовара = перечисления.ВидыТоваров.Аксессуары;
	стр.отсечка = 12;
	стр.процент = 5;
	
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

Процедура ДействияФормыДействие6(Кнопка)
	Запрос =  новый запрос;
	Запрос.МенеджерВременныхТаблиц = Новый менеджерВременныхтаблиц();
   // ПолучитьпоступлениеДенег (Запрос);
    РассчитатьПремиПоЗаказам(Запрос);	
	
	
КонецПроцедуры

Процедура ПолучитьпоступлениеДенег (Запрос)
  	Запрос.МенеджерВременныхТаблиц = Новый менеджерВременныхтаблиц();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.ОтветственноеЛицо.НаправлениеПродаж КАК НаправлениеПродаж,
		|	ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка КАК Документ.ЗаказПокупателя) КАК Сделка,
		|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.Владелец,
		|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.ОтветственноеЛицо,
		|	СУММА(ВЫБОР
		|			КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовНачальныйОстаток < ВЫБОР
		|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
		|							ИЛИ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
		|						ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход
		|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
		|						ТОГДА -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
		|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.Взаимозачет
		|						ТОГДА ВЫБОР
		|								КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход <> 0
		|									ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход
		|								ИНАЧЕ -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|				ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовНачальныйОстаток
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
		|							ИЛИ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
		|						ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход
		|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
		|						ТОГДА -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
		|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.Взаимозачет
		|						ТОГДА ВЫБОР
		|								КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход <> 0
		|									ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход
		|								ИНАЧЕ -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		КОНЕЦ) КАК ПриходДенег,
		|	ВЫБОР
		|		КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Период < ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка.ДатаОплаты
		|			ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка.ДатаОплаты
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Период, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(
		|			&нач,
		|			&кон,
		|			Регистратор,
		|			,
		|			ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.Позаказам)
		|				И ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровконтрагентов.СПокупателем)
		|				И ДоговорКонтрагента.ТипДоговора <> ЗНАЧЕНИЕ(Справочник.ТипыДоговоров.ПеремещениеОТХ)) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
		|ГДЕ
		|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка <> НЕОПРЕДЕЛЕНО
		|	И ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовНачальныйОстаток > 0
		|	И ВЫБОР
		|			КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовНачальныйОстаток < ВЫБОР
		|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
		|							ИЛИ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
		|						ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход
		|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
		|						ТОГДА -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
		|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.Взаимозачет
		|						ТОГДА ВЫБОР
		|								КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход <> 0
		|									ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход
		|								ИНАЧЕ -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|				ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовНачальныйОстаток
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
		|							ИЛИ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
		|						ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход
		|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
		|						ТОГДА -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
		|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.Взаимозачет
		|						ТОГДА ВЫБОР
		|								КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход <> 0
		|									ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход
		|								ИНАЧЕ -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		КОНЕЦ <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.ОтветственноеЛицо.НаправлениеПродаж,
		|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.Владелец,
		|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.ОтветственноеЛицо,
		|	ВЫБОР
		|		КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Период < ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка.ДатаОплаты
		|			ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка.ДатаОплаты
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Период, ДЕНЬ)
		|	КОНЕЦ,
		|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента,
		|	ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка КАК Документ.ЗаказПокупателя)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сделка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|	СУММА(ПродажиОбороты.СтоимостьОборот) КАК СтоимостьОборот
		|ПОМЕСТИТЬ Обороты
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			ЗаказПокупателя В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ВТ.Сделка
		|				ИЗ
		|					ВТ КАК ВТ)) КАК ПродажиОбороты
		|ГДЕ
		|	ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.ЗаказПокупателя
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗаказПокупателя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.НаправлениеПродаж,
		|	ВТ.Сделка КАК Сделка,
		|	ВТ.ДоговорКонтрагентаВладелец КАК Контрагент,
		|	ВТ.ДоговорКонтрагентаОтветственноеЛицо КАК Менеджер,
		|	СУММА(ВТ.ПриходДенег) КАК ПриходДенег,
		|	СУММА(ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовНачальныйОстаток * &ПроцентПросрочки * РАЗНОСТЬДАТ(ВТ.Сделка.ДатаОплаты, ВТ.Период, ДЕНЬ) / 36500 КАК ЧИСЛО(15, 2))) КАК ШтрафЗаПросрочку,
		|	СРЕДНЕЕ(Обороты.СтоимостьОборот) КАК СтоимостьОборот
		|ПОМЕСТИТЬ ПоступлениеДенег1
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(&нач, &кон, День, , ) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
		|		ПО ВТ.Сделка = ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка
		|			И ВТ.ДоговорКонтрагента = ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента
		|			И ВТ.Период = ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
		|		ПО ВТ.Сделка = Обороты.ЗаказПокупателя
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.ДоговорКонтрагентаОтветственноеЛицо,
		|	ВТ.НаправлениеПродаж,
		|	ВТ.Сделка,
		|	ВТ.ДоговорКонтрагентаВладелец,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ВТ.ПриходДенег > Обороты.СтоимостьОборот
		|				ТОГДА 1
		|			ИНАЧЕ ВТ.ПриходДенег / Обороты.СтоимостьОборот
		|		КОНЕЦ КАК ЧИСЛО(15, 3))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеДенег1.НаправлениеПродаж,
		|	ПоступлениеДенег1.Сделка,
		|	ПоступлениеДенег1.Контрагент,
		|	ПоступлениеДенег1.Менеджер,
		|	СУММА(ПоступлениеДенег1.ПриходДенег) КАК ПриходДенег,
		|	СУММА(ПоступлениеДенег1.ШтрафЗаПросрочку) КАК ШтрафЗаПросрочку,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА СУММА(ПоступлениеДенег1.ПриходДенег) > СРЕДНЕЕ(ПоступлениеДенег1.СтоимостьОборот)
		|				ТОГДА 1
		|			ИНАЧЕ СУММА(ПоступлениеДенег1.ПриходДенег) / СРЕДНЕЕ(ПоступлениеДенег1.СтоимостьОборот)
		|		КОНЕЦ КАК ЧИСЛО(15, 3)) КАК КОплаты
		|ПОМЕСТИТЬ поступлениеДенег
		|ИЗ
		|	ПоступлениеДенег1 КАК ПоступлениеДенег1
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеДенег1.Менеджер,
		|	ПоступлениеДенег1.Контрагент,
		|	ПоступлениеДенег1.НаправлениеПродаж,
		|	ПоступлениеДенег1.Сделка";

	Запрос.УстановитьПараметр("кон", КонПериода);
	Запрос.УстановитьПараметр("нач", НачПериода);
	Запрос.УстановитьПараметр("ПроцентПросрочки", ПроцентПросрочки);

	Результат = Запрос.Выполнить();



конецПроцедуры

процедура РассчитатьПремиПоЗаказам(Запрос)

	Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.ОтветственноеЛицо.НаправлениеПродаж КАК НаправлениеПродаж,
			|	ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка КАК Документ.ЗаказПокупателя) КАК Сделка,
			|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.Владелец,
			|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.ОтветственноеЛицо,
			|	СУММА(ВЫБОР
			|			КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
			|					И ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток < 0
			|				ТОГДА ВЫБОР
			|						КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход < ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток
			|							ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток
			|						ИНАЧЕ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
			|					КОНЕЦ
			|			КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовНачальныйОстаток > 0
			|				ТОГДА ВЫБОР
			|						КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовНачальныйОстаток < ВЫБОР
			|								КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
			|										ИЛИ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
			|									ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход
			|								КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
			|									ТОГДА -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
			|								КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.Взаимозачет
			|									ТОГДА ВЫБОР
			|											КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход <> 0
			|												ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход
			|											ИНАЧЕ -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
			|										КОНЕЦ
			|								ИНАЧЕ 0
			|							КОНЕЦ
			|							ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовНачальныйОстаток
			|						ИНАЧЕ ВЫБОР
			|								КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
			|										ИЛИ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
			|									ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход
			|								КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
			|									ТОГДА -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
			|								КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.Взаимозачет
			|									ТОГДА ВЫБОР
			|											КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход <> 0
			|												ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход
			|											ИНАЧЕ -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
			|										КОНЕЦ
			|								ИНАЧЕ 0
			|							КОНЕЦ
			|					КОНЕЦ
			|		КОНЕЦ) КАК ПриходДенег,
			|	ВЫБОР
			|		КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Период < ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка.ДатаОплаты
			|			ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка.ДатаОплаты
			|		ИНАЧЕ НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Период, ДЕНЬ)
			|	КОНЕЦ КАК Период,
			|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента,
			|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор КАК Регистратор,
			|	ВЫБОР
			|		КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты1.СуммаВзаиморасчетовНачальныйОстаток * &ПроцентПросрочки * РАЗНОСТЬДАТ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка.ДатаОплаты, ВЫБОР
			|						КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Период < ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка.ДатаОплаты
			|							ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка.ДатаОплаты
			|						ИНАЧЕ НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Период, ДЕНЬ)
			|					КОНЕЦ, ДЕНЬ) / 36500 КАК ЧИСЛО(15, 2))
			|	КОНЕЦ КАК ШтрафЗаПросрочку
			|ПОМЕСТИТЬ ДвижениеДенег
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(
			|			&нач,
			|			&кон,
			|			Регистратор,
			|			,
			|			ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.Позаказам)
			|				И ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровконтрагентов.СПокупателем)
			|				И ДоговорКонтрагента.ТипДоговора <> ЗНАЧЕНИЕ(Справочник.ТипыДоговоров.ПеремещениеОТХ)
			|				И ДоговорКонтрагента.ВалютаВзаиморасчетов.код = ""643"") КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(
			|				&Нач,
			|				&Кон,
			|				День,
			|				,
			|				ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.Позаказам)
			|					И ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровконтрагентов.СПокупателем)
			|					И ДоговорКонтрагента.ТипДоговора <> ЗНАЧЕНИЕ(Справочник.ТипыДоговоров.ПеремещениеОТХ)) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты1
			|		ПО ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка = ВзаиморасчетыСКонтрагентамиОстаткиИОбороты1.Сделка
			|			И ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента = ВзаиморасчетыСКонтрагентамиОстаткиИОбороты1.ДоговорКонтрагента
			|			И (ВЫБОР
			|				КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Период < ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка.ДатаОплаты
			|					ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка.ДатаОплаты
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Период, ДЕНЬ)
			|			КОНЕЦ = ВзаиморасчетыСКонтрагентамиОстаткиИОбороты1.Период)
			|ГДЕ
			|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка <> НЕОПРЕДЕЛЕНО
			|	И ВЫБОР
			|			КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
			|					И ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток < 0
			|				ТОГДА ВЫБОР
			|						КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход < ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток
			|							ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток
			|						ИНАЧЕ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
			|					КОНЕЦ
			|			КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовНачальныйОстаток > 0
			|				ТОГДА ВЫБОР
			|						КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовНачальныйОстаток < ВЫБОР
			|								КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
			|										ИЛИ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
			|									ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход
			|								КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
			|									ТОГДА -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
			|								КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.Взаимозачет
			|									ТОГДА ВЫБОР
			|											КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход <> 0
			|												ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход
			|											ИНАЧЕ -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
			|										КОНЕЦ
			|								ИНАЧЕ 0
			|							КОНЕЦ
			|							ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовНачальныйОстаток
			|						ИНАЧЕ ВЫБОР
			|								КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
			|										ИЛИ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
			|									ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход
			|								КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
			|									ТОГДА -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
			|								КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.Взаимозачет
			|									ТОГДА ВЫБОР
			|											КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход <> 0
			|												ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход
			|											ИНАЧЕ -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
			|										КОНЕЦ
			|								ИНАЧЕ 0
			|							КОНЕЦ
			|					КОНЕЦ
			|		КОНЕЦ <> 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.ОтветственноеЛицо.НаправлениеПродаж,
			|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.Владелец,
			|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.ОтветственноеЛицо,
			|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента,
			|	ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка КАК Документ.ЗаказПокупателя),
			|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор,
			|	ВЫБОР
			|		КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Период < ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка.ДатаОплаты
			|			ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка.ДатаОплаты
			|		ИНАЧЕ НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Период, ДЕНЬ)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты1.СуммаВзаиморасчетовНачальныйОстаток * &ПроцентПросрочки * РАЗНОСТЬДАТ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка.ДатаОплаты, ВЫБОР
			|						КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Период < ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка.ДатаОплаты
			|							ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка.ДатаОплаты
			|						ИНАЧЕ НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Период, ДЕНЬ)
			|					КОНЕЦ, ДЕНЬ) / 36500 КАК ЧИСЛО(15, 2))
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДвижениеДенег.Сделка,
			|	СУММА(ВЫБОР
			|			КОГДА ДвижениеДенег.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
			|					ИЛИ РАЗНОСТЬДАТ(ДвижениеДенег.Сделка.ДатаОплаты, ДвижениеДенег.Регистратор.Дата, ДЕНЬ) < 61
			|				ТОГДА ДвижениеДенег.ПриходДенег
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ПриходДенег,
			|	ВЫБОР
			|		КОГДА ДвижениеДенег.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
			|			ТОГДА ВЫРАЗИТЬ(ДвижениеДенег.Регистратор КАК Документ.ВозвратТоваровОтПокупателя)
			|		ИНАЧЕ ДвижениеДенег.Сделка
			|	КОНЕЦ КАК Документ,
			|	СУММА(ДвижениеДенег.ШтрафЗаПросрочку) КАК ШтрафЗаПросрочку
			|ПОМЕСТИТЬ ПриходИтого
			|ИЗ
			|	ДвижениеДенег КАК ДвижениеДенег
			|
			|СГРУППИРОВАТЬ ПО
			|	ДвижениеДенег.Сделка,
			|	ВЫБОР
			|		КОГДА ДвижениеДенег.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
			|			ТОГДА ВЫРАЗИТЬ(ДвижениеДенег.Регистратор КАК Документ.ВозвратТоваровОтПокупателя)
			|		ИНАЧЕ ДвижениеДенег.Сделка
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПродажиОбороты.Номенклатура,
			|	ВЫРАЗИТЬ(ПродажиОбороты.ЗаказПокупателя КАК Документ.ЗаказПокупателя) КАК ЗаказПокупателя,
			|	ПродажиОбороты.СтоимостьОборот КАК Оборот,
			|	ПродажиСебестоимостьОбороты.СтоимостьОборот КАК Себестоимость,
			|	ПродажиОбороты.СтоимостьОборот - ПродажиСебестоимостьОбороты.СтоимостьОборот КАК Наценка,
			|	ВЫБОР
			|		КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
			|			ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ВозвратТоваровОтПокупателя)
			|		КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
			|			ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг)
			|	КОНЕЦ КАК Регистратор,
			|	ЕСТЬNULL(ИнформацияПоПроезду.ДоставкаВЦене, 0) КАК Транспорт,
			|	ВЫБОР
			|		КОГДА ПродажиОбороты.КоличествоОборот = 0
			|			ТОГДА 0
			|		ИНАЧЕ ЕСТЬNULL(ИнформацияПоПроезду.ДоставкаВЦене, 0) / ПродажиОбороты.КоличествоОборот
			|	КОНЕЦ КАК ТранспортШт,
			|	ПродажиОбороты.КоличествоОборот
			|ПОМЕСТИТЬ БазаПродаж
			|ИЗ
			|	РегистрНакопления.Продажи.Обороты(
			|			,
			|			,
			|			Регистратор,
			|			ЗаказПокупателя В
			|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|					ПриходИтого.Сделка
			|				ИЗ
			|					ПриходИтого КАК ПриходИтого)) КАК ПродажиОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиСебестоимость.Обороты(, , Регистратор, ) КАК ПродажиСебестоимостьОбороты
			|		ПО ПродажиОбороты.Номенклатура = ПродажиСебестоимостьОбороты.Номенклатура
			|			И ПродажиОбороты.ЗаказПокупателя = ПродажиСебестоимостьОбороты.ЗаказПокупателя
			|			И ПродажиОбороты.Регистратор = ПродажиСебестоимостьОбороты.Регистратор
			|			И ПродажиОбороты.Подразделение = ПродажиСебестоимостьОбороты.Подразделение
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияПоПроезду КАК ИнформацияПоПроезду
			|		ПО ПродажиОбороты.Регистратор = ИнформацияПоПроезду.Реализация
			|			И ПродажиОбороты.ЗаказПокупателя = ИнформацияПоПроезду.Заказ
			|			И ПродажиОбороты.Номенклатура = ИнформацияПоПроезду.Номенклатура
			|ГДЕ
			|	(ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
			|			ИЛИ ПродажиОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА БазаПродаж.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
			|			ТОГДА БазаПродаж.Регистратор
			|		ИНАЧЕ БазаПродаж.ЗаказПокупателя
			|	КОНЕЦ КАК Документ,
			|	СУММА(БазаПродаж.Оборот) КАК Оборот,
			|	БазаПродаж.ЗаказПокупателя
			|ПОМЕСТИТЬ ОборотИтого
			|ИЗ
			|	БазаПродаж КАК БазаПродаж
			|
			|СГРУППИРОВАТЬ ПО
			|	БазаПродаж.ЗаказПокупателя,
			|	ВЫБОР
			|		КОГДА БазаПродаж.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
			|			ТОГДА БазаПродаж.Регистратор
			|		ИНАЧЕ БазаПродаж.ЗаказПокупателя
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	БазаПродаж.Номенклатура,
			|	РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.Месяц,
			|	МАКСИМУМ(РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппа,
			|	МАКСИМУМ(РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.Производитель) КАК Производитель,
			|	РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.ВидТовара
			|ПОМЕСТИТЬ ДляОтсрочки
			|ИЗ
			|	БазаПродаж КАК БазаПродаж
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам КАК РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам
			|		ПО БазаПродаж.Номенклатура.ВидТовара = РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.ВидТовара
			|			И (ВЫБОР
			|				КОГДА РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.НоменклатурнаяГруппа = ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
			|					ТОГДА ИСТИНА
			|				ИНАЧЕ РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.НоменклатурнаяГруппа = БазаПродаж.Номенклатура.НоменклатурнаяГруппа
			|			КОНЕЦ)
			|			И (ВЫБОР
			|				КОГДА РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.Производитель = ЗНАЧЕНИЕ(Справочник.Производители.ПустаяСсылка)
			|					ТОГДА ИСТИНА
			|				ИНАЧЕ РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.Производитель = БазаПродаж.Номенклатура.Производитель
			|			КОНЕЦ)
			|			И (НАЧАЛОПЕРИОДА(БазаПродаж.ЗаказПокупателя.ДатаОтгрузки, МЕСЯЦ) = РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.Месяц)
			|
			|СГРУППИРОВАТЬ ПО
			|	РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.ВидТовара,
			|	БазаПродаж.Номенклатура,
			|	РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.Месяц
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДляОтсрочки.Номенклатура,
			|	РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.Месяц,
			|	РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.ДатаОплаты,
			|	РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.ДнейОтсрочки
			|ПОМЕСТИТЬ СрокиОтсрочки
			|ИЗ
			|	ДляОтсрочки КАК ДляОтсрочки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам КАК РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам
			|		ПО ДляОтсрочки.ВидТовара = РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.ВидТовара
			|			И ДляОтсрочки.Производитель = РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.Производитель
			|			И ДляОтсрочки.НоменклатурнаяГруппа = РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.НоменклатурнаяГруппа
			|			И ДляОтсрочки.Месяц = РекомендованыеДатыОтсрочкиПоНоменклатурнымГруппам.Месяц
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ПриходИтого.Документ ССЫЛКА Документ.ВозвратТоваровОтПокупателя
			|			ТОГДА ВЫБОР
			|					КОГДА ПриходИтого.ПриходДенег < ОборотИтого.Оборот
			|						ТОГДА 1
			|					ИНАЧЕ ПриходИтого.ПриходДенег / ОборотИтого.Оборот
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ПриходИтого.ПриходДенег > ОборотИтого.Оборот
			|					ТОГДА 1
			|				ИНАЧЕ ПриходИтого.ПриходДенег / ОборотИтого.Оборот
			|			КОНЕЦ
			|	КОНЕЦ КАК КОплаты,
			|	ПриходИтого.Сделка,
			|	ПриходИтого.Документ
			|ПОМЕСТИТЬ КоэффициентыОплаты
			|ИЗ
			|	ПриходИтого КАК ПриходИтого
			|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотИтого КАК ОборотИтого
			|		ПО ПриходИтого.Документ = ОборотИтого.Документ
			|			И ПриходИтого.Сделка = ОборотИтого.ЗаказПокупателя
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Отсечки.ВидТовара,
			|	Отсечки.НоменклатурнаяГруппа,
			|	Отсечки.Отсечка,
			|	Отсечки.Процент
			|ПОМЕСТИТЬ ДанныеПоОтсечкам
			|ИЗ
			|	&Отсечки КАК Отсечки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	БазаПродаж.Номенклатура,
			|	ДанныеПоОтсечкам.ВидТовара,
			|	МАКСИМУМ(ДанныеПоОтсечкам.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппа
			|ПОМЕСТИТЬ ДляОтсечек
			|ИЗ
			|	БазаПродаж КАК БазаПродаж
			|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоОтсечкам КАК ДанныеПоОтсечкам
			|		ПО БазаПродаж.Номенклатура.ВидТовара = ДанныеПоОтсечкам.ВидТовара
			|			И (ВЫБОР
			|				КОГДА ДанныеПоОтсечкам.НоменклатурнаяГруппа = ЗНАЧЕНИЕ(Справочник.номенклатурныеГруппы.пустаяссылка)
			|					ТОГДА ИСТИНА
			|				ИНАЧЕ БазаПродаж.Номенклатура.НоменклатурнаяГруппа = ДанныеПоОтсечкам.НоменклатурнаяГруппа
			|			КОНЕЦ)
			|
			|СГРУППИРОВАТЬ ПО
			|	БазаПродаж.Номенклатура,
			|	ДанныеПоОтсечкам.ВидТовара
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДляОтсечек.Номенклатура,
			|	ДанныеПоОтсечкам.Отсечка,
			|	ДанныеПоОтсечкам.Процент
			|ПОМЕСТИТЬ ОтчечкиПоНоменклатуре
			|ИЗ
			|	ДляОтсечек КАК ДляОтсечек
			|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоОтсечкам КАК ДанныеПоОтсечкам
			|		ПО ДляОтсечек.ВидТовара = ДанныеПоОтсечкам.ВидТовара
			|			И ДляОтсечек.НоменклатурнаяГруппа = ДанныеПоОтсечкам.НоменклатурнаяГруппа
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПриходИтого.Сделка КАК ЗаказПокупателя,
			|	ПриходИтого.ПриходДенег,
			|	КоэффициентыОплаты.КОплаты,
			|	ВЫБОР
			|		КОГДА ПриходИтого.Документ ССЫЛКА Документ.ВозвратТоваровОтПокупателя
			|			ТОГДА ""Оплаченный возврат""
			|		ИНАЧЕ ""Оплата отгрузки""
			|	КОНЕЦ КАК ВидНачисления,
			|	БазаПродаж.Номенклатура,
			|	БазаПродаж.Оборот,
			|	БазаПродаж.Себестоимость,
			|	БазаПродаж.Наценка,
			|	ВЫБОР
			|		КОГДА ПриходИтого.Документ ССЫЛКА Документ.ВозвратТоваровОтПокупателя
			|			ТОГДА БазаПродаж.ТранспортШт * БазаПродаж.КоличествоОборот
			|		ИНАЧЕ БазаПродаж.Транспорт
			|	КОНЕЦ КАК Транспорт,
			|	ВЫБОР
			|		КОГДА СрокиОтсрочки.ДнейОтсрочки ЕСТЬ NULL 
			|			ТОГДА ВЫБОР
			|					КОГДА РАЗНОСТЬДАТ(БазаПродаж.ЗаказПокупателя.ДатаОплаты, ДОБАВИТЬКДАТЕ(БазаПродаж.ЗаказПокупателя.ДатаОтгрузки, МЕСЯЦ, 1), ДЕНЬ) > 0
			|						ТОГДА &ПроцПремированияПредоплаты
			|					ИНАЧЕ &ПроцДепремированияПредоплаты
			|				КОНЕЦ * БазаПродаж.Оборот * РАЗНОСТЬДАТ(БазаПродаж.ЗаказПокупателя.ДатаОплаты, ДОБАВИТЬКДАТЕ(БазаПродаж.ЗаказПокупателя.ДатаОтгрузки, МЕСЯЦ, 1), ДЕНЬ) / 36500
			|		КОГДА СрокиОтсрочки.ДнейОтсрочки <> 0
			|			ТОГДА ВЫБОР
			|					КОГДА РАЗНОСТЬДАТ(БазаПродаж.ЗаказПокупателя.ДатаОплаты, ДОБАВИТЬКДАТЕ(БазаПродаж.ЗаказПокупателя.ДатаОтгрузки, ДЕНЬ, СрокиОтсрочки.ДнейОтсрочки), ДЕНЬ) > 0
			|						ТОГДА &ПроцПремированияПредоплаты
			|					ИНАЧЕ &ПроцДепремированияПредоплаты
			|				КОНЕЦ * БазаПродаж.Оборот * РАЗНОСТЬДАТ(БазаПродаж.ЗаказПокупателя.ДатаОплаты, ДОБАВИТЬКДАТЕ(БазаПродаж.ЗаказПокупателя.ДатаОтгрузки, ДЕНЬ, СрокиОтсрочки.ДнейОтсрочки), ДЕНЬ) / 36500
			|		ИНАЧЕ ВЫБОР
			|				КОГДА РАЗНОСТЬДАТ(БазаПродаж.ЗаказПокупателя.ДатаОплаты, СрокиОтсрочки.ДатаОплаты, ДЕНЬ) > 0
			|					ТОГДА &ПроцПремированияПредоплаты
			|				ИНАЧЕ &ПроцДепремированияПредоплаты
			|			КОНЕЦ * БазаПродаж.Оборот * РАЗНОСТЬДАТ(БазаПродаж.ЗаказПокупателя.ДатаОплаты, СрокиОтсрочки.ДатаОплаты, ДЕНЬ) / 36500
			|	КОНЕЦ КАК ПремияЗаОтсрочку,
			|	ВЫБОР
			|		КОГДА СрокиОтсрочки.ДнейОтсрочки ЕСТЬ NULL 
			|			ТОГДА ДОБАВИТЬКДАТЕ(БазаПродаж.ЗаказПокупателя.ДатаОтгрузки, МЕСЯЦ, 1)
			|		КОГДА СрокиОтсрочки.ДнейОтсрочки <> 0
			|			ТОГДА ДОБАВИТЬКДАТЕ(БазаПродаж.ЗаказПокупателя.ДатаОтгрузки, ДЕНЬ, СрокиОтсрочки.ДнейОтсрочки)
			|		ИНАЧЕ СрокиОтсрочки.ДатаОплаты
			|	КОНЕЦ КАК РекомендуемаяДатаОплаты,
			|	ВЫБОР
			|		КОГДА ПриходИтого.Документ ССЫЛКА Документ.ВозвратТоваровОтПокупателя
			|			ТОГДА ВЫБОР
			|					КОГДА БазаПродаж.Наценка - БазаПродаж.ТранспортШт * БазаПродаж.КоличествоОборот < 0
			|						ТОГДА БазаПродаж.Оборот * &Процентоборот / 100
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА БазаПродаж.Наценка - БазаПродаж.Транспорт > 0
			|					ТОГДА БазаПродаж.Оборот * &Процентоборот / 100
			|				ИНАЧЕ 0
			|			КОНЕЦ
			|	КОНЕЦ КАК ПремияЗаОборот,
			|	ПриходИтого.Сделка.ДатаОплаты КАК ДатаОплаты,
			|	ПриходИтого.Сделка.Контрагент КАК Контрагент,
			|	ПриходИтого.Сделка.ДоговорКонтрагента.ОтветственноеЛицо КАК Менеджер,
			|	БазаПродаж.Номенклатура.ВидТовара КАК ВидТовара,
			|	ПриходИтого.ШтрафЗаПросрочку,
			|	ВЫБОР
			|		КОГДА ПриходИтого.Сделка.Контрагент В (&Обмены)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ПриходИтого.Документ ССЫЛКА Документ.ВозвратТоваровОтПокупателя
			|					ТОГДА ВЫБОР
			|							КОГДА БазаПродаж.Наценка - БазаПродаж.ТранспортШт * БазаПродаж.КоличествоОборот < 0
			|								ТОГДА ВЫБОР
			|										КОГДА ЕСТЬNULL(БазаПродаж.Себестоимость, 0) = 0
			|											ТОГДА 0
			|										ИНАЧЕ ВЫБОР
			|												КОГДА -(БазаПродаж.Наценка - БазаПродаж.ТранспортШт * БазаПродаж.КоличествоОборот) / БазаПродаж.Себестоимость * 100 > ОтчечкиПоНоменклатуре.Отсечка
			|													ТОГДА (БазаПродаж.Наценка - БазаПродаж.ТранспортШт * БазаПродаж.КоличествоОборот - ОтчечкиПоНоменклатуре.Отсечка * БазаПродаж.Себестоимость / 100) * ОтчечкиПоНоменклатуре.Процент / 100
			|												ИНАЧЕ 0
			|											КОНЕЦ
			|									КОНЕЦ
			|							ИНАЧЕ 0
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА БазаПродаж.Наценка - БазаПродаж.Транспорт > 0
			|							ТОГДА ВЫБОР
			|									КОГДА ЕСТЬNULL(БазаПродаж.Себестоимость, 0) = 0
			|										ТОГДА 0
			|									ИНАЧЕ ВЫБОР
			|											КОГДА (БазаПродаж.Наценка - БазаПродаж.Транспорт) / БазаПродаж.Себестоимость * 100 > ОтчечкиПоНоменклатуре.Отсечка
			|												ТОГДА (БазаПродаж.Наценка - БазаПродаж.Транспорт - ОтчечкиПоНоменклатуре.Отсечка * БазаПродаж.Себестоимость / 100) * ОтчечкиПоНоменклатуре.Процент / 100
			|											ИНАЧЕ 0
			|										КОНЕЦ
			|								КОНЕЦ
			|						ИНАЧЕ 0
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ КАК ПремияЗаНаценку
			|ИЗ
			|	ПриходИтого КАК ПриходИтого
			|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыОплаты КАК КоэффициентыОплаты
			|		ПО ПриходИтого.Сделка = КоэффициентыОплаты.Сделка
			|			И ПриходИтого.Документ = КоэффициентыОплаты.Документ
			|		ЛЕВОЕ СОЕДИНЕНИЕ БазаПродаж КАК БазаПродаж
			|			ЛЕВОЕ СОЕДИНЕНИЕ СрокиОтсрочки КАК СрокиОтсрочки
			|			ПО БазаПродаж.Номенклатура = СрокиОтсрочки.Номенклатура
			|				И (НАЧАЛОПЕРИОДА(БазаПродаж.ЗаказПокупателя.Дата, МЕСЯЦ) = СрокиОтсрочки.Месяц)
			|			ЛЕВОЕ СОЕДИНЕНИЕ ОтчечкиПоНоменклатуре КАК ОтчечкиПоНоменклатуре
			|			ПО БазаПродаж.Номенклатура = ОтчечкиПоНоменклатуре.Номенклатура
			|		ПО ПриходИтого.Сделка = БазаПродаж.ЗаказПокупателя
			|			И (ВЫБОР
			|				КОГДА ПриходИтого.Документ ССЫЛКА Документ.ВозвратТоваровОтПокупателя
			|					ТОГДА ПриходИтого.Документ = БазаПродаж.Регистратор
			|				ИНАЧЕ ПриходИтого.Документ = БазаПродаж.ЗаказПокупателя
			|						И НЕ БазаПродаж.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
			|			КОНЕЦ)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВидНачисления";

			
		Запрос.УстановитьПараметр("кон", КонПериода);
	Запрос.УстановитьПараметр("нач", НачПериода);
	Запрос.УстановитьПараметр("ПроцентПросрочки", ПроцентПросрочки);
		
	Запрос.УстановитьПараметр("Обмены", ОбменСКонтрагентами.ВыгрузитьКолонку("контрагент"));
	Запрос.УстановитьПараметр("ПроцДепремированияПредоплаты", ПроцентЗаДлительнуюОтсрочку);
	Запрос.УстановитьПараметр("Процентоборот", ПроцентПремии);
	Запрос.УстановитьПараметр("ПроцПремированияПредоплаты", ПроцентЗаКороткуюОтсрочку);
	Запрос.УстановитьПараметр("Отсечки", Отсечки);
	Результат = Запрос.Выполнить();

	Приходы = Результат.Выгрузить();

     ВыводРезультата(Приходы);


конецПроцедуры


Процедура ВыводРезультата(Рез)
	СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТЗ",Рез);
	
	Настройки = КомпоновщикНастроек.Настройки;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
	Настройки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных);
	Результат = ЭлементыФормы.Результат;
	Результат.Очистить();
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры


