Функция Печать() Экспорт
	
	Если Не Метаданные.Имя = "УправлениеТорговлей" Тогда
		Сообщить("Печатная форма предназначена для использования в конфигурации ""Управление торговлей""", СтатусСообщения.Внимание);
	КонецЕсли;
	
	Если 	ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Возврат ПечатьРеализации(СсылкаНаОбъект);
	КонецЕсли;
	
	Если 	ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Возврат ПечатьПеремещенияТоваров(СсылкаНаОбъект);
	КонецЕсли;

КонецФункции // Печать


Функция ПечатьРеализации ( Регистратор) 
	ТабДок=Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ОтчетРеализация");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	А.Комплектующая КАК Номенклатура,
	|	А.Комплектующая.Код КАК Код,
	|	А.Комплектующая.КодСБИС КАК КодСБИС,
	|	СУММА(А.КоличествоЗаказано) КАК КоличествоЗаказано,
	|	СУММА(А.КоличествоОтгружено) КАК КоличествоОтгружено,
	|	СУММА(А.КоличествоВернуть) КАК КоличествоВернуть,
	|	А.Номенклатура КАК Номенклатура1
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|		ЕСТЬNULL(ЗаказПокупателяТовары.КоличествоЗаказано, 0) КАК КоличествоЗаказано,
	|		ЕСТЬNULL(РеализацияТоваровУслугТовары.КоличествоОтгружено, 0) КАК КоличествоОтгружено,
	|		КомплектующиеНоменклатуры.Комплектующая КАК Комплектующая,
	|		ЕСТЬNULL(ЗаказПокупателяТовары.КоличествоЗаказано, 0) - ЕСТЬNULL(РеализацияТоваровУслугТовары.КоличествоОтгружено, 0) КАК КоличествоВернуть
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|			СУММА(ЗаказПокупателяТовары.Количество) КАК КоличествоЗаказано
	|		ИЗ
	|			Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|		ГДЕ
	|			ЗаказПокупателяТовары.Ссылка = &СсылкаЗаказ
	|			И (ЗаказПокупателяТовары.Номенклатура.Наименование ПОДОБНО ""%LegeArtis%""
	|					ИЛИ ЗаказПокупателяТовары.Номенклатура.Наименование ПОДОБНО ""%YST%"")
	|			И ЗаказПокупателяТовары.Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказПокупателяТовары.Номенклатура) КАК ЗаказПокупателяТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|				СУММА(РеализацияТоваровУслугТовары.Количество) КАК КоличествоОтгружено
	|			ИЗ
	|				Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|			ГДЕ
	|				РеализацияТоваровУслугТовары.Ссылка = &СсылкаРеализация
	|				И (РеализацияТоваровУслугТовары.Номенклатура.Наименование ПОДОБНО ""%LegeArtis%""
	|						ИЛИ РеализацияТоваровУслугТовары.Номенклатура.Наименование ПОДОБНО ""%YST%"")
	|				И РеализацияТоваровУслугТовары.Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				РеализацияТоваровУслугТовары.Номенклатура) КАК РеализацияТоваровУслугТовары
	|			ПО ЗаказПокупателяТовары.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				КомплектующиеНоменклатуры.Номенклатура КАК Номенклатура,
	|				КомплектующиеНоменклатуры.Комплектующая КАК Комплектующая
	|			ИЗ
	|				РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	|			ГДЕ
	|				КомплектующиеНоменклатуры.Номенклатура В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							Документ.ЗаказПокупателя.Товары.Номенклатура
	|						ИЗ
	|							Документ.ЗаказПокупателя.Товары
	|						ГДЕ
	|							Документ.ЗаказПокупателя.Товары.Ссылка = &СсылкаЗаказ)
	|				И КомплектующиеНоменклатуры.Комплектующая В ИЕРАРХИИ(&Крышки)) КАК КомплектующиеНоменклатуры
	|			ПО ЗаказПокупателяТовары.Номенклатура = КомплектующиеНоменклатуры.Номенклатура) КАК А
	|
	|СГРУППИРОВАТЬ ПО
	|	А.Комплектующая,
	|	А.Комплектующая.Код,
	|	А.Комплектующая.КодСБИС,
	|	А.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодСБИС";

	Запрос.УстановитьПараметр("СсылкаРеализация", Регистратор);
	Запрос.УстановитьПараметр("СсылкаЗаказ", Регистратор.Сделка);
	Запрос.УстановитьПараметр("Крышки", Справочники.Номенклатура.НайтиПоКоду("0080004"));

	Результат = Запрос.Выполнить();

	
	ОбластьЗаголовок= Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ЗаголовокДокумента="Реализация №" +  Регистратор.Номер +" от "+Формат(Регистратор.Дата,"ДФ=dd.MM.yyyy") +". Покупатель: "+Регистратор.Контрагент.Наименование;
	ОбластьШапка= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.типДокумента ="Реализации";
	
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");

	ТабДок.Очистить();

	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапка);
	
	ВыборкаДетали = Результат.Выбрать();

	КоличествоЗаказаноИтого=0;
	КоличествоОтгруженоИтого=0;
	КоличествоВернутьИтого=0;
	Пока ВыборкаДетали.Следующий() Цикл
	КоличествоЗаказаноИтого=КоличествоЗаказаноИтого+ ВыборкаДетали.КОличествоЗаказано;
	КоличествоОтгруженоИтого=КоличествоОтгруженоИтого+ВыборкаДетали.КОличествоОтгружено ;
	КоличествоВернутьИтого=КоличествоВернутьИтого+ ВыборкаДетали.КОличествоВернуть;

		ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла;
	ОбластьПодвалТаблицы.Параметры.КоличествоЗаказаноИтого=КоличествоЗаказаноИтого;
	ОбластьПодвалТаблицы.Параметры.КоличествоОтгруженоИтого=КоличествоОтгруженоИтого;
	ОбластьПодвалТаблицы.Параметры.КоличествоВернутьИтого=КоличествоВернутьИтого;
	ТабДок.Вывести(ОбластьПодвалТаблицы);	
    Возврат ТабДок;
КонецФункции

Функция ПечатьПеремещенияТоваров ( Регистратор) 
	ТабДок=Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ОтчетРеализация");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	А.Комплектующая КАК Номенклатура,
	|	А.Комплектующая.Код КАК Код,
	|	А.Комплектующая.КодСБИС КАК КодСБИС,
	|	СУММА(А.КоличествоЗаказано) КАК КоличествоЗаказано,
	|	СУММА(А.КоличествоОтгружено) КАК КоличествоОтгружено,
	|	СУММА(А.КоличествоВернуть) КАК КоличествоВернуть
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|		ЕСТЬNULL(ЗаказПокупателяТовары.КоличествоЗаказано, 0) КАК КоличествоЗаказано,
	|		ЕСТЬNULL(РеализацияТоваровУслугТовары.КоличествоОтгружено, 0) КАК КоличествоОтгружено,
	|		КомплектующиеНоменклатуры.Комплектующая КАК Комплектующая,
	|		ЕСТЬNULL(ЗаказПокупателяТовары.КоличествоЗаказано, 0) - ЕСТЬNULL(РеализацияТоваровУслугТовары.КоличествоОтгружено, 0) КАК КоличествоВернуть
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВнутреннийЗаказТовары.Номенклатура КАК Номенклатура,
	|			СУММА(ВнутреннийЗаказТовары.Количество) КАК КоличествоЗаказано
	|		ИЗ
	|			Документ.ВнутреннийЗаказ.Товары КАК ВнутреннийЗаказТовары
	|		ГДЕ
	|			ВнутреннийЗаказТовары.Ссылка = &СсылкаЗаказ
	//|			И (ВнутреннийЗаказТовары.Номенклатура.Наименование ПОДОБНО ""%LegeArtis%""
	//|					ИЛИ ВнутреннийЗаказТовары.Номенклатура.Наименование ПОДОБНО ""%YST%"")
	//|			И ВнутреннийЗаказТовары.Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВнутреннийЗаказТовары.Номенклатура) КАК ЗаказПокупателяТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				КомплектующиеНоменклатуры.Номенклатура КАК Номенклатура,
	|				КомплектующиеНоменклатуры.Комплектующая КАК Комплектующая
	|			ИЗ
	|				РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	|			ГДЕ
	|				КомплектующиеНоменклатуры.Номенклатура В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							Документ.ВнутреннийЗаказ.Товары.Номенклатура
	|						ИЗ
	|							Документ.ВнутреннийЗаказ.Товары
	|						ГДЕ
	|							Документ.ВнутреннийЗаказ.Товары.Ссылка = &СсылкаЗаказ)
	|				И КомплектующиеНоменклатуры.Комплектующая В ИЕРАРХИИ(&Крышки)) КАК КомплектующиеНоменклатуры
	|			ПО ЗаказПокупателяТовары.Номенклатура = КомплектующиеНоменклатуры.Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|				СУММА(ПеремещениеТоваровТовары.Количество) КАК КоличествоОтгружено
	|			ИЗ
	|				Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|			ГДЕ
	|				ПеремещениеТоваровТовары.Ссылка = &СсылкаРеализация
	//|				И (ПеремещениеТоваровТовары.Номенклатура.Наименование ПОДОБНО ""%LegeArtis%""
	//|						ИЛИ ПеремещениеТоваровТовары.Номенклатура.Наименование ПОДОБНО ""%YST%"")
	//|				И ПеремещениеТоваровТовары.Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ПеремещениеТоваровТовары.Номенклатура) КАК РеализацияТоваровУслугТовары
	|			ПО ЗаказПокупателяТовары.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура) КАК А
	|
	|СГРУППИРОВАТЬ ПО
	|	А.Комплектующая,
	|	А.Комплектующая.Код,
	|	А.Комплектующая.КодСБИС
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодСБИС";

	Запрос.УстановитьПараметр("СсылкаРеализация", Регистратор);
	Если ЗначениеЗаполнено(Регистратор.ВнутреннийЗаказ) тогда
		Запрос.УстановитьПараметр("СсылкаЗаказ", Регистратор.ВнутреннийЗаказ);
	иначе
		Предупреждение("Не заполнено поле ""Внутренний заказ"" ");
		возврат неопределено;
	КонецЕсли;
			
	Запрос.УстановитьПараметр("Крышки", Справочники.Номенклатура.НайтиПоКоду("0080004"));

	Результат = Запрос.Выполнить();

	
	ОбластьЗаголовок= Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ЗаголовокДокумента="Перемещение №" +  Регистратор.Номер +" от "+Формат(Регистратор.Дата,"ДФ=dd.MM.yyyy") +". ";
	ОбластьШапка= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.типДокумента ="Перемещении";
	
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");

	ТабДок.Очистить();

	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапка);
	
	ВыборкаДетали = Результат.Выбрать();

	КоличествоЗаказаноИтого=0;
	КоличествоОтгруженоИтого=0;
	КоличествоВернутьИтого=0;
	Пока ВыборкаДетали.Следующий() Цикл
	КоличествоЗаказаноИтого=КоличествоЗаказаноИтого+ ВыборкаДетали.КОличествоЗаказано;
	КоличествоОтгруженоИтого=КоличествоОтгруженоИтого+ВыборкаДетали.КОличествоОтгружено ;
	КоличествоВернутьИтого=КоличествоВернутьИтого+ ВыборкаДетали.КОличествоВернуть;

		ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла;
	ОбластьПодвалТаблицы.Параметры.КоличествоЗаказаноИтого=КоличествоЗаказаноИтого;
	ОбластьПодвалТаблицы.Параметры.КоличествоОтгруженоИтого=КоличествоОтгруженоИтого;
	ОбластьПодвалТаблицы.Параметры.КоличествоВернутьИтого=КоличествоВернутьИтого;
	ТабДок.Вывести(ОбластьПодвалТаблицы);	
    Возврат ТабДок;
КонецФункции

