Функция СоздатьСтруктуру()
	Тест = Новый Структура;
	Тест.Вставить("Описание", ЭлементыФормы.ПТДОписание.ПолучитьТекст());
	Тест.Вставить("Регистр", Регистр);
	Тест.Вставить("Режим", Режим);
	Тест.Вставить("Записи", тпКонстанты);
	Тест.Вставить("Отбор", Отбор);
	Тест.Вставить("Параметры", Параметры);
	Тест.Вставить("ФормаРедактирования", "РегистрСведений_Запись");
	Возврат Тест;
КонецФункции

Процедура ЗаполнитьИзСтруктуры(Тест) Экспорт
	Если Тест.Свойство("Описание") Тогда
		ЭлементыФормы.ПТДОписание.УстановитьТекст(Тест.Описание);
	КонецЕсли;
	
	Если Тест.Свойство("Режим") Тогда
		Режим = Тест.Режим;
	КонецЕсли;
	Если Тест.Свойство("Регистр") Тогда
		Регистр = Тест.Регистр;
	КонецЕсли;
	Если Тест.Свойство("Отбор") Тогда
		Отбор = Тест.Отбор;
	КонецЕсли;
	Если Тест.Свойство("Записи") Тогда
		тпКонстанты = Тест.Записи;
		ЭлементыФормы.тпКонстанты.СоздатьКолонки();
	КонецЕсли;
	
	Если Тест.Свойство("Параметры") Тогда
		Параметры = Тест.Параметры;
	КонецЕсли;
	
КонецПроцедуры

Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
	СтруктураТеста = СоздатьСтруктуру();
	Если МодальныйРежим Тогда 
		Закрыть(СтруктураТеста);
	Иначе
		СтрокаТеста.Описание = СтруктураТеста.Описание;
		СтрокаТеста.Тест = ЗначениеВСтрокуВнутр(СтруктураТеста);
		Закрыть(СтруктураТеста);
	КонецЕсли;
КонецПроцедуры

Процедура ПриОткрытии()
	// Вставить содержимое обработчика.
КонецПроцедуры


Процедура РегистрСвединийНачалоВыбора(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	Список = Новый СписокЗначений;
	Для Каждого Строка ИЗ Метаданные.РегистрыСведений Цикл
		 Список.Добавить(Строка.Имя, ?(ПустаяСтрока(Строка.Синоним), Строка.Имя, Строка.Синоним),, БиблиотекаКартинок.РегистрСведений);
		 
	КонецЦикла;
	Результат = Список.ВыбратьЭлемент();
	Если Результат <> Неопределено Тогда
		Регистр = Результат.Значение;
		
		Набор = РегистрыСведений[Регистр].СоздатьНаборЗаписей();
		Отбор = Набор.Отбор;
		ЭлементыФормы.тпКонстанты.Колонки.Очистить();
		тпКонстанты = Набор.Выгрузить();
		ЭлементыФормы.тпКонстанты.СоздатьКолонки();
	КонецЕсли;
	
КонецПроцедуры
