
Процедура ЗаполнитьЗаказыПоОстаткам(ДатаОст='00010101') Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РезервНаСкладахОстатки.ЗаказПокупателя,
	               |	СУММА(РезервНаСкладахОстатки.КоличествоКонечныйОстаток) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.РезервНаСкладах.ОстаткиИОбороты( ,//&Дата
				   |, Регистратор, , ) КАК РезервНаСкладахОстатки
	               |ГДЕ
	               |	РезервНаСкладахОстатки.КоличествоКонечныйОстаток > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РезервНаСкладахОстатки.ЗаказПокупателя";
	Если ДатаОст<>'00010101' тогда
		Запрос.Текст = стрЗаменить(Запрос.Текст, "//&Дата", "&Дата");
		Запрос.УстановитьПараметр("Дата", ДатаОст);
 	КонецЕсли;
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Заказы.Очистить();
	Пока Выборка.Следующий() Цикл
	  стр1 = Заказы.Добавить();
	  стр1.ЗаказПокупателя = выборка.ЗаказПокупателя;
	  стр1.Количество	   = выборка.Количество;
	КонецЦикла;
	
КонецПроцедуры	

Функция ПодготовитьТаблицуПоРезервамНаСкладахУпр()
СписокЗаказов = Заказы.ВыгрузитьКолонку("ЗаказПокупателя");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка",            Ссылка);
	Запрос.УстановитьПараметр("МоментДокумента",           дата);
	Запрос.УстановитьПараметр("СписокЗаказов",             СписокЗаказов);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РезервНаСкладахОстатки.ЗаказПокупателя,
	               |	РезервНаСкладахОстатки.Номенклатура,
	               |	РезервНаСкладахОстатки.Склад,
	               |	РезервНаСкладахОстатки.АдресХранения,
	               |	РезервНаСкладахОстатки.КоличествоОстаток КАК Количество,
	               |	&ДокументСсылка КАК Регистратор,
	               |	&МоментДокумента КАК Период
	               |ИЗ
	               |	РегистрНакопления.РезервНаСкладах.Остатки(, ЗаказПокупателя В (&СписокЗаказов)) КАК РезервНаСкладахОстатки";
				   
				   
	 ТаблицаРезервов = Запрос.Выполнить().Выгрузить();

	 Возврат ТаблицаРезервов;
	
КонецФункции	

процедура ОбработкаПроведения(Отказ)
	
Если не Отказ тогда
 таблица1 = ПодготовитьТаблицуПоРезервамНаСкладахУпр();	
	набор = регистрыНакопления.РезервНаСкладах.СоздатьНаборЗаписей();
	набор.Отбор.регистратор.ВидСравнения = видСравнения.Равно;
	набор.Отбор.регистратор.Значение = ссылка;
	набор.Отбор.регистратор.использование = истина;
	набор.Прочитать();
	
	Попытка
		НаборДвижений = движения.РезервНаСкладах;
		НаборДвижений.мТаблицаДвижений = Таблица1;
		НаборДвижений.мПериод = Дата;
		
		НаборДвижений.ВыполнитьРасход();

	Исключение
		СообщитьОбОшибке("Не удалось провести документ : "+ОписаниеОшибки() );
	КонецПопытки;
	
КонецЕсли;	
	
КонецПроцедуры	