
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Для каждого стр из РаботаСКонтрагентами цикл
	Запись = Регистрысведений.РаботаССезоннымиЗаказами.СоздатьМенеджерЗаписи();
	Запись.ПериодПланирования = ПериодПланирования;
	Запись.Менеджер = Менеджер;
	Запись.ТоварнаяГруппа = ТоварнаяГруппа;
	Запись.Бренд = стр.бренд;
	Запись.Контрагент = стр.Контрагент;
	Запись.СхемаРаботы = стр.СхемаРаботы;
	Запись.ПланПродаж = стр.ПланПродаж;
	Запись.КорректировкаПлана = стр.КорректировкаПлана;
	Запись.Причина = стр.Причина;
	Запись.УсловияРаботыВСезон = стр.условияРаботы;
	Запись.ДатаЗаказа =  стр.ДатаЗаказа;
	Запись.ДатаОтгрузки = стр.ДатаОтгрузки; 
	//Запись.Объем = стр.ПримерныйОбъем;
	Запись.Комментарий = стр.комментарий;
	Запись.Записать();	
	конецЦикла;	
КонецПроцедуры

Процедура ЗаполнитьНажатие(Элемент)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Справочник.Контрагенты) КАК Контрагент,
		|	ЗначенияСвойствОбъектов.Значение КАК Важность
		|ПОМЕСТИТЬ Важности
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &Важность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Бренды.бренд
		|ПОМЕСТИТЬ Бренды
		|ИЗ
		|	&Бренды КАК Бренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Справочник.Контрагенты) КАК Контрагент
		|ПОМЕСТИТЬ Контрагенты
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Значение = &Значение
		|	И ЗначенияСвойствОбъектов.Свойство = &Свойство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект,
		|	ЗначенияСвойствОбъектов.Значение
		|ПОМЕСТИТЬ РабГруппа
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &рабочаяГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(ЕСТЬNULL(РабГруппа.Значение, ДоговорыКонтрагентов.Владелец) КАК Справочник.Контрагенты) КАК Контрагент
		|ПОМЕСТИТЬ ВТ_Контрагенты
		|ИЗ
		|	Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО Контрагенты.Контрагент = ДоговорыКонтрагентов.Владелец
		|		ЛЕВОЕ СОЕДИНЕНИЕ РабГруппа КАК РабГруппа
		|		ПО Контрагенты.Контрагент = РабГруппа.Объект
		|ГДЕ
		|	ДоговорыКонтрагентов.ОтветственноеЛицо = &Менеджер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РаботаССезоннымиЗаказами.Контрагент,
		|	РаботаССезоннымиЗаказами.СхемаРаботы,
		|	РаботаССезоннымиЗаказами.НоменклатурнаяГруппа,
		|	РаботаССезоннымиЗаказами.ФактСезонники,
		|	РаботаССезоннымиЗаказами.ФактТекучка,
		|	РаботаССезоннымиЗаказами.ПланПродаж,
		|	РаботаССезоннымиЗаказами.КорректировкаПлана,
		|	РаботаССезоннымиЗаказами.Причина,
		|	РаботаССезоннымиЗаказами.УсловияРаботыВСезон,
		|	РаботаССезоннымиЗаказами.ДатаЗаказа,
		|	РаботаССезоннымиЗаказами.ДатаОтгрузки,
		|	РаботаССезоннымиЗаказами.Объем,
		|	РаботаССезоннымиЗаказами.Комментарий,
		|	Бренды.бренд
		|ПОМЕСТИТЬ Регистр
		|ИЗ
		|	Бренды КАК Бренды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботаССезоннымиЗаказами КАК РаботаССезоннымиЗаказами
		|		ПО Бренды.бренд = РаботаССезоннымиЗаказами.Бренд
		|ГДЕ
		|	РаботаССезоннымиЗаказами.Менеджер = &Менеджер
		|	И РаботаССезоннымиЗаказами.ПериодПланирования = &ПериодПланирования
		|	И РаботаССезоннымиЗаказами.ТоварнаяГруппа = &товарнаяГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Контрагенты.Контрагент,
		|	Бренды.бренд
		|ПОМЕСТИТЬ Шаблончик
		|ИЗ
		|	ВТ_Контрагенты КАК ВТ_Контрагенты,
		|	Бренды КАК Бренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Регистр.Контрагент, Шаблончик.Контрагент) КАК Контрагент,
		|	Регистр.СхемаРаботы,
		|	Регистр.ПланПродаж,
		|	Регистр.КорректировкаПлана,
		|	Регистр.ФактСезонники,
		|	Регистр.ФактТекучка,
		|	Регистр.Причина,
		|	Регистр.УсловияРаботыВСезон КАК УсловияРаботы,
		|	Регистр.ДатаЗаказа,
		|	Регистр.ДатаОтгрузки,
		|	Регистр.Объем КАК ПримерныйОбъем,
		|	Регистр.Комментарий,
		|	ЕСТЬNULL(Регистр.Контрагент.Регион, Шаблончик.Контрагент.Регион) КАК Регион,
		|	ЕСТЬNULL(Регистр.Контрагент.КатегорияПокупателя, Шаблончик.Контрагент.КатегорияПокупателя) КАК НаправлениеПродаж,
		|	Важности.Важность,
		|	Шаблончик.бренд
		|ПОМЕСТИТЬ Шаблон
		|ИЗ
		|	Шаблончик КАК Шаблончик
		|		ЛЕВОЕ СОЕДИНЕНИЕ Важности КАК Важности
		|		ПО Шаблончик.Контрагент = Важности.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Регистр КАК Регистр
		|		ПО Шаблончик.Контрагент = Регистр.Контрагент
		|			И Шаблончик.бренд = Регистр.бренд
		|ГДЕ
		|	Важности.Важность < 3
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &поГруппе
		|			ТОГДА &Порочие
		|		ИНАЧЕ ПродажиОбороты.Номенклатура.Производитель
		|	КОНЕЦ КАК Производитель,
		|	СУММА(ПродажиОбороты.КоличествоОборот) КАК ФактИтого,
		|	ЕСТЬNULL(РабГруппа.Значение, ПродажиОбороты.ДоговорКонтрагента.Владелец) КАК Контрагент,
		|	СУММА(ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0) - ЕСТЬNULL(ВложенныйЗапрос.КоличествоОборот, 0)) КАК ФактТекучка,
		|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.КоличествоОборот, 0)) КАК ФактСезонники
		|ПОМЕСТИТЬ Продажи
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&Нач,
		|			&Кон,
		|			,
		|			ДоговорКонтрагента.Владелец В
		|					(ВЫБРАТЬ
		|						Контрагенты.Контрагент
		|					ИЗ
		|						Контрагенты КАК Контрагенты)
		|				И ДоговорКонтрагента.ОтветственноеЛицо = &Менеджер) КАК ПродажиОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗаказыПокупателейСезонныеОбороты.Номенклатура КАК Номенклатура,
		|			СУММА(ЗаказыПокупателейСезонныеОбороты.КоличествоРасход) КАК КоличествоОборот,
		|			ЗаказыПокупателейСезонныеОбороты.Контрагент КАК Контрагент
		|		ИЗ
		|			РегистрНакопления.ЗаказыПокупателейСезонные.Обороты(&Нач, &Кон, Регистратор, ЗаказПокупателя.ДоговорКонтрагента.ОтветственноеЛицо = &Менеджер) КАК ЗаказыПокупателейСезонныеОбороты
		|		ГДЕ
		|			ЗаказыПокупателейСезонныеОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЗаказыПокупателейСезонныеОбороты.Номенклатура,
		|			ЗаказыПокупателейСезонныеОбороты.Контрагент) КАК ВложенныйЗапрос
		|		ПО ПродажиОбороты.Номенклатура = ВложенныйЗапрос.Номенклатура
		|			И ПродажиОбороты.ДоговорКонтрагента.Владелец = ВложенныйЗапрос.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РабГруппа КАК РабГруппа
		|		ПО ПродажиОбороты.ДоговорКонтрагента.Владелец = РабГруппа.Объект
		|ГДЕ
		|	ПродажиОбороты.Номенклатура.НоменклатурнаяГруппа В(&СписокГруппНоменклатуры)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(РабГруппа.Значение, ПродажиОбороты.ДоговорКонтрагента.Владелец),
		|	ВЫБОР
		|		КОГДА &поГруппе
		|			ТОГДА &Порочие
		|		ИНАЧЕ ПродажиОбороты.Номенклатура.Производитель
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(РабГруппа.Значение, ЗаказыПокупателейСезонныеОбороты.Контрагент) КАК Контрагент,
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказыПокупателейСезонныеОбороты.Регистратор ССЫЛКА Документ.ЗаказПокупателяСезонный
		|				ТОГДА ЗаказыПокупателейСезонныеОбороты.КоличествоПриход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Заказали,
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказыПокупателейСезонныеОбороты.Регистратор ССЫЛКА Документ.ЗакрытиеЗаказовПокупателейСезонных
		|				ТОГДА -ЗаказыПокупателейСезонныеОбороты.КоличествоПриход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Отказались,
		|	ВЫБОР
		|		КОГДА &поГруппе
		|			ТОГДА &Порочие
		|		ИНАЧЕ ЗаказыПокупателейСезонныеОбороты.Номенклатура.Производитель
		|	КОНЕЦ КАК Бренд
		|ПОМЕСТИТЬ ДвижениеПоСезонникам
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателейСезонные.Обороты(&НачТ, &КонТ, Регистратор, ЗаказПокупателяСезонный.ДоговорКонтрагента.ОтветственноеЛицо = &Менеджер) КАК ЗаказыПокупателейСезонныеОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РабГруппа КАК РабГруппа
		|		ПО ЗаказыПокупателейСезонныеОбороты.Контрагент = РабГруппа.Объект
		|ГДЕ
		|	(ЗаказыПокупателейСезонныеОбороты.Регистратор ССЫЛКА Документ.ЗаказПокупателяСезонный
		|			ИЛИ ЗаказыПокупателейСезонныеОбороты.Регистратор ССЫЛКА Документ.ЗакрытиеЗаказовПокупателейСезонных)
		|	И ЗаказыПокупателейСезонныеОбороты.Номенклатура.НоменклатурнаяГруппа В(&СписокГруппНоменклатуры)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(РабГруппа.Значение, ЗаказыПокупателейСезонныеОбороты.Контрагент),
		|	ВЫБОР
		|		КОГДА &поГруппе
		|			ТОГДА &Порочие
		|		ИНАЧЕ ЗаказыПокупателейСезонныеОбороты.Номенклатура.Производитель
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительнаяИнформацияПоКонтрагентамПрозрачностьКонтрагента.Ссылка.Владелец КАК Контрагент,
		|	ВЫБОР
		|		КОГДА &поГруппе
		|			ТОГДА &Порочие
		|		ИНАЧЕ ДополнительнаяИнформацияПоКонтрагентамПрозрачностьКонтрагента.Производитель
		|	КОНЕЦ КАК Производитель,
		|	СУММА(ДополнительнаяИнформацияПоКонтрагентамПрозрачностьКонтрагента.КоличествоГодовойОбъем) КАК ПрозрачностьКонтрагент
		|ПОМЕСТИТЬ Прозрачности
		|ИЗ
		|	Справочник.ДополнительнаяИнформацияПоКонтрагентам.ПрозрачностьКонтрагента КАК ДополнительнаяИнформацияПоКонтрагентамПрозрачностьКонтрагента
		|ГДЕ
		|	ДополнительнаяИнформацияПоКонтрагентамПрозрачностьКонтрагента.Год = ""2018""
		|	И ДополнительнаяИнформацияПоКонтрагентамПрозрачностьКонтрагента.Полугодие = ""целый год""
		|	И ДополнительнаяИнформацияПоКонтрагентамПрозрачностьКонтрагента.Прозрачность.ТоварнаяГруппа = &ТоварнаяГруппа
		|
		|СГРУППИРОВАТЬ ПО
		|	ДополнительнаяИнформацияПоКонтрагентамПрозрачностьКонтрагента.Ссылка.Владелец,
		|	ВЫБОР
		|		КОГДА &поГруппе
		|			ТОГДА &Порочие
		|		ИНАЧЕ ДополнительнаяИнформацияПоКонтрагентамПрозрачностьКонтрагента.Производитель
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Шаблон.Контрагент,
		|	Шаблон.СхемаРаботы,
		|	Шаблон.ПланПродаж,
		|	Шаблон.КорректировкаПлана,
		|	Шаблон.Причина,
		|	Шаблон.УсловияРаботы,
		|	Шаблон.ДатаЗаказа,
		|	Шаблон.ДатаОтгрузки,
		|	Шаблон.ПримерныйОбъем,
		|	Шаблон.Комментарий,
		|	Шаблон.Регион,
		|	Шаблон.НаправлениеПродаж,
		|	Продажи.ФактИтого,
		|	Шаблон.Важность,
		|	Продажи.ФактТекучка,
		|	Продажи.ФактСезонники,
		|	Шаблон.бренд,
		|	ДвижениеПоСезонникам.Заказали КАК ЗаказаноПоСезоннику,
		|	ДвижениеПоСезонникам.Отказались КАК Отказы,
		|	ВЫБОР
		|		КОГДА Шаблон.Контрагент.ОсновнойМенеджерКонтрагента = &Менеджер
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Основной,
		|	Прозрачности.ПрозрачностьКонтрагент
		|ИЗ
		|	Шаблон КАК Шаблон
		|		ЛЕВОЕ СОЕДИНЕНИЕ Продажи КАК Продажи
		|		ПО Шаблон.Контрагент = Продажи.Контрагент
		|			И Шаблон.бренд = Продажи.Производитель
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДвижениеПоСезонникам КАК ДвижениеПоСезонникам
		|		ПО Шаблон.бренд = ДвижениеПоСезонникам.Бренд
		|			И Шаблон.Контрагент = ДвижениеПоСезонникам.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Прозрачности КАК Прозрачности
		|		ПО Шаблон.Контрагент = Прозрачности.Контрагент
		|			И Шаблон.бренд = Прозрачности.Производитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Шаблон.Контрагент.Наименование";

	Запрос.УстановитьПараметр("Значение", Перечисления.КатегорииКонтрагентов.Работающие);
	Запрос.УстановитьПараметр("СписокГруппНоменклатуры", ТоварнаяГруппа.Состав.ВыгрузитьКолонку("НоменклатурнаяГруппа"));
	Запрос.УстановитьПараметр("Прозрачность",Справочники.ПрозрачностьКонтрагентов.НайтиПоКоду("000000042"));
	Запрос.УстановитьПараметр("ТоварнаяГруппа", ТоварнаяГруппа);
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	Запрос.УстановитьПараметр("ПериодПланирования", ПериодПланирования);
	Запрос.УстановитьПараметр("Свойство", планыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90218"));
	Запрос.УстановитьПараметр("Важность", планыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90184"));
    Запрос.УстановитьПараметр("РабочаяГруппа", планыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90230"));
    Запрос.УстановитьПараметр("Порочие", Справочники.Производители.НайтиПоКоду("4071"));
	
	Запрос.УстановитьПараметр("поГруппе", ВцеломПоГруппе);
	Запрос.УстановитьПараметр("Нач",ДобавитьМесяц(ПериодПланирования.ДатаНачала,-12));
    Запрос.УстановитьПараметр("Кон", конецДня(ДобавитьМесяц(ПериодПланирования.ДатаКонца,-12)));
	Запрос.УстановитьПараметр("НачТ",ПериодПланирования.ДатаНачала);
    Запрос.УстановитьПараметр("КонТ",КонецДня(ПериодПланирования.ДатаКонца));

	
	
	Если ВцеломПоГруппе тогда
	Бренды.Очистить();
	стр = Бренды.Добавить();
	стр.Бренд = Справочники.Производители.НайтиПоКоду("4071");
   КонецЕсли;		
    Запрос.УстановитьПараметр("Бренды", Бренды);
	Результат = Запрос.Выполнить().Выгрузить();

	РаботаСКонтрагентами.Загрузить(Результат);
конецпроцедуры

Процедура РаботаСКонтрагентамиСхемаРаботыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Если Элемент.списокВыбора.Количество()>0 Тогда
	Элемент.списокВыбора.Очистить();
    конецЕсли;
    Элемент.СписокВыбора.Добавить("По сезонным заказам");
    Элемент.СписокВыбора.Добавить("В текущем режиме");
    Элемент.СписокВыбора.Добавить("По сезонным + текущий режим");

КонецПроцедуры

Процедура РаботаСКонтрагентамиПричинаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
		Если Элемент.списокВыбора.Количество()>0 Тогда
	Элемент.списокВыбора.Очистить();
    конецЕсли;
    Элемент.СписокВыбора.Добавить("Цена");
    Элемент.СписокВыбора.Добавить("Условия");
    Элемент.СписокВыбора.Добавить("Дебитор");

	
	
	
КонецПроцедуры


Процедура РаботаСКонтрагентамиУсловияРаботыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Если Элемент.списокВыбора.Количество()>0 Тогда
	Элемент.списокВыбора.Очистить();
конецЕсли;
     Элемент.СписокВыбора.Добавить("Отсрочка");
    Элемент.СписокВыбора.Добавить("% возврата");
    Элемент.СписокВыбора.Добавить("Перенос отсрочки");
    Элемент.СписокВыбора.Добавить("Обмен");
    Элемент.СписокВыбора.Добавить("Предоплата");
КонецПроцедуры

Процедура ВцеломПоГруппеПриИзменении(Элемент)
	Если ВцеломПоГруппе тогда
	Бренды.Очистить();
	стр = Бренды.Добавить();
	стр.Бренд = Справочники.Производители.НайтиПоКоду("4071");
	ЭлементыФормы.Бренды.Доступность =ложь;
    иначе
	Бренды.Очистить();
	ЭлементыФормы.Бренды.Доступность =Истина;
	конецЕсли;	
		КонецПроцедуры

		Процедура ПриОткрытии()
		ВцеломПоГруппе =Истина;	
			Бренды.Очистить();
	ЭлементыФормы.Бренды.Доступность =ложь;

		КонецПроцедуры


		Процедура РаботаСКонтрагентамиПриПолученииДанных(Элемент, ОформленияСтрок)
			Для каждого стр из ОформленияСтрок Цикл
				Если стр.ДанныеСтроки.Основной тогда
					стр.Шрифт = Новый Шрифт(,, Истина);
				конецЕсли;	
			конецЦикла;	
		КонецПроцедуры

		Процедура РаботаСКонтрагентамиПрозрачностьКонтрагентОткрытие(Элемент, СтандартнаяОбработка)
			стандартнаяОбработка = Ложь;
			ТекСтрока = Элементыформы.РаботаСКонтрагентами.ТекущиеДанные;	
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДополнительнаяИнформацияПоКонтрагентам.Ссылка
			|ИЗ
			|	Справочник.ДополнительнаяИнформацияПоКонтрагентам КАК ДополнительнаяИнформацияПоКонтрагентам
			|ГДЕ
			|	ДополнительнаяИнформацияПоКонтрагентам.Владелец = &Владелец
			|	И ДополнительнаяИнформацияПоКонтрагентам.ПометкаУдаления = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("Владелец", ТекСтрока.контрагент);
			
			Результат = Запрос.Выполнить();
			
			Выборка = Результат.Выбрать();
			
			Выборка.Следующий();
			Форма = Выборка.ссылка.Получитьформу();
			форма.Открыть();
			
		КонецПроцедуры

		Процедура ТоварнаяГруппаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
			Если Элемент.списокВыбора.Количество()>0 Тогда
				Элемент.списокВыбора.Очистить();
			конецЕсли;
			Элемент.СписокВыбора.Добавить(Справочники.ТоварныеГруппыДляПланирования.НайтиПоКоду("000000063"));
			Элемент.СписокВыбора.Добавить(Справочники.ТоварныеГруппыДляПланирования.НайтиПоКоду("000000002"));
			Элемент.СписокВыбора.Добавить(Справочники.ТоварныеГруппыДляПланирования.НайтиПоКоду("000000003"));
		КонецПроцедуры

		Процедура РаботаСКонтрагентамиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
			стр = Элементыформы.РаботаСКонтрагентами.ТекущиеДанные;	
			Запись = Регистрысведений.РаботаССезоннымиЗаказами.СоздатьМенеджерЗаписи();
			Запись.ПериодПланирования = ПериодПланирования;
			Запись.Менеджер = Менеджер;
			Запись.ТоварнаяГруппа = ТоварнаяГруппа;
			Запись.Бренд = стр.бренд;
			Запись.Контрагент = стр.Контрагент;
			Запись.СхемаРаботы = стр.СхемаРаботы;
			Запись.ПланПродаж = стр.ПланПродаж;
			Запись.КорректировкаПлана = стр.КорректировкаПлана;
			Запись.Причина = стр.Причина;
			Запись.УсловияРаботыВСезон = стр.условияРаботы;
			Запись.ДатаЗаказа =  стр.ДатаЗаказа;
			Запись.ДатаОтгрузки = стр.ДатаОтгрузки; 
			//Запись.Объем = стр.ПримерныйОбъем;
			Запись.Комментарий = стр.комментарий;
			Запись.Записать();	
		КонецПроцедуры
