
Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.
		Элементы.Найти("ДатаНачала");
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение  = НачПериода;
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.
		Элементы.Найти("ДатаОкончания");
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение  = КонецДня(КонПериода);
	
	
	
	
КонецПроцедуры


Процедура ДетальноНажатие(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


Процедура ДетальноДетально(Кнопка)
Для каждого Настройка Из СхемаКомпоновкиДанных.ВариантыНастроек Цикл
Если Кнопка.Текст = Настройка.Представление тогда
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройка.Настройки);
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.
	Элементы.Найти("ДатаНачала");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = НачПериода;
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.
	Элементы.Найти("ДатаОкончания");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = КонецДня(КонПериода);
	ЭлементыФормы.Кнопка1.Заголовок= Настройка.Представление;
Прервать;
КонецЕсли;
КонецЦикла;

КонецПроцедуры



