ФУНКЦИЯ Печать() ЭКСПОРТ
	//ОчиститьСообщения();
	
	Если СсылкаНаОбъект.Товары.Количество()=0 Тогда
		Сообщить(нстр("ru=""Нет товаров для печати!"";
					  |en=""No goods for printing!""") );
		Возврат неопределено;
	КонецЕсли;	
	
	Если СсылкаНаОбъект.Ссылка.Пустая() Тогда
		Сообщить(нстр("ru=""Для печати необходимо предварительно записать Документ!"";
					  |en=""For the printing it is necessary to write down the Document previously!""") );
		Возврат неопределено;
	КонецЕсли;		
	
	ТабДок = ПечатьINVOICE();
	//Если не ТабДок=Неопределено Тогда
	//	ТабДок.Защита = Истина;
	//	ТабДок.ТолькоПросмотр = Истина;
	// 	ТабДок.Показать();
	//КонецЕсли;
   возврат ТабДок;
   
КонецФункции

Функция ПечатьINVOICE(ИмяМакета="INVOICE")
		
	ТабДок=Новый ТабличныйДокумент;
	Макет = ПолучитьМакет(ИмяМакета); 
	
	ОбластьШапка= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.КонтрагентНаименование = ?(СокрЛП(СсылкаНаОбъект.Контрагент.Код)="91535", "JIANGSU SAINTY MACHINERY IMP. & EXP. CORP., LTD",
	СокрЛП(СсылкаНаОбъект.Контрагент.НаименованиеПолное) );
	//Freeman = 91735
	ОбластьШапка.Параметры.ФактАдресПродавца = ?(СокрЛП(СсылкаНаОбъект.Контрагент.Код)="91735","Rm1502 Zhongning Bld No.255 Lingqiao Rd Ningbo China
	|1502 Жонгнинг, строение 255, Лингквиао Рд, Нингбо, Китай"	, 
	?(СокрЛП(СсылкаНаОбъект.Контрагент.Код)="91535","BUILDING C, 21TH RUANJIAN AVE, NANJING, CHINA
	|строение 21, Руанджиан Аве, Нанджинг, Китай", 
	?(СокрЛП(СсылкаНаОбъект.Контрагент.Код) = "93694","China, Fujian Province, Zhangzhou Jingcheng High-tech industrial Zone, Nanjihg Couty"
	,?(СокрЛП(СсылкаНаОбъект.Контрагент.Код) ="93695","NO.36, LANE300, SIMING(M)ROAD, YINZHOU, NINGBO CHINA","") ) )  );
	
	Если Найти(врег(СсылкаНаОбъект.Товары[0].Номенклатура.Производитель.Наименование), "TREBL") > 0 
		ИЛИ Найти(врег(СсылкаНаОбъект.Товары[0].Номенклатура.Производитель.Наименование), "ARRIVO") > 0 
		ИЛИ Найти(врег(СсылкаНаОбъект.Товары[0].Номенклатура.Производитель.Наименование), "SDT") > 0 
		ИЛИ Найти(врег(СсылкаНаОбъект.Товары[0].Номенклатура.Производитель.Наименование), "STEGER") > 0 
		Тогда
		ОбластьШапка.Параметры.TYPE = "STEEL";
		ОбластьШапка.Параметры.тип = "стальные";
	Иначе
		ОбластьШапка.Параметры.TYPE = "ALLOY";
		ОбластьШапка.Параметры.тип = "алюминиевые";
	КонецЕсли;
	
	ОбластьШапка.Параметры.Договор = СокрЛП(СсылкаНаОбъект.ДоговорКонтрагента.Номер)+" "+Формат(СсылкаНаОбъект.ДоговорКонтрагента.Дата,"ДЛФ=D");
	
	ОбластьШапка.Параметры.ДатаДокумента  = Формат(СсылкаНаОбъект.Дата,"ДЛФ=D");
	ОбластьШапка.Параметры.ДатаДокумента2 = Формат( ДобавитьМесяц(СсылкаНаОбъект.Дата, -2) ,"ДЛФ=D");  //спецификация на 2 месяца раньше!
	
	ОбластьШапка.Параметры.Номер = Формат( число(Прав(СсылкаНаОбъект.Номер,стрДлина(СсылкаНаОбъект.Номер)-2)), "ЧГ=0");
	
	//+++ 18.03.2014
	ОбластьШапка.Параметры.НомерКонтейнера = СокрЛП(СсылкаНаОбъект.НомерКонтейнера); 
	ОбластьШапка.Параметры.НомерДок = СокрЛП(СсылкаНаОбъект.Номер); 
	
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьШапкаТабл = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДок.Вывести(ОбластьШапкаТабл);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	//-------------------Цикл по товарам---------------------------------------	
	ВесИтого=0; ВесНеттоИтого=0; ОбъемИтого=0;
	для каждого стр1 из СсылкаНаОбъект.Товары цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, стр1);
		
		ОбластьСтрока.Параметры.Код 		  = стр1.Номенклатура.Код;
		ОбластьСтрока.Параметры.Номенклатура = стр1.Номенклатура.НаименованиеПолное;
		
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтого.Параметры.Количество 		= СсылкаНаОбъект.Товары.Итог("Количество");
	
	Если ИмяМакета="INVOICE" тогда
		ОбластьИтого.Параметры.Сумма			= СсылкаНаОбъект.Товары.Итог("Сумма");
	КонецЕсли;
	ТабДок.Вывести(ОбластьИтого);
	
	ОбластьСтрокаДоп = Макет.ПолучитьОбласть("СтрокаДоп");
	ОбластьСтрокаДоп.Параметры.ДопПоля = СокрЛП(СсылкаНаОбъект.ДопПоля);
	ТабДок.Вывести(ОбластьСтрокаДоп);
	
	//-------------------печати и подписи---------------------------------------
	//ОбластьСтрока = Макет.ПолучитьОбласть("ПодвалШапка");
	//ТабДок.Вывести(ОбластьСтрока);
	
	Если СокрЛП(СсылкаНаОбъект.Контрагент.Код)="91735" тогда
		ОбластьСтрока = Макет.ПолучитьОбласть("ПодвалFREEMAN");
	ИначеЕсли СокрЛП(СсылкаНаОбъект.Контрагент.Код)="91535" тогда
		ОбластьСтрока = Макет.ПолучитьОбласть("ПодвалJIANGSU");
	ИначеЕсли СокрЛП(СсылкаНаОбъект.Контрагент.Код) = "92540" Тогда
		ОбластьСтрока = Макет.ПолучитьОбласть("ПодвалJIANGSU");
	ИначеЕсли СокрЛП(СсылкаНаОбъект.Контрагент.Код) = "93694" Тогда
		ОбластьСтрока = Макет.ПолучитьОбласть("ПодвалZHEANGZHOU");
	ИначеЕсли СокрЛП(СсылкаНаОбъект.Контрагент.Код) = "93695" Тогда
		ОбластьСтрока = Макет.ПолучитьОбласть("ПодвалNINGBO");
	Иначе
		ОбластьСтрока = Макет.ПолучитьОбласть("Подвал1");
	КонецЕсли;	
	ТабДок.Вывести(ОбластьСтрока);
	
	возврат ТабДок;
	
КонецФункции	

