Процедура ПоказатьОшибку(ЗаголовокПар, ОписаниеОшибки, ПодробностиПар) Экспорт
	Заголовок = ЗаголовокПар;
	ОписаниеОшибкиНадпись = ОписаниеОшибки;
	Подробности = ПодробностиПар;
	ОткрытьМодально();
КонецПроцедуры


/////////////////////////////////////////////////////
// Методы формы

Процедура КнопкаВыполнитьНажатие(Кнопка)
	Закрыть();
КонецПроцедуры

Процедура НастроитьПроксиНажатие(Элемент)
	форманастройки = этотОбъект.ПолучитьФорму("ФормаНастройкиПроксиСервера");
	формаНастройки.ОткрытьМодально();

	Если формаНастройки.результат Тогда 
		результат= Истина;
		этаформа.Закрыть();
	КонецЕсли;	
КонецПроцедуры

Процедура ПодробнееНажатие(Элемент)
	ОткрытьЗначение(Подробности);
КонецПроцедуры


Процедура ПриОткрытии()
		КартинкаЗаголовка= ЭДО_БиблиотекаКартинок().КартинкаЗаголовка;
		ЭтаФорма.Заголовок = "Не удалось подключиться к серверу  "+НаименованиеСистемы;
	
КонецПроцедуры

