// Обработчик события элемента ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)

	Если Не ЭтоГруппа Тогда
		ЕдиницаХраненияОстатков = Неопределено;
	КонецЕсли; 

КонецПроцедуры

// Обработчик события ПередЗаписью формы.
//
Процедура ПередЗаписью(Отказ)

	Если НЕ ОбменДанными.Загрузка
	   И НЕ ЭтоГруппа
	   И ЗначениеНеЗаполнено(БазоваяЕдиницаИзмерения) Тогда
		СообщитьПользователюНезаполненРеквизит(Ссылка, "базовая единица");
		Отказ = Истина;
	КонецЕсли;
	
	//+++ 06.04.2012 редактирование - не доступно
	Если НЕ РольДоступна("ПолныеПрава") тогда
		Отказ = истина;
		Предупреждение("Недостаточно прав для создания или редактирования
					   |элементов справочника ""Номенклатурные группы""!
					   |Данные - не могут быть сохранены!");
	КонецЕсли;
					   
	Если НЕ Отказ Тогда
	
		обЗаписатьПротоколИзменений(ЭтотОбъект);
	
	КонецЕсли; 

КонецПроцедуры // ПередЗаписью()

