
функция НайтиПервоначальныеЗаказы()
	СписокЗак = новый СписокЗначений;
	СписокЗак.ЗагрузитьЗначения( СсылкаНаОбъект.Заказы.ВыгрузитьКолонку("ЗаказПокупателя") );
 	возврат СписокЗак;
КонецФункции	

//ЗаказПокупателя
Функция ПечатьОбщегоЗаказаПокупателяПоВнутреннимНомерам(СписокЗак)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПокупателя_СчетЗаказ";
	
	Макет = ПолучитьМакет("Макет");
	
	// Выводим шапку накладной
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	
	//Если Найти(врег(СсылкаНаОбъект.Комментарий), "ПЕРЕМЕЩЕНИЕ ИЗ ЯРОСЛАВЛЯ") = 0 Тогда
	//	ОбластьМакета.Параметры.Поставщик = "Яршинторг (Шинтрейд)";
	//Иначе
	//	ОбластьМакета.Параметры.Поставщик = "Яршинторг (Ярославль)";
	//КонецЕсли;
	
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++	
  //СписокНомеров = "";
  //СписокНомеровПортальный = "";
  //Для i=0 по СписокЗак.Количество()-1 цикл
  //   СписокНомеров = СписокНомеров +СокрЛП(СписокЗак[i].Значение.Номер)+"; ";
  //   СписокНомеровПортальный = СписокНомеровПортальный+СокрЛП(СписокЗак[i].Значение.НомерВходящегоДокумента)+"; ";
  //КонецЦикла;				  
  //  ОбластьМакета.Параметры.СписокНомеров = СписокНомеров;
  //  ОбластьМакета.Параметры.СписокНомеровПортальный = СписокНомеровПортальный;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокЗаказовПокупателей", СписокЗак);
	Запрос.УстановитьПараметр("ЭтотОбщийЗаказ", СсылкаНаОбъект);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателяТовары.НомерСтроки КАК НомерСтроки,
	               |	ЗаказПокупателяТовары.Номенклатура.Код КАК Код,
	               |	ЗаказПокупателяТовары.Номенклатура.НаименованиеПолное КАК Наименование,
	               |	ЗаказПокупателяТовары.Номенклатура,
	               |	ЗаказПокупателяТовары.Цена,
	               |	ЗаказПокупателяТовары1.СсылкаНомерВходящегоДокумента КАК НомерПорт,
	               |	ЗаказПокупателяТовары1.Количество КАК Количество,
	               |	ЗаказПокупателяТовары.Количество КАК КоличествоОбщее,
	               |	ЗаказПокупателяТовары1.Заказ
	               |ИЗ
	               |	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЗаказПокТовары1.Ссылка.НомерВходящегоДокумента КАК СсылкаНомерВходящегоДокумента,
	               |			ЗаказПокТовары1.Номенклатура КАК Номенклатура,
	               |			ЗаказПокТовары1.Количество КАК Количество,
	               |			ЗаказПокТовары1.Ссылка КАК Заказ
	               |		ИЗ
	               |			Документ.ЗаказПокупателя.Товары КАК ЗаказПокТовары1
	               |		ГДЕ
	               |			ЗаказПокТовары1.Ссылка В(&СписокЗаказовПокупателей)) КАК ЗаказПокупателяТовары1
	               |		ПО ЗаказПокупателяТовары.Номенклатура = ЗаказПокупателяТовары1.Номенклатура
	               |ГДЕ
	               |	ЗаказПокупателяТовары.Ссылка = &ЭтотОбщийЗаказ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки,
	               |	НомерПорт
	               |АВТОУПОРЯДОЧИВАНИЕ";
				   
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Результат);
		
		ОбластьСтрока.Параметры.Заказчик = СделатьВсеЗамены(Результат.Заказ.Комментарий); //31.08.2018
		
		ОбластьСтрока.Параметры.Номер = СокрЛП(Результат.Заказ.Номер);
		
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ОбластьИтого=Макет.ПолучитьОбласть("Подвал");
	ОбластьИтого.Параметры.КоличествоИтого = СсылкаНаОбъект.Товары.Итог("Количество");
	ТабДокумент.Вывести(ОбластьИтого);
	
	ОбластьИтого=Макет.ПолучитьОбласть("ОбластьДата");
	ОбластьИтого.Параметры.Дата=ТекущаяДата();
	ТабДокумент.Вывести(ОбластьИтого);
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ОтображатьСетку = Ложь;
	
	
	Возврат ТабДокумент;

КонецФункции // ПечатьСчетаЗаказа()

функция СделатьВсеЗамены(ТекстКомментарий)
	Заказчик = СтрЗаменить(ТекстКомментарий,"# данные перенесены ", "");    //   '# данные перенесены >> СП018490 # Боровичи 1'
	Заказчик = СокрЛП(Заказчик);
	i=найти(Заказчик, "#"); L=стрДлина(Заказчик);
//	сообщить(Заказчик +" - "+строка(i));
	пока i>0 цикл//+++ 31.08.2018 - лев(Заказчик,2)=">>"  не надо! на перемещение из Ярославля или данные перемесены...
		Заказчик = прав(Заказчик, L-i);
		i=найти(Заказчик, "#"); L=стрДлина(Заказчик);
	КонецЦикла;
	Заказчик = СокрЛП( СтрЗаменить(Заказчик, "#", "") );  //номер точки!
возврат Заказчик;			
КонецФункции	
	
//ЗаказПокупателя 1
Функция ПечатьЗаказаПокупателя()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПокупателя_СчетЗаказ";
	
	Макет = ПолучитьМакет("Макет1");
	
	СписокЗаказов = НайтиПервоначальныеЗаказы();
	
	Если СписокЗаказов.Количество()>0 тогда
		
		Для каждого СтрТЧ ИЗ СсылкаНаОбъект.Заказы Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Номер = СтрТЧ.ЗаказПокупателя.Номер;
		//----------------ЗАМЕНА-----------------
			ОбластьМакета.Параметры.Заказчик = СделатьВсеЗамены(СтрТЧ.ЗаказПокупателя.Комментарий); //31.08.2018
						
			Если Найти(врег(СтрТЧ.ЗаказПокупателя.Комментарий), "ПЕРЕМЕЩЕНИЕ ИЗ ЯРОСЛАВЛЯ") = 0 Тогда
				ОбластьМакета.Параметры.Поставщик = "Яршинторг (Шинтрейд)";
			Иначе
				ОбластьМакета.Параметры.Поставщик = "Яршинторг (Ярославль)";
			КонецЕсли;
			ОбластьМакета.Параметры.НомерПортальный = СтрТЧ.ЗаказПокупателя.НомерВходящегоДокумента;
			ТабДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабДокумент.Вывести(ОбластьМакета);
			
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ЗаказПокупателя", СтрТЧ.ЗаказПокупателя);
			
			Запрос.Текст = "ВЫБРАТЬ
			|	ЗаказПокупателяТовары.НомерСтроки,
			|	ЗаказПокупателяТовары.Номенклатура.Код КАК Код,
			|	ЗаказПокупателяТовары.Номенклатура,
			|	ЗаказПокупателяТовары.Количество,
			|	ЗаказПокупателяТовары.Цена
			|ИЗ
			|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
			|ГДЕ
			|	ЗаказПокупателяТовары.Ссылка = &ЗаказПокупателя";
			
			Результат = Запрос.Выполнить().Выбрать();
			
			Пока Результат.Следующий() Цикл
				ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
				ОбластьСтрока.Параметры.НомерСтроки = Результат.НомерСтроки;
				ОбластьСтрока.Параметры.Код = Результат.Код;
				ОбластьСтрока.Параметры.Наименование = Результат.Номенклатура.НаименованиеПолное;
				ОбластьСтрока.Параметры.Количество = Результат.Количество;
				ОбластьСтрока.Параметры.Цена = Результат.Цена;
				ТабДокумент.Вывести(ОбластьСтрока);
			КонецЦикла;
			
			ОбластьИтого=Макет.ПолучитьОбласть("Подвал");
			ОбластьИтого.Параметры.КоличествоИтого=СтрТЧ.ЗаказПокупателя.Товары.Итог("Количество");
			ТабДокумент.Вывести(ОбластьИтого);
			
			ОбластьИтого=Макет.ПолучитьОбласть("ОбластьДата");
			ОбластьИтого.Параметры.Дата=ТекущаяДата();
			ТабДокумент.Вывести(ОбластьИтого);
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла;
		
	Иначе
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Номер = СсылкаНаОбъект.Номер;
		
		ОбластьМакета.Параметры.Заказчик = СделатьВсеЗамены(СсылкаНаОбъект.Комментарий); //31.08.2018
		
		Если Найти(врег(СсылкаНаОбъект.Комментарий), "ПЕРЕМЕЩЕНИЕ ИЗ ЯРОСЛАВЛЯ") = 0 Тогда
			ОбластьМакета.Параметры.Поставщик = "Яршинторг (Шинтрейд)";
		Иначе
			ОбластьМакета.Параметры.Поставщик = "Яршинторг (Ярославль)";
		КонецЕсли;
		ОбластьМакета.Параметры.НомерПортальный = СсылкаНаОбъект.НомерВходящегоДокумента;
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабДокумент.Вывести(ОбластьМакета);
		
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЗаказПокупателя", СсылкаНаОбъект);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаказПокупателяТовары.НомерСтроки,
		|	ЗаказПокупателяТовары.Номенклатура.Код КАК Код,
		|	ЗаказПокупателяТовары.Номенклатура,
		|	ЗаказПокупателяТовары.Количество,
		|	ЗаказПокупателяТовары.Цена
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &ЗаказПокупателя";
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Пока Результат.Следующий() Цикл
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
			ОбластьСтрока.Параметры.НомерСтроки = Результат.НомерСтроки;
			ОбластьСтрока.Параметры.Код = Результат.Код;
			ОбластьСтрока.Параметры.Наименование = Результат.Номенклатура.НаименованиеПолное;
			ОбластьСтрока.Параметры.Количество = Результат.Количество;
			ОбластьСтрока.Параметры.Цена = Результат.Цена;
			ТабДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		ОбластьИтого=Макет.ПолучитьОбласть("Подвал");
		ОбластьИтого.Параметры.КоличествоИтого=СсылкаНаОбъект.Товары.Итог("Количество");
		ТабДокумент.Вывести(ОбластьИтого);
		
		ОбластьИтого=Макет.ПолучитьОбласть("ОбластьДата");
		ОбластьИтого.Параметры.Дата=ТекущаяДата();
		ТабДокумент.Вывести(ОбластьИтого);
		
	КонецЕсли;
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.АвтоМасштаб = Истина;
	
	
	Возврат ТабДокумент;

КонецФункции // ПечатьСчетаЗаказа()
 
// общая процедура печати
Функция Печать() Экспорт
	
	ТабДокумент = неопределено;
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) тогда
		#Если Клиент тогда
			Предупреждение("Не выбран документ!", 30);		
		#КонецЕсли
	КонецЕсли;
	
	ТабДокумент = ПечатьЗаказаПокупателя();
	
	Возврат ТабДокумент;
		
КонецФункции

