Функция ПолучитьДанные()
	
	ТекстДанные = "";
	
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//			   |	ЗаказПокупателя.Город.Наименование КАК Город,
	//			   |	ЗаказПокупателя.АдресДПД КАК Город
	//			   |ИЗ
	//			   |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	//			   |ГДЕ
	//			   |	ЗаказПокупателя.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	//			   |	//УсловиеСтатус
	//			   |
	//			   |УПОРЯДОЧИТЬ ПО
	//			   |	Город
	//			   |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 800
	               |	ЗаказПокупателяРеквизитыЗаказаТК.Ссылка КАК ЗаказПокупателя,
	               |	ЗаказПокупателяРеквизитыЗаказаТК1.Значение КАК АдресКладрСтр
	               |ИЗ
	               |	Документ.ЗаказПокупателя.РеквизитыЗаказаТК КАК ЗаказПокупателяРеквизитыЗаказаТК
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.РеквизитыЗаказаТК КАК ЗаказПокупателяРеквизитыЗаказаТК1
	               |		ПО ЗаказПокупателяРеквизитыЗаказаТК.Ссылка = ЗаказПокупателяРеквизитыЗаказаТК1.Ссылка
	               |ГДЕ
	               |	ЗаказПокупателяРеквизитыЗаказаТК.Поле = ""City""
	               |	И ЗаказПокупателяРеквизитыЗаказаТК.Значение ПОДОБНО &Город
	               |	И ЗаказПокупателяРеквизитыЗаказаТК.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК
	               |	И ЗаказПокупателяРеквизитыЗаказаТК.Ссылка.ДоговорКонтрагента.ОтветственноеЛицо.НаправлениеПродаж = &НаправлениеПродажКолесаТут
	               |	И ЗаказПокупателяРеквизитыЗаказаТК1.Поле = ""Адрес покупателя""
	               |	И (ВЫРАЗИТЬ(ЗаказПокупателяРеквизитыЗаказаТК1.Значение КАК СТРОКА(200))) <> """"
	               |АВТОУПОРЯДОЧИВАНИЕ";

				   

	Запрос.УстановитьПараметр("ДатаН", НачПериода);
	Запрос.УстановитьПараметр("ДатаК", КонецДня(КонПериода));
	Запрос.УстановитьПараметр("НаправлениеПродажКолесаТут", Справочники.НаправленияПродаж.НайтиПоКоду("16"));
	Запрос.УстановитьПараметр("Город", "%"+Город+"%");
	рез = Запрос.Выполнить();			   
	Выборка = рез.Выбрать();
	тз= Рез.Выгрузить();
	//тз.выбратьСтроку();
	ЭтаФорма.Заголовок="Количество найденных объектов: " + Строка(Выборка.Количество());
	
	Пока Выборка.Следующий() Цикл
		
		//Адрес = Выборка.Город;
		Адрес = СокрЛП(Выборка.АдресКладрСтр);
		Адрес = СтрЗаменить(Адрес, "Москва, Москва","Москва");
		АдресДляЯндексКарт = "Россия " + Адрес;
		ТекстДанные = ТекстДанные + ".add(ymaps.geocode('" + АдресДляЯндексКарт + "'))" + Символы.ПС;

	КонецЦикла;	
	
	Возврат ТекстДанные;
	
КонецФункции

Функция ПолучитьHTMLМакет()
	
	ТекстСкрипта = ПолучитьМакет("МакетКластеризация").ПолучитьТекст();
	//ТекстСкрипта = Обработка.ПолучитьМакет("МакетКластеризация").ПолучитьТекст();
		
	Возврат ТекстСкрипта;
	
КонецФункции

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры


Процедура ОсновныеДействияФормыОсновныеДействияФормыСформировать(Кнопка)
	НовыйТекст = ПолучитьHTMLМакет();
	
	НовыйТекст = СтрЗаменить(НовыйТекст, "&AdressData&", ПолучитьДанные());
	
	ИмяВрем = ПолучитьИмяВременногоФайла("html");
	
	Файл = Новый ЗаписьТекста(ИмяВрем);
	Файл.ЗаписатьСтроку(НовыйТекст);
	Файл.Закрыть();

	ЗапуститьПриложение(ИмяВрем);
	
	//ЭлементыФормы.Карта.УстановитьТекст(НовыйТекст);

КонецПроцедуры

