
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Для  каждого стр из СтатьиЗатрат Цикл
		Объект = Стр.статьяЗатрат.ПолучитьОбъект();
		Объект.ПланируетОтветственный = стр.ПланируетОтветсвенныйФ;
		Объект.ПланируетРуководитель = стр.ПланируетРуководительФ;
		объект.Записать();
	конецЦикла;	
	КонецПроцедуры

Процедура ОсновныеДействияФормыЗаполнить(Кнопка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиЗатрат.Ссылка КАК СтатьяЗатрат,
		|	СтатьиЗатрат.ПланируетОтветственный,
		|	СтатьиЗатрат.ПланируетРуководитель,
		|	ЛОЖЬ КАК ПланируетОтветсвенныйФ,
		|	ЛОЖЬ КАК ПланируетРуководительФ
		|ИЗ
		|	Справочник.СтатьиЗатрат КАК СтатьиЗатрат
		|ГДЕ
		|	СтатьиЗатрат.Ответственный = &Ответственный";

	Запрос.УстановитьПараметр("Ответственный", Ответственный);

	СтатьиЗатрат = Запрос.Выполнить().Выгрузить();

КонецПроцедуры

Процедура ПриОткрытии()
	Ответственный = ГлТекущийПользователь;
	Если глТекущийпользователь=Справочники.Пользователи.НайтиПоКоду("Алексеева А.Е.") тогда
	ЭлементыФормы.Ответственный.Доступность = Истина;
	конецЕсли;
		
КонецПроцедуры

Процедура СтатьиЗатратПриПолученииДанных(Элемент, ОформленияСтрок)
	Для каждого стр  из  Оформлениястрок Цикл
		если стр.ДанныеСтроки.ПланируетОтветственный =истина  тогда
			стр.ДанныеСтроки.ПланируетОтветсвенныйФ = Истина;
		конецЕсли;	
		если стр.ДанныеСтроки.ПланируетРуководитель=Истина тогда
			стр.ДанныеСтроки.ПланируетРуководительФ = Истина;
		конецЕсли;	
	конецЦикла;	

КонецПроцедуры
