
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если  СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код) = "Пелевин С.В."  Или 
		СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код) = "Щербаков А.И."   Или
				
		СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код) = "Адиянов А."    Тогда 
		Отказ = Ложь;
	Иначе 
		Отказ = Истина;
	КонецЕсли;	
		

КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры
