
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.УчетДенежныхСредствВПодотчетеУВодителей.Записывать = Истина;
	Движения.УчетДенежныхСредствВПодотчетеУВодителей.Очистить();
	Движение = Движения.УчетДенежныхСредствВПодотчетеУВодителей.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Заказ = Заказ;
	Движение.Реализация = Реализация;
	Движение.ЗаданиеНаОтгрузку = ЗаданиеНаОтгрузку;
	Движение.Сумма = Сумма;
	Движение.СуммаТранспорт = СуммаТранспорт;
	Движение.СуммаПредыдущийДолг = СуммаПредыдущийДолг;
КонецПроцедуры
