
Процедура ДействияФормыОтчетСформировать(Кнопка)
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	ТабДок = ЭлементыФормы.ПолеТабличногоДокумента;
	Отчет(ТабДок);

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА
КонецПроцедуры

Процедура Отчет(ТабДок) Экспорт
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Макет = ВнешнийОтчетОбъект.ПолучитьМакет("Отчет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СпособыРаспределенияСтатейЗатратСрезПоследних.СтатьяЗатрат,
	|	СпособыРаспределенияСтатейЗатратСрезПоследних.Подразделение,
	|	СпособыРаспределенияСтатейЗатратСрезПоследних.КоэффициентыРаспределенияЗатрат
	|ПОМЕСТИТЬ ВТ_СпособыРаспределения
	|ИЗ
	|	РегистрСведений.СпособыРаспределенияСтатейЗатрат.СрезПоследних(&НачДата, (НЕ НеРаспределять)) КАК СпособыРаспределенияСтатейЗатратСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗатратыОбороты.Подразделение КАК Подразделение,
	|	ЗатратыОбороты.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ_СпособыРаспределения.КоэффициентыРаспределенияЗатрат КАК КоэффициентыРаспределенияЗатрат,
	|	ЗатратыОбороты.СуммаОборот КАК СуммаОборот
	|ПОМЕСТИТЬ ВТ_Затраты
	|ИЗ
	|	РегистрНакопления.Затраты.Обороты(&НачДата, &КонДата, , Подразделение В ИЕРАРХИИ (&Аренда)) КАК ЗатратыОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпособыРаспределения КАК ВТ_СпособыРаспределения
	|		ПО ЗатратыОбороты.Подразделение = ВТ_СпособыРаспределения.Подразделение
	|			И ЗатратыОбороты.СтатьяЗатрат = ВТ_СпособыРаспределения.СтатьяЗатрат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КоэффициентыРаспределенияЗатрат.Контрагент,
	|	КоэффициентыРаспределенияЗатрат.Ссылка КАК КоэффициентРаспределенияЗатрат,
	|	КоэффициентыРаспределенияЗатрат.Коэффициент,
	|	ИтогиПоКоэффициентам.СуммовойКоэффициент,
	|	ВЫРАЗИТЬ(КоэффициентыРаспределенияЗатрат.Коэффициент / ИтогиПоКоэффициентам.СуммовойКоэффициент КАК ЧИСЛО(15, 2)) КАК Доля
	|ПОМЕСТИТЬ ВТ_Коэффициенты
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(КоэффициентыРаспределенияЗатратКоэффиценты.Коэффициент) КАК Коэффициент,
	|		КоэффициентыРаспределенияЗатратКоэффиценты.Контрагент КАК Контрагент,
	|		КоэффициентыРаспределенияЗатратКоэффиценты.Ссылка КАК Ссылка
	|	ИЗ
	|		Справочник.КоэффициентыРаспределенияЗатрат.Коэффиценты КАК КоэффициентыРаспределенияЗатратКоэффиценты
	|	
	|	СГРУППИРОВАТЬ ПО
	|		КоэффициентыРаспределенияЗатратКоэффиценты.Ссылка,
	|		КоэффициентыРаспределенияЗатратКоэффиценты.Контрагент) КАК КоэффициентыРаспределенияЗатрат
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(КоэффициентыРаспределенияЗатратКоэффиценты.Коэффициент) КАК СуммовойКоэффициент,
	|			КоэффициентыРаспределенияЗатратКоэффиценты.Ссылка КАК КоэффициентРаспределенияЗатрат
	|		ИЗ
	|			Справочник.КоэффициентыРаспределенияЗатрат.Коэффиценты КАК КоэффициентыРаспределенияЗатратКоэффиценты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			КоэффициентыРаспределенияЗатратКоэффиценты.Ссылка) КАК ИтогиПоКоэффициентам
	|		ПО КоэффициентыРаспределенияЗатрат.Ссылка = ИтогиПоКоэффициентам.КоэффициентРаспределенияЗатрат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Затраты.Подразделение,
	|	ВТ_КОЭФФИЦИЕНТЫ.Контрагент,
	|	ВТ_Затраты.СтатьяЗатрат,
	|	ВТ_Затраты.СуммаОборот КАК СуммаОборот,
	|	ВТ_КОЭФФИЦИЕНТЫ.Доля,
	|	ВЫРАЗИТЬ(ВТ_Затраты.СуммаОборот * ВТ_КОЭФФИЦИЕНТЫ.Доля КАК ЧИСЛО(15, 0)) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ЗАТРАТЫ_Распределенные1
	|ИЗ
	|	ВТ_Затраты КАК ВТ_Затраты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Коэффициенты КАК ВТ_КОЭФФИЦИЕНТЫ
	|		ПО ВТ_Затраты.КоэффициентыРаспределенияЗатрат = ВТ_КОЭФФИЦИЕНТЫ.КоэффициентРаспределенияЗатрат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗАТРАТЫ_Распределенные1.Подразделение,
	|	ВТ_ЗАТРАТЫ_Распределенные1.Контрагент,
	|	СУММА(ВТ_ЗАТРАТЫ_Распределенные1.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ЗАТРАТЫ_Распределенные
	|ИЗ
	|	ВТ_ЗАТРАТЫ_Распределенные1 КАК ВТ_ЗАТРАТЫ_Распределенные1
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЗАТРАТЫ_Распределенные1.Подразделение,
	|	ВТ_ЗАТРАТЫ_Распределенные1.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПродажиОбороты.Подразделение, ВТ_ЗАТРАТЫ_Распределенные.Подразделение) КАК Подразделение,
	|	ЕСТЬNULL(ПродажиОбороты.Контрагент, ВТ_ЗАТРАТЫ_Распределенные.Контрагент) КАК Контрагент,
	|	ПродажиОбороты.СтоимостьОборот КАК СуммаДоход,
	|	ВТ_ЗАТРАТЫ_Распределенные.Сумма КАК СуммаЗатраты,
	|	ЕСТЬNULL(ПродажиОбороты.СтоимостьОборот, 0) - ЕСТЬNULL(ВТ_ЗАТРАТЫ_Распределенные.Сумма, 0) КАК Прибыль
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПродажиОбороты.Подразделение КАК Подразделение,
	|		ПродажиОбороты.ДоговорКонтрагента.Владелец КАК Контрагент,
	|		СУММА(ПродажиОбороты.СтоимостьОборот) КАК СтоимостьОборот
	|	ИЗ
	|		РегистрНакопления.Продажи.Обороты(&НачДата, &КонДата, , Подразделение В ИЕРАРХИИ (&Аренда)) КАК ПродажиОбороты
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПродажиОбороты.Подразделение,
	|		ПродажиОбороты.ДоговорКонтрагента.Владелец) КАК ПродажиОбороты
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ЗАТРАТЫ_Распределенные КАК ВТ_ЗАТРАТЫ_Распределенные
	|		ПО ПродажиОбороты.Подразделение = ВТ_ЗАТРАТЫ_Распределенные.Подразделение
	|			И ПродажиОбороты.Контрагент = ВТ_ЗАТРАТЫ_Распределенные.Контрагент
	|ИТОГИ
	|	СУММА(СуммаДоход),
	|	СУММА(СуммаЗатраты),
	|	СУММА(Прибыль)
	|ПО
	|	ОБЩИЕ,
	|	Подразделение";

	Запрос.УстановитьПараметр("Аренда", Справочники.Подразделения.Аренда);
	Запрос.УстановитьПараметр("КонДата", КонецДня(КонПериода));
	Запрос.УстановитьПараметр("НачДата", НачПериода);

	Результат = Запрос.Выполнить();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ПредставлениеПериода=ПредставлениеПериода(НачПериода ,КонецДня(КонПериода),"ФП=Истина");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьПодразделение = Макет.ПолучитьОбласть("Подразделение");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ВыборкаОбщийИтог.Следующий();		// Общий итог
	ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
	ТабДок.Вывести(ОбластьОбщийИтог, ВыборкаОбщийИтог.Уровень());

	ВыборкаПодразделение = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаПодразделение.Следующий() Цикл
		ОбластьПодразделение.Параметры.Заполнить(ВыборкаПодразделение);
		ТабДок.Вывести(ОбластьПодразделение, ВыборкаПодразделение.Уровень());

		ВыборкаДетали = ВыборкаПодразделение.Выбрать();

		Пока ВыборкаДетали.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетали.Уровень());
		КонецЦикла;
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры
