
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок = "Прочитать табличный документ из файла";
	ДиалогВыбораФайла.Фильтр    = "Лист Excel (*.xls)|*.xls";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		//		ТабличныйДокумент = ЭлементыФормы.ТабличныйДокумент;
		ФайлНаДиске = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
		Если нРег(ФайлНаДиске.Расширение) = ".xls" Тогда
			мПрочитатьТабличныйДокументИзExcel(ДиалогВыбораФайла.ПолноеИмяФайла,1);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция мПрочитатьТабличныйДокументИзExcel( ИмяФайла, НомерЛистаExcel = 1) Экспорт
	
	СвойствоЦвет                  = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90166");
	
	xlLastCell = 11;
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		Сообщить("Файл не существует!");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист = Excel.Sheets(1);
	Исключение
		Сообщить("Ошибка. Возможно неверно указан номер листа книги Excel.");
		Возврат ложь;
		
	КонецПопытки;	
	
	ActiveCell = Excel.ActiveCell.SpecialCells(xlLastCell);
	RowCount = ActiveCell.Row;
	
	ColumnCount = ActiveCell.Column;
	
	Сообщить("Найдено "+строка(RowCount)+" строк и "+строка(ColumnCount)+" столбцов");
		
	сообщить("Начало ----------"+строка(ТекущаяДата())+"---------" );
	
	Для Row = НомерПервойСтроки По RowCount Цикл
		
		ОбработкаПрерыванияПользователя();
		
		Состояние("Идет загрузка из Excel: "+строка(Row)+" / "+строка(RowCount)+" ("+строка(окр(Row*100/RowCount,1))+"%)");
		
		Если СокрЛП(ExcelЛист.Cells(Row,Код).Value)<>"" Тогда
			
			//		A<NZ> B<SH269> D<5.5>xC<13>/E<4>xF<98> ETG<35> DH<58.6> I<MBF>
			//      A<ALCASTA> B<M01> D<6>xC<14>/E<5>xF<100> ETG<38> DH<57.1> I<GMF>
			//		A<CATWILD> B<M01> D<6>xC<14>/E<5>xF<100> ETG<38> DH<57.1> I<GMF>			
			//		A<NZ> B<SH269> D<5.5>xC<13>/E<4>xF<98> ETG<35> DH<58.6> I<MBF>
			
			СтрокаКод					 = СокрЛП(Формат(ExcelЛист.Cells(Row,Код).Value, "ЧГ=0"));
			СтрокаМодель				 = СокрЛП(строка(ExcelЛист.Cells(Row,Модель).Value));  //модель
			СтрокаДиаметр				 = Строка(ExcelЛист.Cells(Row,Диаметр).Value);   
			СтрокаДиаметр				 = стрЗаменить(СтрокаДиаметр,",",".");
			СтрокаШирина				 = Строка(ExcelЛист.Cells(Row,ШиринаД).Value);
			СтрокаШирина				 = стрЗаменить(СтрокаШирина,",",".");
			СтрокаКоличествоОтверстий	 = Строка(ExcelЛист.Cells(Row,КоличествоОтверстий).Value); 
			СтрокаКоличествоОтверстий	 = стрЗаменить(СтрокаКоличествоОтверстий,",",".");
			СтрокаPCD					 = Строка(ExcelЛист.Cells(Row,PCD).Value);
			СтрокаPCD					 = стрЗаменить(СтрокаPCD,",",".");
			СтрокаВылет					 = Строка(ExcelЛист.Cells(Row,Вылет).Value);
			СтрокаВылет					 = стрЗаменить(СтрокаВылет,",",".");
			СтрокаСтупица				 = Строка(Окр(ExcelЛист.Cells(Row,Ступица).Value,2));  
			СтрокаСтупица				 = стрЗаменить(СтрокаСтупица,",",".");
			СтрокаЦвет					 = Строка(ExcelЛист.Cells(Row,Цвет).Value);   //цвет
			
			Ном =  Справочники.Номенклатура.НайтиПоКоду(СтрокаКод);
			
			Если Ном <> Справочники.Номенклатура.ПустаяСсылка() тогда
				
				//Сравниваем все параметры прайса с реквизитами в 1С
				
				ЕстьОшибка = Ложь;
				Модель1С = СтрЗаменить(Ном.Модель.Наименование, "_", "");
				Если НЕ Врег(Модель1С) = Врег(СтрокаМодель) Тогда
					Сообщить(СтрокаКод + " В строке " + Строка(Row) + " не совпадает модель");
					Сообщить(Модель1С + " // " + СтрокаМодель);
					ЕстьОшибка = Истина;
				КонецЕсли;
				Если НЕ Ном.Типоразмер.Диаметр = СтрокаДиаметр Тогда
					Сообщить(СтрокаКод + " В строке " + Строка(Row) + " не совпадает диаметр");
					Сообщить(Ном.Типоразмер.Диаметр + " // " + СтрокаДиаметр);
					ЕстьОшибка = Истина;
				КонецЕсли;
				Если НЕ Ном.Типоразмер.Ширина = СтрокаШирина Тогда
					Сообщить(СтрокаКод + " В строке " + Строка(Row) + " не совпадает ширина");
					Сообщить(Ном.Типоразмер.Ширина + " // " + СтрокаШирина);
					ЕстьОшибка = Истина;
				КонецЕсли;
				Если НЕ Ном.Типоразмер.КоличествоОтверстий = СтрокаКоличествоОтверстий Тогда
					Сообщить(СтрокаКод + " В строке " + Строка(Row) + " не совпадает количество отверстий");
					Сообщить(Ном.Типоразмер.КоличествоОтверстий + " // " + СтрокаКоличествоОтверстий);
					ЕстьОшибка = Истина;
				КонецЕсли;
				Если НЕ Ном.Типоразмер.PCD = СтрокаPCD Тогда
					Сообщить(СтрокаКод + " В строке " + Строка(Row) + " не совпадает PCD");
					Сообщить(Ном.Типоразмер.PCD + " // " + СтрокаPCD);
					ЕстьОшибка = Истина;
				КонецЕсли;
				Если НЕ Ном.Типоразмер.Вылет = СтрокаВылет Тогда
					Сообщить(СтрокаКод + " В строке " + Строка(Row) + " не совпадает вылет");
					Сообщить(Ном.Типоразмер.Вылет + " // " + СтрокаВылет);
					ЕстьОшибка = Истина;
				КонецЕсли;
				Если НЕ Ном.Типоразмер.ДиаметрСтупицы = СтрокаСтупица Тогда
					Сообщить(СтрокаКод + " В строке " + Строка(Row) + " не совпадает ступица");
					Сообщить(Ном.Типоразмер.ДиаметрСтупицы + " // " + СтрокаСтупица);
					ЕстьОшибка = Истина;
				КонецЕсли;
								
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Объект", Ном);
				Запрос.УстановитьПараметр("Свойство", СвойствоЦвет);
				Запрос.Текст = "ВЫБРАТЬ
				         |	ЗначенияСвойствОбъектов.Значение
				         |ИЗ
				         |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
				         |ГДЕ
				         |	ЗначенияСвойствОбъектов.Объект = &Объект
				         |	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
				Результат = Запрос.Выполнить().Выбрать();
				Если Результат.Следующий() Тогда
					Если НЕ Результат.Значение = СтрокаЦвет Тогда
						Сообщить(СтрокаКод + " В строке " + Строка(Row) + " не совпадает цвет");
						Сообщить(Результат.Значение + " // " + СтрокаЦвет);
						ЕстьОшибка = Истина;
					КонецЕсли;
				КонецЕсли;				
				
				Если ЕстьОшибка Тогда
					Сообщить(Символы.ПС);
				КонецЕсли;
				
			Иначе
				
				Сообщить("Не найдена номенклатура " + СтрокаКод + " строка " + Строка(Row));
				
			Конецесли;
						
		КонецЕсли;
		
	КонецЦикла;
	
	Excel.WorkBooks.Close();
	Excel = 0;
	сообщить("Конец--------"+строка(ТекущаяДата())+"-------" );	
	Возврат Истина;
	
КонецФункции // ()
