
Процедура ПолеТабличногоДокумента1ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка)=Тип("Структура") Тогда
		Если Расшифровка.Свойство("ИмяРегистра") и Расшифровка.Свойство("Номенклатура") Тогда
			СтандартнаяОбработка = Ложь;
			ТекНом = Расшифровка.Номенклатура;
			ТекОтчет = Отчеты.ОтчетОстаткиИОбороты.Создать();
			ТекОтчет.ИмяРегистра = Расшифровка.ИмяРегистра;
			ТекОтчет.ЗаполнитьНачальныеНастройки();
			ТекОтчет.РаскрашиватьИзмерения = Истина;
			ТекОтчет.ВыводитьИтогиПоВсемУровням = Истина;
			ТекОтчет.ВыводитьПоказателиВСтроку = Истина;
			ТекОтчет.ПостроительОтчета.Отбор.Номенклатура.ВидСравнения = ВидСравнения.Равно;
			ТекОтчет.ПостроительОтчета.Отбор.Номенклатура.Значение = ТекНом;
			ТекОтчет.ПостроительОтчета.Отбор.Номенклатура.Использование = Истина;
			ТекОтчетФормаОтчета = ТекОтчет.ПолучитьОсновнуюФорму();
			ТекОтчетФормаОтчета.ТолькоПросмотр = Истина;
			//ТекОтчетФормаОтчета.ЭлементыФормы.КоманднаяПанельФормы.Доступность = Ложь;
			ТекОтчетФормаОтчета.Открыть();
			ТекОтчетФормаОтчета.ЭлементыФормы.ДатаНач.Значение = ТекущаяДата();
			ТекОтчетФормаОтчета.ЭлементыФормы.ДатаКон.Значение = ТекущаяДата();		
			ТекОтчетФормаОтчета.ОбновитьОтчет();
			
		КонецЕсли;	
     КонецЕсли;
	
КонецПроцедуры
