
Процедура ДействияФормыОтчетСформировать(Кнопка)
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	ТабДок = ЭлементыФормы.ПолеТабличногоДокумента;
	Отчет(ТабДок);

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА
КонецПроцедуры

Процедура Отчет(ТабДок) Экспорт
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Макет = ПолучитьМакет("Отчет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ОтветственноеЛицо.ОсновноеПодразделение КАК ОтветственноеЛицоОсновноеПодразделение,
	|	ДоговорыКонтрагентов.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ДоговорыКонтрагентов.Владелец КАК Владелец,
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ОтветственноеЛицо <> &ПустаяСсылка
	|	И (НЕ ДоговорыКонтрагентов.Владелец.ПометкаУдаления)
	|	И ДоговорыКонтрагентов.ОтветственноеЛицо.Заблокирован 	
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорыКонтрагентов.ОтветственноеЛицо.Наименование,
	|	ДоговорыКонтрагентов.Владелец.Наименование
	|ИТОГИ ПО
	|	ОтветственноеЛицоОсновноеПодразделение,
	|	ОтветственноеЛицо,
	|	Владелец";

	Запрос.УстановитьПараметр("ПустаяСсылка", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());

	Результат = Запрос.Выполнить();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьОтветственноеЛицоОсновноеПодразделение = Макет.ПолучитьОбласть("ОтветственноеЛицоОсновноеПодразделение");
	ОбластьОтветственноеЛицо = Макет.ПолучитьОбласть("ОтветственноеЛицо");
	ОбластьВладелец = Макет.ПолучитьОбласть("Владелец");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаОтветственноеЛицоОсновноеПодразделение = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаОтветственноеЛицоОсновноеПодразделение.Следующий() Цикл
		ОбластьОтветственноеЛицоОсновноеПодразделение.Параметры.Заполнить(ВыборкаОтветственноеЛицоОсновноеПодразделение);
		ТабДок.Вывести(ОбластьОтветственноеЛицоОсновноеПодразделение, ВыборкаОтветственноеЛицоОсновноеПодразделение.Уровень());

		ВыборкаОтветственноеЛицо = ВыборкаОтветственноеЛицоОсновноеПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаОтветственноеЛицо.Следующий() Цикл
			ОбластьОтветственноеЛицо.Параметры.Заполнить(ВыборкаОтветственноеЛицо);
			ТабДок.Вывести(ОбластьОтветственноеЛицо, ВыборкаОтветственноеЛицо.Уровень());

			ВыборкаВладелец = ВыборкаОтветственноеЛицо.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

			Пока ВыборкаВладелец.Следующий() Цикл
				ОбластьВладелец.Параметры.Заполнить(ВыборкаВладелец);
				ТабДок.Вывести(ОбластьВладелец, ВыборкаВладелец.Уровень());

				ВыборкаДетали = ВыборкаВладелец.Выбрать();

				Пока ВыборкаДетали.Следующий() Цикл
					ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
					ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетали.Уровень());
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ
КонецПроцедуры
