
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриОткрытии()
	
	
		
		запрос = новый Запрос;
		запрос.УстановитьПараметр("Пользователь",глТекущийПользователь);
		запрос.Текст ="ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ОсновнойМенеджерПоставщика = &Пользователь";
		рез = Запрос.Выполнить().Выгрузить();
		
		Список = Новый СписокЗначений;
		
		Массив = рез.ВыгрузитьКолонку("Ссылка");
		
		Список.ЗагрузитьЗначения(Массив);
		
		Поставщики.Отбор.ОТХ.ВидСравнения  = ВидСравнения.Равно;
		Поставщики.Отбор.ОТХ.Использование = Истина;
		Поставщики.Отбор.ОТХ.Значение      = ложь;
		
		//если Не РольДоступна("ПравоЗавершенияРаботыПользователей") Тогда
		//	
		//	Поставщики.Отбор.Поставщик.ВидСравнения  = ВидСравнения.ВСписке;
		//	Поставщики.Отбор.Поставщик.Использование = Истина;
		//	Поставщики.Отбор.Поставщик.Значение      = Список;
		//	
		//	ЭлементыФормы.Поставщики.НастройкаОтбора.Поставщик.Доступность = Ложь;
		//	
		//КонецЕсли;

	
КонецПроцедуры

Процедура Кнопка1Нажатие(Элемент)
	
	Поставщик = ЭлементыФормы.Поставщики.ТекущиеДанные.Поставщик;
	
	яштПоставщики.ПроверитьОткрытьФайлПоставщика(Поставщик);
		
КонецПроцедуры

Процедура Кнопка3Нажатие(Элемент)
	Поставщик = ЭлементыФормы.Поставщики.ТекущиеДанные.Поставщик;
	
	яштПоставщики.ПроверитьНоменклатуруФайлПоставщика(Поставщик);
КонецПроцедуры

Процедура Кнопка2Нажатие(Элемент)
	Поставщик = ЭлементыФормы.Поставщики.ТекущиеДанные.Поставщик;
	
	яштПоставщики.ПроверитьЦеныФайлПоставщика(Поставщик);
КонецПроцедуры

Процедура ТабличноеПоле2ЗначениеНачалоВыбора(Элемент, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//
	//СписокТипов = Новый СписокЗначений;
	//
	//СписокТипов.Добавить(Метаданные.Справочники["Производители"].Имя,Метаданные.Справочники["Производители"].Представление());

	//
	//ВыбранныйЭлемент = ЭтаФорма.ВыбратьИзСписка(СписокТипов, Элемент);
	//// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ТабличноеПоле3ЗначениеНачалоВыбора(Элемент, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ПоставщикиПриАктивизацииСтроки(Элемент)
	Производители.Отбор.Контрагент.ВидСравнения  = ВидСравнения.Равно;
		Производители.Отбор.Контрагент.Использование = Истина;
		Производители.Отбор.Контрагент.Значение      = ЭлементыФормы.Поставщики.ТекущиеДанные.Поставщик;
		ЭлементыФормы.Производители.НастройкаОтбора.Контрагент.Доступность = Ложь;

		
		Производители.Отбор.Производитель_Сезон.ВидСравнения  = ВидСравнения.Равно;
		Производители.Отбор.Производитель_Сезон.Использование = Истина;
		Производители.Отбор.Производитель_Сезон.Значение      = Истина;
		ЭлементыФормы.Производители.НастройкаОтбора.Производитель_Сезон.Доступность = Ложь;

		Сезон.Отбор.Контрагент.ВидСравнения  = ВидСравнения.Равно;
		Сезон.Отбор.Контрагент.Использование = Истина;
		Сезон.Отбор.Контрагент.Значение      = ЭлементыФормы.Поставщики.ТекущиеДанные.Поставщик;
		ЭлементыФормы.Сезон.НастройкаОтбора.Контрагент.Доступность = Ложь;

		
		Сезон.Отбор.Производитель_Сезон.ВидСравнения  = ВидСравнения.Равно;
		Сезон.Отбор.Производитель_Сезон.Использование = Истина;
		Сезон.Отбор.Производитель_Сезон.Значение      = Ложь;
		ЭлементыФормы.Сезон.НастройкаОтбора.Производитель_Сезон.Доступность = Ложь;

КонецПроцедуры
