
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = НачПериода;
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = КонецДня(КонПериода);
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПервичныйКонтрагент"));
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90230");
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОбщийСтатус"));
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90218");
	
	Список = Новый СписокЗначений;
	Список.Добавить(Справочники.Контрагенты.НайтиПоКоду("94666")); //Грузополучатели
	Список.Добавить(Справочники.Контрагенты.НайтиПоКоду("90213")); //Дубли
	Список.Добавить(Справочники.Контрагенты.НайтиПоКоду("94223")); //клиентыИМ
	Список.Добавить(Справочники.Контрагенты.НайтиПоКоду("90277")); //Банки

	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокРодитель"));
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение  = Список;
КонецПроцедуры
