////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ПриОткрытии" формы
Процедура ПриОткрытии()
	ЭлементыФормы.ВыводимыйДокумент.СписокВыбора.Добавить("Табличный документ", , , ЭлементыФормы.КартинкаТабличногоДокумента.Картинка);
	ЭлементыФормы.ВыводимыйДокумент.СписокВыбора.Добавить("Текстовый документ", , , ЭлементыФормы.КартинкаТекстовогоДокумента.Картинка);
	ВыводимыйДокументОбработкаВыбора(ЭлементыФормы.ВыводимыйДокумент, 
									 ЭлементыФормы.ВыводимыйДокумент.СписокВыбора[0].Значение, Истина);
КонецПроцедуры // ПриОткрытии()

// Процедура вызывается при нажатии кнопки "ОК"
Процедура КнопкаОКНажатие(Элемент)
	Закрыть(Истина);
КонецПроцедуры // КнопкаОКНажатие()

// Процедура вызывается при нажатии кнопки "Отмена"
Процедура КнопкаОтменаНажатие(Элемент)
	Закрыть(Ложь);
КонецПроцедуры // КнопкаОтменаНажатие()

//Процедура - обработчик собятия "ОбработкаВыбора" поля ввода "ВыводимыйДокумент"
Процедура ВыводимыйДокументОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЭлементСписка = Элемент.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	Элемент.Значение = ЭлементСписка.Значение;
	Элемент.Картинка = ЭлементСписка.Картинка;
КонецПроцедуры // ВыводимыйДокументОбработкаВыбора()

// Процедура вызывается при нажатии кнопок "Установить флажки", "Сбросить флажки"
Процедура КнопкаВклВыклФлажки(Элемент)
	СписокКолонок.ЗаполнитьПометки(Элемент.Имя = "КнопкаВклФлажки");	
КонецПроцедуры // КнопкаВклВыклФлажки()






