
Функция СоздатьСтруктуру()
	Тест = Новый Структура;
	Тест.Вставить("Описание", ЭлементыФормы.ОписаниеТеста.ПолучитьТекст());
	Тест.Вставить("ТекстЗапроса", ЭлементыФормы.Запрос.ПолучитьТекст());
	Тест.Вставить("ПередВыполнениемЗапроса", ЭлементыФормы.ПередВыполнениемЗапроса.ПолучитьТекст());
	Тест.Вставить("ПослеВыполненияЗапроса", ЭлементыФормы.ПослеВыполненияЗапроса.ПолучитьТекст());
	Тест.Вставить("Параметры", Параметры);
	Тест.Вставить("ФормаРедактирования", "Форма_Запроса");
	Возврат Тест;
КонецФункции

Процедура ЗаполнитьИзСтруктуры(СтруктураТеста) Экспорт 
	Если СтруктураТеста.Свойство("Описание") Тогда
		ЭлементыФормы.ОписаниеТеста.УстановитьТекст(СтруктураТеста.Описание);
	КонецЕсли;
	
	Если СтруктураТеста.Свойство("Параметры") Тогда
		Параметры = СтруктураТеста.Параметры;
		Колонка = Параметры.Колонки.Найти("Вычислять");
		Если Колонка = Неопределено Тогда
			Параметры.Колонки.Добавить("Вычислять");
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураТеста.Свойство("ПередВыполнениемЗапроса") Тогда
		ЭлементыФормы.ПередВыполнениемЗапроса.УстановитьТекст(СтруктураТеста.ПередВыполнениемЗапроса);
	КонецЕсли;
	
	Если СтруктураТеста.Свойство("ПослеВыполненияЗапроса") Тогда
		ЭлементыФормы.ПослеВыполненияЗапроса.УстановитьТекст(СтруктураТеста.ПослеВыполненияЗапроса);
	КонецЕсли;
	Если СтруктураТеста.Свойство("ТекстЗапроса") Тогда
		ЭлементыФормы.Запрос.УстановитьТекст(СтруктураТеста.ТекстЗапроса);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПараметрыТипПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ТекСтрока = ЭлементыФормы.Параметры.ТекущиеДанные;
	ТекСтрока.Значение = Элемент.Значение.ПривестиЗначение(ТекСтрока.Значение);
КонецПроцедуры


Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
	СтруктураТеста = СоздатьСтруктуру();
	Если МодальныйРежим Тогда 
		Закрыть(СтруктураТеста);
	Иначе
		СтрокаТеста.Описание = СтруктураТеста.Описание;
		СтрокаТеста.Тест = ЗначениеВСтрокуВнутр(СтруктураТеста);
		Закрыть(СтруктураТеста);
	КонецЕсли;
	
КонецПроцедуры

Процедура КоманднаяПанель1ВыполнитьЗапрос(Кнопка)
	// Вставить содержимое обработчика.
	Попытка
		ГлобальныеПараметры = ТаблицуВСтруктуру(ПараметрыТестов, Новый ТаблицаЗначений, Новый Структура, Неопределено);
		Запрос = Новый Запрос(ЭлементыФормы.Запрос.ПолучитьТекст());
		Для Каждого Параметр Из Параметры Цикл
			Значение = Параметр.Значение;
			Если Параметр.Вычислять Тогда
				Значение = Вычислить(Параметр.Значение);
			КонецЕсли;
			
			Запрос.УстановитьПараметр(Параметр.Имя, Значение);
		КонецЦикла;
		Результат = Запрос.Выполнить().Выгрузить();
		ЭлементыФормы.Результат.СоздатьКолонки();
		ЭлементыФормы.Панель1.ТекущаяСтраница = ЭлементыФормы.Панель1.Страницы.Результат;
	Исключение
		Предупреждение(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

Процедура КоманднаяПанель1ПолучитьПараметры(Кнопка)
	
	ТекстЗапроса = ЭлементыФормы.Запрос.ПолучитьТекст();
	Запрос = Новый Запрос(ТекстЗапроса);
	ОписаниеПараметров = Запрос.НайтиПараметры();
	Для Каждого Параметр Из ОписаниеПараметров Цикл
		Строка = Параметры.Найти(Параметр.Имя, "Имя");
		Если Строка = Неопределено Тогда
			Строка = Параметры.Добавить();
			Строка.Имя = Параметр.Имя;
		КонецЕсли;
		Строка.Тип = Параметр.ТипЗначения;
	КонецЦикла;
КонецПроцедуры


