
Процедура ОткрытьФрм(фрм)
	
	Если фрм.открыта() Тогда 
		фрм.активизировать()
	иначе 	
		фрм.открытьМодально();
	КонецЕсли;
	
КонецПроцедуры	

Процедура HTMLДокументonclick(Элемент, pEvtObj)
	pEvtObj.returnValue = Ложь;
	попытка 
		ТекстСсылки = стрЗаменить(pEvtObj.srcElement.parentElement.document.activeElement.href, "about:", "");
		ТекстСсылки = стрЗаменить(ТекстСсылки, "blank", "");
	исключение 
		Возврат
	конецПопытки;	
	Если найти(ТекстСсылки, "ВАЛЮТА")>0 Тогда 
		гуид = прав(ТекстСсылки, стрДлина(ТекстСсылки)-7);
		СсылкаНаЭлемент = справочники.Валюты.ПолучитьСсылку(Новый УникальныйИдентификатор(гуид));
		Если значениеЗаполнено(ссылкаНаЭлемент) Тогда
			открытьФРМ(СсылкаНаЭлемент.ПолучитьФорму());
		КонецЕсли;
	ИначеЕсли найти(текстСсылки, "СПРАВОЧНИКВАЛЮТ")>0 Тогда 
		ОткрытьФрм(справочники.Валюты.ПолучитьФормуСписка());
	ИначеЕсли найти(текстСсылки, "ОКВ")> 0 Тогда 
		открытьФРМ(Справочники.Валюты.ПолучитьФорму("ФормаПодбораИзКлассификатора"));
	ИначеЕсли найти(Текстссылки, "ЕДИНИЦА")>0 Тогда 
		стрДан = Сред(ТекстСсылки, 9);
		позРазд = Найти(стрДан, ":");
		типСправочника = Лев(стрДан, позРазд - 1);
		гуид = Сред(стрДан, позРазд + 1);
		
		СсылкаНаЭлемент = Вычислить("справочники." + типСправочника + ".ПолучитьСсылку(Новый УникальныйИдентификатор(гуид))");
		Если значениеЗаполнено(ссылкаНаЭлемент) Тогда
			ОткрытьФрм(СсылкаНаЭлемент.ПолучитьФорму());
		КонецЕсли;
	ИначеЕсли найти(текстСсылки, "СПРАВОЧНИКЕДИНИЦ")>0 Тогда 
		ОткрытьФрм(справочники.КлассификаторЕдиницИзмерения.ПолучитьФормуСписка());
	ИначеЕсли найти(текстСсылки, "ОКЕИ")> 0 Тогда 
		открытьФРМ(Справочники.КлассификаторЕдиницИзмерения.ПолучитьФорму("ФормаПодбораИзКлассификатора"));
	ИначеЕсли найти(Текстссылки, "СТРАНА")>0 Тогда 
		гуид = прав(ТекстСсылки, стрДлина(ТекстСсылки)-7);
		СсылкаНаЭлемент = справочники.КлассификаторСтранМира.ПолучитьСсылку(Новый УникальныйИдентификатор(гуид));
		Если значениеЗаполнено(ссылкаНаЭлемент) Тогда
			ОткрытьФрм(СсылкаНаЭлемент.ПолучитьФорму());
		КонецЕсли;
	ИначеЕсли найти(текстСсылки, "СПРАВОЧНИКСТРАН")>0 Тогда 
		ОткрытьФрм(справочники.КлассификаторСтранМира.ПолучитьФормуСписка());
	ИначеЕсли найти(текстСсылки, "ОКСМ")> 0 Тогда 
		
		открытьФРМ(Справочники.КлассификаторСтранМира.ПолучитьФорму("ФормаПодбораИзКлассификатора"));

	ИначеЕсли найти(Текстссылки, "КОНТРАГЕНТ")>0 Тогда 
		гуид = прав(ТекстСсылки, стрДлина(ТекстСсылки)-11);
		СсылкаНаЭлемент = справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(гуид));
		Если значениеЗаполнено(ссылкаНаЭлемент) Тогда
			ОткрытьФрм(СсылкаНаЭлемент.ПолучитьФорму());
		КонецЕсли;
	ИначеЕсли найти(Текстссылки, "ОРГАНИЗАЦИЯ")>0 Тогда 
		гуид = прав(ТекстСсылки, стрДлина(ТекстСсылки)-12);
		СсылкаНаЭлемент = справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(гуид));
		Если значениеЗаполнено(ссылкаНаЭлемент) Тогда
			ОткрытьФрм(СсылкаНаЭлемент.ПолучитьФорму());
		КонецЕсли;
   ИначеЕсли найти(Текстссылки, "СЧЕТФАКТУРАВЫДАННЫЙ")>0 Тогда 
		гуид = прав(ТекстСсылки, стрДлина(ТекстСсылки)-20);
		СсылкаНаЭлемент = Документы.СчетФактураВыданный.ПолучитьСсылку(Новый УникальныйИдентификатор(гуид));
		Если значениеЗаполнено(ссылкаНаЭлемент) Тогда
			ОткрытьФрм(СсылкаНаЭлемент.ПолучитьФорму());
		КонецЕсли;   
	ИначеЕсли найти(ТекстСсылки, "КАРТОЧКА:")>0 Тогда
		СтрокаИД = прав(ТекстСсылки, СтрДлина(ТекстСсылки)-9);
		Если найти(строкаИД, ":")>0 Тогда
			BoxID = лев(строкаИД, найти(строкаИД, ":")-1);
			DocID = прав(строкаИД, стрДлина(СтрокаИД) - найти(строкаИД, ":"));
			
			Док =  Модуль_РаботаССерверомДиадок.ПолучитьДокументДиадок(DocID, BoxId) ;
			ПолучитьМодульПрог("Модуль_Логика_ПоведениеФорм").ОткрытьКарточкуДокументаДД(Док, ЭтаФорма);
		КонецЕсли;
	ИначеЕсли найти(ТекстСсылки, "http")>0 тогда 
		ЗапуститьПриложение(ТекстСсылки);
	КонецЕсли;	
КонецПроцедуры

Процедура ПриОткрытии()
	
	КартинкаЗаголовка = ЭДО_БиблиотекаКартинок().КартинкаЗаголовка;
	Элементыформы.HTMLТекст.УстановитьТекст(HTMLТекст);
	ЭтаФорма.Заголовок = ЗаголовокФормы;
	
	ЭлементыФормы.НастройкаФорматаОтправкиДокументов.Видимость = ЭтоУведомлениеОСменеФормата;
	
КонецПроцедуры

Процедура НастройкаФорматаОтправкиДокументовНажатие(Элемент)
	
	Закрыть();

	ВладелецФормы.ТекущийЭлемент = ВладелецФормы.ЭлементыФормы.ДеревоПочтовыхЯщиков;
	
КонецПроцедуры

