Процедура ЗапомнитьНастройкиДоверенности()
	
	ОдинСАдаптер_НастройкиТекущегоПользователя_УстановитьНастройку("ДиадокДатаДоверенность" , Дата);
	ОдинСАдаптер_НастройкиТекущегоПользователя_УстановитьНастройку("ДиадокНомерДоверенность", СокрЛП(Номер));
	
	ОдинСАдаптер_НастройкиТекущегоПользователя_УстановитьНастройку("ДиадокОрганизацияДоверенностьВыдал", 	ОрганизацияДоверенностьВыдал);
	ОдинСАдаптер_НастройкиТекущегоПользователя_УстановитьНастройку("ДиадокДолжностьДоверенностьВыдал", 		ДолжностьДоверенностьВыдал);
	ОдинСАдаптер_НастройкиТекущегоПользователя_УстановитьНастройку("ДиадокФамилияДоверенностьВыдал", 		ФамилияДоверенностьВыдал);
	ОдинСАдаптер_НастройкиТекущегоПользователя_УстановитьНастройку("ДиадокИмяДоверенностьВыдал", 			ИмяДоверенностьВыдал);
	ОдинСАдаптер_НастройкиТекущегоПользователя_УстановитьНастройку("ДиадокОтчествоДоверенностьВыдал", 		ОтчествоДоверенностьВыдал);
	ОдинСАдаптер_НастройкиТекущегоПользователя_УстановитьНастройку("ДиадокДополнительныеСведенияВыдал", 	ДополнительныеСведенияВыдал);
	
КонецПроцедуры

Процедура ОсновныеДействияФормыОк(Кнопка)
	
	СписокНезаполненныхПолей = "";
	
	Если НЕ ЗначениеЗаполнено(Номер) Тогда
		СписокНезаполненныхПолей=	?(СписокНезаполненныхПолей ="", "", СписокНезаполненныхПолей+", ") + "номер";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		СписокНезаполненныхПолей=	?(СписокНезаполненныхПолей ="", "", СписокНезаполненныхПолей+", ") + "дата";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ФамилияДоверенностьВыдал) Тогда
		СписокНезаполненныхПолей=	?(СписокНезаполненныхПолей ="", "", СписокНезаполненныхПолей+", ") + "фамилия";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяДоверенностьВыдал) Тогда
		СписокНезаполненныхПолей=	?(СписокНезаполненныхПолей ="", "", СписокНезаполненныхПолей+", ") + "имя";
	КонецЕсли;
			
	Если ЗначениеЗаполнено(СписокНезаполненныхПолей) Тогда
		предупреждение(
		?(Найти(СписокНезаполненныхПолей, ",")=0, "Не заполнено обязательное поле:", "Не заполнены обязательные поля:")+"
		|"+СписокНезаполненныхПолей, ,  НаименованиеСистемы);
		Возврат;
	КонецЕсли;
	
	ОрганизацияДоверенностьВыдал=	СокрЛП(ОрганизацияДоверенностьВыдал);
	ДолжностьДоверенностьВыдал=		СокрЛП(ДолжностьДоверенностьВыдал);
	ФамилияДоверенностьВыдал=		СокрЛП(ФамилияДоверенностьВыдал);
	ИмяДоверенностьВыдал=			СокрЛП(ИмяДоверенностьВыдал);
	ОтчествоДоверенностьВыдал=		СокрЛП(ОтчествоДоверенностьВыдал);
	ДополнительныеСведенияВыдал=	СокрЛП(ДополнительныеСведенияВыдал);
	
	ЗапомнитьНастройкиДоверенности();
	
	Закрыть(Истина);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	КартинкаЗаголовка= ЭДО_БиблиотекаКартинок().КартинкаЗаголовка;
	НажатОк=	Ложь;
	
КонецПроцедуры

Процедура НадписьОчиститьНажатие(Элемент)
	
	Номер=	"";
	Дата=	"";
	
	ОрганизацияДоверенностьВыдал=	"";
	ДолжностьДоверенностьВыдал=		"";
	ФамилияДоверенностьВыдал=		"";
	ИмяДоверенностьВыдал=			"";
	ОтчествоДоверенностьВыдал=		"";
	
	ДополнительныеСведенияВыдал=	"";
	
КонецПроцедуры
