
Процедура КнопкаСформироватьНажатие(Кнопка)
	  	 ТабличноеПоле1 = Новый ТаблицаЗначений();
ТекCOMПодключение = Новый COMОбъект("V82.COMConnector");
СтрокаПодключения = "Srvr = ""sigma:2041""; Ref = ""v82ib_formula_ut"";Usr = ""Лапенков"";Pwd = ""wd89Soil""";
ТекCOMОбъект = ТекCOMПодключение.Connect(СтрокаПодключения);

Если ТекCOMОбъект=неопределено тогда  Возврат; КонецЕсли;
			
//ТабДок = ЭлементыФормы.ТабДок;

Запрос =ТекCOMОбъект.newObject("Запрос");
	
	Запрос.УстановитьПараметр("НачДата",НачПериода);
	Запрос.УстановитьПараметр("КонДата",КонецДня(КонПериода));
	Запрос.Текст =
	"ВЫБРАТЬ
	|Событие.НачалоСобытия Дата,
	|ПРЕДСТАВЛЕНИЕ(Событие.ВидОперации.Ссылка) ВидОперации, 
	| Событие.Ссылка.Пост.Наименование Пост,
	|	Событие.Автомобиль.Наименование Автомобиль,
	|	Событие.Автомобиль.Модель.Наименование Модель,
	|	Событие.Автомобиль.ГосНомер ГосНомер,
	|	Событие.Автомобиль.VIN VIN,
	|	Событие.Автомобиль.ГодВыпуска  ГодВыпуска
	|	ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.НачалоСобытия > &НачДата  И НЕ Событие.Автомобиль=ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
	|	И Событие.НачалоСобытия <= &КонДата
	|	УПОРЯДОЧИТЬ ПО   Событие.НачалоСобытия";
//	
      
	
	ТабДок = ЭлементыФормы.ПолеТабличногоДокумента1;
    Макет = ПолучитьМакет("Макет");
   	
    ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
 //   ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщийИтогТранспорт");
 //   ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицыТранспорт");

 //   ОбластьЗаголовок.Параметры.ТипОтчета = " по транспорту за " + ПредставлениеПериода(Начпериода, КонецДня(КонПериода));
 //   
    ТабДок.Очистить();
  //  ТабДок.Вывести(ОбластьЗаголовок);
    ТабДок.Вывести(ОбластьШапка);
	
	Выборка=Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ОбластьДетальные = Макет.ПолучитьОбласть("Детальные");
        ОбластьДетальные.Параметры.Заполнить(Выборка);
		ОбластьДетальные.Параметры.ГодВыпуска = Формат(Выборка.ГодВыпуска,"ДФ=dd.MM.yyyy");
		ТабДок.Вывести(ОбластьДетальные);
//	            Сообщить(Выборка.Дата + " = " + Выборка.Автомобиль); 
	КонецЦикла;

 //   ТабДок.НачатьАвтогруппировкуСтрок();
 //   
 //   Результат = Запрос.Выполнить();
 //   ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
 //   ВыборкаОбщийИтог.Следующий();		// Общий итог

 //   ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
 //   ТабДок.Вывести(ОбластьОбщийИтог, ВыборкаОбщийИтог.Уровень(),,Ложь);
 //
 

КонецПроцедуры

Процедура КнопкаВыбораПериодаНажатие(Элемент)
		НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;

КонецПроцедуры

Процедура ПриОткрытии()
	 НачПериода = НачалоДня(ТекущаяДата());
	 КонПериода = КонецДня(ТекущаяДата()+3*86400);
КонецПроцедуры
