
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения<> Неопределено Тогда
		ДокументОснование = ДанныеЗаполнения;
		Для каждого строка из ДокументОснование.товары Цикл
			Если строка.номенклатура.ВидТовара = Перечисления.ВидыТоваров.Диски тогда
				стр = товары.Добавить();
				стр.Номенклатура = Строка.Номенклатура;
				стр.НомерКонтейнера = ДанныеЗаполнения.Сделка.НомерКонтейнера;
		    конецесли;
		конецЦикла;
	конецЕсли;
	Если Товары.Количество()=0 Тогда
		Сообщить("Создание документа не требуется");
	конецЕсли;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	НаборЗаписей = РегистрыСведений.ПровереннаяНагрузкаДисков.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.документПоставки.Установить(Ссылка);
	наборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	наборЗаписей.Записать();	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	НаборЗаписей = РегистрыСведений.ПровереннаяНагрузкаДисков.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.документПроверки.Установить(Ссылка);
	наборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	наборЗаписей.Записать();	
	Для каждого стр из Товары цикл
		Запись = НаборЗаписей.Добавить();
		Запись.ДокументПроверки = ссылка;
		Запись.Номенклатура = стр.Номенклатура;
		Запись.НомерПартии = стр.НомерПартии;
		Запись.НомерКонтейнера = стр.НомерКонтейнера;
	конецЦикла;
		наборЗаписей.Записать();	

КонецПроцедуры
