Функция Печать() Экспорт
		СоответствиеПоставщиковКодДпд=новый Соответствие; //для ШК Дпд, что бы шк был поменьше
СоответствиеПоставщиковКодДпд.Вставить(Справочники.Контрагенты.ПустаяСсылка(),"1");//Яршинторг - Ярославль
СоответствиеПоставщиковКодДпд.Вставить(Справочники.Контрагенты.НайтиПоКоду("94036  "),"2");//Яршинторг Екб- Екб
СоответствиеПоставщиковКодДпд.Вставить(Справочники.Контрагенты.НайтиПоКоду("93187  "),"3");//Яршинторг Рнд- Рнд
СоответствиеПоставщиковКодДпд.Вставить(Справочники.Контрагенты.НайтиПоКоду("П000835"),  "4");//Яршинторг Спб- Спб
СоответствиеПоставщиковКодДпд.Вставить(Справочники.Контрагенты.НайтиПоКоду("93870  "),  "6");//Яршинторг Мск- Мск

         	ТабНаклеек=новый ТаблицаЗначений;
		ТабНаклеек.Колонки.Добавить("Заказ");	
		ТабНаклеек.Колонки.Добавить("НомерЗаказа");
		ТабНаклеек.Колонки.Добавить("Номенклатура");
		ТабНаклеек.Колонки.Добавить("ШК");
		
		ТабНаклеек.Очистить();








   Если ТипЗнч(ссылкаНаОбъект) = Тип("ДокументСсылка.ЗаданиеНаПеремещение") тогда
	   Для каждого стр из ссылкаНаобъект.Заказыпокупателей Цикл
		   Если стр.ЗаказПокупателя.TerminalОтгрузкаТранспортнойКомпанией Тогда
		   создатьЭтикетки(стр.ЗаказПокупателя,ТабНаклеек);
           конецЕсли;
		   
	   конецЦикла;
   иначе
	   Если ссылкаНаОбъект.TerminalОтгрузкаТранспортнойКомпанией Тогда
       создатьЭтикетки(ссылкаНаОбъект,ТабНаклеек);
	   конецЕсли;
   конецЕсли;
   
   
     	Макет         		= ПолучитьМакет("Макет");
	Наклейка = Макет.ПолучитьОбласть("Наклейка|Наклейка_В");
	//НаклейкаГ = Макет.ПолучитьОбласть("Наклейка|Наклейка_В ");
	Разделитель = Макет.ПолучитьОбласть("Разделитель");
	//Параметры = новый Структура("СтолбцовНапечатано,СтрокНапечатано");
	ТабДокумент   = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПокупателя_Наклейка";
	нпп=0;
	Для каждого стр из  ТабНаклеек цикл
		нпп=нпп+1;
		Наклейка.Параметры.Организация = "ЗАО ТК Яршинторг";
		Наклейка.Параметры.ЗаказНомер = стр.НомерЗаказа;
		//Если ЗначениеЗаполнено(СсылкаНаОбъект.грузоотправитель) Тогда
		//Наклейка.Параметры.поставщик = стр.НомерЗаказа;
		// иначе
		Наклейка.Параметры.поставщик = "ЗАО ТК Яршинторг";
		//конецЕсли;
        табИнфо = стр.Заказ.РеквизитыЗаказаТК.Выгрузить();
	
	    тек =  табинфо.Найти("ContactFio");
		Наклейка.Параметры.Контрагент = тек.значение;

	    тек =  табинфо.Найти("ContactPhone");
		Наклейка.Параметры.телефонКонтрагента = тек.значение;
		
	    тек =  табинфо.Найти("Адрес покупателя");
		Наклейка.Параметры.АдресКуда = тек.значение;
		Наклейка.Параметры.НаправлениеОтгрузки = "Перевозчик DPD";
		Наклейка.Параметры.Номенклатура = стр.номенклатура;
		ОбШтрихКод=Наклейка.Рисунки.ШК.Объект;
		ОбШтрихКод.Сообщение = стр.ШК; 
		ОбШтрихКод.ТекстКода = СокрЛП(стр.ШК);
		
		
		Если нпп%2=0 тогда
			ТабДокумент.Присоединить(Наклейка);
		Иначе
			//ТабДокумент.Вывести(НаклейкаГ);
			ТабДокумент.Вывести(Наклейка);
		КонецЕсли;
		Если нпп%2=0 тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	КонецЦикла;
		
     возврат табДокумент;
конецФункции
	
	
	
	
Процедура создатьЭтикетки(ДокЗаказ,ТабНаклеек)
	     НомерЗаказа = ДокЗаказ.Номер;
	
		
	     МассивОтдельныеПосылки  = Новый ТаблицаЗначений;
		 МассивОтдельныеПосылки.Колонки.Добавить("Номенклатура");
		 МассивОтдельныеПосылки.Колонки.Добавить("Количество");
	     ТабАксы = Новый ТаблицаЗначений;
		 ТабАксы.Колонки.Добавить("Номенклатура");
		 ТабАксы.Колонки.Добавить("Количество");
	     ТабКрепеж = Новый ТаблицаЗНачений;
		 ТабКрепеж.Колонки.Добавить("Номенклатура");
		 ТабКрепеж.Колонки.Добавить("Количество");

		 для каждого стр из ДокЗаказ.Товары Цикл
			 Если стр.номенклатура.видТовара = перечисления.ВидыТоваров.Аксессуары Тогда
				нСтр =  ТабАксы.Добавить();
			иначеЕсли стр.номенклатура.видТовара = перечисления.ВидыТоваров.Прочее Тогда	
				нСтр =  ТабКрепеж.Добавить();
			иначе
				нСтр =  МассивОтдельныеПосылки.Добавить();
			конецЕсли;
			нстр.номенклатура = стр.номенклатура;
			нстр.Количество = Стр.Количество;
	     конецЦикла;
		//массив посылок шины/диски
		Для каждого стр из МассивОтдельныеПосылки Цикл
			кол=1;
			Пока кол<=стр.Количество цикл
				ШК=ВРЕГ("YST"+глТранслит(НомерЗаказа)+"V"+глТранслит(СокрЛП(стр.Номенклатура.Код))+"V"+кол);
				нстр = ТабНаклеек.Добавить();
				нстр.заказ = ДокЗаказ;
				нстр.номерЗаказа = НомерЗаказа;
				нстр.Номенклатура     =стр.Номенклатура.Наименование; 
				Нстр.шк = ШК;
				кол=кол+1;
			КонецЦикла
		КонецЦикла;
		
		
		Аксы="";
		Для каждого стр из ТабАксы Цикл
			//ЗаполнитьЗначенияСвойств(нстр,стр);
			ШК=ВРЕГ("YST"+глТранслит(НомерЗаказа)+"V"+(СокрЛП("AKS"))+"V"+1);
			Аксы=Аксы+СокрЛП(стр.Номенклатура)+" "+стр.Количество+"шт."+Символы.ПС;
		КонецЦикла;
		Если ТабАксы.Количество()>0 тогда
			нстр=табНаклеек.Добавить();
			нстр.заказ = ДокЗаказ;
			нстр.номерЗаказа = НомерЗаказа;
			нстр.Номенклатура = Аксы;
			нстр.ШК=ШК;
		КонецЕсли;
		
		Крепеж="";
		Для каждого стр из ТабКрепеж Цикл
			//ЗаполнитьЗначенияСвойств(нстр,стр);
			ШК=ВРЕГ("YST"+глТранслит(НомерЗаказа)+"V"+(СокрЛП("KRP"))+"V"+1);
			Крепеж=Крепеж+СокрЛП(стр.Номенклатура)+" "+стр.Количество+"шт."+Символы.ПС;
		КонецЦикла;
		Если ТабКрепеж.Количество()>0 тогда
			нстр=табНаклеек.Добавить();
			нстр.заказ = ДокЗаказ;
			нстр.номерЗаказа = НомерЗаказа;
			нстр.Номенклатура = Крепеж;
			нстр.ШК=ШК;
		КонецЕсли;
	//крепеж
	//Документы
	//Если Выборка.ЗаказПокупателяТипКонтрагента=Перечисления.ЮрФизЛицо.ЮрЛицо тогда
		//ШК=ВРЕГ("KTY"+СокрЛП(Выборка.НомерBITRIX)+"V"+СоответствиеПоставщиковКодДпд.Получить(Выборка.Поставщик)+"V"+ИнтернетМагазин.Транслитерация(СокрЛП("DOC"))+"V"+1);
		//Запись.ЗаписатьНачалоЭлемента("parcel");
		//Запись.ЗаписатьНачалоЭлемента("number"); Запись.ЗаписатьТекст(ШК); Запись.ЗаписатьКонецЭлемента();
		//Запись.ЗаписатьНачалоЭлемента("weight"); Запись.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(""+0.05," ",""),",",".")); Запись.ЗаписатьКонецЭлемента();
		//Запись.ЗаписатьНачалоЭлемента("length"); Запись.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(""+30," ",""),",",".")); Запись.ЗаписатьКонецЭлемента();
		//Запись.ЗаписатьНачалоЭлемента("width");  Запись.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(""+30," ",""),",","."));  Запись.ЗаписатьКонецЭлемента();
		//Запись.ЗаписатьНачалоЭлемента("height"); Запись.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(""+30," ",""),",",".")); Запись.ЗаписатьКонецЭлемента();
		//Запись.ЗаписатьКонецЭлемента();//parcel
		//СоставШК=СоставШК+ШК+";";
	//КонецЕсли;
	//Документы
конецпроцедуры	