
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
//	КомпоновщикНастроек.Настройки
	ПараметрыДанныхЭлементы = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	Если КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Дата1") <> Неопределено Тогда 
		КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Дата1").Значение = НачПериода;
	КонецЕсли;
	
	Если КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Дата2").Значение <> Неопределено Тогда 
		КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Дата2").Значение = КонецДня(КонПериода);
	КонецЕсли;
	
КонецПроцедуры
