
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	ВыбратьБазовыйМодуль();
	
КонецПроцедуры

Процедура ЗаполнитьТаблицу()
	
	Для каждого ЭлементСписка Из СписокБазовыхМодулей Цикл
		СтрокаТаблицы=	ТаблицаМодулей.Добавить();
		СтрокаТаблицы.ПредставлениеМодуля=	ЭлементСписка.Представление;
		СтрокаТаблицы.ИмяМодуля=			ЭлементСписка.Значение;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	КартинкаЗаголовка= ЭДО_БиблиотекаКартинок().КартинкаЗаголовка;
	
	ЗаполнитьТаблицу();
	
КонецПроцедуры

Процедура ВыбратьБазовыйМодуль()
	
	Если ЭлементыФормы.ТаблицаМодулей.ТекущиеДанные = Неопределено Тогда
		Предупреждение("Выберите базовую конфигурацию на основе которой разработано ваше отраслевое решение");
	Иначе
		Закрыть(ЭлементыФормы.ТаблицаМодулей.ТекущиеДанные.ИмяМодуля);
	КонецЕсли;
	
КонецПроцедуры

Процедура ТаблицаМодулейВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	ВыбратьБазовыйМодуль();
	
КонецПроцедуры
