
Перем ТекстЗапросаСтоимостнаяОценкаСклада;
Перем ТекстЗапросаКредиторка;
Перем ТекстЗапросаДебиторка, ТекстЗапросаПрограммы;
Перем ТекстЗапросаВзаимозачетыПоГруппам;
Перем ТекстЗапросаПросроченнаяДебиторкаФ_Ф;


Процедура ДействияФормыОтчетСформировать(Кнопка)

	
	Отчет();

	
КонецПроцедуры

Процедура Отчет() Экспорт

	КОнДата=НачПериода;
	
	Пока  КонДата<=КонПериода Цикл
		Сообщить(ТекущаяДата());
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("КонДата", НачалоДня(КонецДня(КонДата)+1));
		Запрос.УстановитьПараметр("ДатаНач", Дата('20070101'));
		Запрос.УстановитьПараметр("ПоЗаказам", Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам);
		Запрос.УстановитьПараметр("ПустаяНГ",  Справочники.НоменклатурныеГруппы.ПустаяСсылка());
		//Запрос.УстановитьПараметр("Программа", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Программа"));	
		
		Если НЕ ПросроченнаяДебиторка Тогда  // Флажок ставится для Формулы и Филиалов
			Запрос.Текст = 	ТекстЗапросаПрограммы;
		Иначе
			Запрос.Текст = 	ТекстЗапросаПросроченнаяДебиторкаФ_Ф;
		КонецЕсли;	
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока  Выборка.Следующий() Цикл
			МенеджерДТГ=РегистрыСведений.ДеньгиВТоварныхГруппах.СоздатьМенеджерЗаписи();
			МенеджерДТГ.Период=КонДата;
			МенеджерДТГ.НоменклатурнаяГруппа=Выборка.НоменклатурнаяГруппа;
			МенеджерДТГ.Производитель=Выборка.Производитель;
			МенеджерДТГ.НеУчитыватьФ_Ф=ПросроченнаяДебиторка;
			МенеджерДТГ.Сумма=Выборка.Сумма;
			МенеджерДТГ.Записать();
		КонецЦикла;
		// --------- Взаимозачеты по группам
		//
		//Запрос.Текст= ТекстЗапросаВзаимозачетыПоГруппам;
		//Выборка = Запрос.Выполнить().Выбрать();
		//
		//Пока Выборка.Следующий() Цикл
		//	НайдСтрока= ТЗДеньгиВТоварныхГруппах.Найти(Выборка.Программа,"Программа"); 
		//	Если НайдСтрока<>Неопределено Тогда
		//		НайдСтрока.СуммаВзаимозачета=Выборка.Сумма;
		//	КонецЕсли;	
		//КонецЦИкла;
		
// непосредственно заполнение ДТГ	
	
		Сообщить(ТекущаяДата());
		КонДата=КонДата+86400;
		
КонецЦикла;	
КонецПроцедуры


Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

Процедура ДействияФормыУдалитьЗаписи(Кнопка)
	
Режим = РежимДиалогаВопрос.ДаНет;
Ответ = Вопрос("Удалить данные за период с "+ НачПериода +" по "+КонПериода , Режим, 0);
Если Ответ = КодВозвратаДиалога.Нет Тогда
    Возврат;
КонецЕсли;

Запрос=Новый Запрос;
Запрос.Текст= "ВЫБРАТЬ
 |	ДеньгиВТоварныхГруппах.Период,
 |	ДеньгиВТоварныхГруппах.Программа,
 |	ДеньгиВТоварныхГруппах.Производитель,
 |	ДеньгиВТоварныхГруппах.НоменклатурнаяГруппа,
 |	ДеньгиВТоварныхГруппах.НеУчитыватьФ_Ф,
 |	ДеньгиВТоварныхГруппах.Сумма
 |ИЗ
 |	РегистрСведений.ДеньгиВТоварныхГруппах КАК ДеньгиВТоварныхГруппах
 |ГДЕ Период МЕЖДУ &НачДата И &КОнДата ";
 Запрос.УстановитьПараметр("НачДата",НачПериода);
 Запрос.УстановитьПараметр("КонДата",КонПериода);
 Запрос.УстановитьПараметр("НеУчитыватьФ_Ф",ПросроченнаяДебиторка);
 
 Выборка=Запрос.Выполнить().Выбрать();
 

МенеджерДТГ=РегистрыСведений.ДеньгиВТоварныхГруппах.СоздатьНаборЗаписей();
сч=НачПериода;
Пока Выборка.Следующий() Цикл 
	МенеджерДТГ.Отбор.Период.Установить( Выборка.Период);
	МенеджерДТГ.Отбор.НеУчитыватьФ_Ф.Установить(ПросроченнаяДебиторка);
	МенеджерДТГ.Отбор.Программа.Установить(Выборка.Программа) ;
	МенеджерДТГ.Отбор.Производитель.Установить(Выборка.Производитель) ;
	МенеджерДТГ.Отбор.НоменклатурнаяГруппа.Установить(Выборка.НоменклатурнаяГруппа) ;
	МенеджерДТГ.Очистить();
	МенеджерДТГ.Записать();

КонецЦикла;
	
КонецПроцедуры


ТекстЗапросаПрограммы=" ВЫБРАТЬ
|"" Обмен по ТГ"" Вид,
|НоменклатурнаяГруппа,
|Производитель,
|"""" Контрагент,	
|"""" ДоговорКонтрагента,
|"""" Сделка,
|Сумма Сумма
| ПОМЕСТИТЬ ВТ_ОбменМеждуТГ
|ИЗ
|(ВЫБРАТЬ
|НоменклатурнаяГруппаПриход НоменклатурнаяГруппа,
|ПроизводительПриход Производитель,
|СУММА(СуммаДокумента) Сумма
|ИЗ 	Документ.ВзаимозачетНоменклатурныеГруппы 
|ГДЕ	Проведен 
|И ВидОперации=Значение(Перечисление.ВидОбменаМеждуТоварнымиГруппами.ОбменТоварами)
|И  ДатаНачала<=&КонДата И 
|(ДатаОкончания=ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) ИЛИ ДатаОкончания>=&КонДата)
| СГРУППИРОВАТЬ ПО НоменклатурнаяГруппаПриход,ПроизводительПриход
|ОБЪЕДИНИТЬ
|ВЫБРАТЬ
|НоменклатурнаяГруппаРасход НоменклатурнаяГруппа,
|ПроизводительРасход Производитель,
|-СУММА(СуммаДокумента) Сумма
|ИЗ 	Документ.ВзаимозачетНоменклатурныеГруппы 
|ГДЕ	Проведен 
|И ВидОперации=Значение(Перечисление.ВидОбменаМеждуТоварнымиГруппами.ОбменТоварами)
|И  ДатаНачала<=&КонДата И 
|(ДатаОкончания=ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) ИЛИ ДатаОкончания>=&КонДата)
|СГРУППИРОВАТЬ ПО НоменклатурнаяГруппаРасход,ПроизводительРасход ) А
| ;
|
|ВЫБРАТЬ
|НоменклатурнаяГруппа, Производитель, СУММА(Сумма) Сумма
|ИЗ
|(ВЫБРАТЬ 
|ДТГ.Вид,
|ДТГ.Номенклатура.НоменклатурнаяГруппа НоменклатурнаяГруппа,
|ДТГ.Номенклатура.Производитель Производитель,
|Контрагент,
|ДоговорКонтрагента,
|Сделка,
|СУММА(Сумма) Сумма
|ИЗ
|(ВЫБРАТЬ
|ВЫБОР КОГДА ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток>0 ТОГДА
|	 ""Дебиторка""
|ИНАЧЕ
|	 ""Кредиторка""
|КОНЕЦ
|Вид,
|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Владелец КАК Контрагент,
|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
|ВзаиморасчетыСКонтрагентамиОстатки.Сделка КАК Сделка,
|	Заказы.Номенклатура Номенклатура,

|   ВЫБОР КОГДА ЕстьNULL(Заказы.СуммаДокумента,0)=0 ТОГДА 0
|   ИНАЧЕ
|  ВЫБОР КОГДА ВзаиморасчетыСКонтрагентамиОстатки.Сделка.СуммаВключаетНДС Тогда
|	 ВЫРАЗИТЬ (Заказы.Сумма/Заказы.Сделка.СуммаДокумента*ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток КАК ЧИСЛО (15,2))
|   ИНАЧЕ
|	  ВЫРАЗИТЬ ((Заказы.Сумма+Заказы.СуммаНДС)/Заказы.Сделка.СуммаДокумента*ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток КАК ЧИСЛО (15,2))
|   КОНЕЦ 
|КОНЕЦ Сумма
|	//ВЫРАЗИТЬ (Заказы.Сумма/Заказы.СуммаДокумента*ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток КАК ЧИСЛО (15,2)) Сумма
|ИЗ
|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки( &КонДата
|		, ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоЗаказам) ВзаиморасчетыСКонтрагентамиОстатки
|ЛЕВОЕ СОЕДИНЕНИЕ		    
|(
| ВЫБРАТЬ ДоговорКОнтрагента, Сделка,Номенклатура, СУММА(Сумма) Сумма, СУММА(СуммаНДС) СуммаНДС, СУММА(СуммаДокумента) СуммаДокумента
| ИЗ
|(ВЫБРАТЬ
|	ЗаказПокупателяТовары.Ссылка.ДоговорКонтрагента ДоговорКонтрагента,
|	ЗаказПокупателяТовары.Ссылка Сделка,
|	ЗаказПокупателяТовары.Номенклатура Номенклатура,
|	ЗаказПокупателяТовары.Сумма Сумма,
|	ЗаказПокупателяТовары.СуммаНДС СуммаНДС,
|	ЗаказПокупателяТовары.Ссылка.СуммаДокумента  СуммаДокумента
|ИЗ
|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
|ОБЪЕДИНИТЬ ВСЕ
|ВЫБРАТЬ
|	ЗаказПоставщикуТовары.Ссылка.ДоговорКонтрагента ДоговорКонтрагента,
|	ЗаказПоставщикуТовары.Ссылка Сделка,
|	ЗаказПоставщикуТовары.Номенклатура Номенклатура,
|	ЗаказПоставщикуТовары.Сумма Сумма,
|	ЗаказПоставщикуТовары.СуммаНДС СуммаНДС,
|	ЗаказПоставщикуТовары.Ссылка.СуммаДокумента  СуммаДокумента
|ИЗ
|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары 
|  ) А
| СГРУППИРОВАТЬ ПО ДоговорКОнтрагента, Сделка,Номенклатура
|) Заказы
|ПО	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента=Заказы.ДоговорКонтрагента
|И  ВзаиморасчетыСКонтрагентамиОстатки.Сделка= Заказы.Сделка
|//ГДЕ Заказы.СуммаДокумента>0 
|ОБЪЕДИНИТЬ
|ВЫБРАТЬ
|""Склад"" Вид,
|"""" Контрагент,	
|"""" ДоговорКонтрагента,
|"""" Сделка,
|Номенклатура,
|СтоимостьОстаток Сумма
|ИЗ РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&КонДата,) ПартииТоваровНаСкладахОстатки 
|) ДТГ
| СГРУППИРОВАТЬ ПО ДТГ.Вид,
|ДТГ.Номенклатура.НоменклатурнаяГруппа,
|ДТГ.Номенклатура.Производитель,
|Контрагент,
|ДоговорКонтрагента,
|Сделка
|ОБЪЕДИНИТЬ
| ВЫБРАТЬ * ИЗ ВТ_ОбменМеждуТГ
| ОБЪЕДИНИТЬ
| ВЫБРАТЬ 
| ВЫБОР КОГДА Сумма>0 ТОГДА ""Дебиторка"" ИНАЧЕ ""Кредиторка"" КОНЕЦ Вид,
| НоменклатурнаяГруппа, Производитель, Контрагент, ДоговорКонтрагента, Сделка, Сумма
| ИЗ	
|	(ВЫБРАТЬ 
| //  ""Дебиторка"" Вид,
|ВзаиморасчетыУслуги.ДоговорКонтрагента.НоменклатурнаяГруппа НоменклатурнаяГруппа,
|"""" Производитель,
|ВзаиморасчетыУслуги.ДоговорКонтрагента.Владелец Контрагент,
|ВзаиморасчетыУслуги.ДоговорКонтрагента ДоговорКонтрагента,
|"""" Сделка, 
|   СУММА(ВзаиморасчетыУслуги.СуммаУпрОстаток) Сумма ИЗ
|   РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки( &КонДата
| , ДоговорКонтрагента.ВедениеВзаиморасчетов <> &ПоЗаказам И
|		ДоговорКонтрагента.НоменклатурнаяГруппа<>&ПустаяНГ) ВзаиморасчетыУслуги
|	СГРУППИРОВАТЬ ПО ВзаиморасчетыУслуги.ДоговорКонтрагента.НоменклатурнаяГруппа,	 
|	ВзаиморасчетыУслуги.ДоговорКонтрагента.Владелец,
|   ВзаиморасчетыУслуги.ДоговорКонтрагента ) ВзаиморасчетыУслуги
|) Б
|СГРУППИРОВАТЬ ПО НоменклатурнаяГруппа, Производитель";

ТекстЗапросаПросроченнаяДебиторкаФ_Ф="ВЫБРАТЬ 
|ДТГ.Номенклатура.НоменклатурнаяГруппа НоменклатурнаяГруппа,
|ДТГ.Номенклатура.Производитель Производитель,
|СУММА(Сумма) Сумма 
|ИЗ
|(ВЫБРАТЬ
|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Владелец КАК Контрагент,
|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
|	ВзаиморасчетыСКонтрагентамиОстатки.Сделка КАК Сделка,
|	Заказы.Номенклатура Номенклатура,
|	//ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток КАК СуммаУпрОстаток,
|	ВЫРАЗИТЬ (Заказы.Сумма/Заказы.СуммаДокумента*ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток КАК ЧИСЛО (15,2)) Сумма
|ИЗ
|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки( &КонДата
|		, ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоЗаказам
|  И (ДоговорКонтрагента.Владелец В (
|   ВЫБРАТЬ Ссылка ИЗ Справочник.Контрагенты ГДЕ  ВходитВХолдинг ))
|) ВзаиморасчетыСКонтрагентамиОстатки

|ЛЕВОЕ СОЕДИНЕНИЕ		    
|(ВЫБРАТЬ
|	ЗаказПокупателяТовары.Ссылка.ДоговорКонтрагента ДоговорКонтрагента,
|	ЗаказПокупателяТовары.Ссылка Сделка,
|	ЗаказПокупателяТовары.Номенклатура Номенклатура,
|	ЗаказПокупателяТовары.Сумма Сумма,
|	ЗаказПокупателяТовары.Ссылка.СуммаДокумента  СуммаДокумента
|ИЗ
|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
|ГДЕ
|	ЗаказПокупателяТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &КонДата
| И ЗаказПокупателяТовары.Ссылка.Проведен
|ОБЪЕДИНИТЬ
|ВЫБРАТЬ
|	ЗаказПоставщикуТовары.Ссылка.ДоговорКонтрагента ДоговорКонтрагента,
|	ЗаказПоставщикуТовары.Ссылка ЗаказПокупателя,
|	ЗаказПоставщикуТовары.Номенклатура Номенклатура,
|	ЗаказПоставщикуТовары.Сумма Сумма,
|	ЗаказПоставщикуТовары.Ссылка.СуммаДокумента  СуммаДокумента
|ИЗ
|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
|ГДЕ
|	ЗаказПоставщикуТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &КонДата	
|	И ЗаказПоставщикуТовары.Ссылка.Проведен) Заказы
|ПО	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента=Заказы.ДоговорКонтрагента
|И  ВзаиморасчетыСКонтрагентамиОстатки.Сделка= Заказы.Сделка
|ГДЕ Заказы.СуммаДокумента>0 
|И ВзаиморасчетыСКонтрагентамиОстатки.Сделка.ДатаОплаты<=&КонДата
|И ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток>0 ) ДТГ
|СГРУППИРОВАТЬ ПО 
|ДТГ.Номенклатура.НоменклатурнаяГруппа,ДТГ.Номенклатура.Производитель

|УПОРЯДОЧИТЬ ПО  ДТГ.Номенклатура.НоменклатурнаяГруппа.Наименование
|";


