Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	СтруктураОбязательныхПолей = Новый Структура("Организация, ДатаНачала,ДатаОкончания,НоменклатурнаяГруппаПриход,НоменклатурнаяГруппаРасход,СуммаДокумента");
	
		// Теперь позовем общую процедуру проверки.
	ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ РольДоступна("МенеджерПоВзаимозачетам") Тогда
		Отказ = Истина;
		Сообщить("Вы не имеете права производить взаимозачеты между номенклатурными группами. Обратитесь за разъяснениями в финансовую службу.",СтатусСообщения.Важное);
	КонецЕсли;	
		
		
// Заголовок для сообщений об ошибках проведения.
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);	
	
КонецПроцедуры


