
Процедура КнопкаСформироватьНажатие(Кнопка)
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("РезервДляИМ",Справочники.Контрагенты.НайтиПоКоду("П004703"));
	Запрос.УстановитьПараметр("ТипЦенКТ",Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00012"));
	Запрос.УстановитьПараметр("НачПериода",НачПериода);
	Запрос.УстановитьПараметр("КонПериода",КонецДня(КонПериода));
	
	ТекстЗапросаБонусы =  ПолучитьБонусы(ложь).ТекстЗапросаБонусы;
	
	Запрос.Текст = ТекстЗапросаБонусы+"
	|;"+
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(РезервДляИМОбороты.Регистратор КАК Документ.ЗаказПокупателя) КАК ЗаказПокупателя,
	|	ВЫРАЗИТЬ(РезервДляИМОбороты.Регистратор КАК Документ.ЗаказПокупателя).Контрагент КАК Контрагент,
	|	РезервДляИМОбороты.Номенклатура,
	|	-РезервДляИМОбороты.КоличествоОборот КАК КоличествоОборот
	|ПОМЕСТИТЬ втРезервИМ
	|ИЗ
	|	РегистрНакопления.РезервДляИМ.Обороты(&НачПериода, &КонПериода, Регистратор, КонтрагентДляРезерваИМ = &РезервДляИМ) КАК РезервДляИМОбороты
	|ГДЕ
	|	ВЫРАЗИТЬ(РезервДляИМОбороты.Регистратор КАК Документ.ЗаказПокупателя).Контрагент <> &РезервДляИМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.ДоговорКонтрагента.Владелец КАК Контрагент,
	|	ПродажиОбороты.ЗаказПокупателя,
	|	ПродажиОбороты.Номенклатура,
	|	СУММА(ПродажиОбороты.КоличествоОборот) КАК Продажи,
	|	СУММА(ЕСТЬNULL(втРезервИМ.КоличествоОборот, 0)) КАК КоличествоРезервИМ,
	|	ПродажиОбороты.ЗаказПокупателя.Дата,
	|	ПродажиОбороты.Регистратор
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&НачПериода,
	|			&КонПериода,
	|			Регистратор,
	|			ДоговорКонтрагента.КонтрагентДляРезерваИМ = &РезервДляИМ
	|				И ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам)) КАК ПродажиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втРезервИМ КАК втРезервИМ
	|		ПО ПродажиОбороты.ЗаказПокупателя = втРезервИМ.ЗаказПокупателя
	|			И ПродажиОбороты.Номенклатура = втРезервИМ.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.ЗаказПокупателя,
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.ДоговорКонтрагента.Владелец,
	|	ПродажиОбороты.ЗаказПокупателя.Дата,
	|	ПродажиОбороты.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Контрагент,
	|	вт.ЗаказПокупателя,
	|	вт.Номенклатура,
	|	ВЫБОР
	|		КОГДА вт.Продажи > вт.КоличествоРезервИМ
	|				И вт.КоличествоРезервИМ > 0
	|			ТОГДА вт.КоличествоРезервИМ
	|		ИНАЧЕ вт.Продажи
	|	КОНЕЦ КАК ПродажиРезерва,
	|	вт.КоличествоРезервИМ,
	|	вт.ЗаказПокупателяДата,
	|	вт.Регистратор
	|ПОМЕСТИТЬ вт2
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.КоличествоРезервИМ <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт2.Номенклатура КАК Номенклатура,
	|	вт2.ЗаказПокупателяДата КАК Период
	|ПОМЕСТИТЬ втПродажи
	|ИЗ
	|	вт2 КАК вт2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	А.ПериодРеализации,
	|	А.Номенклатура,
	|	втБонусы.Бонус
	|ПОМЕСТИТЬ втБонусыПоНоменклатуре
	|ИЗ
	|	(ВЫБРАТЬ
	|		втПродажи.Период КАК ПериодРеализации,
	|		втПродажи.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(втБонусы.Период) КАК ПериодБонуса
	|	ИЗ
	|		втПродажи КАК втПродажи
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втБонусы КАК втБонусы
	|			ПО втПродажи.Номенклатура = втБонусы.Номенклатура
	|				И втПродажи.Период >= втБонусы.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		втПродажи.Период,
	|		втПродажи.Номенклатура) КАК А
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втБонусы КАК втБонусы
	|		ПО А.Номенклатура = втБонусы.Номенклатура
	|			И А.ПериодБонуса = втБонусы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатуры.Период КАК ПериодЦены,
	|	ЦеныНоменклатуры.Номенклатура,
	|	ЦеныНоменклатуры.Цена
	|ПОМЕСТИТЬ втЦеныКТ
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|ГДЕ
	|	ЦеныНоменклатуры.ТипЦен = &ТипЦенКТ
	|	И ЦеныНоменклатуры.Номенклатура В
	|			(ВЫБРАТЬ
	|				вт2.Номенклатура
	|			ИЗ
	|				вт2)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПродажи.Номенклатура,
	|	втПродажи.Период КАК ЗаказПокупателяДата,
	|	МАКСИМУМ(втЦеныКТ.ПериодЦены) КАК ПериодЦены
	|ПОМЕСТИТЬ втЦеныПоДням
	|ИЗ
	|	втПродажи КАК втПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦеныКТ КАК втЦеныКТ
	|		ПО (втЦеныКТ.Номенклатура = втПродажи.Номенклатура)
	|			И (втЦеныКТ.ПериодЦены <= втПродажи.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажи.Номенклатура,
	|	втПродажи.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт2.Контрагент,
	|	вт2.ЗаказПокупателя,
	|	вт2.Номенклатура,
	|	вт2.ПродажиРезерва,
	|	вт2.КоличествоРезервИМ,
	|	вт2.ЗаказПокупателяДата,
	|	втЦеныКТ.Цена КАК ЦенаКТ,
	|	ЕСТЬNULL(ПродажиСебестоимостьОбороты.СтоимостьОборот, 0) / 1.18 * ЕСТЬNULL(втБонусыПоНоменклатуре.Бонус, 0) / 100 КАК СуммаБонуса,
	|	ЕСТЬNULL(вт2.ПродажиРезерва * ЕСТЬNULL(втЦеныКТ.Цена, 0), 0) - (ЕСТЬNULL(ПродажиСебестоимостьОбороты.СтоимостьОборот, 0) - ЕСТЬNULL(ПродажиСебестоимостьОбороты.СтоимостьОборот, 0) / 1.18 * ЕСТЬNULL(втБонусыПоНоменклатуре.Бонус, 0) / 100) КАК ВаловаяПрибыльСУчетомБонуса,
	|	вт2.КоличествоРезервИМ * втЦеныКТ.Цена КАК СуммаПродажи,
	|	вт2.ЗаказПокупателя.ДоговорКонтрагента.ОтветственноеЛицо.НаправлениеПродаж КАК НаправлениеПродаж,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПродажиСебестоимостьОбороты.СтоимостьОборот, 0) - ЕСТЬNULL(ПродажиСебестоимостьОбороты.СтоимостьОборот, 0) / 1.18 * ЕСТЬNULL(втБонусыПоНоменклатуре.Бонус, 0) / 100 <> 0
	|			ТОГДА ЕСТЬNULL(вт2.ПродажиРезерва * ЕСТЬNULL(втЦеныКТ.Цена, 0), 0) - (ЕСТЬNULL(ПродажиСебестоимостьОбороты.СтоимостьОборот, 0) - ЕСТЬNULL(ПродажиСебестоимостьОбороты.СтоимостьОборот, 0) / 1.18 * ЕСТЬNULL(втБонусыПоНоменклатуре.Бонус, 0) / 100) / (ЕСТЬNULL(ПродажиСебестоимостьОбороты.СтоимостьОборот, 0) - ЕСТЬNULL(ПродажиСебестоимостьОбороты.СтоимостьОборот, 0) / 1.18 * ЕСТЬNULL(втБонусыПоНоменклатуре.Бонус, 0) / 100)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВаловаяПрибыльСУчетомБонусаПроц
	|ИЗ
	|	вт2 КАК вт2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЦеныПоДням КАК втЦеныПоДням
	|			ЛЕВОЕ СОЕДИНЕНИЕ втЦеныКТ КАК втЦеныКТ
	|			ПО втЦеныПоДням.ПериодЦены = втЦеныКТ.ПериодЦены
	|				И втЦеныПоДням.Номенклатура = втЦеныКТ.Номенклатура
	|		ПО вт2.Номенклатура = втЦеныПоДням.Номенклатура
	|			И вт2.ЗаказПокупателяДата = втЦеныПоДням.ЗаказПокупателяДата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиСебестоимость.Обороты(, , Регистратор, ) КАК ПродажиСебестоимостьОбороты
	|		ПО вт2.Регистратор = ПродажиСебестоимостьОбороты.Регистратор
	|			И вт2.ЗаказПокупателя = ПродажиСебестоимостьОбороты.ЗаказПокупателя
	|			И вт2.Номенклатура = ПродажиСебестоимостьОбороты.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втБонусыПоНоменклатуре КАК втБонусыПоНоменклатуре
	|		ПО вт2.Номенклатура = втБонусыПоНоменклатуре.Номенклатура
	|			И вт2.ЗаказПокупателяДата = втБонусыПоНоменклатуре.ПериодРеализации";
	Рез = Запрос.Выполнить().Выгрузить();
	//Рез.ВыбратьСтроку();
	
	тп = ПолучитьДокИзСхемы("ОсновнаяСхемаКомпоновкиДанных",Рез,"Продажи резерва ИМ в ценах KolesaTyt");
	ЭлементыФормы.ТабДок.Вывести(тп);
	//ТабДок.ФиксацияСлева = 5;
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьДокИзСхемы(Макет, таб,Заголовок)
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("тз", таб);
	//Получаем схему из макета
    СхемаКомпоновкиДанных = ПолучитьМакет(Макет);

    //создадим компоновщик настроек и загрузим настройки по умолчанию, вместо настроек по умолчанию можно использовать восстановленные настройки
    КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
    КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
    КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
    Настройки = КомпоновщикНастроек.Настройки;
    
        //установка параметров отчета, без КомпоновщикНастроекКомпоновкиДанных делать это гораздо сложнее
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СвойствоВодитель",         мСвойствоВодитель);
	Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок",            Заголовок);
    
        //Помещаем в переменную данные о расшифровке данных - здесь ненужный пункт, но пусть будет.
    ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

    //Формируем макет, с помощью компоновщика макета
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

    //Передаем в макет компоновки схему, настройки и данные расшифровки
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);

    //Выполним компоновку с помощью процессора компоновки
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных , ДанныеРасшифровки);

    //Очищаем поле табличного документа
    //Результат = ЭлементыФормы.ПолеМатериалы;
	Результат = Новый ТабличныйДокумент();
	//Результат.Очистить();
    //Выводим результат в табличный документ
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(Результат);

    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
    
    Результат.ОтображатьЗаголовки = Ложь;
    Результат.ОтображатьСетку = Ложь;
	
	Возврат  Результат;
КонецФункции

