Процедура ДатаНачалаПриИзменении(Элемент)
	
	УстановитьДатуНачала();
	
КонецПроцедуры

Процедура ДатаКонцаПриИзменении(Элемент)
	
	УстановитьДатуКонца();
		
КонецПроцедуры

Процедура КнопкаНастройкаПериодаНажатие(Элемент)
	
	Если НП.Редактировать() Тогда
		
		НачалоПериода = НП.ПолучитьДатуНачала();
		КонецПериода = НП.ПолучитьДатуОкончания();
		
		ПараметрДатаНачала = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
		ПараметрДатаКонца = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
		ПараметрДатаНачала.Значение = НачалоДня(НачалоПериода);
		ПараметрДатаКонца.Значение = КонецДня(КонецПериода);
		
	КонецЕсли;
	
КонецПроцедуры // КнопкаНастройкаПериодаНажатие()

Процедура ПоштучноПриИзменении(Элемент)
	СменитьСхему();
	УстановитьОтбор();
КонецПроцедуры

Процедура СменитьСхему()
	
	Если Поштучно Тогда
		СхемаКомпоновкиДанных = ПолучитьМакет("ДополнительнаяСхемаКомпоновкиДанных");
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	Иначе
		СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	КонецЕсли;
	
	УстановитьДатуКонца();
	УстановитьДатуНачала();
			
КонецПроцедуры

Процедура КонтейнерПриИзменении(Элемент)
	
	УстановитьОтбор();		
			   
КонецПроцедуры

Процедура УстановитьОтбор()
	
	Если Контейнер <> "" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Комментарий ПОДОБНО &Комментарий";
		
		Запрос.УстановитьПараметр("Комментарий", Контейнер);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			КомпоновщикНастроек.Настройки.Структура[0].Строки[0].Отбор.Элементы[0].Использование = Истина;
			КомпоновщикНастроек.Настройки.Структура[0].Строки[0].Отбор.Элементы[0].ПравоеЗначение = Результат.Ссылка;
			
			ПараметрДатаНачала = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
			ПараметрДатаКонца = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
			ПараметрДатаНачала.Значение = НачалоДня(Результат.Ссылка.Дата);
			ПараметрДатаКонца.Значение = КонецДня(Результат.Ссылка.Дата);
			
			НачалоПериода = НачалоДня(Результат.Ссылка.Дата);
			КонецПериода  = КонецДня(Результат.Ссылка.Дата);
			
			НП.УстановитьПериод(НачалоДня(НачалоПериода), КонецДня(КонецПериода));
			
		Иначе
			КомпоновщикНастроек.Настройки.Структура[0].Строки[0].Отбор.Элементы[0].Использование = Ложь;
			КомпоновщикНастроек.Настройки.Структура[0].Строки[0].Отбор.Элементы[0].ПравоеЗначение = Неопределено;
		КонецЕсли;
		
	Иначе
		КомпоновщикНастроек.Настройки.Структура[0].Строки[0].Отбор.Элементы[0].Использование = Ложь;
		КомпоновщикНастроек.Настройки.Структура[0].Строки[0].Отбор.Элементы[0].ПравоеЗначение = Неопределено;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура УстановитьДатуКонца()
	
	НП.УстановитьПериод(НачалоДня(НачалоПериода), КонецДня(КонецПериода));
	
	ПараметрДатаНачала = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ПараметрДатаКонца = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	ПараметрДатаНачала.Значение = НачалоДня(НачалоПериода);
	ПараметрДатаКонца.Значение = КонецДня(КонецПериода);
	
КонецПроцедуры

Процедура УстановитьДатуНачала()
	
	НП.УстановитьПериод(НачалоДня(НачалоПериода), КонецДня(КонецПериода));
	
	ПараметрДатаНачала = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ПараметрДатаКонца = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	ПараметрДатаНачала.Значение = НачалоДня(НачалоПериода);
	ПараметрДатаКонца.Значение = КонецДня(КонецПериода);	
	
КонецПроцедуры