
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриОткрытии()
	
	ЭлементыФормы.НадписьВерсияОбработки.Заголовок  = ВерсияОбработки;
	ЭлементыФормы.НадписьВерсияКомпоненты.Заголовок = ВерсияКомпоненты;
	
	КартинкаЗаголовка= ЭДО_БиблиотекаКартинок().КартинкаЗаголовка;
	
	ЭлементыФормы.НадписьТелефонТехподдержки.Заголовок = ?(стрДлина(ТелефонТехподдержки)<20, "Телефон техподдержки: " + ТелефонТехподдержки, ТелефонТехподдержки);
	ЭлементыФормы.НадписьТелефонТехподдержки.ГоризонтальноеПоложение = ?(стрДлина(ТелефонТехподдержки)<20, ГоризонтальноеПоложение.Центр, ГоризонтальноеПоложение.Лево);
	ЭлементыФормы.НадписьДистанционнаяПомощь.Видимость = (НаименованиеСистемы="Диадок");
	ЭлементыФормы.НадписьПровестиДиагностику.Видимость = (НаименованиеСистемы="Диадок");
	
	СистемнаяИнформация=	Новый СистемнаяИнформация;
	
	ВерсияПлатформы=		СистемнаяИнформация.ВерсияПриложения;
	ВерсияОс=				СистемнаяИнформация.ВерсияОС;
	ТипПлатформы=			СистемнаяИнформация.ТипПлатформы;
	МодульИнтеграции =      Модуль_ИнтеграцияОбщий.ПолучитьИмяМодуляИнтеграции();
	СтрокаСоединения=		СтрокаСоединенияИнформационнойБазы();
	
	#Если ТонкийКлиент Тогда
		ВидКлиента=	"Тонкий клиент";
	#ИначеЕсли ТолстыйКлиентОбычноеПриложение Тогда
		ВидКлиента=	"Толстый клиент обычное приложение";
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение Тогда
		ВидКлиента=	"Толстый клиент управляемые формы";
	#ИначеЕсли ВебКлиент Тогда
		ВидКлиента=	"Веб клиент";
	#ИначеЕсли НаСервере Тогда
		ВидКлиента=	"Сервер";
	#ИначеЕсли ВнешнееСоединение Тогда
		ВидКлиента=	"Внешнее соединение";
	#КонецЕсли
	
	Если ИспользуетсяПодключаемыйМодуль = Истина Тогда
		ИспользованиеПодключаемогоМодуля = "Используется";	
	Иначе
		ИспользованиеПодключаемогоМодуля = "Не используется";
	КонецЕсли;
		
	ИнформацияОКонфигурации=	Метаданные.ПодробнаяИнформация + " (" + Метаданные.Версия + ")";
		
КонецПроцедуры

Процедура ОткрытьХостВБраузереПоУмолчанию(Хост)
	
	ЗапуститьПриложение(Хост);
	
КонецПроцедуры	

Процедура ОткрытьХостВIE(Хост)
	
	Попытка
		IE=	Новый COMОбъект("InternetExplorer.Application"); 
	Исключение
		Сообщить("Ошибка при открытии приложения Internet Explorer");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	IE.Visible=	True;
	IE.Navigate2(Хост);
	
КонецПроцедуры

Процедура НадписьВключитьОнлайнКонсультантНажатие(Элемент)
	
	ОткрытьХостВБраузереПоУмолчанию("https://web-client.livetex.ru/welcome-new/?site_id=49853&visitor_id=dghxapc4noob6gvi&phone_mask=%2B7(XXX)XXX-XX-XX&phone_holder=%2B7(XXX)XXX-XX-XX&invite_text=&first_message=&lead_submit_text=&account_id=49968&media_server=tel.livetex.ru&open_page=https%3A%2F%2Fdiadoc.kontur.ru%2F4ce63d36-9c88-43b4-8beb-65293e2f3027%2FFolder%2FInbox&widget_type=button&widget_id=APIWindow&lt-ii=");
	
КонецПроцедуры

Процедура НадписьЮзерЭхоНажатие(Элемент)
	
	ОткрытьХостВБраузереПоУмолчанию("https://diadoc.userecho.com/");
	
КонецПроцедуры

Процедура НадписьПровестиДиагностикуНажатие(Элемент)
	
	ОткрытьХостВIE("https://help.kontur.ru/diadoc");
	
КонецПроцедуры

Процедура НадписьДистанционнаяПомощьНажатие(Элемент)
	
	ОткрытьХостВIE("https://help.kontur.ru/vnc");
	
КонецПроцедуры

Процедура ОсновныеДействияФормыСохранитьВФайлик(Кнопка)
	
	ТекстовыйДокумент=	Новый ТекстовыйДокумент;
	
	ТекстовыйДокумент.ДобавитьСтроку("Версия модуля: " + ВерсияОбработки);
	ТекстовыйДокумент.ДобавитьСтроку("Версия компоненты: " + ВерсияКомпоненты);
	ТекстовыйДокумент.ДобавитьСтроку("Версия платформы: " + ВерсияПлатформы);
	ТекстовыйДокумент.ДобавитьСтроку("Версия ОС: " + ВерсияОс);
	ТекстовыйДокумент.ДобавитьСтроку("Тип платформы: " + ТипПлатформы);
	ТекстовыйДокумент.ДобавитьСтроку("Вид клиента: " + ВидКлиента);
	ТекстовыйДокумент.ДобавитьСтроку("Строка соединения: " + СтрокаСоединения);
	ТекстовыйДокумент.ДобавитьСтроку("Подключаемый модуль: " + ИспользованиеПодключаемогоМодуля);
	ТекстовыйДокумент.ДобавитьСтроку("Информация о конфигурации: " + ИнформацияОКонфигурации);
	
	Попытка
		Wscript=		Новый COMobject("Wscript.Shell");
		ПутьКФайлу= 	"C:\" + Wscript.ExpandEnvironmentStrings("%HomePath%") + "\Desktop\ТехническаяИнформацияДиадок.txt";
		ТекстовыйДокумент.Записать(ПутьКФайлу, КодировкаТекста.UTF8);
		Предупреждение("Техническая информация сохранена на Рабочий Стол в файл ТехническаяИнформацияДиадок.txt, отправьте его специалисту технической поддержки", 120, "Диадок");
	Исключение
		Сообщить("Не удалось сохранить файл с технической информацией " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура Надпись26Нажатие(Элемент)
	ИмяМодуляИнтеграции=	Модуль_ИнтеграцияОбщий.ПолучитьИмяМодуляИнтеграции(истина);
	Предупреждение("Требуется перезагрузка обработки", , "Диадок");
	ЭтаФорма.ВладелецФормы.закрыть();			
КонецПроцедуры
