
Процедура ПриОткрытии()
	
	ТекстСообщения = ЭлементыФормы.ТекстовыйДокумент;
	ТекстСообщения.Очистить();
	
	ТекстСообщения.УстановитьТекст("| 
									| 
									|Оплаченный период интеграции с сервисом ""Диадок""
									|истек у следующих организаций:
									| ");
	
	Для Каждого ТекОрганизация Из СписокОрганизаций Цикл
		ДанныеОрганизации = ТекОрганизация.Значение.Box;
		ТекстСообщения.ДобавитьСтроку(" - " + ДанныеОрганизации.Name + "(ИНН - " + ДанныеОрганизации.Inn + ", КПП - " + ДанныеОрганизации.Kpp + ")");
	КонецЦикла;	
	
КонецПроцедуры

//открываем страницу формы заявки на оплату
Процедура ОплатитьСервисНажатие(Элемент)
	
	Попытка
		
		IE = Новый COMОбъект("InternetExplorer.Application");
		IE.Visible = Истина;
		IE.Navigate("https://www.diadoc.ru/order1c?comment=модуль_1C_8_2_и_8_3");
		Пока IE.readyState < 4 Цикл
		КонецЦикла;
		
		//заполняем поля формы заявки в соотвествии с сертификатом (если был)
		Если СписокОрганизаций.Количество() > 0 Тогда 
			ДанныеДляФормы = СписокОрганизаций[0].Значение;
			IE.Document.getElementByID("OrderForm_Fio").value = ДанныеДляФормы.ДанныеСотрудника.ФИО;
			IE.Document.getElementByID("OrderForm_Inn").value = ДанныеДляФормы.Box.Inn;
			IE.Document.getElementByID("OrderForm_Kpp").value = ДанныеДляФормы.Box.Kpp;
			IE.Document.getElementByID("OrderForm_OrganizationTitle").value = ДанныеДляФормы.Box.Name;
		КонецЕсли;	
		
	Исключение
		
		ТекстОшибки = ИнформацияОбОшибке().Описание;
		Сообщить(ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры                                                                                         

