
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Если ЭтотОбъект.ВариантОтчета тогда
		Если СсылкаНаОбъект = Документы.ОтчетКомиссионераОПродажах.ПустаяСсылка() тогда
		Предупреждение("Выберите сначала документ!",30);
		возврат
		КонецЕсли;
	иначе
		Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() тогда
		Предупреждение("Выберите сначала Комиссионера!",30);
		возврат
		КонецЕсли;
	КонецЕсли;
		
		
		
		табДок = Печать();
		табДок.Показать("Отчет комиссионера о продажах");
	
	
КонецПроцедуры
