
Процедура КнопкаВыполнитьНажатие(Кнопка)
Запрос= Новый Запрос;	
Запрос.Текст="ВЫБРАТЬ
|	ДоговорыКонтрагентов.Ссылка.Владелец Контрагент,
|	ДоговорыКонтрагентов.Ссылка ДоговорКОнтрагента,
|	ВзаиморасчетыСКонтрагентамиОбороты.ДоговорКонтрагента.Ссылка
|ИЗ
|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты КАК ВзаиморасчетыСКонтрагентамиОбороты
|		ПО ДоговорыКонтрагентов.Ссылка = ВзаиморасчетыСКонтрагентамиОбороты.ДоговорКонтрагента
|ГДЕ ВзаиморасчетыСКонтрагентамиОбороты.ДоговорКонтрагента.Ссылка Есть NULL и ДоговорыКонтрагентов.Ссылка.ОтветственноеЛицо=&ОтветственноеЛицо		
|И ДоговорыКонтрагентов.Ссылка.ТипДоговора<>&НД И не ДоговорыКонтрагентов.Ссылка.ПометкаУдаления
|УПОРЯДОЧИТЬ ПО ДоговорыКонтрагентов.Ссылка.Владелец.Наименование";

Запрос.УстановитьПараметр("ОтветственноеЛицо",Справочники.Пользователи.ПустаяСсылка());
Запрос.УстановитьПараметр("НД",Справочники.ТипыДоговоров.НД);

Выборка=Запрос.Выполнить().Выбрать();

//Запрос.УстановитьПараметр("ОтветственноеЛицо",);

Пока Выборка.Следующий() Цикл
	Объект=Выборка.ДоговорКОнтрагента.Ссылка.ПолучитьОбъект();
	Объект.УстановитьПометкуУдаления(Истина);	
КонецЦикла;	

КонецПроцедуры
