//Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//	Если СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код) = "Челышева Т.А." или СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код) = "Плотников" Тогда
//	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокВыводимых"));
//	Если Параметр <> Неопределено Тогда
//		Запрос = Новый запрос;
//		запрос.УстановитьПараметр("польз",Справочники.Пользователи.НайтиПоКоду("Челышева Т.А."));
//		запрос.УстановитьПараметр("Категория",Справочники.КатегорииПокупателей.ИнтернетМагазин);
//		запрос.текст = "ВЫБРАТЬ
//					   |	Контрагенты.Ссылка
//					   |ИЗ
//					   |	Справочник.Контрагенты КАК Контрагенты
//					   |ГДЕ
//					   |	Контрагенты.ОсновнойМенеджерКонтрагента = &польз
//					   |	И Контрагенты.КатегорияПокупателя = &Категория";
//		рез = Запрос.Выполнить().Выгрузить();
//		Список = Новый СписокЗначений();
//		Для каждого стр из рез Цикл
//			список.Добавить(стр.Ссылка);
//		КонецЦикла;
//		Параметр.Значение = Список;
//		Параметр.Использование = Истина;
//	КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры
