
Процедура КнопкаВыполнитьНажатие(Кнопка)
	СписокГоловное = новый СписокЗначений;
	СписокГоловное = Справочники.Подразделения.ПустаяСсылка();
	СписокГоловное = Справочники.Подразделения.НайтиПоКоду("00005");
	
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	СоответствиеКонтрагентовСкладамФРан.Контрагент,
	             |	СоответствиеКонтрагентовСкладамФРан.Склад,
	             |	СоответствиеКонтрагентовСкладамФРан.Договор,
	             |	СоответствиеКонтрагентовСкладамФРан.ДоговорПродажи,
	             |	СоответствиеКонтрагентовСкладамФРан.Точка,
	             |	СоответствиеКонтрагентовСкладамФРан.КодСоответствияВБазеФР,
	             |	СоответствиеКонтрагентовСкладамФРан.АвтоСозданиеПоступлений
	             |ПОМЕСТИТЬ втСоответствия
	             |ИЗ
	             |	РегистрСведений.СоответствиеКонтрагентовСкладамФРан КАК СоответствиеКонтрагентовСкладамФРан
	             |ГДЕ
	             |	СоответствиеКонтрагентовСкладамФРан.Контрагент = &Контрагент
	             |	И СоответствиеКонтрагентовСкладамФРан.Точка = &Точка
	             |	И СоответствиеКонтрагентовСкладамФРан.АвтоСозданиеПоступлений
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	МинимальныйОстатокФранчайзи.Контрагент,
	             |	МинимальныйОстатокФранчайзи.Точка,
	             |	МинимальныйОстатокФранчайзи.Номенклатура,
	             |	СУММА(МинимальныйОстатокФранчайзи.Количество) КАК Количество,
	             |	втСоответствия.Склад,
	             |	втСоответствия.Договор
	             |ПОМЕСТИТЬ втМинимальныйОстаток
	             |ИЗ
	             |	РегистрСведений.МинимальныйОстатокФранчайзи КАК МинимальныйОстатокФранчайзи
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСоответствия КАК втСоответствия
	             |		ПО МинимальныйОстатокФранчайзи.Контрагент = втСоответствия.Контрагент
	             |			И МинимальныйОстатокФранчайзи.Точка = втСоответствия.Точка
	             |ГДЕ
	             |	МинимальныйОстатокФранчайзи.Контрагент = &Контрагент
	             |	И МинимальныйОстатокФранчайзи.Точка = &Точка
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	МинимальныйОстатокФранчайзи.Контрагент,
	             |	МинимальныйОстатокФранчайзи.Номенклатура,
	             |	втСоответствия.Склад,
	             |	МинимальныйОстатокФранчайзи.Точка,
	             |	втСоответствия.Договор
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	втМинимальныйОстаток.Контрагент,
	             |	втМинимальныйОстаток.Точка,
	             |	втМинимальныйОстаток.Номенклатура,
	             |	втМинимальныйОстаток.Количество,
	             |	втМинимальныйОстаток.Склад,
	             |	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	             |	втМинимальныйОстаток.Точка.Номер,
	             |	втМинимальныйОстаток.Договор
	             |ПОМЕСТИТЬ втМинимальныйОстатокСклад
	             |ИЗ
	             |	втМинимальныйОстаток КАК втМинимальныйОстаток
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	             |				,
	             |				Номенклатура В
	             |						(ВЫБРАТЬ
	             |							втМинимальныйОстаток.Номенклатура
	             |						ИЗ
	             |							втМинимальныйОстаток)
	             |					И Склад В
	             |						(ВЫБРАТЬ
	             |							втМинимальныйОстаток.Склад
	             |						ИЗ
	             |							втМинимальныйОстаток)) КАК ТоварыНаСкладахОстатки
	             |		ПО втМинимальныйОстаток.Склад = ТоварыНаСкладахОстатки.Склад
	             |			И втМинимальныйОстаток.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ТоварыНаСкладахОстатки.Номенклатура,
	             |	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК ОстатокФакт,
	             |	СУММА(ЗаказыПокупателейОстатки.КоличествоОстаток) КАК Заказано,
	             |	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0)) КАК СвободныйОстаток
	             |ПОМЕСТИТЬ втСвободныйОстаток
	             |ИЗ
	             |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	             |			,
	             |			Склад.ЗапретитьИспользование = ЛОЖЬ
	             |				И Склад.Транзитный = ЛОЖЬ
	             |				И Номенклатура В
	             |					(ВЫБРАТЬ
	             |						втМинимальныйОстаток.Номенклатура
	             |					ИЗ
	             |						втМинимальныйОстаток)) КАК ТоварыНаСкладахОстатки
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(
	             |				,
	             |				ЗаказПокупателя.Проверен
	             |					И ЗаказПокупателя.Подразделение В (&СписокГоловное)
	             |					И Номенклатура В
	             |						(ВЫБРАТЬ
	             |							втМинимальныйОстаток.Номенклатура
	             |						ИЗ
	             |							втМинимальныйОстаток)) КАК ЗаказыПокупателейОстатки
	             |		ПО ТоварыНаСкладахОстатки.Номенклатура = ЗаказыПокупателейОстатки.Номенклатура
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ТоварыНаСкладахОстатки.Номенклатура
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	втМинимальныйОстатокСклад.Контрагент,
	             |	втМинимальныйОстатокСклад.Точка,
	             |	втМинимальныйОстатокСклад.Номенклатура,
	             |	втМинимальныйОстатокСклад.Количество КАК КоличествоМинимум,
	             |	ЕСТЬNULL(втСвободныйОстаток.СвободныйОстаток, 0) КАК СвободныйОстаток,
	             |	втМинимальныйОстатокСклад.КоличествоОстаток,
	             |	ВЫБОР
	             |		КОГДА втМинимальныйОстатокСклад.Количество - втМинимальныйОстатокСклад.КоличествоОстаток - ЕСТЬNULL(взОстатокПоЗаказам.ОстатокПоЗаказам, 0) >= втСвободныйОстаток.СвободныйОстаток
	             |			ТОГДА втСвободныйОстаток.СвободныйОстаток
	             |		ИНАЧЕ втМинимальныйОстатокСклад.Количество - втМинимальныйОстатокСклад.КоличествоОстаток - ЕСТЬNULL(взОстатокПоЗаказам.ОстатокПоЗаказам, 0)
	             |	КОНЕЦ КАК КЗаказу,
	             |	ЕСТЬNULL(взОстатокПоЗаказам.ОстатокПоЗаказам, 0) КАК ОстатокПоЗаказам,
	             |	втМинимальныйОстатокСклад.ТочкаНомер,
	             |	втМинимальныйОстатокСклад.Договор,
	             |	0 КАК Цена,
	             |	втМинимальныйОстатокСклад.Склад
	             |ИЗ
	             |	втМинимальныйОстатокСклад КАК втМинимальныйОстатокСклад
	             |		ЛЕВОЕ СОЕДИНЕНИЕ втСвободныйОстаток КАК втСвободныйОстаток
	             |		ПО втМинимальныйОстатокСклад.Номенклатура = втСвободныйОстаток.Номенклатура
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			втМинимальныйОстатокСклад.Контрагент КАК Контрагент,
	             |			втМинимальныйОстатокСклад.Точка КАК Точка,
	             |			втМинимальныйОстатокСклад.Номенклатура КАК Номенклатура,
	             |			втМинимальныйОстатокСклад.Склад КАК Склад,
	             |			СУММА(ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0)) КАК ОстатокПоЗаказам
	             |		ИЗ
	             |			втМинимальныйОстатокСклад КАК втМинимальныйОстатокСклад
	             |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(
	             |						,
	             |						ЗаказПокупателя.Проверен
	             |							И ЗаказПокупателя.ВводитьТолькоПеремещение) КАК ЗаказыПокупателейОстатки
	             |				ПО втМинимальныйОстатокСклад.ТочкаНомер = ЗаказыПокупателейОстатки.ЗаказПокупателя.НомерТорговойТочкиКонтрагента
	             |					И втМинимальныйОстатокСклад.Номенклатура = ЗаказыПокупателейОстатки.Номенклатура
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			втМинимальныйОстатокСклад.Склад,
	             |			втМинимальныйОстатокСклад.Контрагент,
	             |			втМинимальныйОстатокСклад.Точка,
	             |			втМинимальныйОстатокСклад.Номенклатура) КАК взОстатокПоЗаказам
	             |		ПО втМинимальныйОстатокСклад.Контрагент = взОстатокПоЗаказам.Контрагент
	             |			И втМинимальныйОстатокСклад.Номенклатура = взОстатокПоЗаказам.Номенклатура";
				 Запрос.УстановитьПараметр("Контрагент",Контрагент);
				 Запрос.УстановитьПараметр("Точка",Точка);
				 Запрос.УстановитьПараметр("СписокГоловное",СписокГоловное);
				 Рез = Запрос.Выполнить();
				 таб = Рез.Выгрузить();
				 
				 Если таб.Количество()>0 тогда
					 
					 ТабЗнач1  = Новый ТаблицаЗначений;
					 ТабЗнач1  = ОбменСУТИнтернетМагазин.ПолучитьЦеныДляКонтрагента(Контрагент, таб, ТекущаяДата());
					 
					 Если ТипЗнч(ТабЗнач1) = Тип("Строка") Тогда // нет политики ценообразования документом
						 табЗнач1  = новый ТаблицаЗначений;
						 табЗнач1  = ОбменСУТИнтернетМагазин.ПолучитьЦеныДляКонтрагента_РегСв(Контрагент, таб); //из регистра сведений
					 КонецЕсли;
					 
					 Заказ = Документы.ЗаказПокупателя.СоздатьДокумент();
					 Заказ.Дата = ТекущаяДата();
					 Заказ.Организация = Справочники.Организации.НайтиПоКоду("00001");
					 Заказ.ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00005"); //Крупный опт
					 Заказ.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643");
					 Заказ.КурсВзаиморасчетов = 1;
					 Заказ.КратностьВзаиморасчетов = 1;
					 Заказ.Контрагент = Контрагент;
					 Заказ.ДоговорКонтрагента = таб[0].Договор;
					 Заказ.НомерТорговойТочкиКонтрагента = таб[0].ТочкаНомер;
					 Заказ.Проверен = Истина;
					 Заказ.НеУчитыватьВСезонномЗаказе = Истина;
					 Заказ.СпособОтгрузки = Справочники.СпособыОтгрузкиТовара.НайтиПоКоду("10");
					 
					 Заказ.Комментарий = "Пополнение склада франчайзи";
					 Заказ.Подразделение = Справочники.Подразделения.НайтиПоКоду("00005");
					 Заказ.СуммаВключаетНДС = Истина;
					 Заказ.УчитыватьНДС 	   = Истина;
					 Заказ.ДоговорКонтрагента = таб[0].Договор;
					 Заказ.ВводитьТолькоПеремещение = Истина;
					 Заказ.Склад = Заказ.Подразделение.Склад;
					 
					 Для каждого стр из таб Цикл
						 Если стр.КЗаказу > 0 тогда
							 СтрокаТовары = Заказ.Товары.Добавить();
							 СтрокаТовары.Номенклатура = стр.Номенклатура;
							 СтрокаТовары.Коэффициент = 1;
							 СтрокаТовары.Количество = стр.КЗаказу;
							 СтрокаТовары.Размещение = стр.Склад;
							 
							 стр2 = табЗнач1.найти(СтрокаТовары.Номенклатура, "Номенклатура");
							 Если стр2 = неопределено Тогда
								 стр2МинимальнаяЦена = 0;
							 Иначе
								 стр2МинимальнаяЦена = стр2.МинимальнаяЦена;
							 КонецЕсли;
                             СтрокаТовары.Цена = стр2МинимальнаяЦена;
							 
							 ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрокаТовары, Заказ, Константы.ВалютаРегламентированногоУчета.Получить()); 
							 ЗаполнитьСтавкуНДСТабЧасти(СтрокаТовары, Заказ);
							 РассчитатьСуммуТабЧасти(СтрокаТовары, Заказ);
							 РассчитатьСуммуНДСТабЧасти(СтрокаТовары, Заказ);
						 КонецЕсли;
					 КонецЦикла;
					 
					 Если Заказ.Товары.Количество()>0 тогда
						 Заказ.Записать();
						 Заказ.ПолучитьФорму("ФормаДокумента").Открыть();
					 КонецЕсли;
				 КонецЕсли;

				 
КонецПроцедуры
