
//{ ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ И ЭЛЕМЕНТОВ

	Процедура ПриОткрытии()
		
		УправлениеФормой();
		
	КонецПроцедуры

	Процедура КнопкаПоискИПриглашение_Нажатие(Элемент)
		
		ПолучитьФорму("ФормаПоискаИПриглашенияКонтрагентов", ВладелецФормы).Открыть();
		
		Закрыть();
		
	КонецПроцедуры

	Процедура ОсновныеДействияФормы_КнопкаНапомнитьЧерезМесяц_Нажатие(Кнопка)
		
		ПриглашенияДатаНапоминания_УстановитьСледующуюДату(ДобавитьМесяц(ТекущаяДата(), 1));
		
		Закрыть();
		
	КонецПроцедуры

	Процедура ОсновныеДействияФормы_КнопкаБольшеНеНапоминать_Нажатие(Кнопка)
		
		ПриглашенияДатаНапоминания_УстановитьСледующуюДату('39990101');
		
		Закрыть();
		
	КонецПроцедуры

//} ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ И ЭЛЕМЕНТОВ


//{ СЛУЖЕБНЫЕ ФУНКЦИИ И ПРОЦЕДУРЫ

	Процедура УправлениеФормой()
		
		КартинкаЗаголовка= ЭДО_БиблиотекаКартинок().КартинкаЗаголовка;
		
		HTMLДокумент_Установить_Текст();
		
	КонецПроцедуры

	Процедура ПриглашенияДатаНапоминания_УстановитьСледующуюДату(ДатаНапоминания)
		
		ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").УстановитьПриглашенияДатаНапоминания(ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ПолучитьТаблицуЯщиковДиадокОрганизации().ВыгрузитьКолонку("Объект"), ДатаНапоминания);
		
	КонецПроцедуры

	Процедура HTMLДокумент_Установить_Текст()
		
		Если АктивацияКонтрагентов Тогда
			ТекстHTML= HTMLДокумент_Текст_АктивацияКонтрагентов();
		Иначе
			ТекстHTML= HTMLДокумент_Текст_ПоискНовыхКонтрагентов();
		КонецЕсли;
		
		ТекстHTML= СтрЗаменить(ТекстHTML, "[КраткоеНаименованиеСистемыПредложныйПадеж]", КраткоеНаименованиеСистемыПредложныйПадеж);
		ТекстHTML= СтрЗаменить(ТекстHTML, "[НаименованиеСистемы]", НаименованиеСистемы);
		
		Элементыформы.HTMLДокумент.УстановитьТекст(ТекстHTML);
		
	КонецПроцедуры

	Функция   HTMLДокумент_Текст_АктивацияКонтрагентов()
		
		Возврат
		
		"<head>
		|<style type=""text/css"">
		| h3 {
		|  margin-top: 0.5em; /* Отступ сверху */
		|  margin-bottom: 1em; /* Отступ снизу */
		| }
		| p {
		|  margin-top: 0.2em; /* Отступ сверху */
		|  margin-bottom: 0em; /* Отступ снизу */
		| }
		|</style>
		|</head>
	    |
	    |
		|<body>
		|	<h3>Добро пожаловать в [НаименованиеСистемы]!</h3>
		|	<p>Чтобы начать обмениваться электронными документами, проверьте, кто из ваших контрагентов работает в [КраткоеНаименованиеСистемыПредложныйПадеж], и отправьте им предложения к обмену.</p>
		|</body>"

	КонецФункции

	Функция   HTMLДокумент_Текст_ПоискНовыхКонтрагентов()
		
		Возврат
		
		"<head>
		|<style type=""text/css"">
		| h3 {
		|  margin-top: 0.2em; /* Отступ сверху */
		|  margin-bottom: 1em; /* Отступ снизу */
		| }
		| p {
		|  margin-top: 0.2em; /* Отступ сверху */
		|  margin-bottom: 0em; /* Отступ снизу */
		| }
		|</style>
		|</head>
	    |
	    |
		|<body>
		|	<h3>В базе данных могут быть контрагенты, которых можно пригласить к обмену электронными документами.</h3>
		|	<p>Рекомендуется найти таких контрагентов и отправить им приглашения.</p>
		|</body>"

	КонецФункции

//} СЛУЖЕБНЫЕ ФУНКЦИИ И ПРОЦЕДУРЫ