
Процедура КнопкаСформироватьНажатие(Кнопка)
	
	//проверка заполненности каталога
	Если КаталогДляПоиска.Количество()=0 Тогда
		Предупреждение("Не указан каталог для поиска изображений анфас и профиль !");
		возврат;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	КолКаталогов = 0;

	Для Каждого Стр из КаталогДляПоиска Цикл
		Если СокрЛП(Стр.ИмяКаталога) <> "" Тогда
			КолКаталогов = КолКаталогов+1;
			//проверка существования каталога
			КаталогНаДиске = Новый Файл(Стр.ИмяКаталога);
			Если НЕ КаталогНаДиске.Существует() Тогда
				сообщить("Не найден каталог для поиска изображений анфас:"+КаталогНаДиске, СтатусСообщения.Важное);
				ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если КолКаталогов = 0 Тогда
		Предупреждение("Не указан каталог для поиска изображений !");
		возврат;
	КонецЕсли;
	Если ЕстьОшибки Тогда
		Предупреждение("Необходимо исправить наименование каталога для поиска изображений!
		|Отчет не сформирован!");
	КонецЕсли;	
	Таб = ЭлементыФормы.ПолеТабличногоДокумента1;
	Таб.Очистить();
	СформироватьОтчет(Таб);
	Таб.ТолькоПросмотр = Истина;
	Таб.Показать();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если Склад.Количество()=0 Тогда
		Склад.Добавить(Справочники.Склады.НайтиПоНаименованию("ЯШТ 5000"));
		Склад.Добавить(Справочники.Склады.НайтиПоНаименованию("ЯШТ 8000"));
		Склад.Добавить(Справочники.Склады.НайтиПоНаименованию("Ангар-1"));
		Склад.Добавить(Справочники.Склады.НайтиПоНаименованию("Ангар-2"));
		Склад.Добавить(Справочники.Склады.НайтиПоНаименованию("Ангар-3"));
	КонецЕсли;
	УстановитьВидимостьИмяФайлаАналогов();
КонецПроцедуры

Процедура ОсновныеДействияФормыДействиеЗаданиеПоставщику(Кнопка)
	
	Если НЕ ТипЗнч(ТЗзаказ) = Тип("ТаблицаЗначений") Тогда
		Предупреждение("Нет данных для печати !");
		возврат;
	КонецЕсли;	
	Если ТЗзаказ.Количество() = 0 Тогда
		Предупреждение("Нет данных для печати !");
		возврат;
	КонецЕсли;
	
	Если СписокПоставщиков.Количество()=1 Тогда
		ВыбПоставщик = СписокПоставщиков[0];
	Иначе
		ВыбПоставщик = СписокПоставщиков.ВыбратьЭлемент("Выберите поставщика");
	КонецЕсли;	
		
	Если ВыбПоставщик <> Неопределено Тогда 
		ПечатьЗаданияПоставщику(ВыбПоставщик.Представление, ВыбПоставщик.Значение);
	КонецЕсли;
		
КонецПроцедуры

Процедура КаталогДляПоискаИмяКаталогаАнфасНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ТД = ЭлементыФормы.КаталогДляПоиска.ТекущаяСтрока;
	ТекИмяКаталога = СокрЛП(ТД.ИмяКаталога);
	Если СокрЛП(ТекИмяКаталога)="" Тогда
		ТекИмяКаталога = "\\Terminal\ОТДЕЛ ДИСКОВ\тексты и фото для клиентов"
	КонецЕсли;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Укажите каталог";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = ТекИмяКаталога;

	Если Диалог.Выбрать() Тогда
		ТекИмяКаталога = Диалог.Каталог;
		ТД.ИмяКаталога = ТекИмяКаталога;
	КонецЕсли;

КонецПроцедуры

Процедура КаталогДляПоискаИмяКаталогаПрофильНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ТД = ЭлементыФормы.КаталогДляПоиска.ТекущаяСтрока;
	ТекИмяКаталога = СокрЛП(ТД.ИмяКаталогаПрофиль);
	Если СокрЛП(ТекИмяКаталога)="" Тогда
		ТекИмяКаталога = "\\Terminal\ОТДЕЛ ДИСКОВ\тексты и фото для клиентов"
	КонецЕсли;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Укажите каталог";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = ТекИмяКаталога;

	Если Диалог.Выбрать() Тогда
		ТекИмяКаталога = Диалог.Каталог;
		ТД.ИмяКаталогаПрофиль = ТекИмяКаталога;
	КонецЕсли;

КонецПроцедуры

Процедура ФайлАналоговМоделейНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ТекИмяФайла = СокрЛП(ФайлАналоговМоделей);
	Если СокрЛП(ТекИмяФайла)="" Тогда
		ТекИмяФайла = "\\Terminal\ОТДЕЛ ДИСКОВ\"
	КонецЕсли;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Укажите файл";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.ПолноеИмяФайла = ТекИмяФайла;
    Диалог.Фильтр = "(*.xls)|*.xls";
	
	Если Диалог.Выбрать() Тогда
		ТекИмяФайла = Диалог.ПолноеИмяФайла;
		ФайлАналоговМоделей = ТекИмяФайла;
	КонецЕсли;

КонецПроцедуры

Процедура ПроизводительПриИзменении(Элемент)
	УстановитьВидимостьИмяФайлаАналогов();
КонецПроцедуры

Процедура УстановитьВидимостьИмяФайлаАналогов()
	Если Найти(ВРЕГ(Производитель.Наименование),"REPLICA")>0 Тогда
		ЭлементыФормы.ФайлАналоговМоделей.Видимость = Истина;
		ЭлементыФормы.НадписьФайлАналоговМоделей.Видимость = Истина;
		ЭлементыФормы.ФильтрConcept.Видимость = Истина;
	Иначе
		ЭлементыФормы.ФайлАналоговМоделей.Видимость = Ложь;
		ЭлементыФормы.НадписьФайлАналоговМоделей.Видимость = Ложь;
		ЭлементыФормы.ФильтрConcept.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры	


Процедура КоманднаяПанель1ДействиеЗаполнить(Кнопка)
	
	ТекИмяКаталога = "\\Terminal\ОТДЕЛ ДИСКОВ\тексты и фото для клиентов";
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Укажите каталог";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = ТекИмяКаталога;
	
	Если Диалог.Выбрать() Тогда
		КаталогДляПоиска.Очистить();
		ТекИмяКаталога = Диалог.Каталог;
		СписокФайлов = НайтиФайлы(ТекИмяКаталога,"*.*",Ложь);
		Для Каждого ТекФайл Из СписокФайлов Цикл
			Если ТекФайл.ЭтоКаталог() Тогда
				НовСтр = КаталогДляПоиска.Добавить();
				НовСтр.ИмяКаталога = ТекИмяКаталога+"\"+ТекФайл.Имя;
				НовСтр.Анализировать = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Найти(ВРЕГ(Производитель.Наименование),"REPLICA")>0 Тогда
			Если Найти(ВРЕГ(ТекИмяКаталога),"CONCEPT")>0 Тогда
				ФильтрConcept = Истина;
			Иначе
				ФильтрConcept = Ложь;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


Процедура ОсновныеДействияФормыДействиеПечать(Кнопка)
	
	Если НЕ ТипЗнч(ТЗзаказ) = Тип("ТаблицаЗначений") Тогда
		Предупреждение("Нет данных для печати !");
		возврат;
	КонецЕсли;	
	Если ТЗзаказ.Количество() = 0 Тогда
		Предупреждение("Нет данных для печати !");
		возврат;
	КонецЕсли;
	
	ПечатьЗаданияНаОтгрузку();
	
КонецПроцедуры


Процедура ОсновныеДействияФормыДействиеСписокАналогов(Кнопка)
	
	Если НЕ ТипЗнч(ТЗзаказ) = Тип("ТаблицаЗначений") Тогда
		Предупреждение("Нет данных для печати !");
		возврат;
	КонецЕсли;	
	Если ТЗзаказ.Количество() = 0 Тогда
		Предупреждение("Нет данных для печати !");
		возврат;
	КонецЕсли;
	
	ПечатьАналоговДляКопирования();

КонецПроцедуры

