
Процедура КнопкаСформироватьНажатие(Кнопка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыНаСкладахОстатки.Номенклатура,
	               |	ТоварыНаСкладахОстатки.КоличествоОстаток,
	               |	ЕСТЬNULL(Проверка.ТестПройден, """") КАК ТестПройден,
	               |	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаХраненияОстатков.Вес * ТоварыНаСкладахОстатки.КоличествоОстаток КАК Вес
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ПровереннаяНагрузкаДисков.Номенклатура КАК Номенклатура,
	               |			МАКСИМУМ(ПровереннаяНагрузкаДисков.ТестПройден) КАК ТестПройден,
	               |			МАКСИМУМ(ПровереннаяНагрузкаДисков.Дата) КАК Дата
	               |		ИЗ
	               |			РегистрСведений.ПровереннаяНагрузкаДисков КАК ПровереннаяНагрузкаДисков
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ПровереннаяНагрузкаДисков.Номенклатура) КАК Проверка
	               |		ПО ТоварыНаСкладахОстатки.Номенклатура = Проверка.Номенклатура";
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		СтрТовар = Товары.Добавить();
		СтрТовар.Пометка = Истина;
		СтрТовар.Номенклатура = Результат.Номенклатура;
		СтрТовар.Количество = Результат.КоличествоОстаток;
		СтрТовар.Вес = Результат.Вес;
		Если Результат.ТестПройден = "" Тогда
			СтрТовар.РезультатИспытаний = "";
		Иначе
			СтрТовар.РезультатИспытаний = ?(Результат.ТестПройден, "Тест пройден", "Тест не пройден");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Склад = Справочники.Склады.НайтиПоКоду("02332");
	
КонецПроцедуры

Процедура ПечатьАкта(Кнопка)
	
	Печать();

КонецПроцедуры

Процедура ТабличноеПоле1ПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	ОформлениеСтроки.Ячейки.Код.УстановитьТекст(ДанныеСтроки.Номенклатура.Код);
	
КонецПроцедуры
