
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПланОтгрузокКлиентов
	Движения.ПланОтгрузокКлиентов.Записывать = Истина;
	Движения.ПланОтгрузокКлиентов.Очистить();
	
	Для Каждого ТекСтрокаПланы Из Планы Цикл
		Движение = Движения.ПланОтгрузокКлиентов.Добавить();
		Движение.Период            = НачалоМесяца(Период);
		Движение.НаправлениеПродаж = НаправлениеПродаж;
		Движение.Контрагент         = ТекСтрокаПланы.Контрагент;
		Движение.ЧастотаОтгрузок    = ТекСтрокаПланы.ЧастотаОтгрузок;
		Движение.ЧастотаЗаказов     = ТекСтрокаПланы.ЧастотаЗаказов;
		Движение.ПланПродаж         = ТекСтрокаПланы.ПланПродаж;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
КонецПроцедуры
