
Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
	   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = НачПериода;
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = КонецДня(КонПериода);  	
КонецПроцедуры

Процедура НачПериодаПриИзменении(Элемент)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = НачПериода;
КонецПроцедуры

Процедура КонПериодаПриИзменении(Элемент)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = КонецДня(КонПериода);
КонецПроцедуры


Процедура ВыбПериод2Нажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода2, ?(КонПериода2='0001-01-01', КонПериода2, КонецДня(КонПериода2)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода2 = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода2 = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач2");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = НачПериода2;
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон2");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = КонецДня(КонПериода2);  	
КонецПроцедуры

Процедура НачПериода2ПриИзменении(Элемент)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач2");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = НачПериода2;
КонецПроцедуры

Процедура КонПериода2ПриИзменении(Элемент)
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон2");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = КонецДня(КонПериода2);
КонецПроцедуры

// Смена варината отчета
Процедура _СменаВариантаНастройки (Элемент)

	НастройкиОтбор.ЗагрузитьНастройки(КомпоновщикНастроек.Настройки);
	
	Для каждого Настройка Из СхемаКомпоновкиДанных.ВариантыНастроек Цикл

		Если Элемент.Текст = Настройка.Представление тогда
			
			КомпоновщикНастроек.ЗагрузитьНастройки(Настройка.Настройки);

			КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
			Для каждого СтрокаОтбора из НастройкиОтбор.Настройки.Отбор.Элементы Цикл
				НовЭл = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип(СтрокаОтбора)); 
				НовЭл.ВидСравнения = СтрокаОтбора.ВидСравнения;
				НовЭл.ИдентификаторПользовательскойНастройки = СтрокаОтбора.ИдентификаторПользовательскойНастройки;
				НовЭл.Использование = СтрокаОтбора.Использование;
				НовЭл.ЛевоеЗначение = СтрокаОтбора.ЛевоеЗначение;
				НовЭл.ПравоеЗначение = СтрокаОтбора.ПравоеЗначение;
				НовЭл.Представление = СтрокаОтбора.Представление;
				НовЭл.ПредставлениеПользовательскойНастройки = СтрокаОтбора.ПредставлениеПользовательскойНастройки;
				НовЭл.Применение = СтрокаОтбора.Применение;
				НовЭл.РежимОтображения = СтрокаОтбора.РежимОтображения;
			КонецЦикла;
			
		Прервать;

		КонецЕсли;

	КонецЦикла;
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач");
    ПараметрСКД.Использование = Истина;
    ПараметрСКД.Значение  = НачПериода;
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон");
    ПараметрСКД.Использование = Истина;
    ПараметрСКД.Значение  = КонецДня(КонПериода);
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач2");
    ПараметрСКД.Использование = Истина;
    ПараметрСКД.Значение  = НачПериода2;
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон2");
    ПараметрСКД.Использование = Истина;
    ПараметрСКД.Значение  = КонецДня(КонПериода2);
КонецПроцедуры

Процедура УстановитьВариантыНастроек()

	КП = ЭлементыФормы.ДействияФормы; 
	Разделитель = КП.Кнопки.Вставить(1,,ТипКнопкиКоманднойПанели.Разделитель);	
	НоваяКнопка = КП.Кнопки.Вставить(2,"_ВариантыОтчетов", ТипКнопкиКоманднойПанели.Подменю, "Варианты отчетов", ); НовоеДействие = Новый Действие("_СменаВариантаНастройки"); ч = 1;

	Для каждого Настройка Из СхемаКомпоновкиДанных.ВариантыНастроек Цикл

		НоваяКнопка = КП.Кнопки._ВариантыОтчетов.Кнопки.Добавить("Вариант"+Строка(ч), ТипКнопкиКоманднойПанели.Действие, Настройка.Представление, НовоеДействие); ч = ч + 1;

	КонецЦикла;

КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	УстановитьВариантыНастроек();
	
	НачПериода2 = НачалоМесяца( ТекущаяДата() );	
	КонПериода2 = КонецМесяца( НачПериода2 );	
	НачПериода = ДобавитьМесяц( НачПериода2,-12 );	
	КонПериода = КонецМесяца( НачПериода );	

   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = НачПериода;
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = КонецДня(КонПериода);
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач2");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = НачПериода2;
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон2");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = КонецДня(КонПериода2);
   
   мУстановитьОтборДляФилиалов();//сразу все отборы!
КонецПроцедуры
