
Процедура ПриОткрытии()
   ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПочтовыйАдресКонтрагента");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("00015");

КонецПроцедуры

Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
		    ЭлементРасшифровкиДанных = ДанныеРасшифровки.Элементы[Расшифровка];
			ЭлементРасшифровкиДанныхПоля = ЭлементРасшифровкиДанных.ПолучитьПоля()[0];
		Если ЭлементРасшифровкиДанныхПоля.Поле="Контрагент" или ЭлементРасшифровкиДанныхПоля.Поле="Вид" Тогда	
				СтандартнаяОбработка = Ложь;
				Если ЭлементРасшифровкиДанныхПоля.Поле="Контрагент" Тогда
					Контрагент = ЭлементРасшифровкиДанныхПоля.значение;
				    ЭлементыСоседние = ДанныеРасшифровки.Элементы[Расшифровка-1];
			        Элемент = ЭлементыСоседние.ПолучитьПоля()[0];
                    ВидАдреса = Элемент.Значение;
				иначе	
					ВидАдреса = ЭлементРасшифровкиДанныхПоля.значение;
				    ЭлементыСоседние = ДанныеРасшифровки.Элементы[Расшифровка+1];
			        Элемент = ЭлементыСоседние.ПолучитьПоля()[0];
                    Контрагент = Элемент.Значение;
				конецЕсли;
				РегКИ1=РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
				РегКИ1.Объект = Контрагент;
				РегКИ1.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
				РегКИ1.Вид=ВидАдреса;
				РегКИ1.Прочитать();
				
				Обработки.РедактированиеКонтактнойИнформации.Создать().РедактироватьЗапись(РегКИ1,Истина, ЭтаФорма);

        конецЕсли;
КонецПроцедуры
