Функция Печать() Экспорт

	ДатаОтпуска = ТекущаяДата();	

	//ВвестиДату(ДатаОтпуска, "Введите дату отгрузки", ЧастиДаты.Дата);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Дата,
	|	Номер,
	|   Организация,
	|	Контрагент,
	|   Ответственный
	|ИЗ 
	|	Документ.РеализацияТоваровУслуг КАК Документ
	|ГДЕ
	|   Документ.Ссылка = &ТекущийДокумент";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ПустойСклад", Справочники.Склады.ПустаяСсылка());
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Склад
	|ИЗ
	|   Документ.РеализацияТоваровУслуг.Товары КАК Документ
	|ГДЕ
	|   Документ.Ссылка = &ТекущийДокумент //И Склад <> &ПустойСклад
	|";
	
	Склады = Запрос.Выполнить().Выбрать();
	
	ТабДокумент  = Новый ТабличныйДокумент;
	
	//ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_ТОРГ12";

	Макет = ПолучитьМакет("MX6");

	
	Пока Склады.Следующий() Цикл
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийСклад", Склады.Склад);
		Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
		//Запрос.УстановитьПараметр("ПустойСклад", Справочники.Склады.ПустаяСсылка());
		//Запрос.УстановитьПараметр("СкладШапки", Шапка.Склад);
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Номенклатура,
		|   ЕдиницаИзмерения,
		|   Количество,
		|   Цена,
		|   Склад,
		|   Сумма
		|ИЗ
		|   Документ.РеализацияТоваровУслуг.Товары КАК Документ
		|ГДЕ
		|   Документ.Ссылка = &ТекущийДокумент И Склад = &ТекущийСклад
		|ИТОГИ
		|	СУММА(Количество), СУММА(Сумма) ПО Общие
		|";
		

		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		//ОбластьМакета.Параметры.Заполнить(Шапка);
		//ОбластьМакета.Параметры.НомерДокумента = ПолучитьНомерНаПечать(Шапка);
		ОбластьМакета.Параметры.ПериодНачало  	= Формат(Шапка.Дата, "ДФ=""дд ММММ гггг 'г.'""");
		ОбластьМакета.Параметры.ПериодКонец  	= Формат(Шапка.Дата, "ДФ=""дд ММММ гггг 'г.'""");
		ОбластьМакета.Параметры.Организация  	= Шапка.Организация;
		ОбластьМакета.Параметры.Ответственный  	= Шапка.Ответственный;
		ОбластьМакета.Параметры.Склад			= ?(Склады.Склад = Справочники.Склады.ПустаяСсылка(), Шапка.Склад, Склады.Склад);
		ТабДокумент.Вывести(ОбластьМакета);
		
		Сч = 1;
		
		ТабЧасть = Запрос.Выполнить().Выбрать();
		Пока ТабЧасть.Следующий() Цикл
			
			Если ТабЧасть.ТипЗаписи() = ТипЗаписиЗапроса.ОбщийИтог Тогда
				ОбщаяСумма = ТабЧасть.Сумма;
				ОбщееКолВо = ТабЧасть.Количество;
			Иначе
				ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
				ОбластьСтроки.Параметры.Ном = Сч;
				ОбластьСтроки.Параметры.ДатаОтпуска = Формат(ДатаОтпуска, "ДФ=""дд.ММ.гг""");//Формат(Шапка.Дата, "ДФ=""дд.мм.гг""");
				ОбластьСтроки.Параметры.ДокНом = Шапка.Номер;
				ОбластьСтроки.Параметры.ДокДата = Формат(Шапка.Дата, "ДФ=""дд.ММ.гг""");
				ОбластьСтроки.Параметры.Склад = Шапка.Контрагент;//ТабЧасть.Склад;
				ОбластьСтроки.Параметры.Номенклатура = ТабЧасть.Номенклатура;
				ОбластьСтроки.Параметры.ЕдИзм = ТабЧасть.ЕдиницаИзмерения;
				ОбластьСтроки.Параметры.Цена = ФорматСумм(ТабЧасть.Цена);
				ОбластьСтроки.Параметры.Количество = ТабЧасть.Количество;
				ОбластьСтроки.Параметры.Сумма = ФорматСумм(ТабЧасть.Сумма);
				ТабДокумент.Вывести(ОбластьСтроки);
				Сч = Сч + 1;
			КонецЕсли;
			
			
			
		КонецЦикла;
		
		ОбластьИтоги = Макет.ПолучитьОбласть("Итог");
		ОбластьИтоги.Параметры.КолСумма = ОбщееКолВо;
		ОбластьИтоги.Параметры.СуммаСумма = ФорматСумм(ОбщаяСумма);
		ТабДокумент.Вывести(ОбластьИтоги);
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("Подвал"));
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции