
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Если ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница1" Тогда 		
		
		Для каждого стр из Контрагенты Цикл
			Если стр.Отметка = Истина Тогда
				НаборСвойств = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				НаборСвойств.Объект=стр.Контрагент;
				НаборСвойств.Свойство=ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90218");
				Если ЭлементыФормы.ПолеВыбора1.Значение = "Закрылись" тогда
					НаборСвойств.Значение = Перечисления.КатегорииКонтрагентов.Закрылись;
				ИначеЕсли ЭлементыФормы.ПолеВыбора1.Значение = "ВременноНеРаботаем" тогда
					НаборСвойств.Значение = Перечисления.КатегорииКонтрагентов.ВременноНеРаботаем;
				ИначеЕсли ЭлементыФормы.ПолеВыбора1.Значение = "Разобраться" тогда
					НаборСвойств.Значение = Перечисления.КатегорииКонтрагентов.Разобраться;
				ИначеЕсли ЭлементыФормы.ПолеВыбора1.Значение = "Потенциальные" тогда
					НаборСвойств.Значение = Перечисления.КатегорииКонтрагентов.Потенциальные;
				КонецЕсли;
				НаборСвойств.Записать(Истина);
			конецЕсли;
		КонецЦикла;
	ИначеЕсли ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница2" Тогда 
		Если не    ЗаменитьПервичногоКонтрагента тогда
			Для каждого стр из Контрагенты Цикл
				Если стр.отметка тогда	
					Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
					Запись.Объект = стр.Контрагент;
					Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90230");
					Запись.Значение = ПервичныйКонтрагент;
					Запись.Записать(Истина);
				конецЕсли;
			конецЦикла;
		иначе
			Для каждого стр из Контрагенты Цикл
				Если стр.отметка тогда	
					Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
					Запись.Объект = стр.Контрагент;
					Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90230");
					Запись.Значение = НовыйПервичныйКонтрагент;
					Запись.Записать(Истина);
				конецЕсли;
			конецЦикла;
			
		конецЕсли;	
	ИначеЕсли ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница3" Тогда 
		Значение=ЭлементыФормы.Заводы.Область("R1C1").Текст;
		номерСтроки=1;
		Пока Значение <>"" цикл
			попытка
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Значение);
				Если Номенклатура <> Справочники.Номенклатура.ПустаяСсылка()  тогда
					Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
					Запись.Объект = Номенклатура;
					Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90185");
					Запись.Значение = ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C2").Текст;
					Запись.Записать(Истина);
					
					Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
					Запись.Объект = Номенклатура;
					Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90249");
					Запись.Значение = ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C3").Текст;
					Запись.Записать(Истина);
					
				иначе
					Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена!");
				конецЕсли;
			исключение	
				Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена!");
			конецПопытки;
			номерСтроки=номерСтроки+1; 
			Значение=ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C1").Текст;
		конецЦикла;	
	ИначеЕсли ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница4" Тогда 
		Значение=ЭлементыФормы.Заводы.Область("R1C1").Текст;
		номерСтроки=1;
		Пока Значение <>"" цикл
			попытка
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Значение);
				Если Номенклатура <> Справочники.Номенклатура.ПустаяСсылка()  тогда
					Запись = РегистрыСведений.СезонныйАссортимент.СоздатьМенеджерЗаписи();
					Запись.Номенклатура = Номенклатура;
					Запись.Записать(Истина);
				иначе
					Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена!");
				конецЕсли;
			исключение	
				Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена!");
			конецПопытки;
			номерСтроки=номерСтроки+1; 
			Значение=ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C1").Текст;
			
		конецЦикла;	
	ИначеЕсли ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница5" Тогда 
		Если Не ЗначениеЗаполнено(ДатаЦен) Тогда
			Сообщить("Не заполнена дата цен!");
			возврат;
		конецЕсли;	
		Значение=ЭлементыФормы.Заводы.Область("R1C1").Текст;
		номерСтроки=1;
		Пока Значение <>"" цикл
			попытка
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Значение);
				Если Номенклатура <> Справочники.Номенклатура.ПустаяСсылка()  тогда
					Запись = РегистрыСведений.ЦеныФОП.СоздатьМенеджерЗаписи();
					Запись.Период  = ДатаЦен;
					Запись.Номенклатура = Номенклатура;
					Запись.Цена = Число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C2").Текст);
					Запись.Записать(Истина);
				иначе
					Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена или не правильная цена!");
				конецЕсли;
			исключение	
				Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена или не правильная цена!");
			конецПопытки;
			номерСтроки=номерСтроки+1; 
			Значение=ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C1").Текст;
		конецЦикла;	
	ИначеЕсли ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница6" Тогда 
		
		
		Значение=ЭлементыФормы.Заводы.Область("R2C1").Текст;
		номерСтроки=2;
		Пока Значение <>"" цикл
			попытка
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Значение);
				Если Номенклатура <> Справочники.Номенклатура.ПустаяСсылка()  тогда
					Запись = РегистрыСведений.ЦенообразованиеФОБ.СоздатьМенеджерЗаписи();
					Запись.Номенклатура = Номенклатура;
					Запись.БазоваяЦена = число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C2").Текст);
					Запись.ЦенаСоСкидкой = число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C3").Текст);
					попытка
						Запись.КрепежКоличество = Число(Запись.номенклатура.типоразмер.КоличествоОтверстий);
					исключение
						Запись.КрепежКоличество = 0 ;
					конецПопытки;
					
					попытка
						Запись.Lug = Справочники.Номенклатура.НайтиПоКоду(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C4").Текст);
					исключение
					конецПопытки;
					попытка
						Запись.Undercut = число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C5").Текст);
					исключение
					конецПопытки;
					попытка
						
						Запись.Polish = число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C6").Текст);
					исключение
					конецПопытки;
					попытка
						
						Запись.DoudleColor = число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C7").Текст);
					исключение
					конецПопытки;
					попытка
						
						Запись.Stripe = число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C8").Текст);
					исключение
					конецПопытки;
					попытка
						
						Запись.Rivets = число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C9").Текст);
					исключение
					конецПопытки;
					попытка
						
						Запись.Milling = число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C10").Текст);
					исключение
					конецПопытки;
					попытка
						
						Запись.PlastiicInserts = число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C11").Текст);
					исключение
					конецПопытки;
					попытка
						
						Запись.SSLip = число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C12").Текст);
					исключение
					конецПопытки;
					попытка
						
						Запись.MaxLoadPrice = число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C13").Текст);
					исключение
					конецПопытки;
					попытка
						
						Запись.Width = число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C14").Текст);
					исключение
					конецПопытки;
					попытка
						
						Запись.ECounting = число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C15").Текст);
					исключение
					конецПопытки;
					попытка
						
						Запись.BigCap = число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C16").Текст);
					исключение
					конецПопытки;
					попытка
						
						Запись.Factory = ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C17").Текст;
					исключение
					конецПопытки;
					попытка
						
						Запись.LugName = ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C18").Текст;
					исключение
					конецПопытки;
					попытка
						
						
						Запись.Вес = число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C19").Текст);
					исключение
					конецПопытки;
					попытка
						
						Запись.LugCount = число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C20").Текст);
					исключение
					конецПопытки;
					попытка
						
						Запись.РасчетнаяЦенаФОБ = число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C21").Текст);
					исключение
					конецПопытки;
					
					Запись.Записать(Истина);
				иначе
					Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена или не правильная цена!");
				конецЕсли;
			исключение	
				Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена или не правильная цена!");
			конецПопытки;
			номерСтроки=номерСтроки+1; 
			Значение=ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C1").Текст;
		конецЦикла;	
		
	ИначеЕсли ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница7" Тогда
		Для каждого стр из СписокК Цикл
			Если стр.Отметка = Истина Тогда
				
				НаборСвойств = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				НаборСвойств.Объект=стр.Контрагент;
				НаборСвойств.Свойство=ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90247");
				НаборСвойств.Значение = ?(стр.ДоляИМ> 100, 100,стр.ДоляИМ);
				НаборСвойств.Записать(Истина);
				
				НаборСвойств = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				НаборСвойств.Объект=стр.Контрагент;
				НаборСвойств.Свойство=ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90184");
				НаборСвойств.Значение = ?(Стр.важность> 4, 4,Стр.важность);
				НаборСвойств.Записать(Истина);
				
				НаборСвойств = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
				НаборСвойств.Объект=стр.Контрагент;
				НаборСвойств.Тип=Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
				НаборСвойств.Вид=Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("00018");
				НаборСвойств.Представление = Стр.Сайт;
				НаборСвойств.Записать(Истина);
				
				Кл = Стр.Контрагент.ПолучитьОбъект();
				Кл.ЯШТИнтернет = Стр.Интернет;
				Кл.Записать();
				
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница8" Тогда 
		Значение=ЭлементыФормы.Заводы.Область("R1C1").Текст;
		номерСтроки=1;
		Пока Значение <>"" цикл
			попытка
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Значение);
				контрагент = Справочники.Контрагенты.НайтиПоКоду(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C2").Текст);
				Если Номенклатура <> Справочники.Номенклатура.ПустаяСсылка()  тогда
					Запись = РегистрыСведений.СезонныйАссортиментЭкспорт.СоздатьМенеджерЗаписи();
					Запись.Номенклатура = Номенклатура;
					Запись.Контрагент =контрагент;
					Запись.Записать(Истина);
				иначе
					Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена!");
				конецЕсли;
			исключение	
				Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена!");
			конецПопытки;
			номерСтроки=номерСтроки+1; 
			Значение=ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C1").Текст;
			
		конецЦикла;	
	ИначеЕсли ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница9" Тогда 
		Значение=ЭлементыФормы.Заводы.Область("R1C1").Текст;
		номерСтроки=1;
		Пока Значение <>"" цикл
			попытка
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Значение);
				контрагент = Справочники.Контрагенты.НайтиПоКоду(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C2").Текст);
				Если Номенклатура <> Справочники.Номенклатура.ПустаяСсылка()  тогда
					Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
					Запись.Объект = Номенклатура;
					Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90205");
					Запись.Значение = ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C2").Текст;
					Запись.Записать(Истина);
				иначе
					Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена!");
				конецЕсли;
			исключение	
				Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена!");
			конецПопытки;
			номерСтроки=номерСтроки+1; 
			Значение=ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C1").Текст;
			
		конецЦикла;	
	ИначеЕсли ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница10" Тогда 
		Значение=ЭлементыФормы.Заводы.Область("R1C1").Текст;
		номерСтроки=1;
		Пока Значение <>"" цикл
			попытка
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Значение);
				контрагент = Справочники.Контрагенты.НайтиПоКоду(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C2").Текст);
				Если Номенклатура <> Справочники.Номенклатура.ПустаяСсылка()  тогда
					Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
					Запись.Объект = Номенклатура;
					Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90250");
					Запись.Значение = ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C2").Текст;
					Запись.Записать(Истина);
				иначе
					Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена!");
				конецЕсли;
			исключение	
				Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена!");
			конецПопытки;
			номерСтроки=номерСтроки+1; 
			Значение=ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C1").Текст;
			
		конецЦикла;	
	ИначеЕсли ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница11" Тогда 
		Если Не ЗначениеЗаполнено(ДатаЦенЭкспорт) Тогда
			Сообщить("Не заполнена дата цен!");
			возврат;
		конецЕсли;	
		Значение=ЭлементыФормы.Заводы.Область("R1C1").Текст;
		номерСтроки=1;
		Пока Значение <>"" цикл
			попытка
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Значение);
				Если Номенклатура <> Справочники.Номенклатура.ПустаяСсылка()  тогда
					Запись = РегистрыСведений.ЦеныФопЭкспорт.СоздатьМенеджерЗаписи();
					Запись.Период  = ДатаЦенЭкспорт;
					Запись.Номенклатура = Номенклатура;
					Запись.Цена = Число(ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C2").Текст);
					Запись.Записать(Истина);
				иначе
					Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена или не правильная цена!");
				конецЕсли;
			исключение	
				Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена или не правильная цена!");
			конецПопытки;
			номерСтроки=номерСтроки+1; 
			Значение=ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C1").Текст;
		конецЦикла;
    ИначеЕсли ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница12" Тогда 
		Значение=ЭлементыФормы.Заводы.Область("R2C1").Текст;
		номерСтроки=2;
		Пока Значение <>"" цикл
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Значение);
				Если Номенклатура <> Справочники.Номенклатура.ПустаяСсылка()  тогда
					Нашли = РегистрыСведений.ЦенообразованиеФОБ.Получить(Новый структура("Номенклатура",Номенклатура));
					Запись = РегистрыСведений.ЦенообразованиеФОБ.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(Запись,нашли);
					Запись.Номенклатура = Номенклатура;
					Запись.КодПоставщика = ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C2").Текст;
					Запись.Записать(Истина);
				конецЕсли;	
			номерСтроки=номерСтроки+1; 
			Значение=ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C1").Текст;
		конецЦикла;
		
		
		
		
		
		//18.09.17 Смирнов	
		
	ИначеЕсли ЭлементыФормы.Панель1.ТекущаяСтраница = ЭлементыФормы.Панель1.Страницы.Маркировка Тогда	
		Значение=ЭлементыФормы.Заводы.Область("R1C1").Текст;
		номерСтроки=1; строкИзменено = 0;
		СвойствоПроверен = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90255"); //ПроверенОстаток (нагрузка)
		Пока Значение <>"" цикл
			попытка
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Значение);
				
				Если Номенклатура <> Справочники.Номенклатура.ПустаяСсылка()  тогда
					Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
					Запись.Объект = Номенклатура;
					Запись.Свойство = СвойствоПроверен;
					Запись.Значение = истина;
					Запись.Записать(Истина);
					
					//удалим номенклатуру из РС
					Набор = РегистрыСведений.НоменклатураИмпорт.СоздатьНаборЗаписей();
					Набор.Отбор.номенклатура.Установить(Номенклатура);
					Набор.Записать();
					строкИзменено = строкИзменено + 1;
				иначе
					Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена!");
				конецЕсли;
			исключение	
				Сообщить("По коду в строке "+номерСтроки+" номенклатура не найдена!");
			конецПопытки;
			номерСтроки=номерСтроки+1; 
			Значение=ЭлементыФормы.Заводы.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C1").Текст;
			
		конецЦикла;
		
		//+++( 13.08.2018 - перезалить черный список
		Если строкИзменено > 0 тогда
			яштПоставщики.ЗагрузитьОстаткиЧерныйСписок();
			сообщить("--- Изменены остатки стороннего поставщика для Черного списка ---");
			
			яштПоставщики.ПроверкаЗаказовЧерныйСписок();
			сообщить("--- Изменены Заказы по Черному списку ---");
		КонецЕсли;
		//+++)
		
	конецЕсли;
КонецПроцедуры


Процедура Панель1ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница3" 
		или ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница4" 
		или ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница5" 
		или ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница6" 
		или ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница8" 
		или ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница9" 
		или ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница10" 
		или ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница11" 
		или ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница12" 
		или ЭлементыФормы.Панель1.ТекущаяСтраница = ЭлементыФормы.Панель1.Страницы.Маркировка Тогда
		ЭлементыФормы.Заводы.Очистить();
		ЭлементыФормы.Заводы.Видимость = Истина;
	иначе
		ЭлементыФормы.Заводы.Видимость = Ложь;
	конецЕсли;
	Если ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница6" Тогда 
		ЭлементыФормы.Заводы.Область("R1C1").Текст = "Код";
		ЭлементыФормы.Заводы.Область("R1C2").Текст = "БазоваяЦена";
		ЭлементыФормы.Заводы.Область("R1C3").Текст = "ЦенаСоСкидкой";
		ЭлементыФормы.Заводы.Область("R1C4").Текст = "Lug";
		ЭлементыФормы.Заводы.Область("R1C5").Текст = "Undercut";
		ЭлементыФормы.Заводы.Область("R1C6").Текст = "Polish";
		ЭлементыФормы.Заводы.Область("R1C7").Текст = "DoudleColor";
		ЭлементыФормы.Заводы.Область("R1C8").Текст = "Stripe";
		ЭлементыФормы.Заводы.Область("R1C9").Текст = "Rivets";
		ЭлементыФормы.Заводы.Область("R1C10").Текст = "Milling";
		ЭлементыФормы.Заводы.Область("R1C11").Текст = "PlastiicInserts";
		ЭлементыФормы.Заводы.Область("R1C12").Текст = "SSLip";
		ЭлементыФормы.Заводы.Область("R1C13").Текст = "MaxLoadPrice";
		ЭлементыФормы.Заводы.Область("R1C14").Текст = "Width";
		ЭлементыФормы.Заводы.Область("R1C15").Текст = "ECounting";
		ЭлементыФормы.Заводы.Область("R1C16").Текст = "BigCap";
		ЭлементыФормы.Заводы.Область("R1C17").Текст = "Factory";
		ЭлементыФормы.Заводы.Область("R1C18").Текст = "LugName";
		ЭлементыФормы.Заводы.Область("R1C19").Текст = "Вес";
		ЭлементыФормы.Заводы.Область("R1C20").Текст = "LugCount";
		ЭлементыФормы.Заводы.Область("R1C21").Текст = "РасчетнаяЦенаФоб";

	конецЕсли;
		Если ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница12" Тогда 
		ЭлементыФормы.Заводы.Область("R1C1").Текст = "Код";
		ЭлементыФормы.Заводы.Область("R1C2").Текст = "КодПоставщика";
	конецЕсли;

	Если ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница7" Тогда
		ЭлементыФормы.Контрагенты1.Видимость = Истина;
		Если ПараметрыСеанса.ТекущийПользователь <> Справочники.Пользователи.НайтиПоКоду("Серков") Тогда
			Менеджер = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		НачПериода = НачалоГода(НачалоГода(НачалоГода(ТекущаяДата())-1)-1);	
		КонПериода = ТекущаяДата();	
		ЭлементыФормы.КоманднаяПанель3.Видимость = Истина;
	иначе
		ЭлементыФормы.Контрагенты1.Видимость = Ложь;
		ЭлементыФормы.КоманднаяПанель3.Видимость = ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ПредварительноВсеОчиститьНажатие(Элемент)
	НаборЗаписей = РегистрыСведений.СезонныйАссортимент.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ПриОткрытии()
	ЭлементыФормы.Контрагенты1.Видимость = ЛОЖЬ;
	ЭлементыФормы.КоманднаяПанель3.Видимость = Ложь;
	Если глТекущийпользователь.НаправлениеПродаж <> Справочники.НаправленияПродаж.Диски и глТекущийпользователь.НаправлениеПродаж <> Справочники.НаправленияПродаж.ПустаяСсылка() Тогда
	ЭлементыФормы.Панель1.Страницы.Страница3.Доступность = Ложь;
	ЭлементыФормы.Панель1.Страницы.Страница4.Доступность = Ложь;
	ЭлементыФормы.Панель1.Страницы.Страница5.Доступность = Ложь;
	ЭлементыФормы.Панель1.Страницы.Страница6.Доступность = Ложь;
	ЭлементыФормы.Панель1.Страницы.Страница8.Доступность = Ложь;
	ЭлементыФормы.Панель1.Страницы.Страница9.Доступность = Ложь;
	ЭлементыФормы.Панель1.Страницы.Страница10.Доступность = Ложь;
	ЭлементыФормы.Панель1.Страницы.Страница11.Доступность = Ложь;
	ЭлементыФормы.Панель1.Страницы.Страница12.Доступность = Ложь;

    конецЕсли;

КонецПроцедуры

Процедура ПосмотретьСписокНажатие(Элемент)
	ФормаСписка = РегистрыСведений.СезонныйАссортимент.ПолучитьФорму("ФормаСписка");
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура КоманднаяПанель2Заполнить(Кнопка)
	Если ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница1" Тогда 

	Список = Новый списокЗначений;
	Список.Добавить(Перечисления.КатегорииКонтрагентов.Потенциальные);
	Список.Добавить(Перечисления.КатегорииКонтрагентов.ВРазработке);
	Список.Добавить(Перечисления.КатегорииКонтрагентов.ПерваяПродажа);
	Список.Добавить(Перечисления.КатегорииКонтрагентов.Работающие);
	Список.Добавить(Перечисления.КатегорииКонтрагентов.НеРаботающиеБольшеГода);
	Список.Добавить(Перечисления.КатегорииКонтрагентов.Закрылись);
	Список.Добавить(Перечисления.КатегорииКонтрагентов.ВременноНеРаботаем);
	Список.Добавить(Перечисления.КатегорииКонтрагентов.Разобраться);
	
	текКатегория = Список.ВыбратьЭлемент("Выберите категорию контрагентов для заполнения");
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект,
		|	ЗначенияСвойствОбъектов.Значение
		|ПОМЕСТИТЬ Категории
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &Свойство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент,
		|	ЛОЖЬ КАК Отметка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Категории КАК Категории
		|		ПО Контрагенты.Ссылка = Категории.Объект
		|ГДЕ
		|	99 = 99
		|	И 97 = 97
		|	И 98 = 98";

	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90218"));
	списокДиректоров = Новый СписокЗначений;
	СписокДиректоров.Добавить(Справочники.Пользователи.НайтиПоКоду("Красюк Н.В."));
	СписокДиректоров.Добавить(Справочники.Пользователи.НайтиПоКоду("Красюк Н.В.(руководитель)"));
	СписокДиректоров.Добавить(Справочники.Пользователи.НайтиПоКоду("Лигута А.С."));
	СписокДиректоров.Добавить(Справочники.Пользователи.НайтиПоКоду("Лигута А.С.(руководитель)"));
    Если ЗначениеЗаполнено(глТекущийпользователь.НаправлениеПродаж) и  списокДиректоров.НайтиПоЗначению(глТекущийПользователь)=неопределено Тогда
	Запрос.Текст=СтрЗаменить(Запрос.Текст,"99 = 99","Контрагенты.ОсновнойМенеджерКонтрагента = &ОсновнойМенеджерКонтрагента");
	 Запрос.УстановитьПараметр("ОсновнойМенеджерКонтрагента",глТекущийПользователь);
	конецЕсли;	
    Если не списокДиректоров.НайтиПоЗначению(глТекущийПользователь)=неопределено Тогда
	Запрос.Текст=СтрЗаменить(Запрос.Текст,"97 = 97","Контрагенты.ОсновнойМенеджерКонтрагента.НаправлениеПродаж = &НаправлениеПродаж");
	 Запрос.УстановитьПараметр("НаправлениеПродаж",глТекущийПользователь.направлениеПродаж);
	
	конецЕсли;
	Если текКатегория  <> неопределено Тогда
	Запрос.Текст=СтрЗаменить(Запрос.Текст,"98 = 98"," Категории.Значение = &Значение");	
	Запрос.УстановитьПараметр("Значение",текКатегория.Значение);
    конецЕсли;	
	иначеЕсли ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница2" Тогда 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект КАК Контрагент,
		|	ИСТИНА КАК Отметка
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &Свойство
		|	И ЗначенияСвойствОбъектов.Значение = &Значение";

	Запрос.УстановитьПараметр("Значение", ПервичныйКонтрагент);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90230"));
		
	конецЕсли;	
	Контрагенты.Загрузить(Запрос.Выполнить().Выгрузить());

	
	
КонецПроцедуры

Процедура КонтрагентыВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
КонецПроцедуры

Процедура КонтрагентыПередНачаломДобавления(Элемент, Отказ, Копирование)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура КонтрагентыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НоваяСтрока Тогда
		стр = ЭлементыФормы.Контрагенты.ТекущиеДанные;
		стр.Отметка = Истина;	
	конецЕсли;
КонецПроцедуры

Процедура ПосмотретьНажатие(Элемент)
	ФормаСписка = РегистрыСведений.ЦеныФОП.ПолучитьФормуСписка();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ЗаменитьПервичногоКонтрагентаПриИзменении(Элемент)
	ЭлементыФормы.НадписьНовыйПервичныйКонтрагент.Видимость = ЗаменитьПервичногоКонтрагента;
	ЭлементыФормы.НовыйПервичныйКонтрагент.Видимость = ЗаменитьПервичногоКонтрагента;
	если не ЗаменитьПервичногоКонтрагента тогда
		НовыйПервичныйКонтрагент = Справочники.Контрагенты.ПустаяСсылка();	
	конецЕсли;
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

Процедура Кнопка1Нажатие(Элемент)
	
	
КонецПроцедуры

Процедура Контрагенты1ПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
				
	Если Не ЗначениеЗаполнено(ЭлементыФормы.Контрагенты1.ТекущиеДанные.Важность) Тогда			
			Предупреждение("Проставте ""Важность""!");
		    Отказ = Истина;
	ИначеЕсли ЭлементыФормы.Контрагенты1.ТекущиеДанные.Интернет = Истина тогда
			ЭлементыФормы.Контрагенты1.ТекущиеДанные.Отметка = Ложь;
		Если  ЭлементыФормы.Контрагенты1.ТекущиеДанные.ДоляИМ = 0 ИЛИ
 			Не ЗначениеЗаполнено(ЭлементыФормы.Контрагенты1.ТекущиеДанные.Сайт) Тогда
			Предупреждение("Если заполнено поле Интернет Должны быть заполнены Поля ""Доля интернет магазина"" и ""Сайт""!");
			Отказ = Истина;
		Иначе
			ЭлементыФормы.Контрагенты1.ТекущиеДанные.Отметка = Истина;
		КонецЕсли;
	Иначе
			ЭлементыФормы.Контрагенты1.ТекущиеДанные.Отметка = Истина;
	КонецЕсли;
		
КонецПроцедуры

Процедура Контрагенты1ДоляИМПриИзменении(Элемент)
	Если  ЭлементыФормы.Контрагенты1.ТекущиеДанные.ДоляИМ > 0  Тогда
		ЭлементыФормы.Контрагенты1.ТекущиеДанные.Интернет = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура Контрагенты1СайтПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ЭлементыФормы.Контрагенты1.ТекущиеДанные.Сайт)  Тогда
		ЭлементыФормы.Контрагенты1.ТекущиеДанные.Интернет = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура КоманднаяПанель3Заполнить(Кнопка)
	
	Если ЭлементыФормы.Панель1.ТекущаяСтраница.Имя = "Страница7" Тогда 		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажиОбороты.ДоговорКонтрагента.Владелец.Ссылка,
		|	СУММА(ПродажиОбороты.СтоимостьОборот) КАК СтоимостьОборот
		|ПОМЕСТИТЬ Обороты
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НАЧ, &КОН, Авто, ) КАК ПродажиОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.ДоговорКонтрагента.Владелец.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект,
		|	ЗначенияСвойствОбъектов.Значение
		|ПОМЕСТИТЬ Процент
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект В
		|			(ВЫБРАТЬ
		|				Контрагенты.Ссылка
		|			ИЗ
		|				Справочник.Контрагенты КАК Контрагенты
		|			ГДЕ
		|				Контрагенты.ПометкаУдаления = ЛОЖЬ)
		|	И ЗначенияСвойствОбъектов.Свойство.Код = ""90247""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление,
		|	КонтактнаяИнформация.Объект
		|ПОМЕСТИТЬ Сайт
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект В
		|			(ВЫБРАТЬ
		|				Контрагенты.Ссылка
		|			ИЗ
		|				Справочник.Контрагенты КАК Контрагенты
		|			ГДЕ
		|				Контрагенты.ПометкаУдаления = ЛОЖЬ)
		|	И КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Вид.Код = ""00018""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект,
		|	ЗначенияСвойствОбъектов.Значение
		|ПОМЕСТИТЬ Важность
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект В
		|			(ВЫБРАТЬ
		|				Контрагенты.Ссылка
		|			ИЗ
		|				Справочник.Контрагенты КАК Контрагенты
		|			ГДЕ
		|				Контрагенты.ПометкаУдаления = ЛОЖЬ)
		|	И ЗначенияСвойствОбъектов.Свойство.Код = ""90184""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект,
		|	ЗначенияСвойствОбъектов.Значение
		|ПОМЕСТИТЬ Статус
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство.Код = ""90218""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент,
		|	Контрагенты.ЯШТИнтернет КАК Интернет,
		|	Контрагенты.КатегорияПокупателя,
		|	Контрагенты.ОсновнойМенеджерКонтрагента,
		|	Важность.Значение КАК Важность,
		|	ЕСТЬNULL(Обороты.СтоимостьОборот, 0) КАК СтоимостьОборот,
		|	Сайт.Представление КАК Сайт,
		|	Контрагенты.Код,
		|	Процент.Значение КАК ДоляИМ,
		|	Статус.Значение
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
		|		ПО Контрагенты.Ссылка = Обороты.ДоговорКонтрагентаВладелецСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Сайт КАК Сайт
		|		ПО Контрагенты.Ссылка = Сайт.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ Важность КАК Важность
		|		ПО Контрагенты.Ссылка = Важность.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ Процент КАК Процент
		|		ПО Контрагенты.Ссылка = Процент.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ Статус КАК Статус
		|		ПО Контрагенты.Ссылка = Статус.Объект
		|ГДЕ
		|	Контрагенты.ПометкаУдаления = ЛОЖЬ
		|	И Контрагенты.ЭтоГруппа = ЛОЖЬ
		|	И Обороты.СтоимостьОборот > 0
		|	И Статус.Значение <> &Значение"+
		?(ЗначениеЗаполнено(Менеджер),"	И Контрагенты.ОсновнойМенеджерКонтрагента = &ОсновнойМенеджерКонтрагента", "")+"";
	    Запрос.УстановитьПараметр("Значение", Перечисления.КатегорииКонтрагентов.Закрылись);
		Запрос.УстановитьПараметр("КОН", КонецДня(КОНПериода));
		Запрос.УстановитьПараметр("НАЧ", НачПериода);
	    Запрос.УстановитьПараметр("ОсновнойМенеджерКонтрагента", Менеджер);
		Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
		РезультатЗапроса = Запрос.Выполнить();
	
		СписокК.Загрузить( РезультатЗапроса.Выгрузить());	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПосмотретьСписокЭкспортНажатие(Элемент)
	ФормаСписка = РегистрыСведений.СезонныйАссортиментЭкспорт.ПолучитьФорму("ФормаСписка");
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ПредварительноОчиститьЭкспортНажатие(Элемент)
	НаборЗаписей = РегистрыСведений.СезонныйАссортиментЭкспорт.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура СписокНажатие(Элемент)
		ФормаСписка = РегистрыСведений.ЦенообразованиеФОБ.ПолучитьФормуСписка();
	ФормаСписка.Открыть();

КонецПроцедуры

Процедура ПосмотретьЭкспортНажатие(Элемент)
	ФормаСписка = РегистрыСведений.ЦеныФопЭкспорт.ПолучитьФорму("ФормаСписка");
	ФормаСписка.Открыть();

КонецПроцедуры
