
Процедура КнопкаСформироватьНажатие(Кнопка)
	
	Если ДатаКон1<ДатаНач1 Или Не ЗначениеЗаполнено(ДатаНач1) Или Не ЗначениеЗаполнено(ДатаКон1) Тогда
		Предупреждение("Не верно указан 1-й период!");
		возврат;
	КонецЕсли;	
	Если ДатаКон2<ДатаНач2 Или Не ЗначениеЗаполнено(ДатаНач2) Или Не ЗначениеЗаполнено(ДатаКон2) Тогда
		Предупреждение("Не верно указан 2-й период!");
		возврат;
	КонецЕсли;
	Если ДатаКон3<ДатаНач3 Или Не ЗначениеЗаполнено(ДатаНач3) Или Не ЗначениеЗаполнено(ДатаКон3) Тогда
		Предупреждение("Не верно указан 3-й период!");
		возврат;
	КонецЕсли;
	
	Таб = ЭлементыФормы.ПолеТабличногоДокумента1;
	Таб.Очистить();
	СформироватьОтчет(Таб);
	Таб.ТолькоПросмотр = Истина;
	Таб.Показать();
	
КонецПроцедуры

Процедура КнопкаНастройкаПериода1Нажатие(Элемент)
	
	ВыбратьПериод("ДатаНач1", "ДатаКон1");
	
КонецПроцедуры

Процедура КнопкаНастройкаПериода2Нажатие(Элемент)
	
	ВыбратьПериод("ДатаНач2", "ДатаКон2");

КонецПроцедуры

Процедура КнопкаНастройкаПериода3Нажатие(Элемент)
	
	ВыбратьПериод("ДатаНач3", "ДатаКон3");

КонецПроцедуры

Процедура ВыбратьПериод(ДатаНачНаим, ДатаКонНаим)
	
	НачалоПериода = ЭтаФорма[ДатаНачНаим];
	КонецПериода = ЭтаФорма[ДатаКонНаим];

	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.УстановитьПериод(НачалоПериода, ?(КонецПериода='0001-01-01', КонецПериода, КонецДня(КонецПериода)));
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.Редактировать();
	ЭтаФорма[ДатаНачНаим] = НастройкаПериода.ПолучитьДатуНачала();
	ЭтаФорма[ДатаКонНаим] = НастройкаПериода.ПолучитьДатуОкончания();
	
КонецПроцедуры


Процедура ПриОткрытии()
	
	Если Не ЗначениеЗаполнено(ДатаНач1) или Не ЗначениеЗаполнено(ДатаКон1) Тогда
		ДатаНач1 = '20130501';
		ДатаКон1 = '20131130';
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаНач2) или Не ЗначениеЗаполнено(ДатаКон2) Тогда
		ДатаНач2 = '20130501';
		ДатаКон2 = '20130930';
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаНач3) или Не ЗначениеЗаполнено(ДатаКон3) Тогда
		ДатаНач3 = '20140501';
		ДатаКон3 = '20140930';
	КонецЕсли;
	
КонецПроцедуры

