
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	список = новый списокЗначений;
	список.Добавить(Справочники.ТипыДоговоров.ОтсрочкаОТХ);
	список.Добавить(Справочники.ТипыДоговоров.ПеремещениеОТХ);
	список.Добавить(Справочники.ТипыДоговоров.ПредоплатаПоСчетам);
	список.Добавить(Справочники.ТипыДоговоров.WheelsGroupLimited);
	список.Добавить(Справочники.ТипыДоговоров.НайтиПоКоду("00007"));
	список.Добавить(Справочники.ТипыДоговоров.НайтиПоКоду("00001"));
	список.Добавить(Справочники.ТипыДоговоров.НайтиПоКоду("00004"));
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ТипПокупатели");
   ПараметрСКД.Использование = Истина;
   ПараметрСКД.Значение  = список;

КонецПроцедуры
