Перем СписокДоступныхСравнений;
Перем СписокПериодов;

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Закрыть(Истина);
	
КонецПроцедуры

Процедура НоменклатураПередНачаломДобавления(Элемент, Отказ, Копирование)
	
	
КонецПроцедуры

Процедура ПриОткрытии()
		
	ЭлементыФормы.ВидСравненияНом.СписокВыбора.ЗагрузитьЗначения(СписокДоступныхСравнений);
	ЭлементыФормы.ВидСравненияНом.Значение = ЭлементыФормы.ВидСравненияНом.СписокВыбора.НайтиПоЗначению(ВидСравненияНоменклатуры).Значение;
	
	ЭлементыФормы.ВидСравненияКонтр.СписокВыбора.ЗагрузитьЗначения(СписокДоступныхСравнений);
	ЭлементыФормы.ВидСравненияКонтр.Значение = ЭлементыФормы.ВидСравненияКонтр.СписокВыбора.НайтиПоЗначению(ВидСравненияКонтрагентов).Значение;
	
	ЭлементыФормы.ПериодИтоговВыбор.СписокВыбора.ЗагрузитьЗначения(СписокПериодов);
	ЭлементыФормы.ПериодИтоговВыбор.Значение = ЭлементыФормы.ПериодИтоговВыбор.СписокВыбора.НайтиПоЗначению(ПериодИтогов).Значение;
	
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.УстановитьПериод(ДатаНач, ?(ДатаКон='0001-01-01', ДатаКон, КонецДня(ДатаКон)));
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	Если НастройкаПериода.Редактировать() Тогда
		ДатаНач = НастройкаПериода.ПолучитьДатуНачала();
		ДатаКон = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры


Процедура ОбновлениеОтображения()
	
	ЭлементыФормы.ДатаНачалПолученияДанныхОЗакупках.Видимость = НЕ АнализироватьЗакупкиТолькоВВыбраномПериоде;
	ЭлементыФормы.НадписьДатаНачалПолученияДанныхОЗакупках.Видимость = НЕ АнализироватьЗакупкиТолькоВВыбраномПериоде;
	
КонецПроцедуры


СписокДоступныхСравнений = Новый Массив;
СписокДоступныхСравнений.Добавить(ВидСравнения.ВСписке);
СписокДоступныхСравнений.Добавить(ВидСравнения.ВСпискеПоИерархии);
СписокДоступныхСравнений.Добавить(ВидСравнения.НеВСписке);
СписокДоступныхСравнений.Добавить(ВидСравнения.НеВСпискеПоИерархии);


СписокПериодов = Новый Массив;
СписокПериодов.Добавить("День");
СписокПериодов.Добавить("Неделя");
СписокПериодов.Добавить("Месяц");
СписокПериодов.Добавить("Год");
