
Функция CarrierAnswer(CarrierId="", GuidIn1S="", ArrivalDate, UnloadDate, Cost=0, Car="", Driver="")
	рез = "";
	
	структура1 = новый Структура;
	структура1.Вставить("КодПеревозчика", CarrierId);
	структура1.Вставить("Guid", GuidIn1S);
	структура1.Вставить("ДатаПрибытия", ArrivalDate);
	структура1.Вставить("ДатаРазгрузки", UnloadDate);
	структура1.Вставить("Стоимость", Cost);
	структура1.Вставить("Авто", Car);
	структура1.Вставить("Водитель", Driver);
	структура1.Вставить("ДатаЗаполнения", ТекущаяДата() );
	
	регСв = РегистрыСведений.ОтветыПеревозчиков.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(регСв, структура1);
	
	Попытка
		уид = новый УникальныйИдентификатор(GuidIn1S);
		док = документы.ЗаявкаНаТранспорт.ПолучитьСсылку(уид);	
		Если док.Пустая() тогда
		  	рез = "ERROR! Not fount document by GUID: "+GuidIn1S;
		Иначе
			регСв.Документ = док;
			рез = "Ok.";
		КонецЕсли;
	Исключение
	  	рез = "ERROR! Not right GUID: "+GuidIn1S;
	КонецПопытки;	
	
	регСв.Записать();//пишется всегда! даже без документа...
	
	попытка //2-я  - меняем статус документа (без перепроведения!)
		Если док.Статус = перечисления.СтатусыЗаявокНаТранспорт.НаТендере тогда //с 1 на 2 статус
		докОб = док.ПолучитьОбъект();
		докОб.Статус = перечисления.СтатусыЗаявокНаТранспорт.ЕстьОтвет;
		докОб.Записать();
		КонецЕсли;
	Исключение
	КонецПопытки;	
	
	возврат рез;
	
КонецФункции
