Процедура ВыгрузитьДокументы(ДатаН,ДатаК) Экспорт
           КонтрагентыИсключаем = новый СписокЗначений;
		   КонтрагентыИсключаем.Добавить(Справочники.Контрагенты.НайтиПоКоду("П005342"));
		   КонтрагентыИсключаем.Добавить(Справочники.Контрагенты.НайтиПоКоду("94247  "));
		   КонтрагентыИсключаем.Добавить(Справочники.Контрагенты.НайтиПоКоду("П005344"));
		   
	       Запрос = новый Запрос;
		   Запрос.Текст="ВЫБРАТЬ
		                |	РеализацияТоваровУслуг.Ссылка КАК РеализацияСсылка,
		                |	РеализацияТоваровУслуг.Сделка КАК ЗаказПокупателя,
		                |	РеализацияТоваровУслуг.Сделка.Номер КАК ЗаказПокупателяНомер,
		                |	РеализацияТоваровУслуг.Номер КАК РеализацияНомер,
		                |	РеализацияТоваровУслуг.УПД,
		                |	РеализацияТоваровУслуг.Сделка.НомерВходящегоДокумента КАК ЗаказНомерВходящегоДокумента
		                |ИЗ
		                |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		                |ГДЕ
		                |	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаН И &ДатаК
		                |	И РеализацияТоваровУслуг.ДоговорКонтрагента.ОтветственноеЛицо.НаправлениеПродаж = &НаправлениеПродажКолеса
		                |	И НЕ РеализацияТоваровУслуг.Контрагент В (&КонтрагентыИсключаем)
		                |
		                |УПОРЯДОЧИТЬ ПО
		                |	РеализацияСсылка
		                |АВТОУПОРЯДОЧИВАНИЕ";
	                    Запрос.УстановитьПараметр("ДатаН",ДатаН);
						Запрос.УстановитьПараметр("ДатаК",КонецДня(ДатаК));
						Запрос.УстановитьПараметр("КонтрагентыИсключаем",КонтрагентыИсключаем);
						Запрос.УстановитьПараметр("НаправлениеПродажКолеса",Справочники.НаправленияПродаж.НайтиПоКоду("16"));
						
						Рез = Запрос.Выполнить().Выбрать();
						
						//FTPсервер = "kolesatyt.ru";
						//FTPсервер = "95.213.228.43";
						//FTPсервер = "188.93.20.230";
						FTPсервер = "188.93.20.230";
						врФТП = Новый FTPСоединение(FTPсервер,,"user1c", "oebohaCh5ohyaiko6Aer",, Истина );

						Если врФТП = Неопределено Тогда
							#Если Клиент тогда
								Сообщить( "Во время обмена данными в "+строка(ТекущаяДата())+" произошла ошибка подключения	к FTP: " + ОписаниеОшибки());
							#КонецЕсли
						КонецЕсли;
						
						ПутьКфайлуFTP = "/upload/1c/docs/";
								
						Пока Рез.Следующий() Цикл
							ЛокПолноеИмяФайла = ПолучитьИмяВременногоФайла("mxl");
							Попытка
								Рез.УПД.Получить().Записать(ЛокПолноеИмяФайла);
								ТабДок = Новый ТабличныйДокумент();
								ТабДок.Прочитать(ЛокПолноеИмяФайла);
								табДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
								ЗаказИМ = СтрЗаменить(СтрЗаменить(Рез.ЗаказНомерВходящегоДокумента,"ИМ00",""),"ИМ0","");
								ИмяФайла  = ЗаказИМ+"-"+Рез.РеализацияНомер+".pdf"; 
								ПолноеИмяФайла = КаталогВременныхФайлов()+ИмяФайла; 
								ТабДок.Записать(ПолноеИмяФайла,ТипФайлаТабличногоДокумента.PDF);
								Попытка //каталог уже есть?
									врФТП.СоздатьКаталог(ПутьКфайлуFTP+ЗаказИМ);
								Исключение	
								КонецПопытки;
								врФТП.Записать(ПолноеИмяФайла, ПутьКфайлуFTP+ЗаказИМ+"/"+ИмяФайла);
								
								#Если Клиент тогда
									Сообщить(ПолноеИмяФайла);
								#КонецЕсли
								Сообщить(ИмяФайла);
							Исключение
								Сообщить(ОписаниеОшибки());
								Сообщить("Для "+рез.РеализацияСсылка+" не удалось получить УПД.");
							КонецПопытки;
						КонецЦикла;
						врФТП = неопределено;
КонецПроцедуры
