перем Запрос1, Запрос2, Запрос3;

Процедура ВидГруппировкиПриИзменении(Элемент)
	ВидОтчета =  Элемент.Значение;
КонецПроцедуры

Процедура ПриОткрытии()
	A = 80;
	B = 15;
	C = 5;  
	
	ВидОтчета =  0;
	НачПериода = НачалоМесяца(ТекущаяДата());
	КонПериода = КонецМесяца(ТекущаяДата());
КонецПроцедуры


Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры


Процедура BПриИзменении(Элемент)
	C = 100 - A - B;
КонецПроцедуры


Процедура АПриИзменении(Элемент)
	C = 100 - A - B;
КонецПроцедуры
  
