ФУНКЦИЯ Печать() ЭКСПОРТ
	//ОчиститьСообщения();
	
	Если СсылкаНаОбъект.Товары.Количество()=0 Тогда
		Сообщить(нстр("ru=""Нет товаров для печати!"";
					  |en=""No goods for printing!""") );
		Возврат неопределено;
	КонецЕсли;	
	
	Если СсылкаНаОбъект.Ссылка.Пустая() Тогда
		Сообщить(нстр("ru=""Для печати необходимо предварительно записать Документ!"";
					  |en=""For the printing it is necessary to write down the Document previously!""") );
		Возврат неопределено;
	КонецЕсли;		
	
	ТабДок = ПечатьСпецификации();
	
	возврат ТабДок;
   
КонецФункции



Функция ПечатьСпецификации(МассивЗаказов=неопределено)
	
//	СсылкаНаОбъект = Объект.ссылка;
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПоставщику_Спецификация";
	
	Макет = ПолучитьМакет("Спецификация_печать");
	
	ОбластьЗаголовок    = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка        = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаМодели = Макет.ПолучитьОбласть("СтрокаМодели");
	ОбластьСтрока       = Макет.ПолучитьОбласть("Строка");
	ОбластьИтог         = Макет.ПолучитьОбласть("Итог");
	ОбластьПодвал       = Макет.ПолучитьОбласть("Подвал");
	
	//Заголовок
	ОбластьЗаголовок.Параметры.Контрагент        = СсылкаНаОбъект.Контрагент.НаименованиеПолное;
	ОбластьЗаголовок.Параметры.НомерСпецификации = "2014-1-"+Строка(Число(Прав(СсылкаНаОбъект.Номер,6)));
	
	//СокрЛП(Объект.ДополнительныеПоля[13].ЗначениеПоля);
	ОбластьЗаголовок.Параметры.НомерКонтракта    = СсылкаНаОбъект.ДоговорКонтрагента.номер+" "+формат(СсылкаНаОбъект.ДоговорКонтрагента.Дата,"ДЛФ=D");
	ОбластьЗаголовок.Параметры.Дата              = Формат( ДобавитьМесяц(СсылкаНаОбъект.Дата,-2), "ДФ=dd.MM.yyyy");   // -2 месяца!!!
	
	//+++
	ОбластьЗаголовок.Параметры.НомерКонтейнера = СокрЛП(СсылкаНаОбъект.НомерКонтейнера);
	ОбластьЗаголовок.Параметры.НомерДок = СокрЛП(СсылкаНаОбъект.Номер);
	
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	
	//Шапка
	ТабДокумент.Вывести(ОбластьШапка);
	//СтрокаМодели
	
	//Строка	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПоставщикуТовары.Номенклатура.Наименование КАК Наименование,
	               |	ЗаказПоставщикуТовары.Количество,
	               |	ЗаказПоставщикуТовары.Цена,
	               |	ЗаказПоставщикуТовары.Сумма,
	               |	ЗаказПоставщикуТовары.Номенклатура.Производитель КАК Производитель
	               |ИЗ
	               |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	               |ГДЕ
	               |	ЗаказПоставщикуТовары.Ссылка В(&СписокЗаказов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Производитель";
	Если МассивЗаказов=неопределено тогда
		МассивЗаказов2 = новый Массив;
		МассивЗаказов2.Добавить(СсылкаНаОбъект);
		Запрос.УстановитьПараметр("СписокЗаказов", МассивЗаказов2);
	иначе
		Запрос.УстановитьПараметр("СписокЗаказов", МассивЗаказов);
	КонецЕсли;

	ТЗТоваров = Запрос.Выполнить().Выгрузить();
	ТЗТоваров.Свернуть("Наименование, Производитель, Цена", "Количество, Сумма");
	
	i = 0;
	
	СтрокаСостава = ""; 	Модель0 = "";

	
	Для Каждого Строка Из ТЗТоваров Цикл
		
		Модель = "";
		Если Строка.Производитель = Справочники.Производители.НайтиПоКоду("65") Тогда //LEGEARTIS
			Модель = "#LEGEARTIS";
		ИначеЕсли Найти(врег(Строка.Производитель.Наименование),"REPLICA")>0 тогда
			назв = сокрЛП( врег(Строка.Производитель.Наименование) );
			Модель =  СокрЛП( прав( назв, стрДлина(назв) - Найти(назв,"REPLICA") - 7) );
			если Модель = "TD" тогда Модель = "TOP DRIVER" КонецЕсли;
			Модель = "#" +Модель;
		// если отдельные производители - то это тоже Replica	
		ИначеЕсли врег(Строка.Производитель.Наименование)="TOP DRIVER"
			или врег(Строка.Производитель.Наименование)="CATWILD"
			или врег(Строка.Производитель.Наименование)="YST" тогда
			Модель = "#" +врег(Строка.Производитель.Наименование);
		Иначе // название производителя = Брэнд
			Модель = врег(Строка.Производитель.Наименование);
		КонецЕсли;	
			

		Если i = 0 Тогда
			Модель0 = Модель;
			СтрокаСостава = Модель;
			Модель1 = ?(лев(Модель,1)="#", прав(Модель, стрДлина(Модель)-1), Модель) ;
			ОбластьСтрокаМодели.Параметры.Модель = Модель1;
			ТабДокумент.Вывести(ОбластьСтрокаМодели);
		ИначеЕсли Модель<>Модель0 тогда
			Модель0 = Модель;
			СтрокаСостава = СтрокаСостава + ", " + Модель;
			Модель1 = ?(лев(Модель,1)="#", прав(Модель, стрДлина(Модель)-1), Модель) ;
			ОбластьСтрокаМодели.Параметры.Модель = Модель1;
			ТабДокумент.Вывести(ОбластьСтрокаМодели);
		КонецЕсли;
		
		i = i + 1;
			
		ОбластьСтрока.Параметры.Модель     = Строка.Наименование;
		ОбластьСтрока.Параметры.Количество = Строка.Количество;
		ОбластьСтрока.Параметры.ШтКомп     = ?(Строка.Производитель = Справочники.Производители.НайтиПоКоду("65"), "Set/комплект", "Piece/Штуки");
	//	ОбластьСтрока.Параметры.Состав     = ?(Строка.Производитель = Справочники.Производители.НайтиПоКоду("65"), "", "1 wheel/диск");
		ОбластьСтрока.Параметры.Цена       = Строка.Цена;
		ОбластьСтрока.Параметры.Стоимость  = Строка.Сумма;
		
		ТабДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	//Итог
	ОбластьИтог.Параметры.ИтогКоличество = ТЗТоваров.Итог("Количество");
	ОбластьИтог.Параметры.ИтогСтоимость = ТЗТоваров.Итог("Сумма");
	ТабДокумент.Вывести(ОбластьИтог);
	
	//Подвал
	ОбластьПодвал.Параметры.СуммаРус = ЧислоПрописью(ТЗТоваров.Итог("Сумма"), "L=ru_RU", "доллар США, доллара США, долларов США, м, цент, цента, центов, м");
	ОбластьПодвал.Параметры.СуммаАнг = ЧислоПрописью(ТЗТоваров.Итог("Сумма"), "L=en_US", "USD, USD, USD, cents, cents, cents, 0");
	Если СсылкаНаОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("92540") Тогда
		ОбластьПодвал.Параметры.Производитель = "ZHANGZHOU SHUANGSHENG WHEELS CO.,LTD.";
	ИначеЕсли СсылкаНаОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("91535") Тогда
		ОбластьПодвал.Параметры.Производитель = "Jiangsu Sanhe Aluminium Wheel Manufacturing Co. LTD.";
	ИначеЕсли СсылкаНаОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("93695") Тогда //Ningbo
		ОбластьПодвал.Параметры.Производитель = "FREEMAN RACING WHEELS INC";
	Иначе
		ОбластьПодвал.Параметры.Производитель = ?(СокрЛП(СсылкаНаОбъект.Контрагент.ДополнительноеОписание)="", СокрЛП(СсылкаНаОбъект.Контрагент.НаименованиеПолное), СокрЛП(СсылкаНаОбъект.Контрагент.ДополнительноеОписание));	
	КонецЕсли;
	ОбластьПодвал.Параметры.ТорговыеМарки = стрЗаменить(СтрокаСостава,"#", "");
	
	КомплектПоставки = "";
	КомплектПоставкиАнг = "";
	
	пока СтрокаСостава<>"" цикл
		i=Найти(СтрокаСостава,",");
		Если i>0 тогда
			брэнд = сокрЛП( лев(СтрокаСостава,i-1) );
			СтрокаСостава = сокрЛП(прав(СтрокаСостава, стрДлина(СтрокаСостава) - i));
		иначе
			брэнд = сокрЛП( СтрокаСостава );
			СтрокаСостава = "";
		КонецЕсли;	
	//-------------------------------------------------------------------	
		Если брэнд = "TREBL" или брэнд="ARRIVO" Тогда //штамповка
			КомплектПоставки = КомплектПоставки + брэнд+": коробка, диск."+Символы.ПС;		
			КомплектПоставкиАнг = КомплектПоставкиАнг + брэнд+": wheel, carton box."+Символы.ПС;
	//-------------------------------------------------------------------	
		ИначеЕсли лев(брэнд,1)="#" Тогда            // наиболее полный комплект
			 брэнд = прав(брэнд,стрДлина(брэнд)-1);
			КомплектПоставки = КомплектПоставки + брэнд+": коробка, диск, заглушка со стикером, болты или гайки, количество болтов или гаек указано в упаковочном листе."+Символы.ПС;		
			КомплектПоставкиАнг = КомплектПоставкиАнг + брэнд+": box, cap and sticker, bolts or nuts, quantity of bolts or nuts are indicated in packing list."+Символы.ПС;
	//-------------------------------------------------------------------	
		Иначе //Если Найти(СтрокаСостава, "NZ") Тогда	
			КомплектПоставки = КомплектПоставки + брэнд+": коробка, диск, заглушка со стикером."+Символы.ПС;		
			КомплектПоставкиАнг = КомплектПоставкиАнг + брэнд+": box, cap and sticker."+Символы.ПС;	
		КонецЕсли;
	КонецЦикла;
	
	ОбластьПодвал.Параметры.Перенос = Символы.ПС;
	ОбластьПодвал.Параметры.КомплектПоставки    = КомплектПоставки;
	ОбластьПодвал.Параметры.КомплектПоставкиАнг = КомплектПоставкиАнг;
	
	ОбластьПодвал.Параметры.Дата = Формат(СсылкаНаОбъект.Дата, "ДФ=dd.MM.yyyy");
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
//-------------------печати и подписи---------------------------------------
	//ОбластьСтрока1 = Макет.ПолучитьОбласть("ПодвалШапка");
	//ТабДокумент.Вывести(ОбластьСтрока1);

	Если СокрЛП(СсылкаНаОбъект.Контрагент.Код)="91735" тогда
		ОбластьСтрока1 = Макет.ПолучитьОбласть("ПодвалFREEMAN");
	ИначеЕсли СокрЛП(СсылкаНаОбъект.Контрагент.Код)="91535" тогда
		ОбластьСтрока1 = Макет.ПолучитьОбласть("ПодвалJIANGSU");
	ИначеЕсли СокрЛП(СсылкаНаОбъект.Контрагент.Код) = "92540" Тогда
		ОбластьСтрока1 = Макет.ПолучитьОбласть("ПодвалJIANGSU");
	ИначеЕсли СокрЛП(СсылкаНаОбъект.Контрагент.Код) = "93694" Тогда
		ОбластьСтрока1 = Макет.ПолучитьОбласть("ПодвалZHANGZHOU");
	ИначеЕсли СокрЛП(СсылкаНаОбъект.Контрагент.Код) = "93695" Тогда
		ОбластьСтрока1 = Макет.ПолучитьОбласть("ПодвалNINGBO");
	Иначе
		ОбластьСтрока1 = Макет.ПолучитьОбласть("Подвал1");
	КонецЕсли;	
	ТабДокумент.Вывести(ОбластьСтрока1);

	
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьСпецификации()

