Перем СоответствиеПоставщиковАЭПодразделениям;
перем RegExp, тз;

Процедура РазобратьФайл()
	тз=Новый ТаблицаЗначений;
	тз.Колонки.Добавить("НомерИМ", Новый ОписаниеТипов("Строка"	, , Новый КвалификаторыСтроки(100)));
	тз.Колонки.Добавить("НомерЗаказаИМ", Новый ОписаниеТипов("Строка"	, , Новый КвалификаторыСтроки(100)));
	тз.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	тз.Колонки.Добавить("Товар", Новый ОписаниеТипов("Строка"	, , Новый КвалификаторыСтроки(500)));
	тз.Колонки.Добавить("Колво", Новый ОписаниеТипов("Число"	, , Новый КвалификаторыЧисла(10,0)));
	тз.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));

		
	Номерстроки = 0;
	Пока Номерстроки<=ЭлементыФормы.Сроки.ВысотаТаблицы цикл
		НомерИМ=СокрЛП(ЭлементыФормы.Сроки.Область(Номерстроки,КолонкаНомерИМ,Номерстроки,КолонкаНомерИМ).Текст);
		Артикул=СокрЛП(ЭлементыФормы.Сроки.Область(Номерстроки,КолонкаАртикул,Номерстроки,КолонкаАртикул).Текст);
		Количество=СокрЛП(ЭлементыФормы.Сроки.Область(Номерстроки,КолонкаКоличество,Номерстроки,КолонкаКоличество).Текст);
		//Сообщить(Содержание+":::"+найти(Содержание," "));
		
		Если НомерИМ<>"" и Артикул<>"" и Количество<>"" тогда
			
			НомерИМ=СтрЗаменить(НомерИМ,"IM","ИМ");
			НомерЗаказаИМ = СокрЛП(НомерИМ);
			Подразделение = "000092773";
			
			табТоваров = РазобратьСодержание(Артикул);
			Для каждого стр из табТоваров цикл
				нстр=тз.Добавить();
				
				нстр.НомерЗаказаИМ=НомерЗаказаИМ;
				нстр.НомерИМ=НомерИМ;
				нстр.подразделение = СоответствиеПоставщиковАЭПодразделениям.Получить(Подразделение);
				нстр.товар = стр.НоменклатураНаименование;
				нстр.Колво = Количество;
				нстр.Номенклатура = стр.Номенклатура;
			КонецЦикла;
			//табТоваров = РазобратьСодержание(Содержание);
		КонецЕсли;
		
		Номерстроки=Номерстроки+1;
	КонецЦикла;
	сообщить(тз.Количество());
	
	Запрос = новый Запрос;
	//Запрос.Текст="ВЫБРАТЬ
	//			 |	тзТаблицаИзРеестра.НомерДПД,
	//			 |	тзТаблицаИзРеестра.НомерИМ,
	//			 |	тзТаблицаИзРеестра.НомерЗаказаИМ,
	//			 |	тзТаблицаИзРеестра.Подразделение,
	//			 |	тзТаблицаИзРеестра.Содержание,
	//			 |	тзТаблицаИзРеестра.Товар,
	//			 |	тзТаблицаИзРеестра.Колво,
	//			 |	тзТаблицаИзРеестра.Номенклатура
	//			 |ПОМЕСТИТЬ втТаблицаИзРеестра
	//			 |ИЗ
	//			 |	&тзТаблицаИзРеестра КАК тзТаблицаИзРеестра
	//			 |;
	//			 |
	//			 |////////////////////////////////////////////////////////////////////////////////
	//			 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	//			 |	ЗаказыИзРеестра.НомерЗаказаИМ КАК НомерЗаказаИМ,
	//			 |	ЗаказПокупателяТовары.Ссылка КАК Ссылка,
	//			 |	ЗаказыИзРеестра.Подразделение,
	//			 |	ЗаказыИзРеестра.Товар,
	//			 |	ЗаказыИзРеестра.Номенклатура КАК Номенклатура
	//			 |ИЗ
	//			 |	(ВЫБРАТЬ
	//			 |		втТаблицаИзРеестра.НомерЗаказаИМ КАК НомерЗаказаИМ,
	//			 |		втТаблицаИзРеестра.Подразделение КАК Подразделение,
	//			 |		втТаблицаИзРеестра.Номенклатура КАК Номенклатура,
	//			 |		втТаблицаИзРеестра.Товар КАК Товар
	//			 |	ИЗ
	//			 |		втТаблицаИзРеестра КАК втТаблицаИзРеестра
	//			 |	
	//			 |	СГРУППИРОВАТЬ ПО
	//			 |		втТаблицаИзРеестра.Номенклатура,
	//			 |		втТаблицаИзРеестра.НомерЗаказаИМ,
	//			 |		втТаблицаИзРеестра.Подразделение,
	//			 |		втТаблицаИзРеестра.Товар) КАК ЗаказыИзРеестра
	//			 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	//			 |		ПО ЗаказыИзРеестра.НомерЗаказаИМ = ЗаказПокупателяТовары.Ссылка.НомерВходящегоДокумента
	//			 |			И ЗаказыИзРеестра.Подразделение = ЗаказПокупателяТовары.Ссылка.Подразделение
	//			 |			И ЗаказыИзРеестра.Номенклатура = ЗаказПокупателяТовары.Номенклатура
	//			 |
	//			 |УПОРЯДОЧИТЬ ПО
	//			 |	Ссылка,
	//			 |	НомерЗаказаИМ,
	//			 |	Номенклатура
	//			 |ИТОГИ ПО
	//			 |	НомерЗаказаИМ,
	//			 |	Ссылка
	//			 |АВТОУПОРЯДОЧИВАНИЕ";
	
		//Запрос.Текст="ВЫБРАТЬ
		//			 |	тзТаблицаИзРеестра.НомерДПД,
		//			 |	тзТаблицаИзРеестра.НомерИМ,
		//			 |	тзТаблицаИзРеестра.НомерЗаказаИМ,
		//			 |	тзТаблицаИзРеестра.Подразделение,
		//			 |	тзТаблицаИзРеестра.Содержание,
		//			 |	тзТаблицаИзРеестра.Товар,
		//			 |	тзТаблицаИзРеестра.Колво,
		//			 |	тзТаблицаИзРеестра.Номенклатура
		//			 |ПОМЕСТИТЬ втТаблицаИзРеестра
		//			 |ИЗ
		//			 |	&тзТаблицаИзРеестра КАК тзТаблицаИзРеестра
		//			 |;
		//			 |
		//			 |////////////////////////////////////////////////////////////////////////////////
		//			 |ВЫБРАТЬ РАЗЛИЧНЫЕ
		//			 |	ЗаказыИзРеестра.НомерЗаказаИМ КАК НомерЗаказаИМ,
		//			 |	ЗаказыИзРеестра.Подразделение КАК Подразделение,
		//			 |	ЗаказыИзРеестра.Номенклатура КАК Номенклатура,
		//			 |	ЗаказыИзРеестра.Товар
		//			 |ИЗ
		//			 |	(ВЫБРАТЬ
		//			 |		втТаблицаИзРеестра.НомерЗаказаИМ КАК НомерЗаказаИМ,
		//			 |		втТаблицаИзРеестра.Подразделение КАК Подразделение,
		//			 |		втТаблицаИзРеестра.Номенклатура КАК Номенклатура,
		//			 |		втТаблицаИзРеестра.Товар КАК Товар
		//			 |	ИЗ
		//			 |		втТаблицаИзРеестра КАК втТаблицаИзРеестра
		//			 |	
		//			 |	СГРУППИРОВАТЬ ПО
		//			 |		втТаблицаИзРеестра.Номенклатура,
		//			 |		втТаблицаИзРеестра.НомерЗаказаИМ,
		//			 |		втТаблицаИзРеестра.Подразделение,
		//			 |		втТаблицаИзРеестра.Товар) КАК ЗаказыИзРеестра
		//			 |
		//			 |УПОРЯДОЧИТЬ ПО
		//			 |	НомерЗаказаИМ,
		//			 |	Подразделение,
		//			 |	Номенклатура
		//			 |АВТОУПОРЯДОЧИВАНИЕ";

				 //Запрос.УстановитьПараметр("тзТаблицаИзРеестра",тз);
				 //Рез = Запрос.Выполнить();
				 //тзЗаказы = Рез.Выгрузить();
	//тз.ВыбратьСтроку();
	тз.Сортировать("НомерЗаказаИМ,Подразделение,Номенклатура");
	ТабРезультатРазбора=тз;
	ЭлементыФормы.ТабРезультатРазбора.СоздатьКолонки();
	
КонецПроцедуры

Функция РазобратьСодержание(Артикул)
	таб  = Новый ТаблицаЗначений;
	таб.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	таб.Колонки.Добавить("НоменклатураКод", Новый ОписаниеТипов("Строка"	, , Новый КвалификаторыСтроки(10)));
	таб.Колонки.Добавить("НоменклатураНаименование", Новый ОписаниеТипов("Строка"	, , Новый КвалификаторыСтроки(150)));
	таб.Колонки.Добавить("Колво", Новый ОписаниеТипов("Число"	, , Новый КвалификаторыЧисла(10,0)));
	
	Если СокрЛП(Артикул)<>"" тогда
		нстр = Таб.Добавить();
		нстр.Номенклатура = справочники.Номенклатура.НайтиПоКоду(сокрЛП(Артикул));
		нстр.НоменклатураКод = Артикул;

	КонецЕсли;	
	
	возврат таб;
	
КонецФункции

Процедура ТабРезультатРазбораПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если не значениеЗаполнено(ДанныеСтроки.номенклатура) тогда
		ОформлениеСтроки.ЦветФона = WebЦвета.БледноКрасноФиолетовый;
	КонецЕсли;
КонецПроцедуры

Процедура НайтиРеализацииНажатие(Элемент)
	Запрос = новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		             |	тзТаблицаИзРеестра.НомерИМ,
		             |	тзТаблицаИзРеестра.НомерЗаказаИМ,
		             |	тзТаблицаИзРеестра.Подразделение,
		             |	тзТаблицаИзРеестра.Товар,
		             |	тзТаблицаИзРеестра.Колво,
		             |	тзТаблицаИзРеестра.Номенклатура
		             |ПОМЕСТИТЬ втТаблицаИзРеестра
		             |ИЗ
		             |	&тзТаблицаИзРеестра КАК тзТаблицаИзРеестра
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	ЗаказыИзРеестра.НомерЗаказаИМ КАК НомерЗаказаИМ,
		             |	ЗаказПокупателяТовары.Ссылка КАК ЗаказПокупателяИсходный,
		             |	ЗаказыИзРеестра.Подразделение,
		             |	ЗаказыИзРеестра.Товар,
		             |	ЗаказыИзРеестра.Номенклатура КАК Номенклатура,
		             |	ЗаказыИзРеестра.Колво
		             |ПОМЕСТИТЬ втРеестрСИсходнымиЗаказами
		             |ИЗ
		             |	(ВЫБРАТЬ
		             |		втТаблицаИзРеестра.НомерЗаказаИМ КАК НомерЗаказаИМ,
		             |		втТаблицаИзРеестра.Подразделение КАК Подразделение,
		             |		втТаблицаИзРеестра.Номенклатура КАК Номенклатура,
		             |		втТаблицаИзРеестра.Товар КАК Товар,
		             |		СУММА(втТаблицаИзРеестра.Колво) КАК Колво
		             |	ИЗ
		             |		втТаблицаИзРеестра КАК втТаблицаИзРеестра
		             |	ГДЕ
		             |		НЕ втТаблицаИзРеестра.Номенклатура = ЗНАЧЕНИЕ(справочник.Номенклатура.пустаяСсылка)
		             |	
		             |	СГРУППИРОВАТЬ ПО
		             |		втТаблицаИзРеестра.Номенклатура,
		             |		втТаблицаИзРеестра.НомерЗаказаИМ,
		             |		втТаблицаИзРеестра.Подразделение,
		             |		втТаблицаИзРеестра.Товар) КАК ЗаказыИзРеестра
		             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		             |		ПО ЗаказыИзРеестра.НомерЗаказаИМ = ЗаказПокупателяТовары.Ссылка.НомерВходящегоДокумента
		             |			И ЗаказыИзРеестра.Подразделение = ЗаказПокупателяТовары.Ссылка.Подразделение
		             |			И ЗаказыИзРеестра.Номенклатура = ЗаказПокупателяТовары.Номенклатура
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	втРеестрСИсходнымиЗаказами.НомерЗаказаИМ КАК НомерЗаказаИМ,
		             |	втРеестрСИсходнымиЗаказами.ЗаказПокупателяИсходный КАК ЗаказПокупателяИсходный,
		             |	ЕСТЬNULL(ЗаказыОбъединенные.Ссылка, втРеестрСИсходнымиЗаказами.ЗаказПокупателяИсходный) КАК ЗаказОбъединенный,
		             |	втРеестрСИсходнымиЗаказами.Подразделение,
		             |	втРеестрСИсходнымиЗаказами.Товар,
		             |	втРеестрСИсходнымиЗаказами.Номенклатура,
		             |	втРеестрСИсходнымиЗаказами.Колво
		             |ПОМЕСТИТЬ втРеестрСОбъединеннымиЗаказами
		             |ИЗ
		             |	втРеестрСИсходнымиЗаказами КАК втРеестрСИсходнымиЗаказами
		             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		             |			ЗаказПокупателяЗаказы.Ссылка КАК Ссылка,
		             |			ЗаказПокупателяЗаказы.ЗаказПокупателя КАК ЗаказПокупателя
		             |		ИЗ
		             |			Документ.ЗаказПокупателя.Заказы КАК ЗаказПокупателяЗаказы
		             |		ГДЕ
		             |			ЗаказПокупателяЗаказы.Ссылка.Проведен
		             |			И ЗаказПокупателяЗаказы.ЗаказПокупателя В
		             |					(ВЫБРАТЬ
		             |						втРеестрСИсходнымиЗаказами.ЗаказПокупателяИсходный
		             |					ИЗ
		             |						втРеестрСИсходнымиЗаказами КАК втРеестрСИсходнымиЗаказами)) КАК ЗаказыОбъединенные
		             |		ПО втРеестрСИсходнымиЗаказами.ЗаказПокупателяИсходный = ЗаказыОбъединенные.ЗаказПокупателя
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	втРеестрСОбъединеннымиЗаказами.ЗаказОбъединенный.Контрагент КАК Контрагент,
		             |	втРеестрСОбъединеннымиЗаказами.НомерЗаказаИМ КАК НомерЗаказаИМ,
		             |	втРеестрСОбъединеннымиЗаказами.ЗаказПокупателяИсходный КАК ЗаказПокупателяИсходный,
		             |	втРеестрСОбъединеннымиЗаказами.ЗаказОбъединенный КАК ЗаказОбъединенный,
		             |	втРеестрСОбъединеннымиЗаказами.Подразделение КАК Подразделение,
		             |	втРеестрСОбъединеннымиЗаказами.Номенклатура КАК Номенклатура,
		             |	втРеестрСОбъединеннымиЗаказами.Колво,
		             |	ПродажиОбороты.Регистратор КАК Реализация,
		             |	ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот КАК Цена
		             |ПОМЕСТИТЬ вт
		             |ИЗ
		             |	втРеестрСОбъединеннымиЗаказами КАК втРеестрСОбъединеннымиЗаказами
		             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
		             |				,
		             |				,
		             |				Регистратор,
		             |				ЗаказПокупателя В
		             |					(ВЫБРАТЬ
		             |						втРеестрСОбъединеннымиЗаказами.ЗаказОбъединенный
		             |					ИЗ
		             |						втРеестрСОбъединеннымиЗаказами КАК втРеестрСОбъединеннымиЗаказами)) КАК ПродажиОбороты
		             |		ПО втРеестрСОбъединеннымиЗаказами.ЗаказОбъединенный = ПродажиОбороты.ЗаказПокупателя
		             |			И втРеестрСОбъединеннымиЗаказами.Номенклатура = ПродажиОбороты.Номенклатура
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	вт.Контрагент,
		             |	вт.НомерЗаказаИМ,
		             |	вт.ЗаказПокупателяИсходный,
		             |	вт.ЗаказОбъединенный,
		             |	вт.Подразделение,
		             |	вт.Номенклатура,
		             |	вт.Колво,
		             |	вт.Реализация,
		             |	вт.Цена,
		             |	ЕСТЬNULL(Грузополучатель.Значение, ""Неопределен"") КАК Отправитель,
		             |	ЕСТЬNULL(НомерПеревозчика.Значение, ""Неопределен"") КАК НомерПеревозчика
		             |ИЗ
		             |	вт КАК вт
		             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |			ЗаказПокупателяРеквизитыЗаказаТК.Ссылка КАК Ссылка,
		             |			МАКСИМУМ(ВЫРАЗИТЬ(ЗаказПокупателяРеквизитыЗаказаТК.Значение КАК СТРОКА(500))) КАК Значение
		             |		ИЗ
		             |			Документ.ЗаказПокупателя.РеквизитыЗаказаТК КАК ЗаказПокупателяРеквизитыЗаказаТК
		             |		ГДЕ
		             |			ЗаказПокупателяРеквизитыЗаказаТК.Поле = ""Грузополучатель""
		             |			И ЗаказПокупателяРеквизитыЗаказаТК.Ссылка В
		             |					(ВЫБРАТЬ
		             |						вт.ЗаказПокупателяИсходный
		             |					ИЗ
		             |						вт КАК вт)
		             |		
		             |		СГРУППИРОВАТЬ ПО
		             |			ЗаказПокупателяРеквизитыЗаказаТК.Ссылка) КАК Грузополучатель
		             |		ПО вт.ЗаказПокупателяИсходный = Грузополучатель.Ссылка
		             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |			ЗаказПокупателяРеквизитыЗаказаТК.Ссылка КАК Ссылка,
		             |			МАКСИМУМ(ВЫРАЗИТЬ(ЗаказПокупателяРеквизитыЗаказаТК.Значение КАК СТРОКА(500))) КАК Значение
		             |		ИЗ
		             |			Документ.ЗаказПокупателя.РеквизитыЗаказаТК КАК ЗаказПокупателяРеквизитыЗаказаТК
		             |		ГДЕ
		             |			ЗаказПокупателяРеквизитыЗаказаТК.Поле = ""Номер заказа перевозчика""
		             |			И ЗаказПокупателяРеквизитыЗаказаТК.Ссылка В
		             |					(ВЫБРАТЬ
		             |						вт.ЗаказПокупателяИсходный
		             |					ИЗ
		             |						вт КАК вт)
		             |		
		             |		СГРУППИРОВАТЬ ПО
		             |			ЗаказПокупателяРеквизитыЗаказаТК.Ссылка) КАК НомерПеревозчика
		             |		ПО вт.ЗаказПокупателяИсходный = НомерПеревозчика.Ссылка
		             |ГДЕ
		             |	НЕ вт.Реализация ССЫЛКА Документ.ВозвратТоваровОтПокупателя
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	вт.НомерЗаказаИМ,
		             |	вт.ЗаказПокупателяИсходный,
		             |	вт.ЗаказОбъединенный,
		             |	вт.Подразделение,
		             |	вт.Номенклатура
		             |АВТОУПОРЯДОЧИВАНИЕ";
				 
				 Запрос.УстановитьПараметр("тзТаблицаИзРеестра",тз);
				 //тз.выбратьСтроку();
                 Рез = Запрос.Выполнить();
				 тзЗаказыСРеализациями = Рез.Выгрузить(); 
				 ТабСРеализациями=тзЗаказыСРеализациями;
	ЭлементыФормы.ТабСРеализациями.СоздатьКолонки();
    ЭлементыФормы.Панель1.ТекущаяСтраница = ЭлементыФормы.Панель1.Страницы.Страница3;

КонецПроцедуры

Процедура ТабСРеализациямиПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если  (ДанныеСтроки.ЗаказПокупателяИсходный = ДанныеСтроки.ЗаказОбъединенный) тогда
		ОформлениеСтроки.ЦветФона = WebЦвета.БледноКрасноФиолетовый;
	КонецЕсли;
КонецПроцедуры

Процедура кнПеренестиВЗаявкуНажатие(Элемент)
	Контрагенты = ТабСРеализациями.Скопировать(,"Контрагент");
	Контрагенты.Свернуть("Контрагент");
	
	отбор = новый структура("Контрагент");
	Для каждого контрагент из контрагенты цикл
		отбор.Контрагент = контрагент.Контрагент;
		найденныеСтроки = ТабСРеализациями.НайтиСтроки(отбор);
		Если найденныеСтроки.Количество()>0 тогда
			ДокЗаявка = Документы.ЗаявкаНаВозвратТоваров.СоздатьДокумент();
			ДокЗаявка.Контрагент = Контрагент;
			//ДокЗаявка.Контрагент = Контрагент;
			Товары = ДокЗаявка.Товары;
			Для каждого стр из найденныеСтроки цикл
				нстр = товары.Добавить();
				нстр.Номенклатура = стр.номенклатура;
				нстр.Количество = стр.колво;
				нстр.Реализация = стр.Реализация;
				нстр.ЦенаРеализации = стр.цена;
				нстр.Сумма = нстр.Количество*нстр.ЦенаРеализации;
				нстр.НомерЗаказаИМ = стр.НомерЗаказаИМ;
				нстр.НомерЗаказаТК = стр.НомерПеревозчика;
				нстр.Отправитель = стр.Отправитель;
				ДокЗаявка.ПроверитьНоменклатуруВРеализации(нстр);
			КонецЦикла;
			ДокЗаявка.ПолучитьФорму("ФормаДокумента").Открыть();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура кнРазобратьФайлНажатие(Элемент)
	РазобратьФайл();
	ЭлементыФормы.Панель1.ТекущаяСтраница = ЭлементыФормы.Панель1.Страницы.Страница2;
КонецПроцедуры

Процедура ПриОткрытии()
	КолонкаНомерИМ = 7;
	КолонкаАртикул = 3;
	КолонкаКоличество = 27;
КонецПроцедуры

RegExp = Новый COMОбъект("VBScript.RegExp");   //для определения индексов


СоответствиеПоставщиковАЭПодразделениям = новый Соответствие();
СоответствиеПоставщиковАЭПодразделениям.Вставить("000092773",Справочники.Подразделения.НайтиПоКоду("00005"));
СоответствиеПоставщиковАЭПодразделениям.Вставить("УТ0000494",Справочники.Подразделения.НайтиПоКоду("00138"));//екат
СоответствиеПоставщиковАЭПодразделениям.Вставить("Ф00000010",Справочники.Подразделения.НайтиПоКоду("00106"));//Подразделение Ростов на Дону
СоответствиеПоставщиковАЭПодразделениям.Вставить("П000835",Справочники.Подразделения.НайтиПоКоду("00112"));//Подразделение Санкт-Петербург