
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
	
	
	  // Вставить содержимое обработчика.
  ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
  ДиалогВыбораФайла.Заголовок        = "Загрузить";
  ДиалогВыбораФайла.Расширение    = "txt";
  текст= Новый ТекстовыйДокумент;
  Если ДиалогВыбораФайла.Выбрать() Тогда
	  ИмяФайла = ДиалогВыбораФайла.ПолноеИмяФайла;
	  текст= Новый ТекстовыйДокумент;
	  текст.Прочитать(ИмяФайла);
	  
	 ДокОпр=Документы.ОприходованиеТоваров.СоздатьДокумент();
	 ДокОпр.Дата=КонДата;
	 ДокОпр.Организация=Справочники.Организации.НайтиПоКоду("00001");
	 ДокОпр.Склад=ВыбСклад;
	 ДокОпр.ОтражатьВБухгалтерскомУчете=Истина;
	 ДокОпр.ОтражатьВУправленческомУчете=Истина;
	 ДокОпр.ОтражатьВНалоговомУчете=Истина;
	 ДокОпр.Комментарий="Корректировка себестоимости по складу "+СокрЛП(ДокОпр.Склад.Наименование);
	 ДокОпр.Ответственный=ПараметрыСеанса.ТекущийПользователь;
	 //ДокОпр.
	 СуммаДокумента=0;
	  Для ном=1 по Текст.КоличествоСтрок() Цикл
		  ПСтрока= Текст.ПолучитьСтроку(ном);
		  поз=Найти (ПСтрока,";");
		  Код=Лев(ПСтрока,поз-1);
		  Себестоимость=Сред(ПСтрока,поз+1,СтрДлина(ПСтрока)-поз);
		  НомСсылка=Справочники.Номенклатура.НайтиПоКоду(Код);
		  СтрДок=ДокОпр.Товары.Добавить();
		  СтрДок.Номенклатура=НомСсылка;
		  СтрДок.ЕдиницаИзмерения=СтрДок.Номенклатура.ЕдиницаХраненияОстатков  ;
		  
		 
		
		  СтрДок.Качество=Справочники.Качество.Новый;
		  
          Фильтр = Новый Структура();
          Фильтр.Вставить("Номенклатура",НомСсылка);
          Фильтр.Вставить("Склад", ВыбСклад);

		  ТЗ=РегистрыНакопления.ТоварыНаСкладах.Остатки(НачалоДня(КонДата),Фильтр,"Номенклатура" ,"Количество");
		  
		  Если ТЗ.Количество()>0 Тогда
			СтрДок.Количество=ТЗ[0].Количество;  
		    Иначе
			СтрДок.Количество=0;
		  КонецЕсли; 	  
		  
		  СтрДок.Коэффициент=1;
		  СтрДок.Цена=Себестоимость;
		  СтрДок.Сумма=Себестоимость*СтрДок.Количество;
		  СтрДок.СуммаРегл=Себестоимость*СтрДок.Количество;
		  СуммаДокумента=СуммаДокумента+Себестоимость*СтрДок.Количество;
	  КонецЦикла;	
	  
	  ДокОпр.СуммаДокументаРегл=СуммаДокумента;
	  ДокОпр.СуммаДокумента=СуммаДокумента;
	  ДокОпр.Записать();
	  ДокОпр.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
	  
	КонецЕсли;  
КонецПроцедуры
