
Процедура ПриОткрытии()
	КартинкаЗаголовка= ЭДО_БиблиотекаКартинок().КартинкаЗаголовка;
	ОбновитьСтруктуруЭлементовФормы();
	ОбновитьДанныеНастроекПроксиСервера();
КонецПроцедуры

Процедура ОбновитьДанныеНастроекПроксиСервера()
	НастройкиПроксиЗначение = ОдинСАдаптер_НастройкиТекущегоПользователя_ПолучитьНастройку("ДиадокНастройкиПрокси");
	НастройкиПрокси= ?(ЗначениеЗаполнено(НастройкиПроксиЗначение), НастройкиПроксиЗначение, "ИспользоватьНастройкиIE");
	Если НастройкиПроксиЗначение = "ИспользоватьПроксиСервер"  Тогда
		ПараметрыНастроекПрокси  = ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ПолучитьПараметрыНастроекПроксиДляДиадок();
		ИспользоватьПроксиСервер = ЗначениеЗаполнено(ПараметрыНастроекПрокси.АдресПроксиСервера);
		АдресПроксиСервера       = ПараметрынастроекПрокси.АдресПроксиСервера;
		
		Если найти(АдресПроксиСервера, ":")> 0 Тогда 
			ПортПроксиСервера = прав(АдресПроксиСервера, стрДлина(АдресПроксиСервера) -   найти(АдресПроксиСервера, ":"));
			АдресПроксиСервера = лев(АдресПроксиСервера, найти(АдресПроксиСервера, ":")-1);
		КонецЕсли;	
		
		ЛогинПроксиСервера       = ПараметрынастроекПрокси.ПользовательПроксиСервера;
		ПарольПроксиСервера      = ПараметрынастроекПрокси.ПарольПроксиСервера;
		НастроитьВидимостьПанелиПрокси(Истина);
	Иначе 
		НастроитьВидимостьПанелиПрокси(Ложь);
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьСтруктуруЭлементовФормы()
	
	Если ОдинСАдаптер_НастройкиТекущегоПользователя_ПолучитьНастройку("ДиадокНастройкиПрокси") = Неопределено Тогда
		ПараметрыНастроекПрокси  = ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ПолучитьПараметрыНастроекПроксиДляДиадок();
		Если  ЗначениеЗаполнено(ПараметрыНастроекПрокси.АдресПроксиСервера) Тогда
			ОдинСАдаптер_НастройкиТекущегоПользователя_УстановитьНастройку("ДиадокНастройкиПрокси","ИспользоватьПроксиСервер");
		Иначе
			ОдинСАдаптер_НастройкиТекущегоПользователя_УстановитьНастройку("ДиадокНастройкиПрокси","ИспользоватьНастройкиIE");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура НастроитьВидимостьПанелиПрокси(ИспользоватьПроксиСервер)
	ЭлементыФормы.АдресПроксиСервера.Доступность = ИспользоватьПроксиСервер;
	ЭлементыФормы.ПортПроксиСервера.Доступность = ИспользоватьПроксиСервер;
	ЭлементыФормы.ЛогинПроксиСервера.Доступность = ИспользоватьПроксиСервер;
	ЭлементыФормы.ПарольПроксиСервера.Доступность = ИспользоватьПроксиСервер;
	
	ЭлементыФормы.НадписьАдресПроксиСервера.Доступность = ИспользоватьПроксиСервер;
	ЭлементыФормы.НадписьПортПроксиСервера.Доступность = ИспользоватьПроксиСервер;
	ЭлементыФормы.НадписьЛогинПроксиСервера.Доступность = ИспользоватьПроксиСервер;
	ЭлементыФормы.НадписьПарольПроксиСервера.Доступность = ИспользоватьПроксиСервер;
КонецПроцедуры	

Процедура ПроверитьПараметрыПодключенияНажатие(Элемент)
	
	СтруктураНастроек = ПолучитьСтруктуруНастроекПрокси();
	Попытка
		Модуль_РаботаССерверомДиадок.ПроверитьПодключениеДиадок(НастройкиПрокси, СтруктураНастроек);
		Предупреждение("Подключение прошло успешно!",, НаименованиеСистемы);
	Исключение
		ПолучитьМодульПрог("Модуль_Логика_ПоведениеФорм").СообщениеОбОшибкеДиадок(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура СохранитьПараметрыПодключенияНажатие(Элемент)
	
	ИспользоватьПроксиСервер = 	?(НастройкиПрокси="ИспользоватьПроксиСервер",Истина,Ложь);
	
	СтруктураНастроек = Новый Структура("Адрес, Логин, Пароль");
	СтруктураНастроек.Адрес = АдресПроксиСервера+?(ЗначениеЗаполнено(ПортПроксиСервера), ":"+ПортПроксиСервера, "");
	СтруктураНастроек.Логин = ЛогинПроксиСервера;
	СтруктураНастроек.Пароль = ПарольПроксиСервера;
	
	Если НастройкиПрокси = "ИспользоватьПроксиСервер" Тогда
		Модуль_РаботаССерверомДиадок.УстановитьНастройкиПрокси(СтруктураНастроек);
	ИначеЕсли НастройкиПрокси = "ИспользоватьНастройкиIE" Тогда
		Модуль_РаботаССерверомДиадок.УстановитьНастройкиIE(,1);
	Иначе
		Модуль_РаботаССерверомДиадок.УстановитьНастройкиIE(,0);
	КонецЕсли;
	
	Попытка
		Модуль_РаботаССерверомДиадок.ПроверитьПодключениеДиадок(НастройкиПрокси, СтруктураНастроек);
		Результат = Истина;
	Исключение 
		ПолучитьМодульПрог("Модуль_Логика_ПоведениеФорм").СообщениеОбОшибкеДиадок(ОписаниеОшибки());
	КонецПопытки;
	
	Этаформа.Закрыть();
	
КонецПроцедуры

Процедура ОсновныеДействияФормыОтмена(Кнопка)
	этаформа.Закрыть();
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура НастройкиПроксиПриИзменении(Элемент)
	
	СтруктураНастроек = ПолучитьСтруктуруНастроекПрокси();
	Если НастройкиПрокси = "ИспользоватьПроксиСервер" Тогда
		НастроитьВидимостьПанелиПрокси(Истина);	
		Модуль_РаботаССерверомДиадок.УстановитьНастройкиПрокси(СтруктураНастроек);
	Иначе
		НастроитьВидимостьПанелиПрокси(Ложь);
		
		Если НастройкиПрокси = "ИспользоватьНастройкиIE" Тогда 
			Модуль_РаботаССерверомДиадок.УстановитьНастройкиIE(,1);
		Иначе
			Модуль_РаботаССерверомДиадок.УстановитьНастройкиIE(,0);
		КонецЕсли;	
	КонецЕсли;
	ОдинСАдаптер_НастройкиТекущегоПользователя_УстановитьНастройку("ДиадокНастройкиПрокси",Элемент.Значение);
	ОбновитьДанныеНастроекПроксиСервера();
КонецПроцедуры

Функция ПолучитьСтруктуруНастроекПрокси()
	
	СтруктураНастроек= Новый Структура("Адрес, Логин, Пароль");
	СтруктураНастроек.Адрес = АдресПроксиСервера + ?(ЗначениеЗаполнено(ПортПроксиСервера), ":" + ПортПроксиСервера, "");
	СтруктураНастроек.Логин = ЛогинПроксиСервера;
	СтруктураНастроек.Пароль = ПарольПроксиСервера;
	
	Возврат СтруктураНастроек;
	
КонецФункции

Процедура СохранитьПараметрыПодключения()
	
	СтруктураНастроек = ПолучитьСтруктуруНастроекПрокси();
	Модуль_РаботаССерверомДиадок.УстановитьНастройкиПрокси(СтруктураНастроек);
	
	ОбновитьДанныеНастроекПроксиСервера();
	
КонецПроцедуры


