
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ЗаполнитьСписокРегионов()
	СписокРегионов = новый СписокЗначений;
	СписокРегионов.Очистить();
	//регионы с кодами яндекса
	//http://hmxblog.ya.ru/replies.xml?item_no=2780
	
	СписокРегионов = ДобавитьРегион(СписокРегионов,"213","Москва");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"2","С. Петербург");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"43","Казань");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"54","Екатеринбург");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"16","Ярославль");
	
	//ЦФО
	СписокРегионов = ДобавитьРегион(СписокРегионов,"1","Москва и Московская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10645","Белгородская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10650","Брянская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10658","Владимирская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10672","Воронежская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10687","Ивановская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10693","Калужская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10699","Костромская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10705","Курская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10712","Липецкая область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10772","Орловская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10776","Рязанская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10795","Смоленская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10802","Тамбовская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10819","Тверская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10832","Тульская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10841","Ярославская область");
	
	//Северо-Западный федеральный округ
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10174","Санкт-Петербург и Ленинградская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10176","Ненецкий автономный округ");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10842","Архангельская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10853","Вологодская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10857","Калининградская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10897","Мурманская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10904","Новгородская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10926","Псковская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10933","Республика Карелия");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10939","Республика Коми");
	
	//Южный федеральный округ
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10946","Астраханская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10950","Волгоградская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10995","Краснодарский край");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11004","Республика Адыгеяи");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11015","Республика Калмыкия");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11029","Ростовская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"977","Республика Крым");

	//Приволжский федеральный округ
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11070","Кировская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11077","Республика Марий Эл");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11079","Нижегородская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11084","Оренбургская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11095","Пензенская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11108","Пермский край");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11111","Республика Башкортостан");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11117","Республика Мордовия");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11119","Республика Татарстан");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11131","Самарская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11146","Саратовская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11148","Удмуртская Республика");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11153","Ульяновская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11156","Чувашская Республика");
	
	//Уральский федеральный округ
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11158","Курганская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11162","Свердловская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11176","Тюменская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11193","Ханты-Мансийский автономный округ - Югра");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11225","Челябинская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11232","Ямало-Ненецкий автономный округ");

	//Сибирский федеральный округ
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10231","Республика Алтай");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10233","Республика Тыв");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11235","Алтайский край");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11266","Иркутская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11282","Кемеровская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11309","Красноярский край");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11316","Новосибирская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11318","Омская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11330","Республика Бурятия");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11340","Республика Хакасия");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11353","Томская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"21949","Забайкальский край");

	//Дальневосточный федеральный округ
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10243","Еврейская автономная область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"10251","Чукотский автономный округ");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11375","Амурская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11398","Камчатский край");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11403","Магаданская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11409","Приморский край");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11443","Республика Саха (Якутия)");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11450","Сахалинская область");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11457","Хабаровский край");
	
	//Северо-Кавказский федеральный округ
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11010","Республика Дагестан");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11012","Республика Ингушетия");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11013","Кабардино-Балкарская Республика");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11020","Карачаево-Черкесская Республика");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11021","Республика Северная Осетия — Алания");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11024","Чеченская Республика");
	СписокРегионов = ДобавитьРегион(СписокРегионов,"11069","Ставропольский край");

	
	СписокРегионов.СортироватьПоПредставлению();
	//ЭлементыФормы.СписокРегионов.СписокВыбора=СписокРегионов;
	//Регионы.ЗагрузитьЗначения(СписокРегионов.ВыгрузитьЗначения());
	//Для каждого рег из СписокРегионов цикл
	//	нсп = Регионы.Добавить(); 
	//	ЗаполнитьЗначенияСвойств(нсп,рег);
	//КонецЦикла;	

	//Регионы.СортироватьПоПредставлению();
	
	ЭлементыФормы.СписокВыбораРегионов.СписокВыбора = СписокРегионов;
КонецПроцедуры

Функция ДобавитьРегион(Список,КодРегиона,НазваниеРегиона)
	Если Список.НайтиПоЗначению(КодРегиона)=неопределено тогда
		Список.Добавить(КодРегиона,НазваниеРегиона);
		//Регионы.Добавить(КодРегиона,НазваниеРегиона);
	КонецЕсли;
	возврат Список;
КонецФункции

Процедура ПриОткрытии()
	ЗаполнитьСписокРегионов();
КонецПроцедуры

Процедура СписокВыбораРегионовПриИзменении(Элемент)
	Сообщить("" + Элемент.ВыделенныйТекст + " - " + Элемент.Значение);
КонецПроцедуры
