
Процедура ДействияФормыОтчетСформировать(Кнопка)

	ТабДок = ЭлементыФормы.ПолеТабличногоДокумента;
	Отчет(ТабДок);

КонецПроцедуры

Процедура Отчет(ТабДок) Экспорт

	Макет = ПолучитьМакет("Отчет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	| Б.КОнтрагент,
	| Б.ОсновнойМенеджерКонтрагента,
	|	Б.ДатаПоследнегоДокумента,
	|	Б.ДатаПоследнегоАкта,
    |  ВзаиморасчетыСКонтрагентамиОстатки.Долг Долг
	|
	| ИЗ
	|(ВЫБРАТЬ
	|	А.КОнтрагент КОнтрагент,
	|	А.КОнтрагент.ОсновнойМенеджерКонтрагента ОсновнойМенеджерКонтрагента,
	|	А.ДатаПоследнегоДокумента,
	|	А.ДатаПоследнегоАкта
	|ИЗ
	|	(ВЫБРАТЬ
	|		А.КОнтрагент КАК КОнтрагент,
	|		А.ДатаПоследнегоДокумента КАК ДатаПоследнегоДокумента,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(Б.ДатаПоследнегоАкта, &НачДата) >= &НачДата
	|				ТОГДА ЕСТЬNULL(Б.ДатаПоследнегоАкта, &НачДата)
	|			ИНАЧЕ &НачДата
	|		КОНЕЦ КАК ДатаПоследнегоАкта
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВзаиморасчетыСКонтрагентамиОбороты.ДоговорКонтрагента.Владелец КАК КОнтрагент,
	|			МАКСИМУМ(ВзаиморасчетыСКонтрагентамиОбороты.Регистратор.Дата) КАК ДатаПоследнегоДокумента
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(&НачДата, &КонДата, Регистратор,ДоговорКонтрагента.ВедениеВзаиморасчетов=&ПоЗаказам ) КАК ВзаиморасчетыСКонтрагентамиОбороты
	|			
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВзаиморасчетыСКонтрагентамиОбороты.ДоговорКонтрагента.Владелец) КАК А
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				МАКСИМУМ(АктыСверокСКонтрагентами.Дата) КАК ДатаПоследнегоАкта,
	|				АктыСверокСКонтрагентами.Контрагент КАК Контрагент
	|			ИЗ
	|				РегистрСведений.АктыСверокСКонтрагентами КАК АктыСверокСКонтрагентами
	|			
	|			СГРУППИРОВАТЬ ПО
	|				АктыСверокСКонтрагентами.Контрагент) КАК Б
	|			ПО А.КОнтрагент = Б.Контрагент) КАК А
	|ГДЕ
	|	А.ДатаПоследнегоАкта < А.ДатаПоследнегоДокумента
	|	И РАЗНОСТЬДАТ(А.ДатаПоследнегоАкта, &КонДата, ДЕНЬ) > 90 ) Б
	|
	| ЛЕВОЕ СОЕДИНЕНИЕ 
	|( ВЫБРАТЬ ДоговорКонтрагента.Владелец Контрагент,
	| СУММА(СуммаВзаиморасчетовОстаток) Долг
	| ИЗ
	|РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&КонДата)
	| СГРУППИРОВАТЬ ПО ДоговорКонтрагента.Владелец 
	|) ВзаиморасчетыСКонтрагентамиОстатки
	|ПО Б.Контрагент=ВзаиморасчетыСКонтрагентамиОстатки.Контрагент
	| 
	|
	|// УПОРЯДОЧИТЬ ПО РАЗНОСТЬДАТ(А.ДатаПоследнегоАкта, &КонДата, ДЕНЬ) УБЫВ
	| УПОРЯДОЧИТЬ ПО Б.Контрагент.Наименование";

	Запрос.УстановитьПараметр("ПоЗаказам", Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам);
	Запрос.УстановитьПараметр("КонДата", КонецДня(КонДата));
	Запрос.УстановитьПараметр("НачДата", Константы.ДатаНачалаВеденияАктовСверок.Получить());

	Результат = Запрос.Выполнить();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.КонДата = ФОрмат(КонДата,"ДФ=dd.MM.yyyy");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаДетали = Результат.Выбрать();

	Пока ВыборкаДетали.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
		ОбластьДетальныхЗаписей.Параметры.Телефон = ОписаниеОрганизации(СведенияОЮрФизЛице(ВыборкаДетали.Контрагент, ТекущаяДата()), "Телефоны,");
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетали.Уровень());
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ
КонецПроцедуры

Процедура ПриОткрытии()
	КонДата=ТекущаяДата();
КонецПроцедуры

  

