Функция Печать() Экспорт	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ЗаданиеОтделуВЭД") Тогда
		Возврат ПечатьДокумента(СсылкаНаОбъект);
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ЗаказПокупателяСезонный") Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ссылка",СсылкаНаОбъект);
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ЗаданиеОтделуВЭД.Ссылка
		               |ИЗ
		               |	Документ.ЗаданиеОтделуВЭД КАК ЗаданиеОтделуВЭД
		               |ГДЕ
		               |	ЗаданиеОтделуВЭД.Заказ = &Ссылка";
		Рез = Запрос.Выполнить().Выгрузить();
					   
		док = Рез[0].Ссылка;
		Возврат ПечатьДокумента(Док);
	КонецЕсли;	
КонецФункции // Печать

Функция ПечатьДокумента(Док) 
	
	Макет = ПолучитьМакет("Макет");
	
	табДокумент = НОвый ТабличныйДокумент;
	табДокумент.АвтоМасштаб = Истина;
	табДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	
	область = макет.ПолучитьОбласть("Шапка");
	Область.Параметры.ДатаОтгрузкиПок=	Док.ДатаОтгрузкиПоДаннымПокупателя;			
	Область.Параметры.ДатаОтгрузкиПост=	Док.ДатаОтгрузкиПоДаннымПоставщика;			
	Область.Параметры.Усл=	Док.УсловияПоставки;			
	Область.Параметры.ПортВ	=Док.ПортВыгрузки;			
	Область.Параметры.ПортН= Док.ПортНазначения;			
	Область.Параметры.Адрес	=Док.АдресДоставки;			
	Область.Параметры.СтатусКл=	Док.СтатусЗаказаКлиент;			
	Область.Параметры.СтатусПост=Док.СтатусЗаказаПоставщик;				
	Область.Параметры.Контейнер	=Док.РазмерКонтейнера;			
	Область.Параметры.Упак=	Док.ТребованияКУпаковкеКонтейнера;	
	
    табДокумент.Вывести(область);
	
	для Каждого стр из Док.товары Цикл
		нов = макет.ПолучитьОбласть("Строка");
		Нов.Параметры.Номер	= стр.НомерСтроки;
		Нов.Параметры.Код	= стр.Номенклатура.Код;
		Нов.Параметры.Товар	= стр.Номенклатура.наименование;
		Нов.Параметры.Кол	= стр.Количество;
		Нов.Параметры.Ед	= стр.Номенклатура.БазоваяЕдиницаИзмерения.наименование;
		Нов.Параметры.Цена	= стр.Цена;
		Нов.Параметры.Сумма	= стр.Сумма;
		Нов.Параметры.ЦенаF	= стр.ЦенаFOB;
		Нов.Параметры.макет	= стр.Запросить3Dмакет;
		Нов.Параметры.чертеж= стр.ЗапроситьЧертеж;	
		Нов.Параметры.макетсогласован=стр.Макет3DСогласован;
		Нов.Параметры.Дизайн= стр.ДизайнКоробки;	
		Нов.Параметры.фото	= стр.ВыслатьФото;
		Нов.Параметры.Изготовитель   = стр.Изготовитель;	
		//Набор = РегистрыСведений.СоответствиеТипоразмеровАвтомобилям.СоздатьНаборЗаписей();
		//Набор.Отбор.типоразмер.Установить(стр.Номенклатура.Типоразмер);
		//набор.Прочитать();
		//если набор.Количество()>0 Тогда
		//	Авт = набор[0].Автомобили;
		//КонецЕсли;
		//Нов.Параметры.Применяемость  = Авт;	
		Нов.Параметры.Комментарий    = стр.Комментарий;
		Нов.Параметры.Крышка= стр.Крышка;	
		Нов.Параметры.серт  = стр.СпецТребованияСертификат;  
		табДокумент.Вывести(Нов);
	КонецЦикла;
	
	Возврат табДокумент;
	
КонецФункции
