
Процедура ПриОткрытии()
	Подразделение = глТекущийПользователь.ОсновноеПодразделение;
	
	Если Найти(глТекущийПользователь.Наименование,"Осипова")>0 Тогда	
	    ЭлементыФормы.Подразделение.Доступность = Истина;
	иначе
		ЭлементыФормы.Подразделение.Доступность = Ложь;
	КонецЕсли;
	
	Датас = ДобавитьМесяц(ТекущаяДата(),-1);
	ДатаПо = ТекущаяДата();
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	Если ЗначениеНеЗаполнено(глТекущийПользователь.ОсновноеПодразделение) 
		и Найти(глТекущийПользователь.Наименование,"Осипова") = 0 Тогда
		Отказ = истина;
	КонецЕсли;
	
	Если глТекущийПользователь.ОсновноеПодразделение <> Справочники.Подразделения.НайтиПоКоду("00112")
		и глТекущийПользователь.ОсновноеПодразделение <> Справочники.Подразделения.НайтиПоКоду("00138")
		и глТекущийПользователь.ОсновноеПодразделение <> Справочники.Подразделения.НайтиПоКоду("00106") Тогда
		
	Отказ = истина;
	КонецЕсли;

КонецПроцедуры
