перем мЖирныйШрифт, мСписокЗаказов; 

Процедура КоманднаяПанель1Выбрать(Кнопка)
	
	заказ1 = ЭлементыФормы.Список.ТекущаяСтрока;

	стр2 = ВладелецФормы.Заказы.Добавить();
	стр2.Заказ = Заказ1;
	ВладелецФормы.ЭтотОбъект.ЗаполнитьСтроку(стр2);
 
КонецПроцедуры

Процедура ПриОткрытии()
	
	//+++ отбор док. за период - месяц с текущего дня
		список.отбор.Дата.ЗначениеПо = КонецДня(ТекущаяДата());
		список.отбор.Дата.ЗначениеС  = ДобавитьМесяц(НачалоДня(ТекущаяДата()), -1);
		список.отбор.Дата.Использование = Истина;
		
КонецПроцедуры

//-----------------------------------------------------------

Функция ПроверитьОтгрузкуПоЗаказу(СсылкаЗаказ)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Сделка,
	|	Проведен,
	|	ПометкаУдаления
	|ИЗ
	|  	Документ.РеализацияТоваровУслуг
	|ГДЕ
	|   Сделка = &СсылкаЗаказ И Проведен И ПометкаУдаления = ЛОЖЬ
	|";
	
	Запрос.УстановитьПараметр("СсылкаЗаказ",СсылкаЗаказ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		
		Возврат Истина;
		
	КонецЕсли;	

	Возврат Ложь;
	
КонецФункции

Функция ПроверитьЗакрытиеЗаказа(СсылкаЗаказ)
	Если 	мСписокЗаказов.Найти(СсылкаЗаказ)=Неопределено И СсылкаЗаказ.Проведен Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли	
КонецФункции

Процедура ПеречитатьСписокЗаказов()
	Запрос=Новый Запрос;
	
	Запрос.Текст=" ВЫБРАТЬ РАЗЛИЧНЫЕ ЗаказПокупателя ИЗ	РегистрНакопления.ЗаказыПокупателей.Остатки ";
	мСписокЗаказов=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказПокупателя");
КонецПроцедуры	

Процедура СписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
//+++ такая же как в форме выбора Документа	
	Если (Константы.ОплатыРаспределяютМенеджеры.Получить()) Тогда
		
		ТекущаяСтрока = ДанныеСтроки;
		СуммаДолга  = ТекущийДолг(ТекущаяСтрока.Ссылка.ДоговорКонтрагента, ТекущаяСтрока.Ссылка, Неопределено);
		Если (СуммаДолга<>неопределено) и (СуммаДолга<>0) Тогда 
			ОформлениеСтроки.ЦветФона = WebЦвета.Желтый;
		КонецЕсли;
		
	КонецЕсли;
	
	
//+++ как в форме списка документа	
	Если ПроверитьЗакрытиеЗаказа(ДанныеСтроки.Ссылка) Тогда
		ОформлениеСтроки.ЦветФона = WebЦвета.LightGray;
	КонецЕсли;
	
	Если ПроверитьОтгрузкуПоЗаказу(ДанныеСтроки.Ссылка) Тогда
		ОформлениеСтроки.ЦветТекста = WebЦвета.Синий;
	КонецЕсли;	
		
	 
	ОформлениеСтроки.Ячейки.Проверен.ОтображатьКартинку = Истина;
	ОформлениеСтроки.Ячейки.Проверен.ОтображатьТекст    = Ложь;
	ОформлениеСтроки.Ячейки.Проверен.ОтображатьФлажок   = Ложь;
	ОформлениеСтроки.Ячейки.Проверен.ИндексКартинки     = 2;

	
	Если ДанныеСтроки.Ссылка.Проверен Тогда 
		
		ОформлениеСтроки.Шрифт = мЖирныйШрифт;
        ОформлениеСтроки.Ячейки.Проверен.ИндексКартинки     = 3;
		
	КонецЕсли;


КонецПроцедуры

Процедура ОбновлениеОтображения()
	ПеречитатьСписокЗаказов();
КонецПроцедуры

//-----------------------------------------------------------

Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	КоманднаяПанель1Выбрать(неопределено);
КонецПроцедуры



мСписокЗаказов=Новый Массив;
мЖирныйШрифт = Новый Шрифт(,, Истина);
