
Процедура ПолучитьОтчет(табДок, НачДата) Экспорт
	
	Макет = ПолучитьМакет("Отчет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Ссылка КАК Ссылка,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.Количество КАК Количество,
	|	ЗаказПоставщикуТовары.Цена КАК Цена,
	|	ЗаказПоставщикуТовары.Сумма КАК Сумма
	|ПОМЕСТИТЬ ЗаказыПоставщику
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка.Проведен
	|	И ЗаказПоставщикуТовары.Ссылка.Дата >= &НачДата
	|	И ЗаказПоставщикуТовары.Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)
	|	И ЗаказПоставщикуТовары.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов = &USD
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщику.Ссылка КАК Ссылка,
	|	ЗаказыПоставщику.Номенклатура.Код КАК Код,
	|	ЗаказыПоставщику.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщику.Количество,
	|	ЗаказыПоставщику.Цена,
	|	ЕСТЬNULL(ЦеныФОП.Цена, 0) КАК ЦенаФОП,
	|	ЗаказыПоставщику.Сумма,
	|	NULL КАК Крепеж,
	|	0 КАК КоличествоКрепежа,
	|	0 КАК ЦенаКрепежаФОП,
	|	ЕСТЬNULL(ЦеныФОП.Цена, 0) КАК ЦенаДискаФоп
	|ПОМЕСТИТЬ ЦенаСкомплектующими
	|ИЗ
	|	ЗаказыПоставщику КАК ЗаказыПоставщику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныФОП КАК ЦеныФОП
	|		ПО ЗаказыПоставщику.Номенклатура = ЦеныФОП.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказыПоставщику.Ссылка,
	|	ЗаказыПоставщику.Номенклатура.Код,
	|	ЗаказыПоставщику.Номенклатура,
	|	0,
	|	0,
	|	КомплектующиеНоменклатуры.Количество * ЕСТЬNULL(ЦеныФОП.Цена, 0),
	|	0,
	|	КомплектующиеНоменклатуры.Комплектующая.Код,
	|	КомплектующиеНоменклатуры.Количество,
	|	ЕСТЬNULL(ЦеныФОП.Цена, 0),
	|	0
	|ИЗ
	|	ЗаказыПоставщику КАК ЗаказыПоставщику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныФОП КАК ЦеныФОП
	|			ПО КомплектующиеНоменклатуры.Комплектующая = ЦеныФОП.Номенклатура
	|		ПО ЗаказыПоставщику.Номенклатура = КомплектующиеНоменклатуры.Номенклатура
	|ГДЕ
	|	КомплектующиеНоменклатуры.Комплектующая.Родитель В(&Родитель)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенаСкомплектующими.Ссылка КАК Ссылка,
	|	ЦенаСкомплектующими.Код КАК Код,
	|	ЦенаСкомплектующими.Номенклатура КАК Номенклатура,
	|	СУММА(ЦенаСкомплектующими.Количество) КАК Количество,
	|	СУММА(ЦенаСкомплектующими.Цена) КАК Цена,
	|	СУММА(ЦенаСкомплектующими.ЦенаФОП) КАК ЦенаФОП,
	|	СУММА(ЦенаСкомплектующими.Сумма) КАК Сумма,
	|	МАКСИМУМ(ЦенаСкомплектующими.Крепеж) КАК Крепеж,
	|	СУММА(ЦенаСкомплектующими.КоличествоКрепежа) КАК КоличествоКрепежа,
	|	СУММА(ЦенаСкомплектующими.ЦенаКрепежаФОП) КАК ЦенаКрепежаФОП,
	|	СУММА(ЦенаСкомплектующими.ЦенаДискаФоп) КАК ЦенаДискаФоп
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	ЦенаСкомплектующими КАК ЦенаСкомплектующими
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦенаСкомплектующими.Ссылка,
	|	ЦенаСкомплектующими.Код,
	|	ЦенаСкомплектующими.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.Ссылка КАК Ссылка,
	|	ИтоговаяТаблица.Код,
	|	ИтоговаяТаблица.Номенклатура КАК Номенклатура,
	|	ИтоговаяТаблица.Количество,
	|	ИтоговаяТаблица.Цена,
	|	ИтоговаяТаблица.ЦенаФОП,
	|	ИтоговаяТаблица.Сумма,
	|	ИтоговаяТаблица.Крепеж,
	|	ИтоговаяТаблица.КоличествоКрепежа,
	|	ИтоговаяТаблица.ЦенаКрепежаФОП,
	|	ИтоговаяТаблица.ЦенаДискаФоп
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица
	|ГДЕ
	|	ИтоговаяТаблица.Цена > ИтоговаяТаблица.ЦенаФОП
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Номенклатура";

	Запрос.УстановитьПараметр("USD", Справочники.Валюты.НайтиПоНаименованию("USD"));
	Запрос.УстановитьПараметр("НачДата", НачДата);
    список = новый списокЗначений();
	Список.добавить(справочники.Номенклатура.НайтиПоКоду("0000702"));
	Список.Добавить(справочники.Номенклатура.НайтиПоКоду("0000713"));
	Запрос.УстановитьПараметр("Родитель", Список);
	
	
	Результат = Запрос.Выполнить();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьСсылка = Макет.ПолучитьОбласть("Ссылка");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ОбластьЗаголовок.Параметры.ПредставлениеПериода = ПредставлениеПериода(НачДата, КонецДня(ТекущаяДата()));
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаСсылка = Результат.Выбрать();

	Пока ВыборкаСсылка.Следующий() Цикл
		//ОбластьСсылка.Параметры.Заполнить(ВыборкаСсылка);
		//ОбластьСсылка.Параметры.Комментарий =СокрЛП(ВыборкаСсылка.Ссылка.Комментарий);
		//ТабДок.Вывести(ОбластьСсылка, ВыборкаСсылка.Уровень());

		//ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();

		//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаСсылка);
			ОбластьДетальныхЗаписей.Параметры.Разница =  ВыборкаСсылка.цена - Выборкассылка.ЦенаФОП;
			ТабДок.Вывести(ОбластьДетальныхЗаписей);
		//КонецЦикла;
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

	
	//контроль сезонных заказов
	 	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуСезонныйТовары.Ссылка КАК Ссылка,
	|	ЗаказПоставщикуСезонныйТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуСезонныйТовары.Количество КАК Количество,
	|	ЗаказПоставщикуСезонныйТовары.Цена КАК Цена,
	|	ЗаказПоставщикуСезонныйТовары.Сумма КАК Сумма
	|ПОМЕСТИТЬ ЗаказыПоставщику
	|ИЗ
	|	Документ.ЗаказПоставщикуСезонный.Товары КАК ЗаказПоставщикуСезонныйТовары
	|ГДЕ
	|	ЗаказПоставщикуСезонныйТовары.Ссылка.Проведен
	|	И ЗаказПоставщикуСезонныйТовары.Ссылка.Дата >= &НачДата
	|	И ЗаказПоставщикуСезонныйТовары.Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)
	|	И ЗаказПоставщикуСезонныйТовары.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов = &USD
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщику.Ссылка КАК Ссылка,
	|	ЗаказыПоставщику.Номенклатура.Код КАК Код,
	|	ЗаказыПоставщику.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщику.Количество,
	|	ЗаказыПоставщику.Цена,
	|	ЕСТЬNULL(ЦеныФОП.Цена, 0) КАК ЦенаФОП,
	|	ЗаказыПоставщику.Сумма,
	|	NULL КАК Крепеж,
	|	0 КАК КоличествоКрепежа,
	|	0 КАК ЦенаКрепежаФОП,
	|	ЕСТЬNULL(ЦеныФОП.Цена, 0) КАК ЦенаДискаФоп
	|ПОМЕСТИТЬ ЦенаСкомплектующими
	|ИЗ
	|	ЗаказыПоставщику КАК ЗаказыПоставщику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныФОП КАК ЦеныФОП
	|		ПО ЗаказыПоставщику.Номенклатура = ЦеныФОП.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказыПоставщику.Ссылка,
	|	ЗаказыПоставщику.Номенклатура.Код,
	|	ЗаказыПоставщику.Номенклатура,
	|	0,
	|	0,
	|	КомплектующиеНоменклатуры.Количество * ЕСТЬNULL(ЦеныФОП.Цена, 0),
	|	0,
	|	КомплектующиеНоменклатуры.Комплектующая.Код,
	|	КомплектующиеНоменклатуры.Количество,
	|	ЕСТЬNULL(ЦеныФОП.Цена, 0),
	|	0
	|ИЗ
	|	ЗаказыПоставщику КАК ЗаказыПоставщику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныФОП КАК ЦеныФОП
	|			ПО КомплектующиеНоменклатуры.Комплектующая = ЦеныФОП.Номенклатура
	|		ПО ЗаказыПоставщику.Номенклатура = КомплектующиеНоменклатуры.Номенклатура
	|ГДЕ
	|	КомплектующиеНоменклатуры.Комплектующая.Родитель В(&Родитель)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенаСкомплектующими.Ссылка КАК Ссылка,
	|	ЦенаСкомплектующими.Код КАК Код,
	|	ЦенаСкомплектующими.Номенклатура КАК Номенклатура,
	|	СУММА(ЦенаСкомплектующими.Количество) КАК Количество,
	|	СУММА(ЦенаСкомплектующими.Цена) КАК Цена,
	|	СУММА(ЦенаСкомплектующими.ЦенаФОП) КАК ЦенаФОП,
	|	СУММА(ЦенаСкомплектующими.Сумма) КАК Сумма,
	|	МАКСИМУМ(ЦенаСкомплектующими.Крепеж) КАК Крепеж,
	|	СУММА(ЦенаСкомплектующими.КоличествоКрепежа) КАК КоличествоКрепежа,
	|	СУММА(ЦенаСкомплектующими.ЦенаКрепежаФОП) КАК ЦенаКрепежаФОП,
	|	СУММА(ЦенаСкомплектующими.ЦенаДискаФоп) КАК ЦенаДискаФоп
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	ЦенаСкомплектующими КАК ЦенаСкомплектующими
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦенаСкомплектующими.Ссылка,
	|	ЦенаСкомплектующими.Код,
	|	ЦенаСкомплектующими.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.Ссылка КАК Ссылка,
	|	ИтоговаяТаблица.Код,
	|	ИтоговаяТаблица.Номенклатура КАК Номенклатура,
	|	ИтоговаяТаблица.Количество,
	|	ИтоговаяТаблица.Цена,
	|	ИтоговаяТаблица.ЦенаФОП,
	|	ИтоговаяТаблица.Сумма,
	|	ИтоговаяТаблица.Крепеж,
	|	ИтоговаяТаблица.КоличествоКрепежа,
	|	ИтоговаяТаблица.ЦенаКрепежаФОП,
	|	ИтоговаяТаблица.ЦенаДискаФоп
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица
	|ГДЕ
	|	ИтоговаяТаблица.Цена > ИтоговаяТаблица.ЦенаФОП
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Номенклатура";

	Запрос.УстановитьПараметр("USD", Справочники.Валюты.НайтиПоНаименованию("USD"));
	Запрос.УстановитьПараметр("НачДата", НачДата);
    список = новый списокЗначений();
	Список.добавить(справочники.Номенклатура.НайтиПоКоду("0000702"));
	Список.Добавить(справочники.Номенклатура.НайтиПоКоду("0000713"));
	Запрос.УстановитьПараметр("Родитель", Список);
	
	
	Результат = Запрос.Выполнить();

	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицыСезон");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьСсылка = Макет.ПолучитьОбласть("Ссылка");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ОбластьЗаголовок.Параметры.ПредставлениеПериода = ПредставлениеПериода(НачДата, КонецДня(ТекущаяДата()));
	
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаСсылка = Результат.Выбрать();

	Пока ВыборкаСсылка.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаСсылка);
			ОбластьДетальныхЗаписей.Параметры.Разница =  ВыборкаСсылка.цена - Выборкассылка.ЦенаФОП;
			ТабДок.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

	
	 // не установленные цены
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокЦеныНеУстановлены");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаЦеныНеУстановлены");
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);

	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	             |	ЗаказПоставщикуТовары.Цена,
	             |	ЗаказПоставщикуТовары.Номенклатура.Код КАК Код
	             |ПОМЕСТИТЬ НоменклатураИзЗаказов
	             |ИЗ
	             |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	             |ГДЕ
	             |	ЗаказПоставщикуТовары.Ссылка.Проведен
	             |	И ЗаказПоставщикуТовары.Ссылка.Дата >= &НачДата
	             |	И ЗаказПоставщикуТовары.Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)
	             |	И ЗаказПоставщикуТовары.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов = &USD
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	НоменклатураИзЗаказов.Номенклатура КАК Номенклатура,
	             |	НоменклатураИзЗаказов.Цена,
	             |	НоменклатураИзЗаказов.Номенклатура.Код КАК Код
	             |ИЗ
	             |	НоменклатураИзЗаказов КАК НоменклатураИзЗаказов
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныФОП КАК ЦеныФОП
	             |		ПО НоменклатураИзЗаказов.Номенклатура = ЦеныФОП.Номенклатура
	             |ГДЕ
	             |	(ЦеныФОП.Цена = 0
	             |			ИЛИ ЦеныФОП.Цена ЕСТЬ NULL )
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	КомплектующиеНоменклатуры.Комплектующая,
	             |	NULL,
	             |	КомплектующиеНоменклатуры.Комплектующая.Код
	             |ИЗ
	             |	РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	             |ГДЕ
	             |	КомплектующиеНоменклатуры.Комплектующая.Родитель В(&Родитель)
	             |	И НЕ КомплектующиеНоменклатуры.Комплектующая В
	             |				(ВЫБРАТЬ
	             |					РегистрСведений.ЦеныФОП.Номенклатура
	             |				ИЗ
	             |					РегистрСведений.ЦеныФОП)
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Номенклатура";
				 
				 
	ВыборкаДетальныеЗаписи=Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		   ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("ДеталиЦеныНеУстановлены");
           ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		   ТабДок.Вывести(ОбластьДетальныхЗаписей);
    КонецЦикла;

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ
КонецПроцедуры