
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	ОтчетИнициализация();

КонецПроцедуры

Процедура ПриЗакрытии()

	СохранитьЗначение("НастройкаВнешниеОтчетыВыключенныеПравилаОтчет_bd73dc0b-09d6-47d3-bb4a-1194b112d469", ПостроительОтчетаОтчет.ПолучитьНастройки());

КонецПроцедуры

Процедура ДействияФормыОтчетНастройка(Кнопка)
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_НАСТРОЙКА(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Форма = ВнешнийОтчетОбъект.ПолучитьФорму("ОтчетНастройка");
	Форма.ПостроительОтчета = ПостроительОтчетаОтчет;
	Настройка = ПостроительОтчетаОтчет.ПолучитьНастройки();
	Если Форма.ОткрытьМодально() = Истина Тогда
		ОтчетВывести();
	Иначе
		ПостроительОтчетаОтчет.УстановитьНастройки(Настройка);
	КонецЕсли;

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_НАСТРОЙКА
КонецПроцедуры

Процедура ДействияФормыОтчетСформировать(Кнопка)
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	ОтчетВывести();

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА
КонецПроцедуры

Процедура ОтчетВывести()
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_ВЫПОЛНИТЬ(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	ЭлементыФормы.ПолеТабличногоДокумента.Очистить();

	ПостроительОтчетаОтчет.Выполнить();
	ПостроительОтчетаОтчет.РазмещениеИзмеренийВСтроках = ТипРазмещенияИзмерений.Вместе;
	ПостроительОтчетаОтчет.РазмещениеРеквизитовИзмеренийВСтроках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
	ПостроительОтчетаОтчет.РазмещениеРеквизитовИзмеренийВКолонках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
	ПостроительОтчетаОтчет.МакетОформления = ПолучитьМакетОформления(СтандартноеОформление.Классика);
	ПостроительОтчетаОтчет.Вывести(ЭлементыФормы.ПолеТабличногоДокумента);

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_ВЫПОЛНИТЬ
КонецПроцедуры

Процедура ОтчетИнициализация()
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_ИНИЦИАЛИЗАЦИЯ(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	ПостроительОтчетаОтчет.Текст =
	"ВЫБРАТЬ
	|	ПравилаЦенообразования.Контрагент КАК Контрагент,
	|	ПравилаЦенообразования.Контрагент.ОсновнойМенеджерКонтрагента КАК КонтрагентОсновнойМенеджерКонтрагента,
	|	ПравилаЦенообразования.Приоритет КАК Приоритет,
	|	ПравилаЦенообразования.Выключено,
	|	ПравилаЦенообразования.ВидТовара,
	|	ПравилаЦенообразования.Производитель,
	|	ПРЕДСТАВЛЕНИЕ(ПравилаЦенообразования.Производитель),
	|	ПравилаЦенообразования.НоменклатурнаяГруппа,
	|	ПРЕДСТАВЛЕНИЕ(ПравилаЦенообразования.НоменклатурнаяГруппа),
	|	ПравилаЦенообразования.ВходитВПапку,
	|	ПРЕДСТАВЛЕНИЕ(ПравилаЦенообразования.ВходитВПапку),
	|	ПравилаЦенообразования.Диаметр,
	|	ПравилаЦенообразования.Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(ПравилаЦенообразования.Номенклатура),
	|	ПравилаЦенообразования.ТипЦен,
	|	ПРЕДСТАВЛЕНИЕ(ПравилаЦенообразования.ТипЦен),
	|	ПравилаЦенообразования.ПодСтрока,
	|	ПравилаЦенообразования.СкидкаНаценка КАК СкидкаНаценка,
	|	ПравилаЦенообразования.СкидкаПредоплаты КАК СкидкаПредоплаты,
	|	ПравилаЦенообразования.Контрагент.ОсновнойДоговорКонтрагента.ОтветственноеЛицо
	|ИЗ
	|	РегистрСведений.ПравилаЦенообразования КАК ПравилаЦенообразования
	|ГДЕ
	|	ПравилаЦенообразования.Выключено
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Приоритет),
	|	МИНИМУМ(СкидкаНаценка),
	|	МИНИМУМ(СкидкаПредоплаты)
	|ПО
	|	КонтрагентОсновнойМенеджерКонтрагента,
	|	Контрагент";
	ПостроительОтчетаОтчет.ЗаполнитьНастройки();
	ПостроительОтчетаОтчет.ЗаполнениеРасшифровки = ВидЗаполненияРасшифровкиПостроителяОтчета.ЗначенияГруппировок;
	ПостроительОтчетаОтчет.ТекстЗаголовка = "Отчет";
	Настройка = ВосстановитьЗначение("НастройкаВнешниеОтчетыВыключенныеПравилаОтчет_bd73dc0b-09d6-47d3-bb4a-1194b112d469");
	Если Настройка <> Неопределено Тогда
		ПостроительОтчетаОтчет.УстановитьНастройки(Настройка);
	КонецЕсли;

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_ИНИЦИАЛИЗАЦИЯ
КонецПроцедуры
