///////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Инициализация формы
Процедура Инициализировать(ПостроительОтчета) Экспорт
	
	Построитель = ПостроительОтчета;
	
	ЭлементыФормы.Колонки.СоздатьКолонки();
	
	ОбновитьПредставление();
	
КонецПроцедуры	// Процедура Инициализировать

// Процедура обновления представления формы
Процедура ОбновитьПредставление()

	Если Построитель.ТипАнализа = Тип("АнализДанныхОбщаяСтатистика") Тогда 
		
		Заголовок = НСтр("ru='Параметры: Общая статистика'");
		КартинкаЗаголовка = ЭлементыФормы.КартинкаОбщаяСтатистика.Картинка;
		
	КонецЕсли;
	
КонецПроцедуры	// ОбновитьПредставление()

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНДНОЙ ПАНЕЛИ

// Обработчик действия кнопки Выполнить командной панели ОсновныеДействияФормы
Процедура ОсновныеДействияФормыВыполнить(Кнопка)
	
	Владелец = ВладелецФормы;
	Закрыть(Истина);
	// выполняем анализ
	Владелец.ВыполнитьАнализДанных(Построитель.ТипАнализа);
		
КонецПроцедуры	// ОсновныеДействияФормыВыполнить(Кнопка)
