
Перем НП Экспорт;
Перем СписокИсключаемыхКонтрагентов;
Перем СоответствиеНаименований;
Перем СписокПодразделений;
Перем КонтрагентФА;

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Если Не ЗначениеЗаполнено(ДатаНач) Тогда
		Сообщить("Не заполнена начальная дата!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаКон) Тогда
		Сообщить("Не заполнена конечная дата!");
		Возврат;
	КонецЕсли;
	
	ФайлSO = Новый Файл(ПутьФайлаSO);
	ФайлSD = Новый Файл(ПутьФайлаSD);
	
	Если ЗначениеЗаполнено(ПутьФайлаSO) Тогда	
    	СформироватьФайлSO(ФайлSO);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПутьФайлаSD) Тогда
		СформироватьФайлSD(ФайлSD);	
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПутьФайлаSOНачалоВыбора(Элемент, СтандартнаяОбработка)
	ВыборФайла(Элемент, , , Ложь);
КонецПроцедуры
	
Процедура ВыборФайла(Элемент, ПроверятьСуществование=Ложь, Знач РасширениеПоУмолчанию = "svc", 
	АрхивироватьФайлДанных = Ложь, ВыборФайлаПравил = Ложь)
	
	ДиалогФыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);		
	ДиалогФыбораФайла.Фильтр						=	"Файл протокола обмена (*.svc)|*.svc";
	ДиалогФыбораФайла.Расширение					=	"svc";	
	ДиалогФыбораФайла.Заголовок						=	"Выберите каталог";
	ДиалогФыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогФыбораФайла.ИндексФильтра					=	0;
	ДиалогФыбораФайла.ПолноеИмяФайла				=	Элемент.Значение;
	ДиалогФыбораФайла.ПроверятьСуществованиеФайла	=	ПроверятьСуществование;
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Элемент.Значение = ДиалогФыбораФайла.Каталог;
		
		Если Элемент = ЭлементыФормы.ПутьФайлаSD Тогда 
			ПутьФайлаSDПриИзменении(Элемент);	
		ИначеЕсли Элемент = ЭлементыФормы.ПутьФайлаSO Тогда 
			ПутьФайлаSOПриИзменении(Элемент);
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПутьФайлаSDНачалоВыбора(Элемент, СтандартнаяОбработка)
	ВыборФайла(Элемент, , , Ложь);
КонецПроцедуры

Процедура ПутьФайлаSOПриИзменении(Элемент)
	Файл = Новый Файл(ПутьФайлаSO);
КонецПроцедуры

Процедура ПутьФайлаSDПриИзменении(Элемент)
	Файл = Новый Файл(ПутьФайлаSD);   
КонецПроцедуры

Процедура СформироватьФайлSD(ФайлSD)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ВложенныйЗапрос.ДатаОбновления) КАК ДатаОбновления,
	               |	ВложенныйЗапрос.ИНН КАК ИНН,
	               |	ВложенныйЗапрос.Наименование,
	               |	ВложенныйЗапрос.Адрес,
	               |	ВложенныйЗапрос.Страна,
	               |	ВложенныйЗапрос.Телефон,
	               |	ВложенныйЗапрос.СфераДеятельности,
	               |	ВложенныйЗапрос.ОбъемПродажПоИным,
	               |	ВложенныйЗапрос.Один,
	               |	ВложенныйЗапрос.Валюта,
	               |	МАКСИМУМ(ВложенныйЗапрос.СуммарныйОбъем) КАК СуммарныйОбъем,
	               |	ВложенныйЗапрос.Индекс,
	               |	ВложенныйЗапрос.Город,
	               |	ВложенныйЗапрос.КатегорияПокупателя
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПродажиОбороты.ДокументПродажи.Дата КАК ДатаОбновления,
	               |		ПродажиОбороты.ДоговорКонтрагента.Владелец.ИНН КАК ИНН,
	               |		ПродажиОбороты.ДоговорКонтрагента.Владелец.Наименование КАК Наименование,
	               |		ЕСТЬNULL(взКонтактнаяИнф.Адрес, """") КАК Адрес,
	               |		""RUS"" КАК Страна,
	               |		"""" КАК Телефон,
	               |		"""" КАК СфераДеятельности,
	               |		"""" КАК ОбъемПродажПоИным,
	               |		""1"" КАК Один,
	               |		""RUB"" КАК Валюта,
	               |		ВЫБОР
	               |			КОГДА ЕСТЬNULL(ВложенныйЗапрос.АналитикаПродаж, ПродажиОбороты.КоличествоОборот) = 0
	               |				ТОГДА 1
	               |			ИНАЧЕ ЕСТЬNULL(ВложенныйЗапрос.АналитикаПродаж, ПродажиОбороты.КоличествоОборот)
	               |		КОНЕЦ КАК СуммарныйОбъем,
	               |		ЕСТЬNULL(взКонтактнаяИнф.Индекс, 0) КАК Индекс,
	               |		ЕСТЬNULL(взКонтактнаяИнф.Город, 0) КАК Город,
	               |		ПродажиОбороты.ЗаказПокупателя.Контрагент.КатегорияПокупателя КАК КатегорияПокупателя
	               |	ИЗ
	               |		РегистрНакопления.Продажи.Обороты(
	               |				&ДатаНач,
	               |				&ДатаКон,
	               |				Регистратор,
	               |				Подразделение В (&Подразделение)
	               |					И Номенклатура.Производитель В (&СписокПроизводителей)
	               |					И НЕ ДоговорКонтрагента.Владелец В (&СписокКонтрагентов)
	               |					И НЕ Номенклатура.Артикул = """"
	               |					И НЕ Номенклатура.Артикул ПОДОБНО ""%\_%"" СПЕЦСИМВОЛ ""\""
	               |					И 99 = 99
	               |					И ДоговорКонтрагента.Владелец.ИНН <> """") КАК ПродажиОбороты
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				АналитикаПродажПоБрендам.Контрагент КАК Контрагент,
	               |				СУММА(АналитикаПродажПоБрендам.КоличествоЗима + АналитикаПродажПоБрендам.КоличествоЛето) КАК АналитикаПродаж
	               |			ИЗ
	               |				РегистрСведений.АналитикаПродажПоБрендам КАК АналитикаПродажПоБрендам
	               |			ГДЕ
	               |				АналитикаПродажПоБрендам.Производитель В(&СписокПроизводителей)
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				АналитикаПродажПоБрендам.Контрагент) КАК ВложенныйЗапрос
	               |			ПО ПродажиОбороты.ДоговорКонтрагента.Владелец = ВложенныйЗапрос.Контрагент
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				КонтактнаяИнформация.Объект КАК Объект,
	               |				ВЫБОР
	               |					КОГДА КонтактнаяИнформация.Поле6 = """"
	               |						ТОГДА КонтактнаяИнформация.Поле5
	               |					ИНАЧЕ КонтактнаяИнформация.Поле6
	               |				КОНЕЦ + "" "" + КонтактнаяИнформация.Поле7 КАК Адрес,
	               |				КонтактнаяИнформация.Поле1 КАК Индекс,
	               |				ВЫБОР
	               |					КОГДА КонтактнаяИнформация.Поле2 ПОДОБНО ""%Москва%""
	               |							ИЛИ КонтактнаяИнформация.Поле2 ПОДОБНО ""%Санкт-Петербург%""
	               |							ИЛИ КонтактнаяИнформация.Поле2 ПОДОБНО ""%Севастополь%""
	               |						ТОГДА КонтактнаяИнформация.Поле2
	               |					КОГДА КонтактнаяИнформация.Поле4 = """"
	               |						ТОГДА КонтактнаяИнформация.Поле5
	               |					ИНАЧЕ КонтактнаяИнформация.Поле4
	               |				КОНЕЦ КАК Город
	               |			ИЗ
	               |				РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |			ГДЕ
	               |				КонтактнаяИнформация.Тип = &ТипАдреса
	               |				И КонтактнаяИнформация.Вид = &ВидАдреса) КАК взКонтактнаяИнф
	               |			ПО ПродажиОбороты.ДоговорКонтрагента.Владелец = взКонтактнаяИнф.Объект
	               |	ГДЕ
	               |		НЕ ПродажиОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя) КАК ВложенныйЗапрос
	               |ГДЕ
	               |	ВложенныйЗапрос.СуммарныйОбъем > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.ИНН,
	               |	ВложенныйЗапрос.Наименование,
	               |	ВложенныйЗапрос.Валюта,
	               |	ВложенныйЗапрос.ОбъемПродажПоИным,
	               |	ВложенныйЗапрос.Один,
	               |	ВложенныйЗапрос.СфераДеятельности,
	               |	ВложенныйЗапрос.Страна,
	               |	ВложенныйЗапрос.Адрес,
	               |	ВложенныйЗапрос.Телефон,
	               |	ВложенныйЗапрос.Индекс,
	               |	ВложенныйЗапрос.Город,
	               |	ВложенныйЗапрос.КатегорияПокупателя
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИНН,
	               |	ДатаОбновления";
				   
				   
				   
		СписокПроизводителей = Новый СписокЗначений;
		СписокПроизводителей.Добавить(Справочники.Производители.НайтиПоКоду("4"));
		СписокПроизводителей.Добавить(Справочники.Производители.НайтиПоКоду("15"));
		СписокПроизводителей.Добавить(Справочники.Производители.НайтиПоКоду("739"));
		
		Запрос.УстановитьПараметр("ТипФА", Справочники.ТипыДоговоров.ФормулаАвтоПлюс);
		Запрос.УстановитьПараметр("КонтрагентФАИНН", КонтрагентФА.ИНН);
		Запрос.УстановитьПараметр("ФАНаименование", КонтрагентФА.Наименование);
		Запрос.УстановитьПараметр("КатегорияФА", КонтрагентФА.КатегорияПокупателя);
		Запрос.УстановитьПараметр("КонтрагентФА", КонтрагентФА);

		
		Запрос.УстановитьПараметр("ВидАдреса", Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
		Запрос.УстановитьПараметр("ВидТелефона", Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
		Запрос.УстановитьПараметр("СписокПроизводителей", СписокПроизводителей);
		Запрос.УстановитьПараметр("ТипАдреса", Перечисления.ТипыКонтактнойИнформации.Адрес);
		Запрос.УстановитьПараметр("ТипТелефона", Перечисления.ТипыКонтактнойИнформации.Телефон);
		Запрос.УстановитьПараметр("Подразделение", СписокПодразделений);
		Запрос.УстановитьПараметр("СписокКонтрагентов", СписокИсключаемыхКонтрагентов);
		
		Если ЗначениеЗаполнено(Контрагент) тогда
			Запрос.УстановитьПараметр("Контрагент", Контрагент);
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"99 = 99","ДоговорКонтрагента.Владелец = &Контрагент")
		КонецЕсли;
		
		Результат = Запрос.Выполнить().Выбрать();
		
		НаименованиеФайла = "50300001960_SD_"+Формат(ТекущаяДата(), "ДФ=yyyyMMdd")+"_"+Формат(ТекущаяДата(), "ДФ=ЧЧммсс")+".csv";
		ФайлSD = ПутьФайлаSD+"\"+НаименованиеФайла;
		СтрокаЗаголовка = "50300001960;"+Формат(ДатаНач, "ДФ=yyyy/MM/dd")+";"+Формат(ДатаКон, "ДФ=yyyy/MM/dd")+";"+Формат(Результат.Количество()+1, "ЧГ=0"); 		
		//Текст = Новый ЗаписьТекста(ФайлSD,"UTF-8", Символы.ПС, Ложь,Символы.ПС);
		Текст = Новый ТекстовыйДокумент;
		//Текст.ЗаписатьСтроку(СтрокаЗаголовка);
		Текст.ДобавитьСтроку(СтрокаЗаголовка);
		
		Пока Результат.Следующий() Цикл
			ДатаОбновления = СтрЗаменить(Сред(Строка(Результат.ДатаОбновления), 1, 10), ".", "/");
			ДатаОбновления=Формат(Результат.ДатаОбновления, "ДФ=yyyy/MM/dd");
			НаименованиеКонтрагента = ПреобразоватьСтроку(Результат.Наименование);
			Если НаименованиеКонтрагента = "РОЗНИЧНЫЙ ПОКУПАТЕЛЬ ДПД" 
				или НаименованиеКонтрагента = "ПОКУПАТЕЛЬ" 
				или НаименованиеКонтрагента = "РОЗНИЧНЫЙ ПОКУПАТЕЛЬ ПОДОРОЖНИК"
				или Результат.категорияПокупателя = Справочники.КатегорииПокупателей.КонечныйПотребительФЛ
				тогда
				СтрокаФайла = ДатаОбновления+";"+СокрЛП("7604220153")+";"+"АВТОЭКСПЕРТ ЯРОСЛАВЛЬ"+";"+"МОСКОВСКИЙ ПРОСПЕКТ 119 КОРП 2"+";"+"150030"+";"+"ЯРОСЛАВЛЬ"+";RUS;"+
				Результат.Телефон+";"+Результат.СфераДеятельности+";"+Результат.ОбъемПродажПоИным+";"+Результат.Один+";"+Результат.Валюта+";"+
				Формат(Результат.СуммарныйОбъем, "ЧГ=0");
			иначе
				Наименование= СоответствиеНаименований.Получить(СокрЛП(Результат.Наименование));
				Если Наименование<>Неопределено тогда
					НаименованиеКонтрагента = ПреобразоватьСтроку(Наименование);
				КонецЕсли;
				НаименованиеКонтрагента=лев(НаименованиеКонтрагента,35);
				Адрес = СокрЛП(ПреобразоватьСтроку(Результат.Адрес));
				Адрес=?(Адрес="","УЛ",Адрес);
				Адрес=лев(Адрес,35);
				Адрес = ПреобразоватьСтроку(Адрес);
				Город = ПреобразоватьСтроку(Результат.Город);
				Если СокрЛП(Город)="" тогда
					Сообщить(НаименованиеКонтрагента+" не установлен город!");
				КонецЕсли;	
				Если Результат.Индекс=null или СокрЛП(Результат.Индекс)="" тогда
					Сообщить(НаименованиеКонтрагента+" индекс пустой!!!, файл не пройдет проверку.");
				КонецЕсли;	
				СтрокаФайла = ДатаОбновления+";"+СокрЛП(Результат.ИНН)+";"+НаименованиеКонтрагента+";"+Адрес+";"+Результат.Индекс+";"+Город+";"+Результат.Страна+";"+
				""+";"+Результат.СфераДеятельности+";"+Результат.ОбъемПродажПоИным+";"+Результат.Один+";"+Результат.Валюта+";"+
				Формат(Результат.СуммарныйОбъем, "ЧГ=0");
			КонецЕсли;
			//Текст.ЗаписатьСтроку(СтрокаФайла);		
			Текст.ДобавитьСтроку(ВРЕГ(СтрокаФайла));
		КонецЦикла;
		Текст.УстановитьТекст(СокрЛП(Текст.ПолучитьТекст()));//убираем последнюю пустую строку
		Текст.Записать(ФайлSD,"UTF-8");
		//Текст.Закрыть();
	
КонецПроцедуры

Процедура СформироватьФайлSO(ФайлSO)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ВложенныйЗапрос.ДокументПродажиДата, ВозвратТоваровОтПокупателяТовары.Ссылка.Дата) КАК ДатаОбновления,
	               |	ВЫБОР
	               |		КОГДА ПродажиОбороты.ДоговорКонтрагента.ТипДоговора = &ТипФА
	               |			ТОГДА &КонтрагентФАИНН
	               |		ИНАЧЕ ПродажиОбороты.ДоговорКонтрагента.Владелец.ИНН
	               |	КОНЕЦ КАК ИНН,
	               |	""0"" КАК ВидСубдиллера,
	               |	ВЫБОР
	               |		КОГДА ПродажиОбороты.ДоговорКонтрагента.ТипДоговора = &ТипФА
	               |			ТОГДА &ФАНаименование
	               |		ИНАЧЕ ПродажиОбороты.ДоговорКонтрагента.Владелец.Наименование
	               |	КОНЕЦ КАК Наименование,
	               |	КонтактнаяИнформацияАдрес.Поле6 + "" "" + КонтактнаяИнформацияАдрес.Поле7 КАК Адрес,
	               |	ЕСТЬNULL(КонтактнаяИнформацияАдрес.Поле1, """") КАК Индекс,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВозвратТоваровОтПокупателяТовары.Ссылка, ""N"") = ""N""
	               |			ТОГДА ""N""
	               |		ИНАЧЕ ""Y""
	               |	КОНЕЦ КАК ВозвращеннаяПродукция,
	               |	СУММА(ПродажиОбороты.КоличествоОборот) КАК ОбъемПродаж,
	               |	ПродажиОбороты.Номенклатура.Артикул КАК КодПродукции,
	               |	"""" КАК ИмяБрэнда,
	               |	ПродажиОбороты.Регистратор.Дата КАК ДатаСФ,
	               |	ПродажиОбороты.Регистратор.Номер КАК НомерСФ,
	               |	ПродажиОбороты.Регистратор.Дата КАК ДатаНакладной,
	               |	ПродажиОбороты.Регистратор.Номер КАК НомерНакладной,
	               |	"""" КАК PoS,
	               |	ВЫБОР
	               |		КОГДА ПродажиОбороты.ДоговорКонтрагента.ТипДоговора = &ТипФА
	               |			ТОГДА &КатегорияФА
	               |		ИНАЧЕ ПродажиОбороты.ЗаказПокупателя.Контрагент.КатегорияПокупателя
	               |	КОНЕЦ КАК КатегорияПокупателя
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&ДатаНач,
	               |			&ДатаКон,
	               |			Регистратор,
	               |			Подразделение В (&Подразделение)
	               |				И Номенклатура.Производитель В (&СписокПроизводителей)
	               |				И НЕ ДоговорКонтрагента.Владелец В (&СписокКонтрагентов)
	               |				И НЕ Номенклатура.Артикул = """"
	               |				И НЕ Номенклатура.Артикул ПОДОБНО ""%\_%"" СПЕЦСИМВОЛ ""\""
	               |				И 99 = 99
	               |				И ДоговорКонтрагента.Владелец.ИНН <> """") КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдрес
	               |		ПО (КонтактнаяИнформацияАдрес.Тип = &ТипАдреса)
	               |			И (КонтактнаяИнформацияАдрес.Вид = &ВидАдреса)
	               |			И (ВЫБОР
	               |				КОГДА ПродажиОбороты.ДоговорКонтрагента.ТипДоговора = &ТипФА
	               |					ТОГДА &КонтрагентФА = КонтактнаяИнформацияАдрес.Объект
	               |				ИНАЧЕ ПродажиОбороты.ДоговорКонтрагента.Владелец = КонтактнаяИнформацияАдрес.Объект
	               |			КОНЕЦ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	               |			ПО РеализацияТоваровУслугТовары.Номенклатура = ВозвратТоваровОтПокупателяТовары.Номенклатура
	               |				И РеализацияТоваровУслугТовары.Ссылка = ВозвратТоваровОтПокупателяТовары.ДокументПартии
	               |				И РеализацияТоваровУслугТовары.Количество = ВозвратТоваровОтПокупателяТовары.Количество
	               |		ПО ПродажиОбороты.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
	               |			И ПродажиОбороты.Регистратор = РеализацияТоваровУслугТовары.Ссылка
	               |			И ПродажиОбороты.КоличествоОборот = РеализацияТоваровУслугТовары.Количество
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВЫБОР
	               |				КОГДА ПродажиОбороты.ДоговорКонтрагента.ТипДоговора = &ТипФА
	               |					ТОГДА &КонтрагентФА
	               |				ИНАЧЕ ПродажиОбороты.ДоговорКонтрагента.Владелец
	               |			КОНЕЦ КАК ДоговорКонтрагентаВладелец,
	               |			МАКСИМУМ(ПродажиОбороты.ДокументПродажи.Дата) КАК ДокументПродажиДата
	               |		ИЗ
	               |			РегистрНакопления.Продажи.Обороты(
	               |					&ДатаНач,
	               |					&ДатаКон,
	               |					,
	               |					Подразделение В (&Подразделение)
	               |						И Номенклатура.Производитель В (&СписокПроизводителей)
	               |						И НЕ ДоговорКонтрагента.Владелец В (&СписокКонтрагентов)
	               |						И НЕ Номенклатура.Артикул ПОДОБНО ""%\_%"" СПЕЦСИМВОЛ ""\"") КАК ПродажиОбороты
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВЫБОР
	               |				КОГДА ПродажиОбороты.ДоговорКонтрагента.ТипДоговора = &ТипФА
	               |					ТОГДА &КонтрагентФА
	               |				ИНАЧЕ ПродажиОбороты.ДоговорКонтрагента.Владелец
	               |			КОНЕЦ) КАК ВложенныйЗапрос
	               |		ПО (ВЫБОР
	               |				КОГДА ПродажиОбороты.ДоговорКонтрагента.ТипДоговора = &ТипФА
	               |					ТОГДА &КонтрагентФА = ВложенныйЗапрос.ДоговорКонтрагентаВладелец
	               |				ИНАЧЕ ПродажиОбороты.ДоговорКонтрагента.Владелец = ВложенныйЗапрос.ДоговорКонтрагентаВладелец
	               |			КОНЕЦ)
	               |ГДЕ
	               |	ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтактнаяИнформацияАдрес.Поле6 + "" "" + КонтактнаяИнформацияАдрес.Поле7,
	               |	ЕСТЬNULL(КонтактнаяИнформацияАдрес.Поле1, """"),
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВозвратТоваровОтПокупателяТовары.Ссылка, ""N"") = ""N""
	               |			ТОГДА ""N""
	               |		ИНАЧЕ ""Y""
	               |	КОНЕЦ,
	               |	ПродажиОбороты.Номенклатура.Артикул,
	               |	ПродажиОбороты.Регистратор.Дата,
	               |	ПродажиОбороты.Регистратор.Номер,
	               |	ВЫБОР
	               |		КОГДА ПродажиОбороты.ДоговорКонтрагента.ТипДоговора = &ТипФА
	               |			ТОГДА &КонтрагентФАИНН
	               |		ИНАЧЕ ПродажиОбороты.ДоговорКонтрагента.Владелец.ИНН
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПродажиОбороты.ДоговорКонтрагента.ТипДоговора = &ТипФА
	               |			ТОГДА &ФАНаименование
	               |		ИНАЧЕ ПродажиОбороты.ДоговорКонтрагента.Владелец.Наименование
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПродажиОбороты.ДоговорКонтрагента.ТипДоговора = &ТипФА
	               |			ТОГДА &КатегорияФА
	               |		ИНАЧЕ ПродажиОбороты.ЗаказПокупателя.Контрагент.КатегорияПокупателя
	               |	КОНЕЦ,
	               |	ПродажиОбороты.Регистратор.Дата,
	               |	ПродажиОбороты.Регистратор.Номер,
	               |	ЕСТЬNULL(ВложенныйЗапрос.ДокументПродажиДата, ВозвратТоваровОтПокупателяТовары.Ссылка.Дата)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИНН,
	               |	НомерНакладной";
				   
				   
		СписокПроизводителей = Новый СписокЗначений;
		СписокПроизводителей.Добавить(Справочники.Производители.НайтиПоКоду("4"));
		СписокПроизводителей.Добавить(Справочники.Производители.НайтиПоКоду("15"));
		СписокПроизводителей.Добавить(Справочники.Производители.НайтиПоКоду("739"));
		
		
		Запрос.УстановитьПараметр("ТипФА", Справочники.ТипыДоговоров.ФормулаАвтоПлюс);
		Запрос.УстановитьПараметр("КонтрагентФАИНН", КонтрагентФА.ИНН);
		Запрос.УстановитьПараметр("ФАНаименование", КонтрагентФА.Наименование);
		Запрос.УстановитьПараметр("КатегорияФА", КонтрагентФА.КатегорияПокупателя);
		Запрос.УстановитьПараметр("КонтрагентФА", КонтрагентФА);
		
		Запрос.УстановитьПараметр("ВидАдреса", Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
		Запрос.УстановитьПараметр("СписокПроизводителей", СписокПроизводителей);
		Запрос.УстановитьПараметр("ТипАдреса", Перечисления.ТипыКонтактнойИнформации.Адрес);
		Запрос.УстановитьПараметр("Подразделение", СписокПодразделений);
		Запрос.УстановитьПараметр("СписокКонтрагентов", СписокИсключаемыхКонтрагентов);
		
		Если ЗначениеЗаполнено(Контрагент) тогда
			Запрос.УстановитьПараметр("Контрагент", Контрагент);
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"99 = 99","ДоговорКонтрагента.Владелец = &Контрагент")
		КонецЕсли;
		
		
		Результат = Запрос.Выполнить().Выбрать();
		
		НаименованиеФайла = "50300001960_SO_"+Формат(ТекущаяДата(), "ДФ=yyyyMMdd")+"_"+Формат(ТекущаяДата(), "ДФ=ЧЧммсс")+".csv";
		ФайлSO = ПутьФайлаSO+"\"+НаименованиеФайла;
		СтрокаЗаголовка = "50300001960;RUS;"+Формат(ДатаНач, "ДФ=yyyy/MM/dd")+";"+Формат(ДатаКон, "ДФ=yyyy/MM/dd")+";"+Формат(Результат.Количество()+1, "ЧГ=0"); 		
		//Текст = Новый ЗаписьТекста(ФайлSO,"UTF-8", Символы.ПС, Ложь,Символы.ПС);
		Текст = Новый ТекстовыйДокумент;
		//Текст.ЗаписатьСтроку(СтрокаЗаголовка);
		Текст.ДобавитьСтроку(СтрокаЗаголовка);
		Пока Результат.Следующий() Цикл
			ДатаОбновления=Формат(Результат.ДатаОбновления, "ДФ=yyyy/MM/dd");
			НаименованиеКонтрагента = ПреобразоватьСтроку(Результат.Наименование);
			Адрес = СокрЛП(ПреобразоватьСтроку(Результат.Адрес));
			Адрес=?(Адрес="","УЛ",Адрес);
			Адрес=лев(Адрес,35);
			Если Результат.Индекс=null или СокрЛП(Результат.Индекс)="" 
				и не( НаименованиеКонтрагента = "РОЗНИЧНЫЙ ПОКУПАТЕЛЬ ДПД" 
				или НаименованиеКонтрагента = "ПОКУПАТЕЛЬ" 
				или НаименованиеКонтрагента = "РОЗНИЧНЫЙ ПОКУПАТЕЛЬ ПОДОРОЖНИК" 
				или Результат.категорияПокупателя = Справочники.КатегорииПокупателей.КонечныйПотребительФЛ)
				тогда
				Сообщить(НаименованиеКонтрагента+" индекс пустой!!!, файл не пройдет проверку.");
			КонецЕсли;
			
			ДатаСФ=Формат(Результат.ДатаСФ, "ДФ=yyyy/MM/dd");
			ДатаНакладной=Формат(Результат.ДатаНакладной, "ДФ=yyyy/MM/dd");
			
			КодПродукции=Результат.КодПродукции;
			КодПродукции = СтрЗаменить(КодПродукции,"*","");
			ПозицияРавно=Найти(КодПродукции,"=");
			Если ПозицияРавно<>0 тогда
				КодПродукции=Лев(КодПродукции,ПозицияРавно-1);
			КонецЕсли;
			
			Если НаименованиеКонтрагента = "РОЗНИЧНЫЙ ПОКУПАТЕЛЬ ДПД" 
				или НаименованиеКонтрагента = "ПОКУПАТЕЛЬ" 
				или НаименованиеКонтрагента = "РОЗНИЧНЫЙ ПОКУПАТЕЛЬ ПОДОРОЖНИК" 
				или Результат.категорияПокупателя = Справочники.КатегорииПокупателей.КонечныйПотребительФЛ тогда
				КодПродукции=Результат.КодПродукции;
				КодПродукции = СтрЗаменить(КодПродукции,"*","");
				ПозицияРавно=Найти(КодПродукции,"=");
				Если ПозицияРавно<>0 тогда
					КодПродукции=Лев(КодПродукции,ПозицияРавно-1);
				КонецЕсли;
				//СтрокаФайла = ДатаОбновления+";"+СокрЛП("7604220153")+";"+"АВТОЭКСПЕРТ ЯРОСЛАВЛЬ"+";"+"МОСКОВСКИЙ ПРОСПЕКТ 119 корп. 2"+";"+"150030"+";"+"ЯРОСЛАВЛЬ"+";RUS;"+
				СтрокаФайла = ДатаОбновления+";"+СокрЛП("7604220153")+";"+Результат.ВидСубдиллера+";"+"АВТОЭКСПЕРТ ЯРОСЛАВЛЬ"+";"+"МОСКОВСКИЙ ПРОСПЕКТ 119 КОРП 2"+";"+"150030"+";"+
				Результат.ВозвращеннаяПродукция+";"+Результат.ОбъемПродаж+";"+Прав(ДополнитьСтроку(КодПродукции,6,"0",0),6)+";"+Результат.ИмяБрэнда+";"+
				ДатаСФ+";"+СокрЛП(Результат.НомерСФ)+";"+ДатаНакладной+";"+СокрЛП(Результат.НомерНакладной)+";"+Результат.PoS;
			иначе
				
				Наименование= СоответствиеНаименований.Получить(СокрЛП(Результат.Наименование));
				Если Наименование<>Неопределено тогда
					НаименованиеКонтрагента = ПреобразоватьСтроку(Наименование);
				КонецЕсли;
				НаименованиеКонтрагента=Лев(НаименованиеКонтрагента,35);
				
				
				СтрокаФайла = ДатаОбновления+";"+СокрЛП(Результат.ИНН)+";"+Результат.ВидСубдиллера+";"+НаименованиеКонтрагента+";"+Адрес+";"+Результат.Индекс+";"+
				Результат.ВозвращеннаяПродукция+";"+Результат.ОбъемПродаж+";"+Прав(ДополнитьСтроку(КодПродукции,6,"0",0),6)+";"+Результат.ИмяБрэнда+";"+
				ДатаСФ+";"+СокрЛП(Результат.НомерСФ)+";"+ДатаНакладной+";"+СокрЛП(Результат.НомерНакладной)+";"+Результат.PoS;
			КонецЕсли;
			//Текст.ЗаписатьСтроку(СтрокаФайла);
			Текст.ДобавитьСтроку(Врег(СтрокаФайла));
		КонецЦикла;
		
		//Текст.Закрыть();
	    Текст.УстановитьТекст(СокрЛП(Текст.ПолучитьТекст()));//убираем последнюю пустую строку
		Текст.Записать(ФайлSO,"UTF-8");

КонецПроцедуры

Функция ПреобразоватьСтроку(СтрокаПреобразования)
	СтрокаФорматирования = ВРег(СтрокаПреобразования);
	СтрокаФорматирования = СтрЗаменить(СтрокаФорматирования, """","");
	СтрокаФорматирования = СтрЗаменить(СтрокаФорматирования, "-"," ");	
	СтрокаФорматирования = СтрЗаменить(СтрокаФорматирования, ".","");
	СтрокаФорматирования = СтрЗаменить(СтрокаФорматирования, "+","");
	СтрокаФорматирования = СтрЗаменить(СтрокаФорматирования, "(","");
	СтрокаФорматирования = СтрЗаменить(СтрокаФорматирования, ")","");
	СтрокаФорматирования = СтрЗаменить(СтрокаФорматирования, "/","");
	СтрокаФорматирования = СтрЗаменить(СтрокаФорматирования, "\","");
	СтрокаФорматирования = СтрЗаменить(СтрокаФорматирования, "=","");
	СтрокаФорматирования = СтрЗаменить(СтрокаФорматирования, "*","");
	СтрокаФорматирования = СтрЗаменить(СтрокаФорматирования, "!","");
	СтрокаФорматирования = СтрЗаменить(СтрокаФорматирования, ".","");
	СтрокаФорматирования = СтрЗаменить(СтрокаФорматирования, ",","");
    СтрокаФорматирования = СтрЗаменить(СтрокаФорматирования, "«","");
	СтрокаФорматирования = СтрЗаменить(СтрокаФорматирования, "»","");
	СтрокаФорматирования = СтрЗаменить(СтрокаФорматирования, "№","N");

	СтрокаФорматирования = СокрЛП(СтрокаФорматирования);
	Возврат СтрокаФорматирования; 
КонецФункции

  

Процедура КнопкаНастройкаПериодаНажатие(Элемент)

	Если НП.Редактировать() Тогда
		
		ДатаНач = НП.ПолучитьДатуНачала();
		ДатаКон = НП.ПолучитьДатуОкончания();

	КонецЕсли;
	
КонецПроцедуры // КнопкаНастройкаПериодаНажатие()

Процедура ПриОткрытии()
	СписокПодразделений = Новый СписокЗначений;
	//СписокПодразделений.Добавить(Справочники.Подразделения.НайтиПоКоду("00005"));  //Яр
	//СписокПодразделений.Добавить(Справочники.Подразделения.НайтиПоКоду("00112"));  //Питер
	//СписокПодразделений.Добавить(Справочники.Подразделения.НайтиПоКоду("00138"));  //Екат
    Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	Подразделения.Ссылка КАК Подразделение
	             |ИЗ
	             |	Справочник.Подразделения КАК Подразделения
	             |ГДЕ
	             |	Подразделения.ИспользоватьВБюджете
	             |	И НЕ Подразделения.ВЭД
	             |	И НЕ Подразделения.ПометкаУдаления";
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() цикл
		//Если Рез.Подразделение<>Справочники.Подразделения.НайтиПоКоду("00106") тогда //РнД
			СписокПодразделений.Добавить(Рез.Подразделение);
		//КонецЕсли;	
	КонецЦикла;
	//СписокПодразделений.ВыбратьЭлемент();
КонецПроцедуры

СоответствиеНаименований = новый соответствие;
СоответствиеНаименований.Вставить("РостАвтоЗапчасть (до 20.08.13 РосАвтоЗапчасть)","РостАвтоЗапчасть");
СоответствиеНаименований.Вставить("Кутрушенко Е.П Оригиналы документов высылать","Кутрушенко Е.П");
СоответствиеНаименований.Вставить("ШинТрейд (вместо ШинТрейд СПб)","ШинТрейд");
СоответствиеНаименований.Вставить("Балтика, ООО (новый)","Балтика ООО");

КонтрагентФА = Справочники.Контрагенты.НайтиПоКоду("92797");

НП = Новый НастройкаПериода;

СписокИсключаемыхКонтрагентов = Новый СписокЗначений;
СписокИсключаемыхКонтрагентов.Добавить(Справочники.Контрагенты.НайтиПоКоду("00496")); //Малышев Игорь Иванович
//СписокИсключаемыхКонтрагентов.Добавить(Справочники.Контрагенты.НайтиПоКоду("94247"));  //Розничный покупатель ДПД
СписокИсключаемыхКонтрагентов.Добавить(Справочники.Контрагенты.НайтиПоКоду("П004048")); //МОТОРЛЭНД
//СписокИсключаемыхКонтрагентов.Добавить(Справочники.Контрагенты.НайтиПоКоду("П005342")); //Розничный покупатель Подорожник
СписокИсключаемыхКонтрагентов.Добавить(Справочники.Контрагенты.НайтиПоКоду("94143")); //Покупатель


//СписокПодразделений = Новый СписокЗначений;
//СписокПодразделений.Добавить(Справочники.Подразделения.НайтиПоКоду("00005"));  //Яр
//СписокПодразделений.Добавить(Справочники.Подразделения.НайтиПоКоду("00112"));  //Питер
//СписокПодразделений.Добавить(Справочники.Подразделения.НайтиПоКоду("00138"));  //Екат






