
Процедура КнопкаВыполнитьНажатие(Кнопка)
	сообщить(строка(ТекущаяДата())+" -----------------------------------------");
	
	Если ПоОстаткам тогда
		таблОст = ОбменСУТИнтернетМагазин.SIM_ПолучитьТаблицуТоваров(Истина); // с остатками
		списКод = таблОст.ВыгрузитьКолонку("НоменклатураКод");
		запрос = новый Запрос;
		запрос.Текст = "выбрать спр.Ссылка из Справочник.Номенклатура КАК спр
		|ГДЕ спр.Код в (&списКод)
		| и ПОДСТРОКА(спр.Код, 1, 1) В (""0"", ""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"")
        |";
		запрос.УстановитьПараметр("списКод",списКод);
		списТов = запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		сообщить(строка(ТекущаяДата())+" получен список "+строка(списТов.Количество()) +" товаров по наличию");
	Иначе	
		списТов = Неопределено;
	КонецЕсли;
	
	таблЦен = ОбменСУТИнтернетМагазин.ПолучитьЦеныДляКонтрагента_РегСвЭкспорт(Контрагент, списТов  ); 
	сообщить(строка(ТекущаяДата())+" получены цены для "+строка(таблЦен.Количество()) +" товаров");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("таблЦен", таблЦен);
	Запрос.УстановитьПараметр("id",Контрагент.Код);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Табл.Номенклатура,
	               |	Табл.МинимальнаяЦена
	               |ПОМЕСТИТЬ ВТ_Цены
	               |ИЗ
	               |	&таблЦен КАК Табл
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&ID,
	               |	спрНоменклатура.Код,
	               |	МАКСИМУМ(ЕСТЬNULL(ВТ_Цены.МинимальнаяЦена, 0)) КАК Цена,
	               |	"""" КАК МинЦена
	               |ИЗ
	               |	ВТ_Цены КАК ВТ_Цены
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	               |		ПО ВТ_Цены.Номенклатура = спрНоменклатура.Ссылка
	               |ГДЕ
	               |	ПОДСТРОКА(спрНоменклатура.Код, 1, 1) В (""0"", ""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"")
	               |	И ЕСТЬNULL(ВТ_Цены.МинимальнаяЦена, 0) > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	спрНоменклатура.Код";
	Результат = Запрос.Выполнить();
	табл = результат.Выгрузить();
	
	сообщить(строка(ТекущаяДата())+" заполнена таблица для выгрузки "+строка(табл.Количество()) +" товаров");
	
	ОбменСУТИнтернетМагазин.ВыгрузитьВTXT(табл, путь, "price2.txt", "" );
	
	сообщить(строка(ТекущаяДата())+" сохранен файл price2.txt");
	
	Если Флажок1 тогда
		выгрузитьНаFTP();
	КонецЕсли;
	
КонецПроцедуры



процедура выгрузитьНаFTP(ИмяФайла="price2.txt")
	попытка
		врФТП = Новый FTPСоединение("store.yst.ru",,"adminftp", "Hwrsy53#te287",, Истина ); //01.09.2016 - новый пароль!
		#Если Клиент Тогда
			сообщить("Успешно установлено подключение к ftp://store.yst.ru", СтатусСообщения.Информация);
		#КонецЕсли	
	Исключение	
		#Если Клиент Тогда
			сообщить("ошибка подключения к FTP : "+ОписаниеОшибки(), СтатусСообщения.Внимание);
		#КонецЕсли
		возврат;
	КонецПопытки;
врФТП.врФТП.Записать(путь+ИмяФайла, "terminal.yst.ru/ImportData/"+ИмяФайла);
	
КонецПроцедуры


Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Контрагент = справочники.Контрагенты.НайтиПоКоду("П005016");
	ИмяФайла   = "price2.txt";
	путь	   = КаталогВременныхФайлов();

КонецПроцедуры

