
Процедура КнопкаСформироватьНажатие(Кнопка)
	МВТ= новый МенеджерВременныхТаблиц;
	Запрос=Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МВТ;
	Запрос.Текст="ВЫБРАТЬ
	             |	ПродажиОбороты.Номенклатура КАК Номенклатура,
	             |	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот,
	             |	СУММА(ПродажиОбороты.СтоимостьОборот) КАК СтоимостьОборот,
	             |	СУММА(ЕСТЬNULL(ПродажиОбороты.СтоимостьОборот, 0)) - СУММА(ЕСТЬNULL(ПродажиСебестоимостьОбороты.СтоимостьОборот, 0)) КАК ВаловаяПрибыль,
	             |	СУММА(ВЫБОР
	             |			КОГДА ПродажиСебестоимостьОбороты.СтоимостьОборот <> 0
	             |				ТОГДА 100 * (ПродажиОбороты.СтоимостьОборот - ПродажиСебестоимостьОбороты.СтоимостьОборот) / ПродажиОбороты.СтоимостьОборот
	             |			ИНАЧЕ 0
	             |		КОНЕЦ) КАК ПроцентНаценки
	             |ПОМЕСТИТЬ втСебестоимость
	             |ИЗ
	             |	РегистрНакопления.Продажи.Обороты(&НачПериода, &КонПериода, Регистратор, Подразделение = &Подразделение) КАК ПродажиОбороты
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиСебестоимость.Обороты(&НачПериода, &КонПериода, Регистратор, Подразделение = &Подразделение) КАК ПродажиСебестоимостьОбороты
	             |		ПО ПродажиОбороты.Регистратор = ПродажиСебестоимостьОбороты.Регистратор
	             |			И ПродажиОбороты.Номенклатура = ПродажиСебестоимостьОбороты.Номенклатура
	             |			И ПродажиОбороты.ХарактеристикаНоменклатуры = ПродажиСебестоимостьОбороты.ХарактеристикаНоменклатуры
	             |			И ПродажиОбороты.ЗаказПокупателя = ПродажиСебестоимостьОбороты.ЗаказПокупателя
	             |			И ПродажиОбороты.Подразделение = ПродажиСебестоимостьОбороты.Подразделение
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ПродажиОбороты.Номенклатура
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	БюджетДоходовИРасходовДоходы.ВидТовара,
	             |	СУММА(БюджетДоходовИРасходовДоходы.Количество) КАК Количество,
	             |	СУММА(БюджетДоходовИРасходовДоходы.Сумма) КАК Сумма,
	             |	БюджетДоходовИРасходовДоходы.Ссылка.Проект,
	             |	БюджетДоходовИРасходовДоходы.ПроцентНаценки,
	             |	БюджетДоходовИРасходовДоходы.ВаловаяПрибыль
	             |ПОМЕСТИТЬ втДоходПлан
	             |ИЗ
	             |	Документ.БюджетДоходовИРасходов.Доходы КАК БюджетДоходовИРасходовДоходы
	             |ГДЕ
	             |	БюджетДоходовИРасходовДоходы.Ссылка.ПометкаУдаления = ЛОЖЬ
	             |	И БюджетДоходовИРасходовДоходы.Ссылка.Проект = &Проект
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	БюджетДоходовИРасходовДоходы.ВидТовара,
	             |	БюджетДоходовИРасходовДоходы.Ссылка.Проект,
	             |	БюджетДоходовИРасходовДоходы.ПроцентНаценки,
	             |	БюджетДоходовИРасходовДоходы.ВаловаяПрибыль
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	втДоходПлан.ВидТовара,
	             |	СУММА(ЕСТЬNULL(втСебестоимость.КоличествоОборот, 0)) КАК ПродажиКоличество,
	             |	СУММА(ЕСТЬNULL(втСебестоимость.СтоимостьОборот, 0)) КАК ПродажиСумма,
	             |	СРЕДНЕЕ(втДоходПлан.Количество * (РАЗНОСТЬДАТ(&НачПериода, &КонПериода, ДЕНЬ) + 1) / 30.5) КАК ПланКоличество,
	             |	СРЕДНЕЕ(втДоходПлан.Сумма * (РАЗНОСТЬДАТ(&НачПериода, &КонПериода, ДЕНЬ) + 1) / 30.5) КАК ПланСумма,
	             |	СРЕДНЕЕ(втДоходПлан.ПроцентНаценки) КАК ПланПроцентНаценки,
	             |	СРЕДНЕЕ(втДоходПлан.ВаловаяПрибыль * (РАЗНОСТЬДАТ(&НачПериода, &КонПериода, ДЕНЬ) + 1) / 30.5) КАК ВаловаяПрибыль,
	             |	СУММА(втСебестоимость.ВаловаяПрибыль) КАК ФактВаловаяПрибыль,
	             |	СРЕДНЕЕ(втСебестоимость.ПроцентНаценки) КАК ФактПроцентНаценки
	             |ПОМЕСТИТЬ втДоходы
	             |ИЗ
	             |	втДоходПлан КАК втДоходПлан
	             |		ЛЕВОЕ СОЕДИНЕНИЕ втСебестоимость КАК втСебестоимость
	             |		ПО (втДоходПлан.ВидТовара = втСебестоимость.Номенклатура.ВидТовара
	             |				ИЛИ втДоходПлан.ВидТовара = втСебестоимость.Номенклатура.Производитель)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	втДоходПлан.ВидТовара
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	БюджетДоходовИРасходовРасходы.Ссылка.Проект,
	             |	БюджетДоходовИРасходовРасходы.СтатьяЗатрат,
	             |	БюджетДоходовИРасходовРасходы.Сумма
	             |ПОМЕСТИТЬ втРасходПлан
	             |ИЗ
	             |	Документ.БюджетДоходовИРасходов.Расходы КАК БюджетДоходовИРасходовРасходы
	             |ГДЕ
	             |	БюджетДоходовИРасходовРасходы.Ссылка.ПометкаУдаления = ЛОЖЬ
	             |	И БюджетДоходовИРасходовРасходы.Ссылка.Проект = &Проект
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	втРасходПлан.СтатьяЗатрат,
	             |	СУММА(ЕСТЬNULL(ЗатратыОбороты.СуммаОборот, 0)) КАК ЗатратыФакт,
	             |	СРЕДНЕЕ(втРасходПлан.Сумма * (РАЗНОСТЬДАТ(&НачПериода, &КонПериода, ДЕНЬ) + 1) / 30.5) КАК ЗатратыПлан
	             |ПОМЕСТИТЬ втРасходы
	             |ИЗ
	             |	втРасходПлан КАК втРасходПлан
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Затраты.Обороты(&НачПериода, &КонПериода, , ) КАК ЗатратыОбороты
	             |		ПО втРасходПлан.СтатьяЗатрат = ЗатратыОбороты.СтатьяЗатрат
	             |			И втРасходПлан.Проект.Подразделение = ЗатратыОбороты.Подразделение
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	втРасходПлан.СтатьяЗатрат";
	Запрос.УстановитьПараметр("Проект",Проект);
	Запрос.УстановитьПараметр("НачПериода",НачПериода);
	Запрос.УстановитьПараметр("КонПериода",КонецДня(КонПериода));
	Запрос.УстановитьПараметр("Подразделение",Проект.Подразделение);
	
	Запрос.Выполнить();
	
	ТабДок=новый ТабличныйДокумент;
	
	ДоходПланСумма=0;
	ДоходФактСумма=0;
    РасходПланСумма=0;
	РасходФактСумма=0;
	
	Макет=ПолучитьМакет("Макет");
	
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Период=ПредставлениеПериода(НачПериода,КонецДня(КонПериода));
	ОбластьШапка.Параметры.Проект=Проект;
	ТабДок.Вывести(ОбластьШапка);
	
	ТабДок.Вывести(Макет.ПолучитьОбласть("ШапкаДоходы"));
	ОбластьИтогоДоход=Макет.ПолучитьОбласть("ИтогоДоходы");
	ОбластьСтрокаДоход=Макет.ПолучитьОбласть("СтрокаДоходы");
	
	Запрос2=Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц=МВТ;
	Запрос2.Текст="ВЫБРАТЬ
	              |	втДоходы.ВидТовара КАК ВидТовара,
	              |	втДоходы.ПродажиКоличество КАК ПродажиКоличество,
	              |	втДоходы.ПродажиСумма КАК ПродажиСумма,
	              |	втДоходы.ПланКоличество КАК ПланКоличество,
	              |	втДоходы.ПланСумма КАК ПланСумма,
	              |	втДоходы.ПродажиКоличество - втДоходы.ПланКоличество КАК ОтклонениеАбсКоличество,
	              |	втДоходы.ПродажиСумма - втДоходы.ПланСумма КАК ОтклонениеАбсСумма,
	              |	ВЫБОР
	              |		КОГДА втДоходы.ПланКоличество = 0
	              |			ТОГДА 100
	              |		ИНАЧЕ втДоходы.ПродажиКоличество / втДоходы.ПланКоличество * 100 - 100
	              |	КОНЕЦ КАК ОтклонениеОтнКоличество,
	              |	ВЫБОР
	              |		КОГДА втДоходы.ПланСумма = 0
	              |			ТОГДА 100
	              |		ИНАЧЕ втДоходы.ПродажиСумма / втДоходы.ПланСумма * 100 - 100
	              |	КОНЕЦ КАК ОтклонениеОтнСумма,
	              |	втДоходы.ПланПроцентНаценки,
	              |	втДоходы.ВаловаяПрибыль КАК ПланВаловаяПрибыль,
	              |	втДоходы.ФактВаловаяПрибыль КАК ФактВаловаяПрибыль,
	              |	втДоходы.ФактВаловаяПрибыль / (втДоходы.ПродажиСумма - втДоходы.ФактВаловаяПрибыль) * 100 КАК ФактПроцентНаценки,
	              |	втДоходы.ФактВаловаяПрибыль - втДоходы.ВаловаяПрибыль КАК ОтклонениеАбсВаловаяПрибыль,
	              |	втДоходы.ФактВаловаяПрибыль / втДоходы.ПродажиСумма * 100 - втДоходы.ПланПроцентНаценки КАК ОтклонениеАбсПроцНаценки,
	              |	ВЫБОР
	              |		КОГДА втДоходы.ВаловаяПрибыль = 0
	              |			ТОГДА 100
	              |		ИНАЧЕ втДоходы.ФактВаловаяПрибыль / втДоходы.ВаловаяПрибыль * 100 - 100
	              |	КОНЕЦ КАК ОтклонениеОтнВаловаяПрибыль
	              |ИЗ
	              |	втДоходы КАК втДоходы
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	ВидТовара
	              |ИТОГИ
	              |	СУММА(ПродажиКоличество),
	              |	СУММА(ПродажиСумма),
	              |	СУММА(ПланКоличество),
	              |	СУММА(ПланСумма),
	              |	СУММА(ОтклонениеАбсКоличество),
	              |	СУММА(ОтклонениеАбсСумма),
	              |	СУММА(ПродажиКоличество) / СУММА(ПланКоличество) * 100 - 100 КАК ОтклонениеОтнКоличество,
	              |	СУММА(ПродажиСумма) / СУММА(ПланСумма) * 100 - 100 КАК ОтклонениеОтнСумма,
	              |	СУММА(ПланВаловаяПрибыль),
	              |	СУММА(ФактВаловаяПрибыль),
	              |	СУММА(ФактВаловаяПрибыль) / (СУММА(ПродажиСумма) - СУММА(ФактВаловаяПрибыль)) * 100 КАК ФактПроцентНаценки,
	              |	СУММА(ОтклонениеАбсВаловаяПрибыль),
	              |	СУММА(ОтклонениеАбсПроцНаценки),
	              |	СУММА(втДоходы.ФактВаловаяПрибыль) / СУММА(втДоходы.ВаловаяПрибыль) * 100 - 100 КАК ОтклонениеОтнВаловаяПрибыль
	              |ПО
	              |	ОБЩИЕ
	              |АВТОУПОРЯДОЧИВАНИЕ";
	ВыборкаИтого=Запрос2.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтого.Следующий();
	ОбластьИтогоДоход.Параметры.Заполнить(ВыборкаИтого);
	ДоходПланСумма=ВыборкаИтого.ПланВаловаяПрибыль;
	ДоходФактСумма=ВыборкаИтого.ФактВаловаяПрибыль;
	ВыборкаВидТовара=ВыборкаИтого.Выбрать();
	ПоКа ВыборкаВидТовара.Следующий() Цикл
		ОбластьСтрокаДоход.Параметры.Заполнить(ВыборкаВидТовара);
		ТабДок.Вывести(ОбластьСтрокаДоход);
	КонецЦикла;
	ТабДок.Вывести(ОбластьИтогоДоход);
	
	//расход
		Запрос2.Текст="ВЫБРАТЬ
		              |	втРасходы.СтатьяЗатрат КАК СтатьяЗатрат,
		              |	втРасходы.ЗатратыФакт КАК ЗатратыФакт,
		              |	втРасходы.ЗатратыПлан КАК ЗатратыПлан,
		              |	втРасходы.ЗатратыФакт - втРасходы.ЗатратыПлан КАК ОтклонениеАбсСумма,
		              |	ВЫБОР
		              |		КОГДА втРасходы.ЗатратыПлан = 0
		              |			ТОГДА 100
		              |		ИНАЧЕ втРасходы.ЗатратыФакт / втРасходы.ЗатратыПлан * 100 - 100
		              |	КОНЕЦ КАК ОтклонениеОтнСумма
		              |ИЗ
		              |	втРасходы КАК втРасходы
		              |
		              |УПОРЯДОЧИТЬ ПО
		              |	СтатьяЗатрат
		              |ИТОГИ
		              |	СУММА(ЗатратыФакт),
		              |	СУММА(ЗатратыПлан),
		              |	СУММА(ОтклонениеАбсСумма),
		              |	СУММА(ЗатратыФакт) / СУММА(ЗатратыПлан) * 100 - 100 КАК ОтклонениеОтнСумма
		              |ПО
		              |	ОБЩИЕ
		              |АВТОУПОРЯДОЧИВАНИЕ";
	ВыборкаИтого=Запрос2.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтого.Следующий();
	
	РасходПланСумма=ВыборкаИтого.ЗатратыПлан;
	РасходФактСумма=ВыборкаИтого.ЗатратыФакт;
	
	ТабДок.Вывести(Макет.ПолучитьОбласть("ШапкаРасходы"));
	ОбластьИтогоРасход=Макет.ПолучитьОбласть("ИтогоРасходы");
	ОбластьСтрокаРасход=Макет.ПолучитьОбласть("СтрокаРасходы");
	
	ОбластьИтогоРасход.Параметры.Заполнить(ВыборкаИтого);
	
	ВыборкаСтатьяЗатрат=ВыборкаИтого.Выбрать();
	ПоКа ВыборкаСтатьяЗатрат.Следующий() Цикл
		ОбластьСтрокаРасход.Параметры.Заполнить(ВыборкаСтатьяЗатрат);
		ТабДок.Вывести(ОбластьСтрокаРасход);
	КонецЦикла;
	ТабДок.Вывести(ОбластьИтогоРасход);

	к=0;
	Если не ПланРуб тогда
		ТабДок.УдалитьОбласть(ТабДок.Область("C2"), ТипСмещенияТабличногоДокумента.ПоВертикали);
		к=к+1;
	КонецЕсли;
	Если не ФактРуб тогда
		ТабДок.УдалитьОбласть(ТабДок.Область("C"+(3-к)), ТипСмещенияТабличногоДокумента.ПоВертикали);
		к=к+1;
	КонецЕсли;
	Если не ОтклонениеАбсРуб тогда
		ТабДок.УдалитьОбласть(ТабДок.Область("C"+(4-к)), ТипСмещенияТабличногоДокумента.ПоВертикали);
		к=к+1;
	КонецЕсли;
	Если не ОтклонениеОтнРуб тогда
		ТабДок.УдалитьОбласть(ТабДок.Область("C"+(5-к)), ТипСмещенияТабличногоДокумента.ПоВертикали);
		к=к+1;
	КонецЕсли;
	Если не ПланШт тогда
		ТабДок.УдалитьОбласть(ТабДок.Область("C"+(6-к)), ТипСмещенияТабличногоДокумента.ПоВертикали);
		к=к+1;
	КонецЕсли;
	Если не ФактШт тогда
		ТабДок.УдалитьОбласть(ТабДок.Область("C"+(7-к)), ТипСмещенияТабличногоДокумента.ПоВертикали);
		к=к+1;
	КонецЕсли;
	Если не ОтклонениеАбсШт тогда
		ТабДок.УдалитьОбласть(ТабДок.Область("C"+(8-к)), ТипСмещенияТабличногоДокумента.ПоВертикали);
		к=к+1;
	КонецЕсли;
	Если не ОтклонениеОтнШт тогда
		ТабДок.УдалитьОбласть(ТабДок.Область("C"+(9-к)), ТипСмещенияТабличногоДокумента.ПоВертикали);
		к=к+1;
	КонецЕсли;
	Если не ПланПроцентНаценки тогда
		ТабДок.УдалитьОбласть(ТабДок.Область("C"+(10-к)), ТипСмещенияТабличногоДокумента.ПоВертикали);
		к=к+1;
	КонецЕсли;
	Если не ФактПроцентНаценки тогда
		ТабДок.УдалитьОбласть(ТабДок.Область("C"+(11-к)), ТипСмещенияТабличногоДокумента.ПоВертикали);
		к=к+1;
	КонецЕсли;
	Если не ОтклонениеАбсПроцНаценки тогда
		ТабДок.УдалитьОбласть(ТабДок.Область("C"+(12-к)), ТипСмещенияТабличногоДокумента.ПоВертикали);
		к=к+1;
	КонецЕсли;
	Если не ПланВаловаяПрибыль тогда
		ТабДок.УдалитьОбласть(ТабДок.Область("C"+(13-к)), ТипСмещенияТабличногоДокумента.ПоВертикали);
		к=к+1;
	КонецЕсли;
	Если не ФактВаловаяПрибыль тогда
		ТабДок.УдалитьОбласть(ТабДок.Область("C"+(14-к)), ТипСмещенияТабличногоДокумента.ПоВертикали);
		к=к+1;
	КонецЕсли;
	Если не ОтклонениеАбсВаловаяПрибыль тогда
		ТабДок.УдалитьОбласть(ТабДок.Область("C"+(15-к)), ТипСмещенияТабличногоДокумента.ПоВертикали);
		к=к+1;
	КонецЕсли;
	Если не ОтклонениеОтнВаловаяПрибыль тогда
		ТабДок.УдалитьОбласть(ТабДок.Область("C"+(16-к)), ТипСмещенияТабличногоДокумента.ПоВертикали);
		к=к+1;
	КонецЕсли;

	ОбластьПодвал=Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.ДоходПланСумма=ДоходПланСумма;
	ОбластьПодвал.Параметры.РасходПланСумма=РасходПланСумма;
	ОбластьПодвал.Параметры.ДоходРасходФакт=ДоходФактСумма-РасходФактСумма;
	ОбластьПодвал.Параметры.ДоходРасходПлан=ДоходПланСумма-РасходПланСумма;
	ОбластьПодвал.Параметры.ДоходФактСумма=ДоходФактСумма;
	ОбластьПодвал.Параметры.РасходФактСумма=РасходФактСумма;

	
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ТабДок.ОтображатьСетку=Ложь;
	ТабДок.Показать();
	//Запрос2.Текст="Выбрать * из втРасходы КАК втРасходы";
	//тз2=Запрос2.Выполнить().Выгрузить().ВыбратьСтроку();
	
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

Процедура ПриОткрытии()
	ПланРуб=истина;
	ФактРуб=истина;
	ОтклонениеАбсРуб=истина;
	ОтклонениеОтнРуб=истина;
	ПланШт=истина;
	ФактШт=истина;
	ОтклонениеАбсШт=истина;
	ОтклонениеОтнШт=истина;
	ПланПроцентНаценки=истина;
	ФактПроцентНаценки=истина;
	ОтклонениеАбсПроцНаценки=истина;
	ПланВаловаяПрибыль=истина;
	ФактВаловаяПрибыль=истина;
	ОтклонениеАбсВаловаяПрибыль=истина;
	ОтклонениеОтнВаловаяПрибыль=истина;
КонецПроцедуры
