
Процедура КаталогНачалоВыбора(Элемент, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	Диалог = Новый  ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог = Каталог;
	Если Диалог.Выбрать() Тогда 
		Каталог = Диалог.Каталог;
	КонецЕсли;

КонецПроцедуры
 
Процедура КоманднаяПанель1Сохранить(Кнопка)
	
	Если НЕ ЗначениеЗаполнено(Каталог) Тогда
		Предупреждение("Выберите каталог",,"Диадок");
		Возврат;
	Иначе
		ПараметрыЗакрытия=	Новый Структура("Каталог, СохранятьПротокол", Каталог, ФлагСохранятьПротокол);
		ЭтаФорма.Закрыть(ПараметрыЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

Процедура КоманднаяПанель1Отмена(Кнопка)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	//КартинкаЗаголовка= ЭДО_БиблиотекаКартинок().КартинкаЗаголовка;
	
КонецПроцедуры




