Функция ПроверитьЕстьлиВозвраты(СписЗаказовНаВозврат) экспорт
	Запрос=новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗаявкаНаВозвратТоваровТовары.Номенклатура,
	             |	ЗаявкаНаВозвратТоваровТовары.Реализация,
	             |	ЗаявкаНаВозвратТоваровТовары.Ссылка,
	             |	СУММА(ЗаявкаНаВозвратТоваровТовары.Количество) КАК Количество
	             |ПОМЕСТИТЬ втЗаявка
	             |ИЗ
	             |	Документ.ЗаявкаНаВозвратТоваров.Товары КАК ЗаявкаНаВозвратТоваровТовары
	             |ГДЕ
	             |	ЗаявкаНаВозвратТоваровТовары.Ссылка В(&СписЗаказовНаВозврат)
	             |	И ЗаявкаНаВозвратТоваровТовары.Ссылка.Дата >= &НачПер
	             |	И ЗаявкаНаВозвратТоваровТовары.Ссылка.Дата <= &КонПер
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ЗаявкаНаВозвратТоваровТовары.Номенклатура,
	             |	ЗаявкаНаВозвратТоваровТовары.Реализация,
	             |	ЗаявкаНаВозвратТоваровТовары.Ссылка
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ПродажиОбороты.ДокументПродажи,
	             |	ПродажиОбороты.Номенклатура,
	             |	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот,
	             |	ПродажиОбороты.Регистратор.ЗаявкаОснование
	             |ПОМЕСТИТЬ втВозвраты
	             |ИЗ
	             |	РегистрНакопления.Продажи.Обороты(
	             |			&НачВозврата,
	             |			,
	             |			Регистратор,
	             |			ДокументПродажи В
	             |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |						втЗаявка.Реализация
	             |					ИЗ
	             |						втЗаявка КАК втЗаявка)
	             |				И Номенклатура В
	             |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |						втЗаявка.Номенклатура
	             |					ИЗ
	             |						втЗаявка КАК втЗаявка)) КАК ПродажиОбороты
	             |ГДЕ
	             |	ПродажиОбороты.КоличествоОборот < 0
	             |	И ПродажиОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ПродажиОбороты.Номенклатура,
	             |	ПродажиОбороты.ДокументПродажи,
	             |	ПродажиОбороты.Регистратор.ЗаявкаОснование
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ТоварыНаОтветственномХраненииОбороты.Номенклатура,
	             |	СУММА(ТоварыНаОтветственномХраненииОбороты.КоличествоОборот) КАК КоличествоОборот,
	             |	ТоварыНаОтветственномХраненииОбороты.Регистратор.ДокументОснование,
	             |	МАКСИМУМ(ТоварыНаОтветственномХраненииОбороты.Регистратор.Дата) КАК РегистраторДата
	             |ПОМЕСТИТЬ втОТХ
	             |ИЗ
	             |	РегистрНакопления.ТоварыНаОтветственномХранении.Обороты(
	             |			&НачВозврата,
	             |			,
	             |			Регистратор,
	             |			Номенклатура В
	             |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |					втЗаявка.Номенклатура
	             |				ИЗ
	             |					втЗаявка КАК втЗаявка)) КАК ТоварыНаОтветственномХраненииОбороты
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ТоварыНаОтветственномХраненииОбороты.Номенклатура,
	             |	ТоварыНаОтветственномХраненииОбороты.Регистратор.ДокументОснование
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	втЗаявка.Ссылка КАК Ссылка,
	             |	втЗаявка.Реализация КАК Реализация,
	             |	втЗаявка.Номенклатура КАК Номенклатура,
	             |	втЗаявка.Количество + ЕСТЬNULL(втВозвраты.КоличествоОборот, 0) КАК ЕстьВозврат,
	             |	втЗаявка.Количество КАК Количество,
	             |	втОТХ.КоличествоОборот КАК КоличествоОТХ,
	             |	втОТХ.РегистраторДата
	             |ПОМЕСТИТЬ Врем
	             |ИЗ
	             |	втЗаявка КАК втЗаявка
	             |		ЛЕВОЕ СОЕДИНЕНИЕ втВозвраты КАК втВозвраты
	             |		ПО втЗаявка.Номенклатура = втВозвраты.Номенклатура
	             |			И втЗаявка.Реализация = втВозвраты.ДокументПродажи
	             |			И втЗаявка.Ссылка = втВозвраты.РегистраторЗаявкаОснование
	             |		ЛЕВОЕ СОЕДИНЕНИЕ втОТХ КАК втОТХ
	             |		ПО втЗаявка.Номенклатура = втОТХ.Номенклатура
	             |			И втЗаявка.Ссылка = втОТХ.РегистраторДокументОснование
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Врем.Ссылка,
	             |	СУММА(Врем.ЕстьВозврат) КАК ЕстьВозврат,
	             |	СУММА(Врем.Количество) КАК Количество,
	             |	СУММА(ЕСТЬNULL(Врем.КоличествоОТХ, 0)) КАК КоличествоОТХ,
	             |	МАКСИМУМ(ЕСТЬNULL(Врем.РегистраторДата, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ДатаОТХ
	             |ИЗ
	             |	Врем КАК Врем
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Врем.Ссылка
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Врем.Ссылка.Дата
	             |АВТОУПОРЯДОЧИВАНИЕ";
				 
				 Запрос.УстановитьПараметр("СписЗаказовНаВозврат",СписЗаказовНаВозврат);
				 НачПер = СписЗаказовНаВозврат[0].Значение.Дата;
				 КонПер = СписЗаказовНаВозврат[ СписЗаказовНаВозврат.Количество()-1 ].Значение.Дата;
				 для каждого стр1 из СписЗаказовНаВозврат цикл
					 если стр1.Значение.Дата < НачПер тогда
						 НачПер = стр1.Значение.Дата;
					 КонецЕсли;
					 если стр1.Значение.Дата > КонПер тогда
						 КонПер = стр1.Значение.Дата;
					 КонецЕсли;	 
				 КонецЦикла;	 
				 Запрос.УстановитьПараметр("НачПер", НачПер);
				 Запрос.УстановитьПараметр("КонПер", КонПер);
				 
				 НачВозвр = ДобавитьМесяц( НачалоМесяца(начПер) , -1);  //возвраты могут быть раньше заявок... на 2 месяца не более
				 Запрос.УстановитьПараметр("НачВозврата", НачВозвр);
				 
		табл = Запрос.Выполнить().Выгрузить();
		
		//табл.Свернуть("Ссылка","ЕстьВозврат,Количество,КоличествоОТХ");	///// Плотников
		
		табл.Колонки.Добавить("Статус");
		
		для каждого стр1 из табл цикл
			Если стр1.Количество=0 тогда
				стр1.Статус = "9.Нет товаров в заявке!";
			ИначеЕсли стр1.ЕстьВозврат=стр1.Количество тогда // по количеству в заявке!
				стр1.Статус = "0.Нет возвратов";
			ИначеЕсли стр1.ЕстьВозврат=0 тогда // кол в заявке = кол. всех возвратов
				стр1.Статус = "1.Есть все возвраты";
			иначеЕсли стр1.ЕстьВозврат>0 тогда
				стр1.Статус = "2.Возвраты есть частично";
			иначеЕсли стр1.ЕстьВозврат<0 тогда
				стр1.Статус = "3.Возврат больше заявки";
			КонецЕсли;	
		КонецЦикла;
	
	возврат  табл;
КонецФункции
Функция ПолучитьПереданные(СписЗаказовНаВозврат) экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПечатныеФормыВНаличии.Документ
		|ИЗ
		|	РегистрСведений.ПечатныеФормыВНаличии КАК ПечатныеФормыВНаличии
		|ГДЕ
		|	ПечатныеФормыВНаличии.Документ В(&Спис)
		|	И ПечатныеФормыВНаличии.Статус = ЗНАЧЕНИЕ(Справочник.СостояниеДокументов.Оформлен)";

	Запрос.УстановитьПараметр("Спис", СписЗаказовНаВозврат);

	Результат = Запрос.Выполнить().Выгрузить();

	возврат Результат;
конецФункции	