
 //ОСНОВНАЯ функция для регл.задания
 //загрузки файлов с почты, создание заказов покупателей и создание событий для Менеджера----------
процедура ЗагрузитьЗаказыСПочты() ЭКСПОРТ
рез = "";
имяПочтЯщикаПолучения="xls@yst.ru";
имяПочтЯщикаОтвет = имяПочтЯщикаПолучения; 

Путь="\\sigma\Общая папка\Файлы с почты\";	

ТаблНастроек = ПолучитьНастройкиЗагрузкиЗаказовИзExcel();

для каждого стр1 из ТаблНастроек цикл
	Если стр1.ОтправителиКлиента="" тогда 
		#Если Клиент тогда
			сообщить("Для настройки клиента "+строка(стр1.Контрагент)+" - нет Отправителей!", СтатусСообщения.Внимание);
		#КонецЕсли
		Продолжить;
	КонецЕсли;
путь1 = Путь;	

стр1.списокФайлов = ПолучитьФайлыСПочты(имяПочтЯщикаПолучения, путь1, стр1.ОтправителиКлиента ); 

рез1 = СоздатьЗаказыИзФайловExcel(стр1, путь1, имяПочтЯщикаОтвет);

рез = рез + рез1;
КонецЦикла;

#Если Клиент тогда
	сообщить(рез);
#КонецЕсли
//рез - в лог файл! 
КонецПроцедуры


//+ 26.04.2018
//ОБЩАЯ ФУНКЦИЯ загрузки файлов с почты
//- загружает письма с почты: имяПочтЯщика 
//	за период [МинДатаОтправления - МаксДатаОтправления]
//	все вложения (application) - пишет в папку:  Путь (если пустая, то КаталогВременныхФайлов )
//  фильтр по строке ОтправителиПисьма, если "" тогда ото всех!
// УдалятьСообщенияССервера  - удалять письма посде загрузки или нет...
//
//возвращает: списокФайлов
//
функция ПолучитьФайлыСПочты(имяПочтЯщика="", Путь="", ОтправителиПисьма="", УдалятьСообщенияССервера = ЛОЖЬ, МинДатаОтправления=неопределено, МаксДатаОтправления=неопределено, ДобавлятьТемуИДатуВИмяФайла=Истина)  Экспорт
	списокФайлов = Новый СписокЗначений;

	имяПочтЯщика = ?(имяПочтЯщика="", "1C@yst.ru", имяПочтЯщика);   // "no-reply@yst76.ru" / "1C@yst.ru";
	Путь=?(Путь="",  КаталогВременныхФайлов(), Путь);
	МинДатаОтправления = ?(МинДатаОтправления=неопределено, НачалоДня(ТекущаяДата()), МинДатаОтправления);
	МаксДатаОтправления =?(МаксДатаОтправления=неопределено, КонецДня(ТекущаяДата()), МаксДатаОтправления);
	
//путь =  Константы.ПутьКФайлам.получить()+"\НовЛайн\";
//текстФайлаСодержит = "Остатки на ";

//------- 1) подключаемся к учетной записи почты: НовЛайнЯщикДляПрайсов-------------
УЗ = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(имяПочтЯщика); 
	ИПП=Новый ИнтернетПочтовыйПрофиль;
	//----------для получения только POP3 ----------------
	ИПП.АдресСервераPOP3   = УЗ.POP3Сервер;
	ИПП.ПортPOP3           = УЗ.ПортPOP3;
	ИПП.Пользователь	   = УЗ.АдресЭлектроннойПочты;
	ИПП.Пароль			   = УЗ.Пароль;
	
	//+++ 22.09.2014 - так возможно...
	ИПП.АдресСервераIMAP = уз.POP3Сервер; 
	ИПП.ПортIMAP 		 = уз.ПортPOP3 ;
	ИПП.ПользовательIMAP = уз.Логин;
	ИПП.ПарольIMAP       = УЗ.Пароль;
	ИПП.ИспользоватьSSLIMAP = истина;
	
попытка
	Почта=Новый ИнтернетПочта;
	Почта.Подключиться(ИПП);
исключение
	#Если Клиент Тогда
		сообщить("Невозможно подключиться к почте: "+имяПочтЯщика+" : "+ОписаниеОшибки(), СтатусСообщения.Внимание);
	#КонецЕсли	
	Возврат списокФайлов;
КонецПопытки;

//---------- 2) перебираем все письма из папки Входящие и ищем только с вложениями-------------
	//для этой цели объект Почта имеет метод "Выбрать". 
	//У метода два параметра: 
	//1-ый отвечает за УдалятьСообщенияССервера
	//2-ой массив с заголовками писем... пустой
	//
// Почта.Выбрать(<УдалятьСообщения>, <МассивЗаголовковСообщенийИлиИдентификаторов>) 

попытка
	Сообщения = Почта.Выбрать(УдалятьСообщенияССервера); // тип: массив из типов: ИнтернетПочтовоеСообщение 
исключение
	Почта.Отключиться();
	#Если Клиент Тогда
		сообщить("Невозможно получить письма с почты: "+имяПочтЯщика+" : "+ОписаниеОшибки(), СтатусСообщения.Внимание);
	#КонецЕсли	
	Возврат списокФайлов;
КонецПопытки;

//----------------Главный Цикл-------------------------
//Далее после выборки сообщений необходимо перебрать их в Цикле и сохранить вложение, 
#Если Клиент Тогда
	сообщить(Строка(ТекущаяДата())+" Начало обработки "+строка(Сообщения.Количество())+" писем.", СтатусСообщения.Информация);
#КонецЕсли	

Для каждого Сообщение Из Сообщения Цикл
	
	//берем только сегодняшние письма!
	Если Сообщение.ДатаОтправления < МинДатаОтправления или Сообщение.ДатаОтправления>МаксДатаОтправления Тогда
	  Продолжить;
	КонецЕсли;	  

	Попытка
		ОтправительПисьма = Сообщение.Отправитель.Адрес;
	Исключение
		ОтправительПисьма = Сообщение.Отправитель;
	КонецПопытки;

	Если ОтправителиПисьма<>"" тогда
		Если Найти(ОтправителиПисьма, ОтправительПисьма)=0 тогда
			#Если Клиент Тогда
				Сообщить("Не найден отправитель: "+ ОтправительПисьма + " в списке:  "+ОтправителиПисьма, СтатусСообщения.Важное);
			#КонецЕсли	
		продолжить;
		КонецЕсли;
	КонецЕсли;	

//ИнтернетПочтовоеСообщение
темаПисьма = ОтправительПисьма+" Тема "+Сообщение.Тема +" (отправлено "+Сообщение.ДатаОтправления+") ";
темаПисьма = стрЗаменить(темаПисьма,":","-"); темаПисьма = стрЗаменить(темаПисьма,"/","_");темаПисьма = стрЗаменить(темаПисьма,"\","_");  
темаПисьма = стрЗаменить(темаПисьма,"""","");темаПисьма = стрЗаменить(темаПисьма,"<","");темаПисьма = стрЗаменить(темаПисьма,">","");     //17.05.2018

// Перебираем вложения письма
	Влож = "";  i=0;
	Для каждого Вложение Из Сообщение.Вложения Цикл     // ИнтернетПочтовоеВложение
		Попытка //возможна ошибка при записи 
			Если Найти(Вложение.ТипСодержимого, "application/")>0 Тогда    
				//"application/vnd.ms-excel" (XLS)  или "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet" (XLSX)
				Если ДобавлятьТемуИДатуВИмяФайла тогда
					имя1 = темаПисьма+Вложение.ИмяФайла;
				иначе //чистое имя файла... неизвестно от кого...
					имя1 = 	Вложение.ИмяФайла;
			    КонецЕсли;
				файл1 = новый Файл(путь+имя1);
				если файл1.Существует() тогда
					#Если Клиент Тогда
					Сообщить("УЖЕ существует файл: "+имя1, СтатусСообщения.Внимание);
					#КонецЕсли	
				Иначе
					
					Если нрег(прав(имя1,4))=".xls"
						или нрег(прав(имя1,4))="xlsx" тогда  //+++ 17.05.2018
					Вложение.Данные.Записать(путь+имя1);
					списокФайлов.Добавить( имя1 );  
					Влож=Влож+Вложение.ИмяФайла+", "; //Запоминаем имя вложения прикрепленных к данному письму
					Иначе
						#Если Клиент Тогда
						Сообщить("НЕВЕРНЫЙ формат файла: "+имя1, СтатусСообщения.Внимание);
						#КонецЕсли	
					КонецЕсли;
				КонецЕсли;
			    файл1 = неопределено;
				
		    КонецЕсли;
		
		Исключение
		  Почта.Отключиться();
		  #Если Клиент Тогда
			  сообщить(темаПисьма+" : "+ОписаниеОшибки(), СтатусСообщения.Внимание);
			  сообщить("Невозможно сохранить файл вложения: "+путь+Вложение.ИмяФайла+"
			  		   |"+темаПисьма, СтатусСообщения.Внимание);
		  #КонецЕсли	
		  Возврат списокФайлов;
	    КонецПопытки;
	  
	 i=i+1;
	КонецЦикла;	
	
	#Если Клиент Тогда
    сообщить(темаПисьма+" : "+Влож, СтатусСообщения.Информация);
	#КонецЕсли

КонецЦикла;	//по письмам

возврат списокФайлов;
КонецФункции

//+ из рег.св. НастройкаЗагрузкиЗаказовИзExcel + адреса отправителей из КонтактнаяИнформация
функция ПолучитьНастройкиЗагрузкиЗаказовИзExcel() экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкаЗагрузкиЗаказовИзExcel.Контрагент,
	               |	НастройкаЗагрузкиЗаказовИзExcel.Артикул,
	               |	НастройкаЗагрузкиЗаказовИзExcel.Количество,
	               |	НастройкаЗагрузкиЗаказовИзExcel.Цена,
	               |	НастройкаЗагрузкиЗаказовИзExcel.ПерваяСтрока,
	               |	НастройкаЗагрузкиЗаказовИзExcel.Код,
	               |	НастройкаЗагрузкиЗаказовИзExcel.EmailОтвет,
	               |	НастройкаЗагрузкиЗаказовИзExcel.ОбъединятьЗаказы,
	               |	НастройкаЗагрузкиЗаказовИзExcel.КоличествоОтказ,
	               |	НастройкаЗагрузкиЗаказовИзExcel.ПричинаОтказа,
	               |	КонтактнаяИнформация.Представление КАК ОтправителиКлиента
	               |ИЗ
	               |	РегистрСведений.НастройкаЗагрузкиЗаказовИзExcel КАК НастройкаЗагрузкиЗаказовИзExcel
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КИ.Объект КАК Контрагент,
	               |			КИ.Представление КАК Представление,
	               |			КИ.Комментарий КАК Комментарий
	               |		ИЗ
	               |			РегистрСведений.КонтактнаяИнформация КАК КИ
	               |		ГДЕ
	               |			ВЫРАЗИТЬ(КИ.Объект КАК Справочник.Контрагенты).Ссылка В
				   |					(ВЫБРАТЬ нн.Контрагент
	               |					ИЗ РегистрСведений.НастройкаЗагрузкиЗаказовИзExcel КАК нн)
	               |			И КИ.Тип = &Тип
	               |			И КИ.Вид = &Вид) КАК КонтактнаяИнформация
	               |		ПО НастройкаЗагрузкиЗаказовИзExcel.Контрагент = КонтактнаяИнформация.Контрагент";
	Запрос.УстановитьПараметр("Тип", перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);				   
	Запрос.УстановитьПараметр("Вид", справочники.ВидыКонтактнойИнформации.НайтиПоКоду("39245")  ); //E-mail отправителей для загрузки заказов через @				   
		Результат = Запрос.Выполнить();
		табл = результат.Выгрузить();
	для каждого стр1 из табл цикл
	//	стр1.КодКлиента = сокрЛП(стр1.КодКлиента);
		стр1.ОтправителиКлиента = СокрЛП(стр1.ОтправителиКлиента);
		стр1.ОтправителиКлиента = стрЗаменить(стр1.ОтправителиКлиента," ","");
		стр1.ОтправителиКлиента = стрЗаменить(стр1.ОтправителиКлиента,",",";");
	КонецЦикла;
    табл.Колонки.Добавить("списокФайлов");
	возврат табл;
КонецФункции	

//+ возвращает табл.знач
функция РазобратьExcelФайлВТабЗнач(ИмяФайлаПолное, стр1) экспорт
	
	//+++ 17.05.2018
	ВидТов1 = перечисления.ВидыТоваров.ПустаяСсылка();
	
	Если Найти(врег(ИмяФайлаПолное)," ШИНЫ ")>0 тогда
		ВидТов1 = перечисления.ВидыТоваров.Шины;
	ИначеЕсли Найти(врег(ИмяФайлаПолное)," ДИСКИ ")>0 тогда
		ВидТов1 = перечисления.ВидыТоваров.Диски;
	ИначеЕсли Найти(нрег(ИмяФайлаПолное)," аксессуары ")>0 тогда
		ВидТов1 = перечисления.ВидыТоваров.Аксессуары;
	КонецЕсли;
	
	НомерЛистаExcel = 1;
	xlLastCell = 11;
	
	табЗнач = новый ТаблицаЗначений;
	табЗнач.Колонки.Добавить("НомерСтроки");
	табЗнач.Колонки.Добавить("Артикул");
	табЗнач.Колонки.Добавить("Номенклатура"); //если найдём такую
	табЗнач.Колонки.Добавить("Количество");
	табЗнач.Колонки.Добавить("Цена");
	
	//разбор Excel-файла: ИмяФайла  по полям  стр1
	//НомерСтроки  = от стр1.ПерваяСтрока до конца...
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайлаПолное);
		#Если Клиент тогда
			Состояние("Обработка файла Microsoft Excel...");
		#КонецЕсли	
		ExcelЛист = Excel.Sheets(НомерЛистаExcel);
	Исключение
		#Если Клиент тогда
		Сообщить("Ошибка. Невозможно открыть файл Excel:  "+ИмяФайлаПолное);
		#КонецЕсли	
		Возврат табЗнач;
	КонецПопытки;
	
	ActiveCell = Excel.ActiveCell.SpecialCells(xlLastCell);
	RowCount = ActiveCell.Row;
	//ColumnCount = ActiveCell.Column;
	ПустаяНом = справочники.Номенклатура.ПустаяСсылка();
	нн=1; 
	Для Row = стр1.ПерваяСтрока По RowCount Цикл
		
		СтрТЗ = табЗнач.Добавить(); //всегда!
		 СтрТЗ.НомерСтроки = нн;
		 СтрТЗ.Артикул     = "";
		 СтрТЗ.Количество  = 0;
		 СтрТЗ.Цена	       = 0;
		 СтрТЗ.Номенклатура = ПустаяНом;
		 
		Попытка
		 СтрТЗ.Артикул   =  СокрЛП(ExcelЛист.Cells(Row,стр1.Артикул).Text);
		 
		 кол1 =   СокрЛП(ExcelЛист.Cells(Row,стр1.Количество).Text);
		 	кол1 = стрЗаменить(кол1,",","."); кол1 = стрЗаменить(кол1," ",""); кол1 = стрЗаменить(кол1,символ(160) ,"");
		  	СтрТЗ.Количество = число(кол1);
		  
		 Цена1=   СокрЛП(ExcelЛист.Cells(Row,стр1.Цена).Text);
		 	Цена1= стрЗаменить(Цена1,",","."); Цена1= стрЗаменить(Цена1," ",""); Цена1= стрЗаменить(Цена1,символ(160) ,"");
			ЦенаExcel = число(Цена1); //+++ 26.03.2019
		  	СтрТЗ.Цена = ЦенаExcel;
		  
		 Код1   =  ?(стр1.Код>0, СокрЛП(ExcelЛист.Cells(Row,стр1.Код).Text), "");
		 СтрТЗ.Номенклатура = НайтиТовар(СтрТЗ.Артикул, Код1, ВидТов1, ЦенаExcel, стр1.Контрагент); //+++ 26.03.2019
		 
	 	Исключение
			#Если Клиент тогда
				Сообщить(строка(нн)+") Артикул: "+СтрТЗ.Артикул+" Кол-во: "+кол1+" шт. Цена: "+Цена1+"р. Ошибка: "+ОписаниеОшибки(), СтатусСообщения.Внимание );
			#КонецЕсли	
		КонецПопытки; 
		
	нн=нн+1;	
	КонецЦикла;
	
	Excel.WorkBooks.Close();
	Excel = 0;
	
	возврат табЗнач;
	
КонецФункции	

//22.03.2019 - базовая (диски) или кр.опт цена...
функция НайтиБлижайшийТоварПоЦенамКлиента(табл1, ЦенаExcel=0, СтрКонтрагент=неопределено)
	
Если СтрКонтрагент=неопределено тогда // не должно быть такого!
	Запрос1 = новый Запрос;
	Запрос1.УстановитьПараметр("табл1", табл1);
	Запрос1.УстановитьПараметр("Диски", перечисления.ВидыТоваров.Диски);
	Запрос1.УстановитьПараметр("Базовая",справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00008") );
	Запрос1.УстановитьПараметр("КрОпт",  справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00005") );
	Запрос1.УстановитьПараметр("ЦенаExcel", ЦенаExcel);//число
	 Запрос1.текст = "ВЫБРАТЬ
	                 |	ВТ.Товар
	                 |ПОМЕСТИТЬ ВТ_Товары
	                 |ИЗ
	                 |	&табл1 КАК ВТ
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	втТов.Товар,
	                 |	ЕСТЬNULL(рсЦены.Цена, 0) КАК Цена,
	                 |	ВЫБОР
	                 |		КОГДА ЕСТЬNULL(рсЦены.Цена, 0) >= &ЦенаExcel
	                 |			ТОГДА ЕСТЬNULL(рсЦены.Цена, 0) - &ЦенаExcel
	                 |		ИНАЧЕ &ЦенаExcel - ЕСТЬNULL(рсЦены.Цена, 0)
	                 |	КОНЕЦ КАК Разность
	                 |ИЗ
	                 |	ВТ_Товары КАК втТов
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                 |			ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	                 |			ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	                 |		ИЗ
	                 |			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(,
	                 |					Номенклатура в (выбрать вт.Товар из вт_Товары как вт)
					 |						И ВЫБОРКОГДА Номенклатура.ВидТовара = &Диски
	                 |								ТОГДА ТипЦен = &Базовая
	                 |							ИНАЧЕ ТипЦен = &КрОпт
	                 |						КОНЕЦ) КАК ЦеныНоменклатурыСрезПоследних) КАК рсЦены
	                 |		ПО втТов.Товар = рсЦены.Номенклатура
	                 |
	                 |УПОРЯДОЧИТЬ ПО
	                 |	Разность"; //сразу сортируем по возрастанию
 	//+++ 22.03.2019 - цены
    табл = Запрос1.Выполнить().Выгрузить();
иначе
	
	оснДОговор = стрКонтрагент.ОсновнойДоговорКонтрагента;
	флПредоплата = (оснДОговор.типДоговора = справочники.ТипыДоговоров.НайтиПоКоду("00001") 
			  или оснДОговор.ТипДоговора = справочники.ТипыДоговоров.ПредоплатаПоСчетам //+++14.08.2017
			  или оснДОговор.типДоговора = справочники.ТипыДоговоров.ФакторингПредоплата);
			  
	масТов  = табл1.выгрузитьКолонку("Товар");	
	таблЦен = ОбменСУТИнтернетМагазин.ПолучитьЦеныДляКонтрагента_РегСв(стрКонтрагент, масТов);
	
	табл = табл1.Скопировать();
	табл.Колонки.Добавить("Разность");
	разностьМин = 999999; тов1=Неопределено;  
	для каждого стр1 из табл цикл
		стрЦены = таблЦен.найти(стр1.Товар, "Номенклатура");
		Если стрЦены = Неопределено тогда
			Продолжить;
		КонецЕсли;	
			
		если флПредоплата тогда
			стр1.Цена = стрЦены.ЦенаСоСкидкойПредоплаты;
		иначе
			стр1.Цена = стрЦены.МинимальнаяЦена;
		КонецЕсли;
		
		разность = стр1.Цена - ЦенаExcel;
		стр1.разность = ?(разность<0, -разность, разность); //всегда +
	КонецЦикла;	
	табл.Сортировать("Разность Возр");//по возрастанию
	
КонецЕсли;	

	возврат табл;
КонецФункции


// приоритет поиска:
// 1) по Коду, если он есть
// 2) по Артикулу или АртикулуСокр 
//ограничение видов товаров - АКБ, АКС, Шины, Диски
Функция НайтиТовар(Артикул="", Код="", ВидТовара1=неопределено, ЦенаExcel=0, стрКонтрагент=неопределено)	
	
	тов1 = справочники.Номенклатура.ПустаяСсылка();
	
	Если Артикул="" и Код="" тогда //нечего искать
		возврат тов1;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	остОТХ.Номенклатура КАК Товар,
	//| остОТХ.КоличествоОстаток,
	|	0 как Цена
	|ИЗ
	|	(ВЫБРАТЬ
	|		ост.Номенклатура КАК Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки( ,
	|				Склад.ЗапретитьИспользование = ЛОЖЬ
	|					И Склад.Транзитный = ЛОЖЬ
	|					И Склад.Подразделение = Значение(Справочник.Склады.ПустаяСсылка)
	|					И Номенклатура.ВидТовара В (&ВидыТоваров)
	|					//И условие поиска по коду или артикулу
	|					) КАК ост
	|ГДЕ ост.КоличествоОстаток>0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		отх.Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыНаОтветственномХранении.Остатки( ,
	|				Склад.ЗапретитьИспользование = ЛОЖЬ
	|					И Склад.Транзитный = ЛОЖЬ
	|					И Склад.Подразделение = Значение(Справочник.Склады.ПустаяСсылка)
	|					И Контрагент В (&СписокКонтрагентовОТХ)
	|					И Номенклатура.ВидТовара В (&ВидыТоваров)
	|					//И условие поиска по коду или артикулу
	|					) КАК отх 
	|ГДЕ отх.КоличествоОстаток>0
	|
	|) КАК остОТХ
	|";
	
	ВидыТоваров = новый СписокЗначений;
	Если Код="" и ЗначениеЗаполнено(ВидТовара1) тогда
		ВидыТоваров.Добавить(ВидТовара1); // ТОЛЬКО 1 вид!
	Иначе
		ВидыТоваров.Добавить(перечисления.ВидыТоваров.Шины);
		ВидыТоваров.Добавить(перечисления.ВидыТоваров.Диски);
		ВидыТоваров.Добавить(перечисления.ВидыТоваров.АКБ);
		ВидыТоваров.Добавить(перечисления.ВидыТоваров.Аксессуары);
		ВидыТоваров.Добавить(перечисления.ВидыТоваров.Прочее); //26.03.2019
	КонецЕсли;
	Запрос.УстановитьПараметр("ВидыТоваров", ВидыТоваров);
	
	СписокКонтрагентовОТХ = Новый СписокЗначений;
	СписокКонтрагентовОТХ = яштПоставщики.ПолучитьСписокПоставщиков(Истина);
	Запрос.УстановитьПараметр("СписокКонтрагентовОТХ", СписокКонтрагентовОТХ);
	
	запросТекст0 = запрос.Текст;
	
	Если Код<>"" тогда //по коду точнее
		Запрос.Текст = стрЗаменить(запрос.Текст, "//И условие поиска по коду или артикулу", "Номенклатура.Код = &Код");
		Если стрДлина(Код)<7 тогда 
			Попытка //06.06.2018 должны быть ТОЛЬКО цифры! но никто не гарантирует
				Код = формат( число(Код),"ЧЦ=7; ЧВН=; ЧГ=0");
			исключение
			КонецПопытки;
		КонецЕсли;	
		Запрос.УстановитьПараметр("Код",Код);
	Иначе
		//***2019.01.28 ищем и по АртикулуСокр
		Запрос.Текст = стрЗаменить(Запрос.Текст, "//И условие поиска по коду или артикулу", "(Номенклатура.Артикул = &Артикул ИЛИ Номенклатура.АртикулСокр = &Артикул)");
		Запрос.УстановитьПараметр("Артикул",Артикул);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	табл1    = Результат.Выгрузить(); //+++ 26.03.2019 нужна таблицы для доп.анализа дублей!
	
	Если табл1.Количество()>0 тогда
		
		Если табл1.Количество()>1 тогда
			#Если Клиент тогда
			сообщить("Найдено "+строка(табл1.Количество())+" товаров по " + ?(Код<>"","Коду: "+Код, "Артикулу: "+Артикул), СтатусСообщения.Внимание);
			#КонецЕсли	
			
		//+++ 26.03.2019 - восстановлен поиск по ближайшей цене
			табл1 = НайтиБлижайшийТоварПоЦенамКлиента(табл1, ЦенаExcel, стрКонтрагент); 
			тов1  = табл1[0].Товар;
			#Если Клиент тогда
			сообщить("Найден ближайщий по цене товар: "+строка(тов1.Код)+" по цене: "+строка( табл1[0].Цена)+"р. (цены Excel: "+строка(ЦенаExcel)+" р.)",  СтатусСообщения.Внимание);
			#КонецЕсли	

			//   тов1 = выборка.Товар; //первый попавшийся НЕЛЬЗЯ! могут быть разные типы... акс и шины / диски
		Иначе
			тов1 = табл1[0].Товар;
		КонецЕсли;
		
	Иначе
		
		//+++ 07.05.2018 поиск по части артикула
		запрос.Текст = стрЗаменить(запросТекст0, "//И условие поиска по коду или артикулу",
		"(Номенклатура.Артикул подобно (&Арт1) 
		|	или Номенклатура.Артикул подобно (&Арт2) 
		|	или Номенклатура.Артикул подобно (&Арт3)
		|	ИЛИ Номенклатура.АртикулСокр Подобно (&Арт1)
		|	ИЛИ Номенклатура.АртикулСокр Подобно (&Арт2)
		|	ИЛИ Номенклатура.АртикулСокр Подобно (&Арт3)
		|) ");
		Запрос.УстановитьПараметр("Арт1",Артикул+"=%"); // в начале
		Запрос.УстановитьПараметр("Арт2","%="+Артикул); //в конце
		Запрос.УстановитьПараметр("Арт3","%="+Артикул+"=%"); // в середине
		
		Результат = Запрос.Выполнить();
		табл1 = Результат.Выгрузить();  //+++ 26.03.2019 нужна таблицы для доп.анализа дублей!
		
		Если табл1.Количество()>1 тогда
			#Если Клиент тогда
				сообщить("Найдено "+строка(табл1.Количество())+" товара по Артикулу: "+Артикул+" через знак = ", СтатусСообщения.Внимание);
			#КонецЕсли	
			тов1 = табл1[0].Товар; //06.06.2018 первый попавшийся аналог подойдёт (это точно все шины!)
			
		ИначеЕсли табл1.Количество()=1 тогда
			тов1 = табл1[0].Товар;
			
			#Если Клиент тогда
				сообщить("Найден Товар по Артикулу: "+Артикул+" через знак = ("+тов1.Артикул+") "+тов1.Наименование, СтатусСообщения.Информация);
			#КонецЕсли	
		Иначе
			//+++ 25.05.2018 - доп. поиск по Артикулу ИЛИ по Коду, если это число 7 цифр
			// только если указан вид товара! Иначе 1400 "пересечений" диски - диски / шины / аксессуары
			Если Код="" и стрДлина(Артикул)=7 тогда 
				колЧисел = 0;
				для i=1 по 7 цикл
					симв1 = сред(Артикул, i,1);
					Если Найти("0123456789", симв1)>0 тогда
						колЧисел = колЧисел +1;
					КонецЕсли;	
				КонецЦикла;	
				
				Если колЧисел=7 тогда//только в ЭТОМ случае - поиск по Коду!
					запрос.Текст = стрЗаменить(запросТекст0, "//И условие поиска по коду или артикулу", "Номенклатура.Код = &Артикул");
					Результат = Запрос.Выполнить();
					табл1 = Результат.Выгрузить();  //+++ 26.03.2019 нужна таблицы для доп.анализа дублей!
					
					Если табл1.Количество()>1 тогда
						#Если Клиент тогда
							сообщить("Найдено "+строка(табл1.Количество())+" товара по Коду: "+Артикул+" (Вместо Артикула)", СтатусСообщения.Внимание);
						#КонецЕсли	
						
						//+++ 26.03.2019 - восстановлен поиск по ближайшей цене
						табл1 = НайтиБлижайшийТоварПоЦенамКлиента(табл1, ЦенаExcel, стрКонтрагент); 
						тов1  = табл1[0].Товар;
						#Если Клиент тогда
						сообщить("Найден ближайщий по цене товар: "+строка(тов1.Код)+" по цене: "+строка( табл1[0].Цена)+"р. (цены Excel: "+строка(ЦенаExcel)+" р.)",  СтатусСообщения.Внимание);
						#КонецЕсли	

					ИначеЕсли табл1.Количество()=1 тогда
						тов1  = табл1[0].Товар;
						#Если Клиент тогда
							сообщить("Найден Товар по Коду: "+Артикул+"  (Вместо Артикула)", СтатусСообщения.Информация);
						#КонецЕсли
					Иначе //ничего не найдено
						#Если Клиент тогда
							сообщить("На остатках (в т.ч. ОТХ) не найден товар по коду: "+Артикул, СтатусСообщения.Внимание);
						#КонецЕсли	
					КонецЕсли;	
					
				Иначе //ничего не найдено
					#Если Клиент тогда
						сообщить("На остатках (в т.ч. ОТХ) не найден товар по артикулу: "+Артикул+" (через знак =)", СтатусСообщения.Внимание);
					#КонецЕсли	
				КонецЕсли;		
			Иначе //ничего не найдено
				#Если Клиент тогда
					сообщить("На остатках (в т.ч. ОТХ) не найден товар по артикулу: "+Артикул, СтатусСообщения.Внимание);
				#КонецЕсли	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	возврат тов1;
	
КонецФункции

//Функция разбора Excel файлов и создание заказа покупателя,
 //стр1 =  списокФайлов,
// для: КодКлиента, Контрагент,
 //из столбцов Excel: Артикул, Количество, Цена, ПерваяСтрока,
 //доп.поля: Код,
//--------------------
 //поля возврата при ошибке: КоличествоОтказ, ПричинаОтказа,
 //---------------------------------
 //связка:	ОтправителиКлиента
 //===============================================
//возвращает количество созданных Заказов
функция СоздатьЗаказыИзФайловExcel(стр1, Путь="", элПочтаОтКого="")
	
	рез = "";
	исклИзАвтоОбъединения = НЕ стр1.ОбъединятьЗаказы; //19.06.2018
	
	для i=0 по стр1.списокФайлов.Количество()-1 цикл
		Кому = стр1.EmailОтвет; //22.05.2018
		ИмяФайла = стр1.списокФайлов[i].Значение;
		табЗнач = РазобратьExcelФайлВТабЗнач(Путь + ИмяФайла, стр1);
		
		ЗаказСсылка = документы.ЗаказПокупателя.ПустаяСсылка();
		табЗначОтвет = СоздатьЗаказПоТабЗнач(табЗнач, стр1.Контрагент, ИмяФайла, ЗаказСсылка, исклИзАвтоОбъединения);
		
		СоздатьУведомлениеОбОшибке(Путь + ИмяФайла, стр1, табЗначОтвет, ЗаказСсылка);
		
		//+++( 06.06.2018 --------------------------------------------------------
		Если ЗаказСсылка.Пустая() тогда
			ЭтоКонфликтБлокировок=ЛОЖЬ; 
			для каждого стр2 из табЗначОтвет цикл
				Если Найти(стр2.ПричинаОтказа,"Конфликт блокировок")>0
					или Найти(стр2.ПричинаОтказа,"Ошибка")>0 тогда       //+++ 09.11.2018 -  любая ошибка!
					//---3) арт.:  () 0шт. х 0р. -> Не найден Товар по Артикулу! Ошибка: {ОбщийМодуль.яштЗаказыСПочты.Модуль(747)}: 
					//Ошибка при вызове метода контекста (Записать): Ошибка при выполнении обработчика - 'ОбработкаПроведения': 
					//{ОбщийМодуль.яштПрочее.Модуль(9321)}: Ошибка при вызове метода контекста (Выполнить): {(16, 2)}: Таблица не найдена "ВТ_ТоварыТЧ"
					//<<?>>ВТ_ТоварыТЧ КАК ВТ_ТоварыB
					ЭтоКонфликтБлокировок = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если ЭтоКонфликтБлокировок тогда
				ИмяФайла2 = стрЗаменить(ИмяФайла,".xls","(Ошибка).xls");  //чтобы ещё раз переЗагружалось!
				
				фл2 = новый Файл(Путь+ИмяФайла2);
				Если фл2.Существует() тогда   //+++ 09.11.2018
					// 2-ой раз! 
					ИмяФайла2 = стрЗаменить(ИмяФайла2,").xls","2).xls");  //чтобы ещё раз переЗагружалось!
					
					// 3-ой раз! 
					фл3 = новый Файл(Путь+ИмяФайла2);
					Если фл3.Существует() тогда 
						ИмяФайла2 = стрЗаменить(ИмяФайла2,"2).xls","3).xls");  //чтобы ещё раз переЗагружалось!
						
						фл4 = новый Файл(Путь+ИмяФайла2); //на 4-ый не меняем имя!
						Если фл4.Существует() тогда 
							ИмяФайла2 = ИмяФайла;
						КонецЕсли; 
						//и на 5-ый раз уже не будет грузиться!
						
					КонецЕсли;
				КонецЕсли;	  
				
				Если ИмяФайла2 <> ИмяФайла тогда
					ПереместитьФайл(Путь+ИмяФайла, Путь+ИмяФайла2);
				КонецЕсли;	
				
				Кому=""; // НИЧЕГО не отправляем клиенту!  Задача № 54792
			КонецЕсли;
		КонецЕсли;
		//+++)
		
		Если элПочтаОтКого<>"" и Кому<>"" тогда 
			
			имяФайла2 = ИмяФайла; //имя ответа = имя файла!
			
			//+++( 23.10.2018 -----------образанное имя файла для обратного письма...-------------- 
			если Кому="zakupkaspb@exist.ru" тогда
				ii=найти(ИмяФайла,")");
				Если ii>0 тогда
					назв1 = "№ "+прав(ИмяФайла, стрДлина(ИмяФайла)-ii );
					jj = найти(ИмяФайла,"(отправлено "); // 11 симв.
					Если jj>0 и jj<ii тогда
						типФ = ?(прав(имяФайла,5)=".xlsx", ".xlsx", прав(имяФайла,4)); 
						
						ИмяФайла2 = назв1 + " от "+сред(ИмяФайла, jj+11, ii-(jj+11)-1 )+типФ;
						КопироватьФайл(Путь+ИмяФайла, Путь+ИмяФайла2); //файлы начинаются с №  ( Задача № 57413 )
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//+++)	
			
			ОтправитьОтветОбратно(Путь, ИмяФайла2, ЗаказСсылка, элПочтаОтКого, Кому); 
			
		КонецЕсли;
		
	КонецЦикла;
	
	возврат рез;
	
КонецФункции

//возвращает: табЗначОтвет с полями:
//НомерСтроки - число
//("Артикул");
//("Номенклатура"); //если найдём такую
//("Количество"); - число
//("Цена");        - число
//
//дополнительные поля:
//КоличествоОтказ, ПричинаОтказа 
//
функция СоздатьЗаказПоТабЗнач(табЗнач, Контр, ИмяФайла = "", ЗаказСсылка, ИсключитьИзАвтоОбъединения=Истина) экспорт
	
	табЗначОтвет = новый ТаблицаЗначений;
	табЗначОтвет = табЗнач.Скопировать(); //все колонки как есть...
	
	табЗначОтвет.Колонки.Добавить("КоличествоОтказ");
	табЗначОтвет.Колонки.Добавить("ПричинаОтказа");
	
	Для каждого стр1 из табЗначОтвет цикл
		стр1.КоличествоОтказ = 0;
		стр1.ПричинаОтказа = "";
	КонецЦикла;
	
	//+++( 17.05.2018 проверка на дубли и "Перенос количества ++++
		ТабБезДублей =  табЗнач.Скопировать();
		ТабБезДублей.Свернуть("Номенклатура", "Количество");
		ТабБезДублей.Колонки.Добавить("Кол0");
		Если ТабБезДублей.Количество()<табЗначОтвет.Количество() Тогда // Есть дубли! 
			Для каждого стр1 из ТабБезДублей Цикл
				
				Если НЕ ЗначениеЗаполнено(стр1.Номенклатура) тогда
					продолжить;
				КонецЕсли;	
					
				стр2 = табЗначОтвет.НайтиСтроки( новый Структура("Номенклатура", стр1.Номенклатура) );
				Если стр2.Количество()>1 Тогда
					
				//-------------причина передаётся в Задачу менеджеру и 
				  стр2[0].ПричинаОтказа = "Кол-во по Артикулу: "+стр1.Номенклатура.Артикул+" = "+строка(стр2[0].Количество)+" + "+строка(стр1.Количество - стр2[0].Количество);	
				  
				  стр1.Кол0 = стр2[0].Количество; //+++ 21.05.2018 количество 0 строки
				  
				  стр2[0].Количество = стр1.Количество; //ОБЩЕЕ КОЛИЧЕСТВО!
						
					для ii=1 по стр2.Количество()-1 цикл
					    стр2[ii].ПричинаОтказа = "ДУБЛЬ по Артикулу: "+стр1.Номенклатура.Артикул+" Кол-во "+строка(стр2[ii].Количество)+" - уже заказано выше.";
					    стр2[ii].Количество = -стр2[ii].Количество;	// отрицательное количество!!! 
					 	//кол-во = кол - отказ
					КонецЦикла;	
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	//+++)
	
    таблСоглЦен = новый ТаблицаЗначений;
	таблСоглЦен.Колонки.Добавить("НомерСтрокиОснования");
	таблСоглЦен.Колонки.Добавить("Номенклатура");
	таблСоглЦен.Колонки.Добавить("Количество");
	таблСоглЦен.Колонки.Добавить("Цена");
	таблСоглЦен.Колонки.Добавить("ЦенаМин");
	таблСоглЦен.Колонки.Добавить("ЦенаПоТипуЦен");
	
	//предварительный анализ ТЗ
	СписокНом   = новый СписокЗначений;
	
	для каждого стрТЗ из табЗначОтвет цикл
		Если стрТЗ.Номенклатура.Пустая() тогда
			стрТЗ.КоличествоОтказ = стрТЗ.Количество;
			стрТЗ.ПричинаОтказа   = "Не найден Товар по Артикулу!";
		ИначеЕсли стрТЗ.Количество<=0 и стрТЗ.ПричинаОтказа<>"" тогда //+++ 21.05.2018 - проверка дублей
			 продолжить;			
		ИначеЕсли стрТЗ.Количество<=0 и стрТЗ.ПричинаОтказа="" тогда   
			стрТЗ.КоличествоОтказ = стрТЗ.Количество;
			стрТЗ.ПричинаОтказа   = "Неверный формат поля Количество или Количество=0!";
		ИначеЕсли стрТЗ.Цена=0 тогда
			стрТЗ.КоличествоОтказ = стрТЗ.Количество;
			стрТЗ.ПричинаОтказа   = "Неверный формат поля Цена или Цена=0!";
		Иначе
			СписокНом.Добавить( стрТЗ.Номенклатура );
		КонецЕсли;	
	КонецЦикла;	
	
	//условие, что не надо делать заказ
	Если табЗначОтвет.Количество()=0 или  табЗначОтвет.Итог("Количество")=0 тогда
		#Если Клиент тогда
			Сообщить("Все товары из Excel-файла отказаны! Создавать заказ НЕ нужно!",СтатусСообщения.Внимание);
		#КонецЕсли	
    возврат табЗначОтвет;
	КонецЕсли;

	//создаём заказ на Ярославль, на Контр по осн.договору (с учётом вида товаров!)
	закОб = документы.ЗаказПокупателя.СоздатьДокумент();
	ЗаполнитьШапкуЗаказаПокупателя( закОб, Контр );
	
	ЗакОб.ИсключитьИзАвтоОбъединения = ИсключитьИзАвтоОбъединения; //+++ 19.06.2018 может быть и выключена!
	
	закОб.Комментарий = "E-mail: "+ИмяФайла;
	
	//табЗначОтвет - чего нет, что не нашли... и т.д.
	табЗначЦен    = ОбменСУТИнтернетМагазин.ПолучитьЦеныДляКонтрагента_РегСв(Контр, СписокНом); //из регистра сведений
	клиентРезерва = закОб.ДоговорКонтрагента.КонтрагентДляРезерваИМ; //доп.остаток!
	таблСвОстаток = получитьСвободныеОстаткиТоваров(СписокНом, клиентРезерва);
	
	флПредоплата = 	закОб.ДоговорКонтрагента.ТипДоговора = справочники.ТипыДоговоров.НайтиПоКоду("00001") 
				или закОб.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.ПредоплатаПоСчетам 
				или закОб.ДоговорКонтрагента.ТипДоговора = справочники.ТипыДоговоров.ФакторингПредоплата; 
				
	Для каждого стрТЗ из табЗначОтвет цикл
					
		Если стрТЗ.КоличествоОтказ=стрТЗ.Количество  // нет товара или ошибка распознавания... 
			или стрТЗ.Количество<=0 тогда //+++ 22.05.2018 дубли!
			продолжить;
		КонецЕсли;	
		
//----------------------------проверка св.остатка-------------------------------------------		
		стр2 = таблСвОстаток.найти(стрТЗ.Номенклатура,"Номенклатура");
		Если стр2=неопределено тогда 
			стрТЗ.КоличествоОтказ = стрТЗ.Количество;
			стрТЗ.ПричинаОтказа = "НЕТ Свободного остатка!"; 
		Иначе	 //--------------------------------------------------------
			если стрТЗ.Количество > стр2.СвободныйОстаток тогда
				стрТЗ.КоличествоОтказ = стрТЗ.Количество - стр2.СвободныйОстаток;
				стрТЗ.ПричинаОтказа = "Свободного остатка - недостаточно!"; 
				
				//+++ (25.05.2018 --- отказ комплекта
				Если (стрТЗ.Номенклатура.ВидТовара = Перечисления.ВидыТоваров.Диски
					или стрТЗ.Номенклатура.ВидТовара = Перечисления.ВидыТоваров.Шины) тогда
					
					Если стрТЗ.Количество=2 и стрТЗ.КоличествоОтказ=1 тогда 
						стрТЗ.КоличествоОтказ = 2;
						стрТЗ.ПричинаОтказа = "Нет в наличие 1шт. Отказан весь комплект!"; 
						
					ИначеЕсли стрТЗ.Количество%4=0 и стрТЗ.КоличествоОтказ%4<>0 тогда 
						колОтказаноКомлект = цел(стрТЗ.КоличествоОтказ/4)+1;
						ок = ?(колОтказаноКомлект=1, "", ?(колОтказаноКомлект<5,"а","ов") );  // 1 комплект, 2-4 комплекта, 5... комплектов
						
						стрТЗ.ПричинаОтказа = "Нет в наличие "+строка(стрТЗ.КоличествоОтказ)+"шт."
											+?(колОтказаноКомлект*4=стрТЗ.Количество," Отказан весь комплект!", 
						      					" Отказано "+строка(колОтказаноКомлект)+" комплект"+ок+" по 4 шт.!"); 
						стрТЗ.КоличествоОтказ = колОтказаноКомлект * 4;
				КонецЕсли;
					
				КонецЕсли;//комплектность шин/дисков
									
			конецЕсли;	
		КонецЕсли;
		
		Если стрТЗ.Количество - стрТЗ.КоличествоОтказ = 0 тогда
			продолжить;
		КонецЕсли;
		
		стр1 = закОб.Товары.Добавить();
		стр1.Номенклатура = стрТЗ.Номенклатура; 
		стр1.Количество   = стрТЗ.Количество - стрТЗ.КоличествоОтказ;
		стр1.Цена  		  = стрТЗ.Цена;
		
//--------------------проверка цен клиента-----------------------------------------------------
		стр2 = табЗначЦен.найти(стрТЗ.Номенклатура,"Номенклатура");
		Если стр2=неопределено тогда //НЕТ цены!
			стрТЗ.ПричинаОтказа = "Цена: "+строка(стр1.Цена)+", а текущая цены Клиента - не определена!";
		Иначе	
			ценаКлиента = ?(флПредоплата, стр2.ЦенаСоСкидкойПредоплаты, стр2.МинимальнаяЦена);
			если стр1.Цена < ценаКлиента тогда
				
				стрСогл = таблСоглЦен.Добавить(); //-----------------------таблица согласования!
				стрСогл.НомерСтрокиОснования = стр1.НомерСтроки;
				стрСогл.Номенклатура = стрТЗ.Номенклатура;
				стрСогл.Цена 		 = стрТЗ.Цена;
				стрСогл.Количество   = стр1.Количество; //кол - колОтказ
				стрСогл.ЦенаМин	     = ЦенаКлиента;
				стрСогл.ЦенаПоТипуЦен= стр2.ЦенаПоТипуЦен;
				
				ЗакОб.ПоставитьНаОтгрузку = ЛОЖЬ; // пока не согласуют цены - в отгрузку на автомате НЕЛЬЗЯ!
                ЗакОб.ИсключитьИзАвтоОбъединения = ИСТИНА; //+++ 22.05.2018 - объединять с другими заказами ТОЖЕ нельзя!
				
				стрТЗ.ПричинаОтказа = "Цена: "+строка(стр1.Цена)+" меньше текущей цены Клиента: "+строка(ценаКлиента)+"р. - Цена отправлена на Согласовании!";
				
				стр1.Статус = перечисления.СтатусыСтрокЗаказа.НаСогласовании;
				стр1.Цена   = ценаКлиента;
				
			КонецЕсли;	
		КонецЕсли;	
		
		ЗаполнитьДопПоляСтрокиТоваров(стр1);

    КонецЦикла; 
	
	//=============Запись заказа====================
	попытка
		Если таблСоглЦен.Количество()=0 тогда
			закОб.ПоставитьНаОтгрузку = Истина; // [v] На отгрузку (для автоВМаршрут!)
		КонецЕсли;
				
		закОб.Записать( РежимЗаписиДокумента.Проведение );
		
		СоздатьЗадачуНаСогласованиеЦенДляОтгрузки(таблСоглЦен, закОб, флПредоплата);
		
		ЗаказСсылка = закОб.Ссылка; //возвращаем назад!

	исключение
		#Если Клиент тогда
			сообщить("Заказ не может быть проведен! "+ОписаниеОшибки(), СтатусСообщения.Внимание);
		#КонецЕсли	
		
		для каждого стрТЗ из табЗначОтвет цикл
			Если стрТЗ.КоличествоОтказ<стрТЗ.Количество тогда	
			стрТЗ.КоличествоОтказ=стрТЗ.Количество;
			КонецЕсли;
		    стрТЗ.ПричинаОтказа = стрТЗ.ПричинаОтказа+" Ошибка: "+ОписаниеОшибки();
		КонецЦикла;		
	КонецПопытки;
	
//+++ 21.05.2018 -----------ДУБЛИ разбор обратно!-------------------
Если ТабБезДублей.Количество()<табЗначОтвет.Количество() Тогда // Есть дубли! 
	Для каждого стр1 из ТабБезДублей Цикл
		
		Если НЕ ЗначениеЗаполнено(стр1.Номенклатура) тогда
			продолжить;
		КонецЕсли;	
			
		стр2 = табЗначОтвет.НайтиСтроки( новый Структура("Номенклатура", стр1.Номенклатура) );
		Если стр2.Количество()>1 Тогда
           колЗак = стр2[0].Количество - стр2[0].КоличествоОтказ;
		   
	   	   стр2[0].Количество = стр1.Кол0;

		   Если колЗак>=стр1.Кол0 тогда
			   стр2[0].КоличествоОтказ = 0;
			   стр2[0].ПричинаОтказа = "Ок.";
		   	   КолЗак = КолЗак - стр1.Кол0;
	   	   Иначе
			   стр2[0].КоличествоОтказ = стр1.Кол0 - колЗак;
			   стр2[0].ПричинаОтказа = "Свободного остатка - недостаточно!";;
			   КолЗак = 0;
	   	   КонецЕсли;
		   
		   для ii=1 по стр2.Количество()-1 цикл
			   
			   Если стр2[ii].Количество<0 тогда //обратное преобразование!
			 	 Кол1 = -стр2[ii].Количество;
			   Иначе //быть такого не может!
				 Кол1 = стр2[ii].Количество;
			   КонецЕсли;
			   
			   стр2[ii].Количество = Кол1;
			 
			   Если колЗак >= Кол1 тогда
				   стр2[ii].КоличествоОтказ = 0;
				   стр2[ii].ПричинаОтказа = "Ок.";
			   	   КолЗак = КолЗак - Кол1;
			   Иначе
				   стр2[ii].КоличествоОтказ = кол1 - колЗак;
				   стр2[ii].ПричинаОтказа = "Свободного остатка - недостаточно!";;
				   КолЗак = 0;
		   	   КонецЕсли;
		   КонецЦикла;	   
			   
		КонецЕсли;
	
	КонецЦикла;	
КонецЕсли;	
	
	возврат табЗначОтвет;
	
КонецФункции

//ост на не запрещенных складах + ОТХ по клиентамОТХ  + резерв (по КлиентРезерв)
функция получитьСвободныеОстаткиТоваров(СписокНом, КлиентРезерва=неопределено, Storage = "00005")
	табл = новый ТаблицаЗначений;
	
	Если СписокНом.Количество()=0 Тогда
		возврат табл;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокНом", СписокНом);
	СписокКонтрагентовОТХ = Новый СписокЗначений;
	СписокКонтрагентовОТХ = яштПоставщики.ПолучитьСписокПоставщиков(Истина);
	Запрос.УстановитьПараметр("СписокКонтрагентовОТХ", СписокКонтрагентовОТХ);
	
	Подразделение = справочники.Подразделения.НайтиПоКоду(Storage);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	//++++++++++ ПРИ ИЗМЕНЕНИИ ЗАПРОСА - НУЖНО ДОБАВИТЬ  //ДопОстаткиРезера  +++++++++++++++++++++
		
	Если Storage = "00005" Тогда  //Головное
		Запрос.Текст = "ВЫБРАТЬ
       |	А.Номенклатура,
       |	А.КоличествоОстаток - ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) КАК СвободныйОстаток
       |ИЗ
       |	(ВЫБРАТЬ
       |		ВсеОстатки.Номенклатура КАК Номенклатура,
       |		СУММА(ВсеОстатки.КоличествоОстаток) КАК КоличествоОстаток
       |	ИЗ
       |		(ВЫБРАТЬ
       |			ост.Номенклатура КАК Номенклатура,
       |			ост.КоличествоОстаток КАК КоличествоОстаток
       |		ИЗ
       |			РегистрНакопления.ТоварыНаСкладах.Остатки(,
       |					Склад.ЗапретитьИспользование = ЛОЖЬ
       |						И Склад.Транзитный = ЛОЖЬ
       |						И Номенклатура В (&СписокНом)) КАК ост
       |		ГДЕ ост.КоличествоОстаток > 0
       |		
       |		ОБЪЕДИНИТЬ ВСЕ
       |		
       |		ВЫБРАТЬ
       |			отх.Номенклатура,
       |			отх.КоличествоОстаток
       |		ИЗ
       |			РегистрНакопления.ТоварыНаОтветственномХранении.Остатки(,
       |					Склад.ЗапретитьИспользование = ЛОЖЬ
       |						И Склад.Транзитный = ЛОЖЬ
       |						И Номенклатура В (&СписокНом)
       |						И Контрагент В (&СписокКонтрагентовОТХ)) КАК отх
       |		ГДЕ отх.КоличествоОстаток > 0
       |		
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
       |//ДопОстаткиРезера
	   |
	   | ) КАК ВсеОстатки
       |	
       |	СГРУППИРОВАТЬ ПО
       |		ВсеОстатки.Номенклатура) КАК А
	   
       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(,
       |				ЗаказПокупателя.Проверен
       |					И ЗаказПокупателя.Транзит = ЛОЖЬ
       |					И Номенклатура В (&СписокНом)) КАК ЗаказыПокупателейОстатки
       |		ПО А.Номенклатура = ЗаказыПокупателейОстатки.Номенклатура";
	   Если КлиентРезерва<>неопределено тогда
	     Запрос.УстановитьПараметр("КлиентРезерва", КлиентРезерва);
		запрос.Текст = СтрЗаменить(запрос.Текст, "//ДопОстаткиРезера","		ОБЪЕДИНИТЬ ВСЕ
		               |		
		               |		ВЫБРАТЬ
		               |			резерв.Номенклатура,
		               |			резерв.КоличествоОстаток
		               |		ИЗ
		               |			РегистрНакопления.РезервДляИМ.Остатки( ,
		               |					КонтрагентДляРезерваИМ = &КлиентРезерва
		               |						И Номенклатура В (&СписокНом)
		               |						И Подразделение = &Подразделение) КАК резерв
		               |		ГДЕ резерв.КоличествоОстаток > 0");
	   КонецЕсли;					   
					   
	Иначе //Обособленное --------------Транзит!--------------------------------------
		Запрос.Текст = "ВЫБРАТЬ
		|	А.Номенклатура,
		|	А.КоличествоОстаток - ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) КАК СвободныйОстаток
		|ИЗ
		|	(ВЫБРАТЬ
       |		ВсеОстатки.Номенклатура КАК Номенклатура,
       |		СУММА(ВсеОстатки.КоличествоОстаток) КАК КоличествоОстаток
       |	ИЗ
       |		(ВЫБРАТЬ
       |			ост.Номенклатура КАК Номенклатура,
       |			ост.КоличествоОстаток КАК КоличествоОстаток
       |		ИЗ
       |			РегистрНакопления.ТоварыНаСкладах.Остатки(,
       |					Склад.ЗапретитьИспользование = ЛОЖЬ
       |						И Склад.Транзитный = Истина
       |						И Склад.Подразделение = &Подразделение
       |						И Номенклатура В (&СписокНом)) КАК ост
       |		ГДЕ ост.КоличествоОстаток > 0
       |		
       |		ОБЪЕДИНИТЬ ВСЕ
       |		
       |		ВЫБРАТЬ
       |			отх.Номенклатура,
       |			отх.КоличествоОстаток
       |		ИЗ
       |			РегистрНакопления.ТоварыНаОтветственномХранении.Остатки(,
       |					Склад.ЗапретитьИспользование = ЛОЖЬ
       |						И Склад.Транзитный = Истина
       |						И Склад.Подразделение = &Подразделение
       |						И Номенклатура В (&СписокНом)
       |						И Контрагент В (&СписокКонтрагентовОТХ)) КАК отх
       |		ГДЕ отх.КоличествоОстаток > 0
       |
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
       |//ДопОстаткиРезера
	   |
	   | ) КАК ВсеОстатки
       |	
       |	СГРУППИРОВАТЬ ПО
       |		ВсеОстатки.Номенклатура) КАК А
	   
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(,
		|				ЗаказПокупателя.Проверен
		|					И ЗаказПокупателя.Транзит
		|					И Номенклатура В (&СписокНом)
		|					И ЗаказПокупателя.Подразделение = &Подразделение) КАК ЗаказыПокупателейОстатки
		|		ПО А.Номенклатура = ЗаказыПокупателейОстатки.Номенклатура";
		
   		Если КлиентРезерва<>неопределено тогда
	   Запрос.УстановитьПараметр("КлиентРезерва", КлиентРезерва);
		запрос.Текст = СтрЗаменить(запрос.Текст, "//ДопОстаткиРезера","		ОБЪЕДИНИТЬ ВСЕ
       |		
       |		ВЫБРАТЬ
       |			резерв.Номенклатура,
       |			резерв.КоличествоОстаток
       |		ИЗ
       |			РегистрНакопления.РезервДляИМ.Остатки( ,
       |					КонтрагентДляРезерваИМ = &КлиентРезерва
       |						И Номенклатура В (&СписокНом)
       |						И Подразделение = &Подразделение) КАК резерв
       |		ГДЕ резерв.КоличествоОстаток > 0");
   		КонецЕсли;
   
	КонецЕсли;
	
	таблСвОст = Запрос.Выполнить().Выгрузить();
	возврат таблСвОст;
	
КонецФункции

процедура ЗаполнитьШапкуЗаказаПокупателя( Заказ, Контрагент )
	
	Заказ.Дата = ТекущаяДата();
	Заказ.Организация   = Справочники.Организации.НайтиПоКоду("00001");
	Заказ.Подразделение = справочники.Подразделения.НайтиПоКоду("00005");  //всегда Ярославль!

	Заказ.Резерв = ЛОЖЬ;
	Заказ.Проверен = Истина;//сразу резервируем!
	Заказ.ДатаОтгрузки = Заказ.Дата ; // в тот же день!
	Заказ.ПоставитьНаОтгрузку = Контрагент.АвтоматическиСтавитьВМаршрут; //если [v] в карточке - надо и в заказе [v] На отгрузку!
	
	//Заказ.ИсключитьИзАвтоОбъединения = Истина;  // НЕ объединять с другими заказами Автоматически - никогда!
	
	Заказ.ВыписатьСпецификацию = Контрагент.ПечататьСпецификацию;
	Заказ.ПечататьСчетИзРеализации    = Контрагент.ПечатьСчетаИзРеализации; //+++ 07.05.2018 исправлено
	Заказ.СпособОтгрузки       		  = Контрагент.способОтгрузки;
	
	Заказ.Контрагент = Контрагент;
    Если ЗначениеЗаполнено(Контрагент.Грузополучатель) Тогда
		Заказ.Грузополучатель = Контрагент.Грузополучатель;
	КонецЕсли;
	Заказ.ДоговорКонтрагента = Контрагент.ОсновнойДоговорКонтрагента; //ОбменСУТИнтернетМагазин.найтиДоговорФакторингаПоОтветственному(Заказ);
	Заказ.ЧислоДнейСМоментаОтгрузки = Заказ.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности; 
	Заказ.ДатаОплаты = Заказ.ДатаОтгрузки + Заказ.ЧислоДнейСМоментаОтгрузки*86400;
	
	Заказ.Ответственный  = Заказ.ДоговорКонтрагента.ОтветственноеЛицо;
	
	Заказ.ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00006"); //Ручная
	Заказ.ВалютаДокумента = константы.ВалютаРегламентированногоУчета.Получить(); // Заказ.ДоговорКонтрагента.ВалютаВзаиморасчетов);  //РУБ.
	Заказ.КурсВзаиморасчетов = 1;
	Заказ.КратностьВзаиморасчетов = 1;
	
   //29.11.2016 - Экспортные рублевые Клиенты  - БЕЗ НДС
	Если  заказ.Контрагент.Экспорт
		и заказ.ДоговорКонтрагента.ВалютаВзаиморасчетов.Код="643"
		и Найти( нрег(заказ.ДоговорКонтрагента.Наименование) ,"экспорт")>0 
		и Найти( заказ.ДоговорКонтрагента.Наименование,"*" )=0 Тогда
		Заказ.СуммаВключаетНДС = ЛОЖЬ;
		Заказ.УчитыватьНДС 	   = ЛОЖЬ;
	Иначе	
		Заказ.СуммаВключаетНДС = Истина;
		Заказ.УчитыватьНДС 	   = Истина;
	КонецЕсли;
				
	Заказ.АвтоРезервирование = Истина;
	Заказ.ССайта = ложь;
	
	Заказ.НапомнитьОСобытии = Истина;
	Заказ.ВремяНапоминания  = ТекущаяДата();
	Заказ.ТипЗаказа = 16;
								
КонецПроцедуры

процедура ЗаполнитьДопПоляСтрокиТоваров(стр1)
	
	стр1.Коэффициент = 1;
	стр1.ЕдиницаИзмерения = стр1.Номенклатура.ЕдиницаХраненияОстатков;
	стр1.Вес = стр1.ЕдиницаИзмерения.Вес * стр1.Количество;
	
	стр1.Сумма = стр1.Цена * стр1.Количество;
	стр1.СтавкаНДС = СтавкаНДСнаДату(ТекущаяДата());
	ставка = ПолучитьСтавкуНДС( СтавкаНДСнаДату( ТекущаяДата() ) );
	стр1.СуммаНДС = Окр( стр1.Сумма *  ставка/(100 + ставка));
	
	стр1.КодТНВЭД = стр1.Номенклатура.КодТНВЭД;
	
КонецПроцедуры

процедура СоздатьЗадачуНаСогласованиеЦенДляОтгрузки(таблСогл, ЗаказОб, флПредоплата=ЛОЖЬ)
	
	Если таблСогл.Количество()=0 тогда
		Возврат;
	КонецЕсли;	
	
	Задача1 = задачи.ЗадачиПользователя.СоздатьЗадачу();
	Задача1.Инициатор   = ЗаказОб.Ответственный; //ответ после согласования...
	Задача1.Постановщик = ЗаказОб.Ответственный; // = Менеджеру по договору ВСЕГДА!
	
	 //+++ 04.05.2018 - меняется! 
	//Задача1.Исполнитель = справочники.Пользователи.НайтиПоКоду("Бондаренко Е.Д. (снабжение)");
	  Задача1.Исполнитель = ЗаказОб.Ответственный.НаправлениеПродаж.Руководитель;	
	
	Задача1.Наименование =  "Согласуйте Цены по @ Заказу покупателя: "+строка(ЗаказОб.Контрагент)
			+" по договору "+?(флПредоплата,"ПРЕДОПЛАТЫ","Отсрочки") +?(Найти(ЗаказОб.ДоговорКонтрагента.Наименование,"*")>0,"( со * )","");
	Задача1.Дата = ТекущаяДата();
	Задача1.СрокИсполнения = ЗаказОб.ДатаОтгрузки + 16*3600; // до 16-00
	Задача1.СрокОповещения = Задача1.Дата;
	Задача1.Оповещение = Истина;
	
	Задача1.НаСогласование = Истина;
	Задача1.Объект = ЗаказОб.ссылка;
	нн=1;
	Задача1.Описание = "
	|"+Задача1.Наименование+",
	|созданному на основании Excel-файла, полученному через эл.почту
	|от "+ЗаказОб.Комментарий+"
	|
	|";
	//---------------Результат согласования цен-------------------------
	//Задача1.РеквизитДляСогласования = "ПоставитьНаОтгрузку";
	//задача1.ЗначениеРеквизитаДляСогласования = Истина;
	
	для каждого стр1 из таблСогл цикл
		
		стр2 = Задача1.Товары.Добавить();
		ЗаполнитьЗначенияСвойств( стр2, стр1 );
		
		стр2.Сумма  = стр2.Количество * стр2.Цена;
		стр2.Статус = перечисления.СтатусыСтрокЗаказа.НаСогласовании;
		стр2.Скидка = ?(стр2.ЦенаПоТипуЦен>0, (стр2.Цена / стр2.ЦенаПоТипуЦен-1)*100, 0);
		стр2.СкидкаМин = ?(стр2.ЦенаПоТипуЦен>0, (стр2.ЦенаМин / стр2.ЦенаПоТипуЦен-1)*100, 0);
		
		строка1 = строка(стр1.НомерСтрокиОснования)+") "+стр1.Номенклатура.Код+" - "+строка(стр1.Номенклатура)
		+"  Цена: "+строка(стр2.Цена)+" меньше цены Клиента: "+строка(стр2.ЦенаМин)+"р. на "+строка(стр2.ЦенаМин - стр2.Цена)+" р.";
		
		Задача1.Описание = Задача1.Описание +строка1+символы.ПС;
		
	нн=нн+1;
	КонецЦикла;	
	
	попытка
		Задача1.Записать();
		#Если Клиент тогда
			Сообщить("Cоздана Задача на согласование "+строка(таблСогл.Количество())+" цен для на сотрудника: "+строка(Задача1.Исполнитель)+"!",СтатусСообщения.Информация); 
		#КонецЕсли	
	исключение
		#Если Клиент тогда
			Сообщить("Ошибка при создании задачи на согласование "+строка(таблСогл.Количество())+" цен!",СтатусСообщения.Внимание);
		#КонецЕсли	
	КонецПопытки;	
	
КонецПроцедуры

//сразу несколько действий по флагам: 
//1) создавать задачу менеджеру об ошибках
//2) писать в текст.лог на диск С:
//3) менять Excel-файлы
//
процедура СоздатьУведомлениеОбОшибке(ИмяФайлаПолное, стр1, табЗначОтвет, ЗаказСсылка) экспорт
	
	ЕстьОтказы = (табЗначОтвет.Итог("КоличествоОтказ")<>0); 
	флСоздаватьЗадачуМенеджеру = ЕстьОтказы; //только если ЕстьОшибки !
	
	флПисатьВлог = Истина;   //всегда
	ИмяЛОГ = "C:\лог_загрузкаФайловСПочты.txt";
	
	флПисатьВExcel    = Истина; //всегда
	ФлМенятьКоличество= Истина; // кол = кол0 - колОтказа
	ТекстОк = "Ok.";
	
//+++ 06.06.2018 - НЕ СОЗДАН ЗАКАЗ 
Если ЗаказСсылка.Пустая() тогда
	ЭтоКонфликтБлокировок=ЛОЖЬ;  // по причине Конфликта блокировок!?
	для каждого стр2 из табЗначОтвет цикл
		Если Найти(стр2.ПричинаОтказа,"Конфликт блокировок")>0 тогда
			ЭтоКонфликтБлокировок = Истина;
		КонецЕсли;
	КонецЦикла;
	//НИЧЕГО НЕ пишем и не создаём задачи 
	//файл переименовываем в ***(БЛОКИРОКА).xls
	Если ЭтоКонфликтБлокировок тогда 
		флПисатьВExcel = ЛОЖЬ; 
		флСоздаватьЗадачуМенеджеру = ЛОЖЬ;
	КонецЕсли;
КонецЕсли;
//+++)		

//1) --------------создаём задачу для Менеджера по Заказу ----------------------
Если флСоздаватьЗадачуМенеджеру тогда
	Задача1 = задачи.ЗадачиПользователя.СоздатьЗадачу();
	Задача1.Инициатор   = справочники.Пользователи.НайтиПоКоду("Робот (магазин)");
	мен = ?(ЗаказСсылка.Пустая(), стр1.Контрагент.ОсновнойМенеджерКонтрагента, ЗаказСсылка.ДоговорКонтрагента.ОтветственноеЛицо);
	Задача1.Постановщик = мен;
	Задача1.Исполнитель = мен;
	    
	Задача1.Наименование =  ?(ЕстьОтказы,"НЕ ПОЛНОСТЬЮ", "УСПЕШНО")+" Загружен файл Excel(@) в Заказ покупателя: "+строка(стр1.Контрагент);
	Задача1.Дата = ТекущаяДата();
	Задача1.СрокИсполнения = НачалоДня(ТекущаяДата())+ 16*3600; // до 16-00
	Задача1.СрокОповещения = ТекущаяДата();
	Задача1.Оповещение = Истина;
	
	Задача1.НаСогласование = ЛОЖЬ;
	Задача1.Объект = ЗаказСсылка;
	нн=1;
	Задача1.Описание = "
	|"+Задача1.Наименование+",
	//06.06.2018
	|из файла: "+ИмяФайлаПолное+"
	|
	|";
	нн=1;
	для каждого стр2 из табЗначОтвет цикл
		Если стр2.КоличествоОтказ=0 и стр2.ПричинаОтказа="" тогда
		ИначеЕсли стр2.ПричинаОтказа<>"Ок." тогда //06.06.2018
		Задача1.Описание = Задача1.Описание + "---"+строка(нн)+") арт.: "+стр2.Артикул+" ("+строка(стр2.Номенклатура)+") "+строка(стр2.Количество)+"шт. х "+строка(стр2.Цена)+"р."
		+" -> " + ?(стр2.КоличествоОтказ>0,"Отказано: "+строка(стр2.КоличествоОтказ)+" шт. ","")
			    + стр2.ПричинаОтказа+"
		|";
		КонецЕсли;
	нн=нн+1;
	КонецЦикла;
	
	попытка
		Задача1.Записать();
		#Если Клиент тогда
			сообщить(" Создана задача для "+строка(Задача1.Исполнитель), СтатусСообщения.Информация);
		#КонецЕсли	
	исключение
		#Если Клиент тогда
			сообщить(" Ошибка при записи задачи для "+строка(Задача1.Исполнитель)+" : "+ОписаниеОшибки(), СтатусСообщения.Внимание);
		#КонецЕсли	
	КонецПопытки;	
	
КонецЕсли;

//2)--------------- пишем ВСЁ в лог-файл ---------------------------------------
Если флПисатьВлог тогда
	попытка
		текстФайл = новый ТекстовыйДокумент;
		текстФайл.Прочитать(ИмяЛОГ,  КодировкаТекста.UTF8);
		
		текстФайл.ДобавитьСтроку("----- Загрузка: "+строка(ТекущаяДата())+" -----" );
		текстФайл.ДобавитьСтроку(ИмяФайлаПолное);
		текстФайл.ДобавитьСтроку(сокрЛП(ЗаказСсылка.Комментарий));
		Если флСоздаватьЗадачуМенеджеру тогда
			текстФайл.ДобавитьСтроку("+ Создана задача для менеджера: "+строка(мен)+" по Клиенту: "+строка(ЗаказСсылка.Контрагент) );
		Иначе
			текстФайл.ДобавитьСтроку("- НЕ Создана задача для менеджера: "+строка(мен)+" по Клиенту: "+строка(ЗаказСсылка.Контрагент) );
		КонецЕсли;	
		текстФайл.ДобавитьСтроку(">>> Создан заказ: "+строка(ЗаказСсылка));
		нн=1;
		для каждого стр2 из табЗначОтвет цикл
		текстФайл.ДобавитьСтроку( ?(стр2.КоличествоОтказ=0 и стр2.ПричинаОтказа="", " + ", "---")
		+строка(нн)+") арт.: "+стр2.Артикул+" ("+строка(стр2.Номенклатура)+") "+строка(стр2.Количество)+"шт. х "+строка(стр2.Цена)+"р. "
		+?(стр2.КоличествоОтказ<>0 или стр2.ПричинаОтказа<>"", "-> "
					+?(стр2.КоличествоОтказ<>0,"Отказано: "+строка(стр2.КоличествоОтказ)+" шт. ","")
						+стр2.ПричинаОтказа, "") 
							     );
		нн=нн+1;
		КонецЦикла;

		текстФайл.Записать(ИмяЛОГ,  КодировкаТекста.UTF8);
	исключение
		#Если Клиент тогда
			сообщить(" Ошибка при записи файла "+ИмяЛОГ+" : "+ОписаниеОшибки(), СтатусСообщения.Внимание);
		#КонецЕсли	
	КонецПопытки;	
КонецЕсли;	

//3)------------- пишем обратно в тот же файл Excel:----------------------------
Если флПисатьВExcel	тогда
	//- КоличествоОтказ и ПричинаОтказа в соответствующие столбцы стр1.КоличествоОтказ и стр1.ПричинаОтказа
НомерЛистаExcel = 1;	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайлаПолное);
		#Если Клиент тогда
			Состояние("Запись результата в файл Microsoft Excel...");
		#КонецЕсли	
		ExcelЛист = Excel.Sheets(НомерЛистаExcel);
	Исключение
		#Если Клиент тогда
		Сообщить("Ошибка. Невозможно открыть файл Excel:  "+ИмяФайлаПолное);
		#КонецЕсли	
		Возврат;
	КонецПопытки;
	
	i=0;
	для каждого стр2 из табЗначОтвет цикл
		Row = стр1.ПерваяСтрока + i;
		если ФлМенятьКоличество тогда
		ExcelЛист.Cells(Row,стр1.Количество).Value = строка( стр2.Количество - стр2.КоличествоОтказ ); //04.05.2018 сразу в количество!
		КонецЕсли;
		
		Если стр1.КоличествоОтказ>0 тогда //25.05.2018 - не пишем
			ExcelЛист.Cells(Row,стр1.КоличествоОтказ).Value = строка( стр2.КоличествоОтказ);
		КонецЕсли;
		Если стр1.ПричинаОтказа>0 тогда   //25.05.2018 - пишем ВСЁ Ok.
			
			//+++( 20.09.2018 - ошибку программы не надо писать клиенту! 
			//Задача № 54792 Ошибка: {ОбщийМодуль.яштЗаказыСПочты.Модуль(727)}:  Ошибка при вызове метода контекста (Записать): Не удалось провести: "Заказ покупателя"!
			Если Найти(стр2.ПричинаОтказа, "Не удалось провести:")>0 тогда    
				стр2.ПричинаОтказа = "Товар НЕ Заказан! Ошибка при создании Заказа!";
			КонецЕсли;
			//+++)
			
			ExcelЛист.Cells(Row,стр1.ПричинаОтказа).Value   = ?(стр2.ПричинаОтказа="", ТекстОк , стр2.ПричинаОтказа);
		КонецЕсли;
	i=i+1;	
	КонецЦикла;
	
	Попытка
		Excel.ActiveWorkbook.Save();
		#Если Клиент тогда
			Сообщить("Записаны причины отказа в файл: "+ИмяФайлаПолное, СтатусСообщения.Информация);
		#КонецЕсли
	исключение
		#Если Клиент тогда
			Сообщить("Ошибка записи файла: "+ИмяФайлаПолное+"
			|"+ОписаниеОшибки(), СтатусСообщения.Внимание);
		#КонецЕсли
	КонецПопытки;
	
	Excel.WorkBooks.Close();
	Excel = 0;
КонецЕсли;

КонецПроцедуры

//отправить Excel-файл назад
процедура ОтправитьОтветОбратно( Путь="", ИмяФайлаОтвета="", ЗаказПокупателя=неопределено, имяПочтЯщика="xls@yst.ru", Кому="<Отправитель>" ) 
	
	УЗ = справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(имяПочтЯщика);
	
	i= найти(ИмяФайлаОтвета,"Тема");  //  invoice@autodoc.ru Тема Заказ № 685 от АВТОДОК аксессуары (отправлено 11.05.2018 15-35-41) sklad685.xls
	j= найти(ИмяФайлаОтвета,"(");
	
	Если Кому="<Отправитель>" тогда
		АдресПочтыКлиента = лев(ИмяФайлаОтвета, i-2);  		//"invoice@autodoc.ru"
	Иначе	
		АдресПочтыКлиента = Кому;
	КонецЕсли;	
		
	Тема0 = сред(ИмяФайлаОтвета, i+4, j-2 - (i+4)+1 ); //"Заказ № 685 от АВТОДОК аксессуары"
   	Тема = "ОТЧЕТ : "+Тема0;
		
		ТекстСообщения = "
		|Автоматиский ответ по загрузке Заказа из Excel в базу Яршинторг:
		|
		|по Вашему письму: "+ИмяФайлаОтвета+"
		|
		|"+?(не ЗначениеЗаполнено(ЗаказПокупателя),"НИЧЕГО НЕТ или Заказа НЕ СОЗДАН! (подробнее см. файл)", 
		             "Создан Заказ покупателя № "+ЗаказПокупателя.Номер+" от "+строка(ЗаказПокупателя.Дата))+"
		|
		|В файле-ответе: 
		|В отдельном столбце - отражается Ok. или указана Причина отказа
		|Если есть причина отказа - Количество уже уменьшено.
		|
		|  Письмо создано автоматически. ОТВЕЧАТЬ на него НЕ НАДО!
		|
		|По всем вопросам - связывайтесь с менеджером: Иван Горелов 
		|		тел.: (4852) 200-200  доб. 232
		|";
		
		СписокФайловВложений = новый СписокЗначений;
		СписокФайловВложений.Добавить( Путь + ИмяФайлаОтвета);
		
		яштРезервыПоТоварам.ПослатьЭлектронноеПисьмо( АдресПочтыКлиента, СписокФайловВложений, УЗ, ТекстСообщения, Тема );
	
КонецПроцедуры	
