
 //ОСНОВНАЯ функция для регл.задания
 //загрузки файлов с почты, создание заказов покупателей и создание событий для Менеджера----------
процедура ЗагрузитьЗаказыСПочты() ЭКСПОРТ
рез = "";
имяПочтЯщика="support@yst.ru";
Путь="\\sigma\Общая папка\Файлы с почты\";	

ТаблНастроек = ПолучитьНастройкиЗагрузкиЗаказовИзExcel();

для каждого стр1 из ТаблНастроек цикл
	Если стр1.ОтправителиКлиента="" тогда 
		Продолжить;
	КонецЕсли;
путь1 = Путь  +стр1.КодКлиента+"\";	
стр1.списокФайлов = ПолучитьФайлыСПочты(имяПочтЯщика, путь1, стр1.ОтправителиКлиента ); 
рез1 = СоздатьЗаказыИзФайловExcel(стр1, путь1);
рез = рез + рез1;
КонецЦикла;

#Если Клиент тогда
	сообщить(рез);
#КонецЕсли
//рез - в лог файл! 
КонецПроцедуры

//+ 26.04.2018
//ОБЩАЯ ФУНКЦИЯ загрузки файлов с почты
//- загружает письма с почты: имяПочтЯщика 
//	за период [МинДатаОтправления - МаксДатаОтправления]
//	все вложения (application) - пишет в папку:  Путь (если пустая, то КаталогВременныхФайлов )
//  фильтр по строке ОтправителиПисьма, если "" тогда ото всех!
// УдалятьСообщенияССервера  - удалять письма посде загрузки или нет...
//
//возвращает: списокФайлов
//
функция ПолучитьФайлыСПочты(имяПочтЯщика="", Путь="", ОтправителиПисьма="", УдалятьСообщенияССервера = ЛОЖЬ, МинДатаОтправления=неопределено, МаксДатаОтправления=неопределено) 
	списокФайлов = Новый СписокЗначений;

	имяПочтЯщика = ?(имяПочтЯщика="", "1C@yst.ru", имяПочтЯщика);   // "no-reply@yst76.ru" / "1C@yst.ru";
	Путь=?(Путь="",  КаталогВременныхФайлов(), Путь);
	МинДатаОтправления = ?(МинДатаОтправления=неопределено, НачалоДня(ТекущаяДата()), МинДатаОтправления);
	МаксДатаОтправления =?(МаксДатаОтправления=неопределено, КонецДня(ТекущаяДата()), МаксДатаОтправления);
	
//путь =  Константы.ПутьКФайлам.получить()+"\НовЛайн\";
//текстФайлаСодержит = "Остатки на ";

//------- 1) подключаемся к учетной записи почты: НовЛайнЯщикДляПрайсов-------------
УЗ = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(имяПочтЯщика); 
	ИПП=Новый ИнтернетПочтовыйПрофиль;
	//----------для получения только POP3 ----------------
	ИПП.АдресСервераPOP3   = УЗ.POP3Сервер;
	ИПП.ПортPOP3           = УЗ.ПортPOP3;
	ИПП.Пользователь	   = УЗ.АдресЭлектроннойПочты;
	ИПП.Пароль			   = УЗ.Пароль;
	
	//+++ 22.09.2014 - так возможно...
	ИПП.АдресСервераIMAP = уз.POP3Сервер; 
	ИПП.ПортIMAP 		 = уз.ПортPOP3 ;
	ИПП.ПользовательIMAP = уз.Логин;
	ИПП.ПарольIMAP       = УЗ.Пароль;
	ИПП.ИспользоватьSSLIMAP = истина;
	
попытка
	Почта=Новый ИнтернетПочта;
	Почта.Подключиться(ИПП);
исключение
	#Если Клиент Тогда
		сообщить("Невозможно подключиться к почте: "+имяПочтЯщика+" : "+ОписаниеОшибки(), СтатусСообщения.Внимание);
	#КонецЕсли	
	Возврат списокФайлов;
КонецПопытки;

//---------- 2) перебираем все письма из папки Входящие и ищем только с вложениями-------------
	//для этой цели объект Почта имеет метод "Выбрать". 
	//У метода два параметра: 
	//1-ый отвечает за УдалятьСообщенияССервера
	//2-ой массив с заголовками писем... пустой
	//
// Почта.Выбрать(<УдалятьСообщения>, <МассивЗаголовковСообщенийИлиИдентификаторов>) 

попытка
	Сообщения = Почта.Выбрать(УдалятьСообщенияССервера); // тип: массив из типов: ИнтернетПочтовоеСообщение 
исключение
	Почта.Отключиться();
	#Если Клиент Тогда
		сообщить("Невозможно получить письма с почты: "+имяПочтЯщика+" : "+ОписаниеОшибки(), СтатусСообщения.Внимание);
	#КонецЕсли	
	Возврат списокФайлов;
КонецПопытки;

//----------------Главный Цикл-------------------------
//Далее после выборки сообщений необходимо перебрать их в Цикле и сохранить вложение, 
#Если Клиент Тогда
	сообщить(Строка(ТекущаяДата())+" Начало обработки "+строка(Сообщения.Количество())+" писем.", СтатусСообщения.Информация);
#КонецЕсли	

Для каждого Сообщение Из Сообщения Цикл
	
	//берем только сегодняшние письма!
	Если Сообщение.ДатаОтправления < МинДатаОтправления или Сообщение.ДатаОтправления>МаксДатаОтправления Тогда
	  Продолжить;
	КонецЕсли;	  

	Попытка
		ОтправительПисьма = Сообщение.Отправитель.Адрес;
	Исключение
		ОтправительПисьма = Сообщение.Отправитель;
	КонецПопытки;

	Если ОтправителиПисьма<>"" тогда
		Если Найти(ОтправителиПисьма, ОтправительПисьма)=0 тогда
			#Если Клиент Тогда
				Сообщить("Не найден отправитель: "+ ОтправительПисьма + " в списке:  "+ОтправителиПисьма, СтатусСообщения.Важное);
			#КонецЕсли	
		продолжить;
		КонецЕсли;
	КонецЕсли;	

//ИнтернетПочтовоеСообщение
темаПисьма = ОтправительПисьма+" Тема "+Сообщение.Тема +" (отправлено "+Сообщение.ДатаОтправления+") ";

// Перебираем вложения письма
	Влож = "";  i=0;
	Для каждого Вложение Из Сообщение.Вложения Цикл     // ИнтернетПочтовоеВложение
		Попытка //возможна ошибка при записи 
			Если Найти(Вложение.ТипСодержимого, "application/")>0 Тогда    
				//"application/vnd.ms-excel" (XLS)  или "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet" (XLSX)
			имя1 = темаПисьма+Вложение.ИмяФайла;
			
				файл1 = новый Файл(путь+имя1);
				если файл1.Существует() тогда
					#Если Клиент Тогда
					Сообщить("УЖЕ существует файл: "+имя1, СтатусСообщения.Внимание);
					#КонецЕсли	
				Иначе
					Вложение.Данные.Записать(путь+имя1);
					списокФайлов.Добавить( имя1 );  
					Влож=Влож+Вложение.ИмяФайла+", "; //Запоминаем имя вложения прикрепленных к данному письму
				КонецЕсли;
			    файл1 = неопределено;
				
		    КонецЕсли;
		
		Исключение
		  Почта.Отключиться();
		  #Если Клиент Тогда
			  сообщить(темаПисьма+" : "+ОписаниеОшибки(), СтатусСообщения.Внимание);
			  сообщить("Невозможно сохранить файл вложения: "+путь+Вложение.ИмяФайла, СтатусСообщения.Внимание);
		  #КонецЕсли	
		  Возврат списокФайлов;
	    КонецПопытки;
	  
	 i=i+1;
	КонецЦикла;	
	
	#Если Клиент Тогда
    сообщить(темаПисьма+" : "+Влож, СтатусСообщения.Информация);
	#КонецЕсли

КонецЦикла;	//по письмам

возврат списокФайлов;
КонецФункции

//+ из рег.св. НастройкаЗагрузкиЗаказовИзExcel + адреса отправителей из КонтактнаяИнформация
функция ПолучитьНастройкиЗагрузкиЗаказовИзExcel()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкаЗагрузкиЗаказовИзExcel.Контрагент.Код как КодКлиента,
				   |	НастройкаЗагрузкиЗаказовИзExcel.Контрагент,
	               |	НастройкаЗагрузкиЗаказовИзExcel.Артикул,
	               |	НастройкаЗагрузкиЗаказовИзExcel.Количество,
	               |	НастройкаЗагрузкиЗаказовИзExcel.Цена,
	               |	НастройкаЗагрузкиЗаказовИзExcel.ПерваяСтрока,
	               |	НастройкаЗагрузкиЗаказовИзExcel.Брэнд,
	               |	НастройкаЗагрузкиЗаказовИзExcel.Код,
	               |	НастройкаЗагрузкиЗаказовИзExcel.КоличествоОтказ,
	               |	НастройкаЗагрузкиЗаказовИзExcel.ПричинаОтказа,
	               |	КонтактнаяИнформация.Представление как ОтправителиКлиента
	               |ИЗ
	               |	РегистрСведений.НастройкаЗагрузкиЗаказовИзExcel КАК НастройкаЗагрузкиЗаказовИзExcel
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КИ.Объект КАК Контрагент,
	               |			КИ.Представление КАК Представление,
	               |			КИ.Комментарий КАК Комментарий
	               |		ИЗ
	               |			РегистрСведений.КонтактнаяИнформация КАК КИ
	               |		ГДЕ
	               |			ВЫРАЗИТЬ(КИ.Объект КАК Справочник.Контрагенты).Ссылка В
	               |					(ВЫБРАТЬ нн.Контрагент ИЗ РегистрСведений.НастройкаЗагрузкиЗаказовИзExcel КАК нн)
	               |			И КИ.Тип = &Тип
	               |			И КИ.Вид = &Вид) КАК КонтактнаяИнформация
	               |		ПО НастройкаЗагрузкиЗаказовИзExcel.Контрагент = КонтактнаяИнформация.Контрагент";
	Запрос.УстановитьПараметр("Тип", перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);				   
	Запрос.УстановитьПараметр("Вид", справочники.ВидыКонтактнойИнформации.НайтиПоКоду("39245")  ); //E-mail отправителей для загрузки заказов через @				   
		Результат = Запрос.Выполнить();
		табл = результат.Выгрузить();
	для каждого стр1 из табл цикл
		стр1.КодКлиента = сокрЛП(стр1.КодКлиента);
		стр1.ОтправителиКлиента = СокрЛП(стр1.ОтправителиКлиента);
		стр1.ОтправителиКлиента = стрЗаменить(стр1.ОтправителиКлиента," ","");
		стр1.ОтправителиКлиента = стрЗаменить(стр1.ОтправителиКлиента,",",";");
	КонецЦикла;

	возврат табл;
КонецФункции	

//+ возвращает табл.знач
функция РазобратьExcelФайлВТабЗнач(ИмяФайла, стр1)
	
	НомерЛистаExcel = 1;
	xlLastCell = 11;
	
	табЗнач = новый ТаблицаЗначений;
	табЗнач.Колонки.Добавить("НомерСтроки");
	табЗнач.Колонки.Добавить("Артикул");
	табЗнач.Колонки.Добавить("Номенклатура"); //если найдём такую
	табЗнач.Колонки.Добавить("Количество");
	табЗнач.Колонки.Добавить("Цена");
	
	//разбор Excel-файла: ИмяФайла  по полям  стр1
	//НомерСтроки  = от стр1.ПерваяСтрока до конца...
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		#Если Клиент тогда
			Состояние("Обработка файла Microsoft Excel...");
		#КонецЕсли	
		ExcelЛист = Excel.Sheets(НомерЛистаExcel);
	Исключение
		#Если Клиент тогда
		Сообщить("Ошибка. Возможно неверно указан номер листа книги Excel.");
		#КонецЕсли	
		Возврат табЗнач;
	КонецПопытки;
	
	ActiveCell = Excel.ActiveCell.SpecialCells(xlLastCell);
	RowCount = ActiveCell.Row;
	//ColumnCount = ActiveCell.Column;
	ПустаяНом = справочники.Номенклатура.ПустаяСсылка();
	нн=1; 
	Для Row = стр1.ПерваяСтрока По RowCount Цикл
		
		СтрТЗ = табЗнач.Добавить(); //всегда!
		 СтрТЗ.НомерСтроки = нн;
		 СтрТЗ.Артикул     = "";
		 СтрТЗ.Количество  = 0;
		 СтрТЗ.Цена	       = 0;
		 СтрТЗ.Номенклатура = ПустаяНом;
		 
		Попытка
		 СтрТЗ.Артикул   =  СокрЛП(ExcelЛист.Cells(Row,стр1.Артикул).Text);
		 
		 кол1 =   СокрЛП(ExcelЛист.Cells(Row,стр1.Количество).Text);
		 	кол1 = стрЗаменить(кол1,",","."); кол1 = стрЗаменить(кол1," ",""); кол1 = стрЗаменить(кол1,символ(160) ,"");
		  	СтрТЗ.Количество = число(кол1);
		  
		 Цена1=   СокрЛП(ExcelЛист.Cells(Row,стр1.Цена).Текст);
		 	Цена1= стрЗаменить(Цена1,",","."); Цена1= стрЗаменить(Цена1," ",""); Цена1= стрЗаменить(Цена1,символ(160) ,"");
		  	СтрТЗ.Цена = число(Цена1);
		  
		 Брэнд1 =  ?(стр1.Брэнд>0, СокрЛП(ExcelЛист.Cells(Row,стр1.Брэнд).Text), "");
		 Код1   =  ?(стр1.Код>0, СокрЛП(ExcelЛист.Cells(Row,стр1.Код).Text), "");
		 СтрТЗ.Номенклатура = НайтиТовар(СтрТЗ.Артикул, Брэнд1, Код1);
		 
	 	Исключение
			#Если Клиент тогда
				Сообщить(строка(нн)+") Артикул: "+СтрТЗ.Артикул+" Кол-во: "+кол1+" шт. Цена: "+Цена1+"р. Ошибка: "+ОписаниеОшибки(), СтатусСообщения.Внимание );
			#КонецЕсли	
		КонецПопытки; 
		
	нн=нн+1;	
	КонецЦикла;
	
	Excel.WorkBooks.Close();
	Excel = 0;
	
	возврат табЗнач;
КонецФункции	

// приоритет поиска:
// 1) по Коду, если он есть
// 2) по Артикулу и Брэнду
// 3) по Артикулу
Функция НайтиТовар(Артикул="", Брэнд="", Код="")	
	тов1 = справочники.Номенклатура.ПустаяСсылка();
	Если Артикул="" тогда
		возврат тов1;
	КонецЕсли;	
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ 
	 |	спрНоменклатура.Ссылка  
	 |ИЗ
	 |	Справочник.Номенклатура КАК спрНоменклатура
	 |ГДЕ
	 |	спрНоменклатура.Артикул = &Артикул
	 |//НайтиПоБрэнду	И спрНоменклатура.Производитель.Наименование =&Брэнд";
	 
	 Если Код<>"" тогда //по коду точнее
	 	Запрос.Текст = стрЗаменить(запрос.Текст,"Артикул = &Артикул","Код = &Код");
	 	Запрос.УстановитьПараметр("Код",Код);
	 иначе
	 	Запрос.УстановитьПараметр("Артикул",Артикул);
 	 КонецЕсли;
 
	 Если Брэнд<>"" тогда
		Запрос.Текст = стрЗаменить(запрос.Текст,"//НайтиПоБрэнду","");
	 	Запрос.УстановитьПараметр("Брэнд",Брэнд);
	 КонецЕсли;	
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 Если выборка.Следующий() тогда
		Если Выборка.Количество()>1 тогда
			#Если Клиент тогда
			сообщить("Найдено "+строка(Выборка.Количество())+" товаров по артикулу: "+Артикул, СтатусСообщения.Внимание);
			#КонецЕсли	
		Иначе
		 	тов1 = выборка.Ссылка;
        КонецЕсли;	
	 Иначе
	 	#Если Клиент тогда
		сообщить("НЕ Найдено ни одного товара по Артикулу: "+Артикул, СтатусСообщения.Внимание);
		#КонецЕсли	
	 КонецЕсли;
	
 возврат тов1;
КонецФункции

//Функция разбора Excel файлов и создание заказа покупателя,
 //стр1 =  списокФайлов,
// для: КодКлиента, Контрагент,
 //из столбцов Excel: Артикул, Количество, Цена, ПерваяСтрока,
 //доп.поля: Брэнд, Код,
//--------------------
 //поля возврата при ошибке: КоличествоОтказ, ПричинаОтказа,
 //---------------------------------
 //связка:	ОтправителиКлиента
 //===============================================
//возвращает количество созданных Заказов
функция СоздатьЗаказыИзФайловExcel(стр1, Путь="")
	рез = "";
	для i=0 по стр1.списокФайлов.Количество()-1 цикл
		  ИмяФайла = стр1.списокФайлов[i].Значение;
		  табЗнач = РазобратьExcelФайлВТабЗнач(Путь + ИмяФайла, стр1);
		  табЗначОтвет = СоздатьЗаказПоТабЗнач(табЗнач, стр1.Контрагент, ИмяФайла );
		  рез = табЗначОтвет.Итог("КоличествоОтказ");
		  Если рез <> 0 тогда
			  СоздатьУведомлениеОбОшибке(ИмяФайла, стр1, табЗначОтвет);
		  КонецЕсли;	  
	КонецЦикла;
	возврат рез;
КонецФункции

//возвращает: табЗначОтвет с полями:
//НомерСтроки - число
//("Артикул");
//("Номенклатура"); //если найдём такую
//("Количество"); - число
//("Цена");        - число
//
//дополнительные поля:
//КоличествоОтказ, ПричинаОтказа 
//
функция СоздатьЗаказПоТабЗнач(табЗнач, Контр, ИмяФайла = "")
	табЗначОтвет = новый ТаблицаЗначений;
	табЗначОтвет = табЗнач.Скопировать(); //все колонки как есть...
	табЗначОтвет.Колонки.Добавить("КоличествоОтказ");
	табЗначОтвет.Колонки.Добавить("ПричинаОтказа");
	
    таблСоглЦен = новый ТаблицаЗначений;
	таблСоглЦен.Колонки.Добавить("НомерСтрокиОснования");
	таблСоглЦен.Колонки.Добавить("Номенклатура");
	таблСоглЦен.Колонки.Добавить("Цена");
	таблСоглЦен.Колонки.Добавить("ЦенаМин");
	таблСоглЦен.Колонки.Добавить("ЦенаПоТипуЦен");
	
	//предварительный анализ ТЗ
	СписокНом   = новый СписокЗначений;
	
	для каждого стрТЗ из табЗначОтвет цикл
		Если стрТЗ.Количество=0 тогда
			стрТЗ.КоличествоОтказ = 99;
			стрТЗ.ПричинаОтказа   = "Неверный формат поля Количество или Количество=0!";
		ИначеЕсли стрТЗ.Номенклатура.Пустая() тогда
			стрТЗ.КоличествоОтказ = стрТЗ.Количество;
			стрТЗ.ПричинаОтказа   = "Не найден Товар по Артикулу!";
		ИначеЕсли стрТЗ.Цена=0 тогда
			стрТЗ.КоличествоОтказ = стрТЗ.Количество;
			стрТЗ.ПричинаОтказа   = "Неверный формат поля Цена или Цена=0!";
		иначе
			стрТЗ.КоличествоОтказ = 0;
			стрТЗ.ПричинаОтказа   = "";
			СписокНом.Добавить( стрТЗ.Номенклатура );
		КонецЕсли;	
	КонецЦикла;	
	
	//условие, что не надо делать заказ
	Если табЗначОтвет.Количество()=0 
		или  табЗначОтвет.Итог("Количество")=0
		или  табЗначОтвет.Итог("КоличествоОтказ")>=табЗначОтвет.Итог("Количество") тогда
		#Если Клиент тогда
			Сообщить("Все товары из Excel-файла отказаны! Создавать заказ НЕ нужно!",СтатусСообщения.Внимание);
		#КонецЕсли	
    возврат табЗначОтвет;
	КонецЕсли;

	//создаём заказ на Ярославль, на Контр по осн.договору (с учётом вида товаров!)
	закОб = документы.ЗаказПокупателя.СоздатьДокумент();
	ЗаполнитьШапкуЗаказаПокупателя( закОб, Контр );
	
	закОб.Комментарий = "E-mail: "+ИмяФайла;
	
	//табЗначОтвет - чего нет, что не нашли... и т.д.
	табЗначЦен    = ОбменСУТИнтернетМагазин.ПолучитьЦеныДляКонтрагента_РегСв(Контр, СписокНом); //из регистра сведений
	клиентРезерва = закОб.ДоговорКонтрагента.КонтрагентДляРезерваИМ; //доп.остаток!
	таблСвОстаток = получитьСвободныеОстаткиТоваров(СписокНом, клиентРезерва);
	
	флПредоплата = 	закОб.ДоговорКонтрагента.ТипДоговора = справочники.ТипыДоговоров.НайтиПоКоду("00001") 
				или закОб.ДоговорКонтрагента.ТипДоговора = Справочники.ТипыДоговоров.ПредоплатаПоСчетам 
				или закОб.ДоговорКонтрагента.ТипДоговора = справочники.ТипыДоговоров.ФакторингПредоплата; 
				
	Для каждого стрТЗ из табЗначОтвет цикл
					
		Если стрТЗ.КоличествоОтказ>0 тогда
			продолжить;
		КонецЕсли;	
		
//----------------------------проверка св.остатка-------------------------------------------		
		стр2 = таблСвОстаток.найти(стрТЗ.Номенклатура,"Номенклатура");
		Если стр2<>неопределено тогда 
			если стрТЗ.Количество > стр2.СвободныйОстаток тогда
				если стрТЗ.Количество<4 тогда
					стрТЗ.КоличествоОтказ = стрТЗ.Количество - стр2.СвободныйОстаток;
				иначе //кратно 4
					стр2СвободныйОстаток4 = цел(стр2.СвободныйОстаток/4)*4;
					стрТЗ.КоличествоОтказ = стрТЗ.Количество - стр2СвободныйОстаток4;
				КонецЕсли;	
				стрТЗ.ПричинаОтказа = "Свободного остатка товара - не достаточно!"; 
			конецЕсли;	
		КонецЕсли;
		
		Если стрТЗ.Количество - стрТЗ.КоличествоОтказ = 0 тогда
			продолжить;
		КонецЕсли;
		
		стр1 = закОб.Товары.Добавить();
		стр1.Номенклатура = стрТЗ.Номенклатура; 
		стр1.Количество   = стрТЗ.Количество - стрТЗ.КоличествоОтказ;
		стр1.Цена  		  = стрТЗ.Цена;
		
//--------------------проверка цен клиента-----------------------------------------------------
		стр2 = табЗначЦен.найти(стрТЗ.Номенклатура,"Номенклатура");
		Если стр2<>неопределено тогда 
			ценаКлиента = ?(флПредоплата, стр2.ЦенаСоСкидкойПредоплаты, стр2.МинимальнаяЦена);
			если стр1.Цена < ценаКлиента тогда
				
				стрСогл = таблСоглЦен.Добавить(); //-----------------------таблица согласования!
				стрСогл.НомерСтрокиОснования = стр1.НомерСтроки;
				стрСогл.Номенклатура = стрТЗ.Номенклатура;
				стрСогл.Цена 		 = стрТЗ.Цена;
				стрСогл.ЦенаМин	     = ЦенаКлиента;
				стрСогл.ЦенаПоТипуЦен= стр2.ЦенаПоТипуЦен;
				
				ЗакОб.ПоставитьНаОтгрузку = ЛОЖЬ; // пока не согласуют - в отгрузку на автомате
                ЗакОб.ИсключитьИзАвтоОбъединения = Истина; // объединять с другими заказами ТОЖЕ нельзя!
				
				стрТЗ.ПричинаОтказа = "Цена: "+строка(стр1.Цена)+" меньше текущей цены Клиента: "+строка(ценаКлиента)+"р. - Цена отправлена на Согласовании!";
				
				стр1.Статус = перечисления.СтатусыСтрокЗаказа.НаСогласовании;
				стр1.Цена   = ценаКлиента;
				
			КонецЕсли;	
		КонецЕсли;	
		
		ЗаполнитьДопПоляСтрокиТоваров(стр1);

    КонецЦикла; 
	
	//=============Запись заказа====================
	попытка
		закОб.Записать( РежимЗаписиДокумента.Проведение);
		
		СоздатьЗадачуНаСогласованиеЦенДляОтгрузки(таблСоглЦен, закОб, флПредоплата);
		
	исключение
		#Если Клиент тогда
			сообщить("Заказ не может быть проведен! "+ОписаниеОшибки(), СтатусСообщения.Внимание);
		#КонецЕсли	
		
		для каждого стрТЗ из табЗначОтвет цикл
			Если стрТЗ.КоличествоОтказ<стрТЗ.Количество тогда	
			стрТЗ.КоличествоОтказ=стрТЗ.Количество;
			КонецЕсли;
		    стрТЗ.ПричинаОтказа = стрТЗ.ПричинаОтказа+" Ошибка проведения Заказа!";
		КонецЦикла;		
	КонецПопытки;
	
	возврат табЗначОтвет;
	
КонецФункции

//ост на не запрещенных складах + ОТХ по клиентамОТХ  + резерв (по КлиентРезерв)
функция получитьСвободныеОстаткиТоваров(СписокНом, КлиентРезерва=неопределено, Storage = "00005")
	табл = новый ТаблицаЗначений;
	
	Если СписокНом.Количество()=0 Тогда
		возврат табл;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокНом", СписокНом);
	СписокКонтрагентовОТХ = Новый СписокЗначений;
	СписокКонтрагентовОТХ = яштПоставщики.ПолучитьСписокПоставщиков(Истина);
	Запрос.УстановитьПараметр("СписокКонтрагентовОТХ", СписокКонтрагентовОТХ);
	
	Подразделение = справочники.Подразделения.НайтиПоКоду(Storage);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	//++++++++++ ПРИ ИЗМЕНЕНИИ ЗАПРОСА - НУЖНО ДОБАВИТЬ  //ДопОстаткиРезера  +++++++++++++++++++++
		
	Если Storage = "00005" Тогда  //Головное
		Запрос.Текст = "ВЫБРАТЬ
       |	А.Номенклатура,
       |	А.КоличествоОстаток - ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) КАК СвободныйОстаток
       |ИЗ
       |	(ВЫБРАТЬ
       |		ВсеОстатки.Номенклатура КАК Номенклатура,
       |		СУММА(ВсеОстатки.КоличествоОстаток) КАК КоличествоОстаток
       |	ИЗ
       |		(ВЫБРАТЬ
       |			ост.Номенклатура КАК Номенклатура,
       |			ост.КоличествоОстаток КАК КоличествоОстаток
       |		ИЗ
       |			РегистрНакопления.ТоварыНаСкладах.Остатки(,
       |					Склад.ЗапретитьИспользование = ЛОЖЬ
       |						И Склад.Транзитный = ЛОЖЬ
       |						И Номенклатура В (&СписокНом)) КАК ост
       |		ГДЕ ост.КоличествоОстаток > 0
       |		
       |		ОБЪЕДИНИТЬ ВСЕ
       |		
       |		ВЫБРАТЬ
       |			отх.Номенклатура,
       |			отх.КоличествоОстаток
       |		ИЗ
       |			РегистрНакопления.ТоварыНаОтветственномХранении.Остатки(,
       |					Склад.ЗапретитьИспользование = ЛОЖЬ
       |						И Склад.Транзитный = ЛОЖЬ
       |						И Номенклатура В (&СписокНом)
       |						И Контрагент В (&СписокКонтрагентовОТХ)) КАК отх
       |		ГДЕ отх.КоличествоОстаток > 0
       |		
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
       |//ДопОстаткиРезера
	   |
	   | ) КАК ВсеОстатки
       |	
       |	СГРУППИРОВАТЬ ПО
       |		ВсеОстатки.Номенклатура) КАК А
	   
       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(,
       |				ЗаказПокупателя.Проверен
       |					И ЗаказПокупателя.Транзит = ЛОЖЬ
       |					И Номенклатура В (&СписокНом)) КАК ЗаказыПокупателейОстатки
       |		ПО А.Номенклатура = ЗаказыПокупателейОстатки.Номенклатура";
	   Если КлиентРезерва<>неопределено тогда
		запрос.Текст = СтрЗаменить(запрос.Текст, "//ДопОстаткиРезера","		ОБЪЕДИНИТЬ ВСЕ
		               |		
		               |		ВЫБРАТЬ
		               |			резерв.Номенклатура,
		               |			резерв.КоличествоОстаток
		               |		ИЗ
		               |			РегистрНакопления.РезервДляИМ.Остатки( ,
		               |					КонтрагентДляРезерваИМ = &КлиентРезерва
		               |						И Номенклатура В (&СписокНом)
		               |						И Подразделение = &Подразделение) КАК резерв
		               |		ГДЕ резерв.КоличествоОстаток > 0");
	   КонецЕсли;					   
					   
	Иначе //Обособленное --------------Транзит!--------------------------------------
		Запрос.Текст = "ВЫБРАТЬ
		|	А.Номенклатура,
		|	А.КоличествоОстаток - ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) КАК СвободныйОстаток
		|ИЗ
		|	(ВЫБРАТЬ
       |		ВсеОстатки.Номенклатура КАК Номенклатура,
       |		СУММА(ВсеОстатки.КоличествоОстаток) КАК КоличествоОстаток
       |	ИЗ
       |		(ВЫБРАТЬ
       |			ост.Номенклатура КАК Номенклатура,
       |			ост.КоличествоОстаток КАК КоличествоОстаток
       |		ИЗ
       |			РегистрНакопления.ТоварыНаСкладах.Остатки(,
       |					Склад.ЗапретитьИспользование = ЛОЖЬ
       |						И Склад.Транзитный = Истина
       |						И Склад.Подразделение = &Подразделение
       |						И Номенклатура В (&СписокНом)) КАК ост
       |		ГДЕ ост.КоличествоОстаток > 0
       |		
       |		ОБЪЕДИНИТЬ ВСЕ
       |		
       |		ВЫБРАТЬ
       |			отх.Номенклатура,
       |			отх.КоличествоОстаток
       |		ИЗ
       |			РегистрНакопления.ТоварыНаОтветственномХранении.Остатки(,
       |					Склад.ЗапретитьИспользование = ЛОЖЬ
       |						И Склад.Транзитный = Истина
       |						И Склад.Подразделение = &Подразделение
       |						И Номенклатура В (&СписокНом)
       |						И Контрагент В (&СписокКонтрагентовОТХ)) КАК отх
       |		ГДЕ отх.КоличествоОстаток > 0
       |
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
       |//ДопОстаткиРезера
	   |
	   | ) КАК ВсеОстатки
       |	
       |	СГРУППИРОВАТЬ ПО
       |		ВсеОстатки.Номенклатура) КАК А
	   
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(,
		|				ЗаказПокупателя.Проверен
		|					И ЗаказПокупателя.Транзит
		|					И Номенклатура В (&СписокНом)
		|					И ЗаказПокупателя.Подразделение = &Подразделение) КАК ЗаказыПокупателейОстатки
		|		ПО А.Номенклатура = ЗаказыПокупателейОстатки.Номенклатура";
		
   		Если КлиентРезерва<>неопределено тогда
		запрос.Текст = СтрЗаменить(запрос.Текст, "//ДопОстаткиРезера","		ОБЪЕДИНИТЬ ВСЕ
       |		
       |		ВЫБРАТЬ
       |			резерв.Номенклатура,
       |			резерв.КоличествоОстаток
       |		ИЗ
       |			РегистрНакопления.РезервДляИМ.Остатки( ,
       |					КонтрагентДляРезерваИМ = &КлиентРезерва
       |						И Номенклатура В (&СписокНом)
       |						И Подразделение = &Подразделение) КАК резерв
       |		ГДЕ резерв.КоличествоОстаток > 0");
   		КонецЕсли;
   
	КонецЕсли;
	
	табл = Запрос.Выполнить().Выгрузить();
	возврат табл;
	
КонецФункции

процедура ЗаполнитьШапкуЗаказаПокупателя( Заказ, Контрагент )
	Заказ.Дата = ТекущаяДата();
	Заказ.Резерв = ЛОЖЬ;
	Заказ.ДатаОтгрузки = Заказ.Дата ; // в тот же день!
	Заказ.ПоставитьНаОтгрузку = Истина;
	
	Заказ.Проверен = Истина;//сразу резервируем!
	
	Заказ.Организация = Справочники.Организации.НайтиПоКоду("00001");
	Заказ.Подразделение = справочники.Подразделения.НайтиПоКоду("00005");  //всегда Ярославль!

	Заказ.Контрагент = Контрагент;
    Если ЗначениеЗаполнено(Контрагент.Грузополучатель) Тогда
		Заказ.Грузополучатель = Контрагент.Грузополучатель;
	КонецЕсли;
	Заказ.ДоговорКонтрагента = Контрагент.ОсновнойДоговорКонтрагента; //ОбменСУТИнтернетМагазин.найтиДоговорФакторингаПоОтветственному(Заказ);
	Заказ.ЧислоДнейСМоментаОтгрузки = Заказ.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности; 
	Заказ.ДатаОплаты = Заказ.ДатаОтгрузки + Заказ.ЧислоДнейСМоментаОтгрузки*86400;
	
	Заказ.Ответственный  = Заказ.ДоговорКонтрагента.ОтветственноеЛицо;
	
	Заказ.ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00006"); //Ручная
	Заказ.ВалютаДокумента = Заказ.ДоговорКонтрагента.ВалютаВзаиморасчетов;  //РУБ.
	Заказ.КурсВзаиморасчетов = 1;
	Заказ.КратностьВзаиморасчетов = 1;
	
   //29.11.2016 - Экспортные рублевые Клиенты  - БЕЗ НДС
	Если  заказ.Контрагент.Экспорт
		и заказ.ДоговорКонтрагента.ВалютаВзаиморасчетов.Код="643"
		и Найти( нрег(заказ.ДоговорКонтрагента.Наименование) ,"экспорт")>0 
		и Найти( заказ.ДоговорКонтрагента.Наименование,"*" )=0 Тогда
		Заказ.СуммаВключаетНДС = ЛОЖЬ;
		Заказ.УчитыватьНДС 	   = ЛОЖЬ;
	Иначе	
		Заказ.СуммаВключаетНДС = Истина;
		Заказ.УчитыватьНДС 	   = Истина;
	КонецЕсли;
				
	Заказ.АвтоРезервирование = Истина;
	Заказ.ССайта = ложь;
	
	Заказ.НапомнитьОСобытии = Истина;
	Заказ.ВремяНапоминания  = ТекущаяДата();
	Заказ.ТипЗаказа = 16;
								
КонецПроцедуры

процедура ЗаполнитьДопПоляСтрокиТоваров(стр1)
	
	стр1.Коэффициент = 1;
	стр1.ЕдиницаИзмерения = стр1.Номенклатура.ЕдиницаХраненияОстатов;
	стр1.Вес = стр1.ЕдиницаИзмерения.Вес * стр1.Количество;
	
	стр1.Сумма = стр1.Цена * стр1.Количество;
	стр1.СтавкаНДС = перечисления.СтавкиНДС.НДС18;
	стр1.СуммаНДС = Окр(стр1.Сумма *18/118);
	
	стр1.КодТНВЭД = стр1.Номенклатура.КодТНВЭД;
	
КонецПроцедуры

процедура СоздатьЗадачуНаСогласованиеЦенДляОтгрузки(таблСогл, ЗаказОб, флПредоплата=ЛОЖЬ)
	
	Задача1 = задачи.ЗадачиПользователя.СоздатьЗадачу();
	Задача1.Инициатор   = справочники.Пользователи.НайтиПоКоду("Робот (магазин)");
	Задача1.Постановщик = ЗаказОб.Ответственный;
	//Задача1.Исполнитель = Заказ.Ответственный.НаправлениеПродаж.Руководитель;
	Задача1.Исполнитель = справочники.Пользователи.НайтиПоКоду("Бондаренко Е.Д. (снабжение)");
	
	Задача1.Наименование =  "Согласуйте Цены по @ Заказу покупателя: "+строка(ЗаказОб.Контрагент)
			+" по договору "+?(флПредоплата,"ПРЕДОПЛАТЫ","Отсрочки") +?(Найти(ЗаказОб.ДоговорКонтрагента.Наименование,"*")>0,"( со * )","");
	Задача1.Дата = ТекущаяДата();
	Задача1.СрокИсполнения = ЗаказОб.ДатаОтгрузки + 16*3600; // до 16-00
	Задача1.СрокОповещения = Задача1.Дата;
	Задача1.Оповещение = Истина;
	
	Задача1.НаСогласование = Истина;
	Задача1.Объект = ЗаказОб.ссылка;
	нн=1;
	Задача1.Описание = "
	|"+Задача1.Наименование+",
	|созданному на основании Excel-файла, полученному через эл.почту
	|от "+ЗаказОб.Комментарий+"
	|
	|";
	
	для каждого стр1 из таблСогл цикл
		
		стр2 = Задача1.Товары.Добавить();
		ЗаполнитьЗначенияСвойств( стр2, таблСогл );
		
		стр2.Сумма  = стр2.Количество * стр2.Цена;
		стр2.Статус = перечисления.СтатусыСтрокЗаказа.НаСогласовании;
		стр2.Скидка = ?(стр2.ЦенаПоТипуЦен>0, (1-стр2.Цена / стр2.ЦенаПоТипуЦен)*100, 0);
		стр2.СкидкаМин = ?(стр2.ЦенаПоТипуЦен>0, (1-стр2.ЦенаМин / стр2.ЦенаПоТипуЦен)*100, 0);
		
		строка1 = строка(стр1.НомерСтрокиОснования)+") "+стр1.Номенклатура.Код+" - "+строка(стр1.Номенклатура)
		+"  Цена: "+строка(стр2.Цена)+" меньше цены Клиента: "+строка(стр2.ЦенаМин)+"р. на "+строка(стр2.ЦенаМин - стр2.Цена)+" р.";
		
		Задача1.Описание = Задача1.Описание +строка1+символы.ПС;
		
	нн=нн+1;
	КонецЦикла;	
	
	попытка
		Задача1.Записать();
		#Если Клиент тогда
			Сообщить("Cоздана Задача на согласование "+строка(таблСогл.Количество())+" цен для на сотрудника: "+строка(Задача1.Исполнитель)+"!",СтатусСообщения.Информация); 
		#КонецЕсли	
	исключение
		#Если Клиент тогда
			Сообщить("Ошибка при создании задачи на согласование "+строка(таблСогл.Количество())+" цен!",СтатусСообщения.Внимание);
		#КонецЕсли	
	КонецПопытки;	
	
КонецПроцедуры


процедура СоздатьУведомлениеОбОшибке(ИмяФайла, стр1, табЗначОтвет)
	//пишем обратно в тот же файл Excel:
	//- КоличествоОтказ и ПричинаОтказа в соответствующие столбцы стр1.КоличествоОтказ и стр1.ПричинаОтказа
	
	//создаём событие для Менеджера по стр1.Контрагент - с указанием ИмяФАЙЛА, отправителя, Темы Письма
	
	//пишем всё в лог-файл
КонецПроцедуры