
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
	ТаблицаВозврата = Новый ТаблицаЗначений;
	
	Таблицавозврата.Колонки.Добавить("Номенклатура");
	Таблицавозврата.Колонки.Добавить("Заказ");
	Всего = Аналоги.Итог("Количество");
	
	Если (Всего>КоличествоНеобходимо) Тогда 
		Возврат;	
	КонецЕсли;
	
	Для каждого Стр из Аналоги Цикл
		Если (Стр.Данет) Тогда 
			СтрУ = Таблицавозврата.Добавить();
			СтрУ.Номенклатура = Стр.Заменитель;
			СтрУ.Заказ = Стр.Количество;
		КонецЕсли;
	КонецЦИкла;
	
	Закрыть(ТаблицаВозврата);
КонецПроцедуры

Процедура ПриОткрытии()
	// Вставить содержимое обработчика.	
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	Запрос = Новый Запрос("Выбрать Заменяемое,Заменитель из РегистрСведений.Аналоги Где Заменяемое=&Заменяемое");	
	Запрос.УстановитьПараметр("Заменяемое",Номенклатура);
	Выб = Запрос.Выполнить().Выгрузить();
	
	Если выб.Количество()=0 Тогда 
		Предупреждение("У данного товара нет аналогов.");
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	ТО = ПолучитьОстатки(Выб.ВыгрузитьКолонку("Заменитель"));
	
	Для каждого СтрХ из Выб Цикл
		СтрН = ТО.Найти(СтрХ.ЗАменитель,"Номенклатура");	
		Если ЗначениеЗаполнено(СтрН) Тогда 
			Остаток = СтрН.СвободныйОстаток;
			Если (СтрН.СвободныйОстаток=0) Тогда 
				Продолжить;
			КонецЕсли;
		Иначе 
			Продолжить;
		КонецЕсли;
		
		СтрУ = Аналоги.Добавить();
		ЗаполнитьЗначенияСвойств(СтрУ,СтрХ);
		СтрУ.Остаток = Остаток;
		
	КонецЦикла;
	
	Если (Аналоги.Количество()=0) Тогда 
		Предупреждение("У данного товара нет свободных остатков по аналогам.");
		Отказ = истина;
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры
