
//------Распознование адреса------------------
// начиная   с n до 6 поля, 7=7
	//стр2.Колонки.Добавить("Поле1");//индекс 
	//стр2.Колонки.Добавить("Поле2");//Область
	//стр2.Колонки.Добавить("Поле3");//Район
	//стр2.Колонки.Добавить("Поле4");//город
	//стр2.Колонки.Добавить("Поле5");//село
	//стр2.Колонки.Добавить("Поле6");//улица
	//стр2.Колонки.Добавить("Поле7");//дом
//
процедура Распознать(знач1, n)
	нКон = 0;	
	знач1 = СокрЛП(знач1);
	
		Если стрДлина(СокрЛП(знач1))=6 тогда
		знач2 = "";
			попытка 
				знач2 = Формат(Число(знач1),"ЧГ=0");
			исключение 
			конецПопытки;
			
			Если СокрЛП(знач2)=СокрЛП(знач1) тогда //индекс только из цифр
			нКон = 1;
			КонецЕсли;
		КонецЕсли;
		
		Если (Найти(знач1," обл")>0) или (Найти(нрег(знач1),"обл.")>0) или (Найти(нрег(знач1),"область")>0) 
			или (Найти(нрег(знач1),"республика")>0) или (Найти(нрег(знач1),"респ.")>0)или (Найти(нрег(знач1),"респ")>0) 
			или (Найти(нрег(знач1),"край")>0)  тогда 
			нКон = 2; 
			Если ( Найти( нрег(знач1),"московская обл")>0 ) тогда
				знач1 = "Московская обл";
			КонецЕсли;	
			
		ИначеЕсли (Найти(нрег(знач1),"ярославль")>0) тогда
			нКон = 4;
			знач1 = "Ярославль"; // регион, но для нас - это Город!
		ИначеЕсли (Найти(нрег(знач1),"москва")>0) и (n<=2) тогда  //+++ 12.10.2011
			нКон = 4;
			знач1 = "Москва"; // регион, но для нас - это Город!
		ИначеЕсли (Найти(знач1,"МКАД")>0) тогда
			нКон = 4;
		иначеЕсли (знач1="МО") тогда
			нКон = 2;
			знач1 = "Московская обл"; // регион!
			
		ИначеЕсли (Найти(нрег(знач1)," р-н")>0) или (Найти(нрег(знач1)," р-он")>0) или (Найти(нрег(знач1)," район")>0) тогда
			нКон = 3;
		иначеЕсли (Найти(нрег(знач1),"г.")>0)   или (Найти(нрег(знач1),"город ")>0) или (Найти(нрег(знач1)," г")=СтрДлина(знач1)-1) тогда
			нКон = 4;
		иначеЕсли (Найти(нрег(знач1),"пос.")>0) или (Найти(нрег(знач1),"п.")=1) или (Найти(нрег(знач1),"поселок ")>0) или ( Найти(нрег(знач1)," п")=СтрДлина(знач1)-1)
			  ИЛИ (Найти(нрег(знач1),"сел.")>0) или (Найти(нрег(знач1),"с.")=1) или (Найти(нрег(знач1),"село ")>0) или ( Найти(нрег(знач1)," с")=СтрДлина(знач1)-1)
			  или (Найти(нрег(знач1),"ст.")>0)  или (Найти(нрег(знач1),"станция")>0)
			  ИЛИ (Найти(нрег(знач1),"дер.")>0) или (Найти(нрег(знач1),"деревня ")>0) тогда
			нКон = 4;
		иначеЕсли (Найти(нрег(знач1),"ул")>0)   или (Найти(нрег(знач1),"улица")>0) 
			  или (Найти(нрег(знач1),"пр-т")>0)  или (Найти(нрег(знач1),"проспект")>0)
			  или (Найти(нрег(знач1),"тр-т")>0)  или (Найти(нрег(знач1),"тракт")>0)
			  или (Найти(нрег(знач1),"пр-д")>0)  или (Найти(нрег(знач1),"проезд")>0) или (Найти(нрег(знач1),"пр.")>0)
			  или (Найти(нрег(знач1),"км.")>0)   или  (Найти(нрег(знач1),"километр")>0) 
			  или (Найти(нрег(знач1),"дор.")>0)  или  (Найти(нрег(знач1),"дорога")>0) 
			  или (Найти(нрег(знач1),"пл-дь")>0) или (Найти(нрег(знач1),"площадь")>0)
			   или (Найти(нрег(знач1),"тракт")>0)
			  или (Найти(нрег(знач1),"пер.")>0)  или (Найти(нрег(знач1),"переулок")>0)
			  или (Найти(нрег(знач1),"ш.")>0)    или (Найти(нрег(знач1),"шоссе")>0) тогда
			нКон = 6;
// город, улица, дом  / или Обл., Район, деревня, дом
		иначеЕсли (Найти(нрег(знач1),"д.")>0) или (Найти(нрег(знач1),"дом")>0)
			 или  (Найти(нрег(знач1),"стр.")>0) или (Найти(нрег(знач1),"строение ")>0)или (n=7) тогда
			нКон = 7;
		КонецЕсли;	
		
	Знач1 = СокрЛП(знач1);
	Если Знач1="" тогда
		n=0;
	КонецЕсли;	
	
	n = нКон;//+++
	
Конецпроцедуры		

процедура РазбитьСтрокуНаПоля(стр0, ТаблЗнач1)
	
ТаблЗнач1 = неопределено;
ТаблЗнач1 =новый ТаблицаЗначений;
ТаблЗнач1.Колонки.Добавить("n");
ТаблЗнач1.Колонки.Добавить("Значение");

стр1 = стр0;// иначе значение меняется!

строка1 = СокрЛП(стр1);
Если строка1<>"" тогда 
		
		i=найти(строка1,","); L = стрДлина(строка1);
		n=1;
		пока i>0 и n<=7 цикл
		знач1 = СокрЛП(Лев(Строка1, i-1));
		
		//!!! распознавание - что это такое
		Распознать(знач1, n); 
		// переделывает значения n!
		
		Если n>0 тогда
			строка111 = ТаблЗнач1.Добавить();
			строка111.n = n;
			строка111.Значение = знач1; // запишем 
		иначе 
			//сообщить("Не распознано поле №"+n+" = '"+знач1+"' (для адреса: "+стр1+")");
			КонецЕсли;	
		n=n+1;
		Строка1 = Прав(Строка1, L-i);
		i=найти(строка1,","); L = стрДлина(строка1);
		если i=0 и L>0 тогда i=L+1; КонецЕсли;
		КонецЦикла;	
КонецЕсли;

КонецПроцедуры

функция ОбработатьАдрес(Адрес1, НомерПоля1=2, НомерПоля2=7) Экспорт
	
	Табзнач1 = Неопределено;
	РазбитьСтрокуНаПоля(Адрес1, Табзнач1);
	рез = "";
	
	для i=0 по Табзнач1.количество()-1 цикл
		стр1 = Табзнач1[i];
	     //регион     //город
		Если (стр1.n>=НомерПоля1) и (стр1.n<=НомерПоля2) тогда
			рез = рез +СокрЛП(стр1.Значение)+", ";
		КонецЕсли;
	КонецЦикла;
	рез = Лев(рез, стрДлина(рез)-2);
	возврат рез;
	
КонецФункции	
