
Процедура КнопкаВыполнитьНажатие(Кнопка)
	для каждого стр из Договоры Цикл
		Если стр.дата <> Дата(1, 1, 1) Тогда
			Объект = стр.договор.ПолучитьОбъект();
			Объект.ДатаОкончанияДействия = Стр.дата;
			объект.Записать();
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

Процедура ОбновитьНажатие(Элемент)
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("тип",Справочники.ТипыДоговоров.Факторинг);
	Запрос.УстановитьПараметр("Дата",Дата(1, 1, 1));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК договор,
	               |	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	               |	ДоговорыКонтрагентов.ДатаОкончанияДействия КАК дата
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.ТипДоговора = &тип
	               |	И ДоговорыКонтрагентов.ДатаОкончанияДействия = &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Контрагент";
				   
	Договоры = запрос.Выполнить().Выгрузить();
	
КонецПроцедуры
