
Процедура ОбработкаПроведения(Отказ, Режим)
	Если не ЗначениеЗаполнено(Подразделение) и СписокПодразделений=Ложь тогда
		Сообщить("Не заполнено подразделение!");
		Отказ = Истина;
	конецЕсли;	
	Если не ЗначениеЗаполнено(Подразделение) тогда
		Сообщить("Не заполнено подразделение!");
		Отказ = Истина;
	конецЕсли;	
	Если не ЗначениеЗаполнено(ПериодПланирования) тогда
		Сообщить("Не заполнен период планирования!");
		Отказ = Истина;
	конецЕсли;	
	
	Если не Отказ Тогда
		Если Число(Формат(ПериодПланирования.ДатаНачала,"ДФ=yyyy")) = Число(Формат(ПериодПланирования.ДатаКонца,"ДФ=yyyy")) Тогда	
			КоличествоМесяцев = Число(Формат(ПериодПланирования.ДатаКонца,"ДФ=MM")) - Число(Формат(ПериодПланирования.ДатаНачала,"ДФ=MM")) +1;
		иначе
			КоличествоМесяцев = 12 - Число(Формат(ПериодПланирования.ДатаНачала,"ДФ=MM")) +1 + Число(Формат(ПериодПланирования.ДатаКонца,"ДФ=MM"));
		КонецЕсли;
		
		// регистр ПланированиеЗатратПодразделения
		Движения.ПланированиеЗатратПодразделения.Записывать = Истина;
		Движения.ПланированиеЗатратПодразделения.Очистить();
		Для Каждого ТекСтрокаПланЗатрат Из ПланЗатрат Цикл
			//Если не ЗначениеЗаполнено(ТекСтрокаПланЗатрат.СтатьяЗатрат) тогда
			//	Сообщить("В строке № "+ТекСтрокаПланЗатрат.НомерСтроки+" не заполнена статья затрат");
			//	Отказ = Истина;
			//конецЕсли;	
			Для ии=1 по количествоМесяцев Цикл
				Если ТекСтрокаПланЗатрат["Месяц"+ии]<> 0 тогда	
					Движение = Движения.ПланированиеЗатратПодразделения.Добавить();
					Движение.ПериодПланирования = ПериодПланирования;
					Движение.Исполнитель = Исполнитель;
					Движение.СтатьяЗатрат = ТекСтрокаПланЗатрат.СтатьяЗатрат;
					
					если СписокПодразделений Тогда
					Движение.Подразделение = ТекСтрокаПланЗатрат.Подразделение;
					иначе	
					Движение.Подразделение = Подразделение;
                    конецесли;
					
					Движение.Месяц = НачалоМесяца(ДобавитьМесяц(ПериодПланирования.ДатаНачала,ии-1));
					Движение.СуммаЗатрат = ТекСтрокаПланЗатрат["Месяц"+ии];
					Движение.Комментарий = ТекСтрокаПланЗатрат["Ком"+ии];
				конецЕсли;
			конецЦикла;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
