
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	АнализКурсовСписанияВалютыИнициализация();

КонецПроцедуры

Процедура ПриЗакрытии()

	СохранитьЗначение("НастройкаОтчетыАнализКурсовСписанияВалютыАнализКурсовСписанияВалюты_4f64375b-770a-4bdc-81fc-376d0258c3c6", ПостроительОтчетаАнализКурсовСписанияВалюты.ПолучитьНастройки());

КонецПроцедуры

Процедура ДействияФормыАнализКурсовСписанияВалютыНастройка(Кнопка)
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_НАСТРОЙКА(АнализКурсовСписанияВалюты)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Форма = ОтчетОбъект.ПолучитьФорму("АнализКурсовСписанияВалютыНастройка");
	Форма.ПостроительОтчета = ПостроительОтчетаАнализКурсовСписанияВалюты;
	Настройка = ПостроительОтчетаАнализКурсовСписанияВалюты.ПолучитьНастройки();
	Если Форма.ОткрытьМодально() = Истина Тогда
		АнализКурсовСписанияВалютыВывести();
	Иначе
		ПостроительОтчетаАнализКурсовСписанияВалюты.УстановитьНастройки(Настройка);
	КонецЕсли;

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_НАСТРОЙКА
КонецПроцедуры

Процедура ДействияФормыАнализКурсовСписанияВалютыСформировать(Кнопка)
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА(АнализКурсовСписанияВалюты)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	АнализКурсовСписанияВалютыВывести();

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА
КонецПроцедуры

Процедура АнализКурсовСписанияВалютыВывести()
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_ВЫПОЛНИТЬ(АнализКурсовСписанияВалюты)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	ЭлементыФормы.ПолеТабличногоДокумента.Очистить();

	ПостроительОтчетаАнализКурсовСписанияВалюты.Параметры.Вставить("БанкСчет", БанкСчет);

	ПостроительОтчетаАнализКурсовСписанияВалюты.Выполнить();
	ПостроительОтчетаАнализКурсовСписанияВалюты.РазмещениеИзмеренийВСтроках = ТипРазмещенияИзмерений.Вместе;
	ПостроительОтчетаАнализКурсовСписанияВалюты.РазмещениеРеквизитовИзмеренийВСтроках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
	ПостроительОтчетаАнализКурсовСписанияВалюты.РазмещениеРеквизитовИзмеренийВКолонках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
	ПостроительОтчетаАнализКурсовСписанияВалюты.МакетОформления = ПолучитьМакетОформления(СтандартноеОформление.Классика);
	ПостроительОтчетаАнализКурсовСписанияВалюты.Вывести(ЭлементыФормы.ПолеТабличногоДокумента);

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_ВЫПОЛНИТЬ
КонецПроцедуры

Процедура АнализКурсовСписанияВалютыИнициализация()
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_ИНИЦИАЛИЗАЦИЯ(АнализКурсовСписанияВалюты)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	ПостроительОтчетаАнализКурсовСписанияВалюты.Текст =
	"ВЫБРАТЬ
	|	ДенежныеСредстваОстаткиИОбороты.Период КАК Период,
	|	ДенежныеСредстваОстаткиИОбороты.Регистратор,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваОстаткиИОбороты.СуммаНачальныйОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ДенежныеСредстваОстаткиИОбороты.СуммаУпрНачальныйОстаток / ДенежныеСредстваОстаткиИОбороты.СуммаНачальныйОстаток КАК ЧИСЛО(10, 4))
	|	КОНЕЦ КАК КурсОстаток,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.КурсВзаиморасчетов КАК КурсВход,
	|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.КурсВзаиморасчетов КАК КурсВыход
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.ОстаткиИОбороты(, , Регистратор, , БанковскийСчетКасса = &БанкСчет) КАК ДенежныеСредстваОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
	|		ПО ДенежныеСредстваОстаткиИОбороты.Регистратор = ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеИсходящееРасшифровкаПлатежа
	|		ПО ДенежныеСредстваОстаткиИОбороты.Регистратор = ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|АВТОУПОРЯДОЧИВАНИЕ";
	ПостроительОтчетаАнализКурсовСписанияВалюты.ЗаполнитьНастройки();
	ПостроительОтчетаАнализКурсовСписанияВалюты.ЗаполнениеРасшифровки = ВидЗаполненияРасшифровкиПостроителяОтчета.ЗначенияГруппировок;
	ПостроительОтчетаАнализКурсовСписанияВалюты.ТекстЗаголовка = "Анализ курсов списания валюты";
	Настройка = ВосстановитьЗначение("НастройкаОтчетыАнализКурсовСписанияВалютыАнализКурсовСписанияВалюты_4f64375b-770a-4bdc-81fc-376d0258c3c6");
	Если Настройка <> Неопределено Тогда
		ПостроительОтчетаАнализКурсовСписанияВалюты.УстановитьНастройки(Настройка);
	КонецЕсли;

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_ИНИЦИАЛИЗАЦИЯ
КонецПроцедуры




