Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Производитель = справочники.Производители.НайтиПоКоду(597); //Trebl
	видСравнения = ">";
	скидка = 21;       // VIP
	
	ДатаКон = ТекущаяДата();
	ДатаНач = НачалоМесяца(ДатаКон);
	
КонецПроцедуры

Процедура ПриОткрытии()
//----------------21.11.2018 - ограничение?!----------------------	
	//ИмяПользователя = ПараметрыСеанса.ТекущийПользователь.Код;
	//Если Найти(ИмяПользователя,"Малышев") = 0 
	//	и Найти(ИмяПользователя,"Бондаренко") = 0 
	//	и Найти(ИмяПользователя,"Марешева")   = 0
	//	и НЕ РольДоступна("ПравоЗавершенияРаботыПользователей") //вместо Плотников
	//	Тогда
	//	Предупреждение("У Вас нет доступа к этому отчету!", 60);
	//	ЭтаФорма.Закрыть();
	//КонецЕсли;  
	
	ЭлементыФормы.видСравнения.СписокВыбора.Очистить();	
	ЭлементыФормы.видСравнения.СписокВыбора.Добавить(">");
	ЭлементыФормы.видСравнения.СписокВыбора.Добавить("<");
	ЭлементыФормы.видСравнения.СписокВыбора.Добавить("=");
	ЭлементыФормы.видСравнения.СписокВыбора.Добавить("<>");
	
	//++ 21.11.2018 - за тек.месяц
	УстановитьПараметрыВОтчет();
	
КонецПроцедуры

Процедура скидкаПриИзменении(Элемент)
	ТабДок = Новый ТабличныйДокумент;
	ЭтотОбъект.СкомпоноватьРезультат(ТабДок);
	ЭлементыФормы.Результат.ТолькоПросмотр = Истина;
	ЭлементыФормы.Результат.Вывести(ТабДОк);
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(ДатаНач, ?(ДатаКон='0001-01-01', ДатаКон, КонецДня(ДатаКон)));
	Если НастройкаПериода.Редактировать() Тогда
		ДатаНач = НастройкаПериода.ПолучитьДатуНачала();
		ДатаКон = НастройкаПериода.ПолучитьДатуОкончания();
		УстановитьПараметрыВОтчет();
	КонецЕсли;
КонецПроцедуры

