Процедура ОбработкаПроведения(Отказ, Режим)
	
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.НДСПокупки.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		
		Если ПредъявленНДСКВычету0 Тогда
			Движение.ВидЦенности = 	Перечисления.ВидыЦенностей.АвансыПолученные0;
			Движение.Событие = 		Перечисления.СобытияПоНДСПокупки.ПредъявленНДСКВычету0;
		Иначе
			Движение.ВидЦенности = 	Перечисления.ВидыЦенностей.АвансыПолученные;
			Движение.Событие = 		Перечисления.СобытияПоНДСПокупки.ПредъявленНДСКВычету;
		КонецЕсли;
		
		Движение.Поставщик = ТекСтрокаСостав.Поставщик;
		Движение.СчетФактура = ТекСтрокаСостав.СчетФактура;
		Движение.СтавкаНДС = ТекСтрокаСостав.СтавкаНДС;
		Движение.СуммаБезНДС = ТекСтрокаСостав.СуммаБезНДС;
		Движение.НДС = ТекСтрокаСостав.НДС;
		Движение.ДокументОплаты = ТекСтрокаСостав.СчетФактура;

	КонецЦикла;

	Движения.НДСПокупки.Записать();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ Отказ Тогда
	
		обЗаписатьПротоколИзменений(ЭтотОбъект);
	
	КонецЕсли; 

КонецПроцедуры
