
Процедура КнопкаВыполнитьНажатие(Кнопка)
	//Северавто+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	
	СеверАвто = Справочники.Контрагенты.НайтиПоКоду("00282");
	
	WinHttp=Новый COMОбъект("Msxml2.SERVERXMLHTTP");
	WinHttp.Open("GET","http://webmim.svrauto.ru/api/v1/catalog/unload?access-token=kPIiDC75XLvXrhIXR-GeQGRuUSMnsrJY&format=xml&types=1",0);
	WinHttp.Send();
	
	Ответ = WinHttp.ResponseText();
	ФайлРезультата = "C:\Остатки_Север_Авто.xml";
	Текст = новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку(Ответ);
	Текст.Записать(ФайлРезультата,"UTF-8 ");

		
	КЧ = Новый КвалификаторыЧисла(12,2);
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура",ОписаниеТиповС);
	ТЗ.Колонки.Добавить("Цена",ОписаниеТиповЧ);
		
	Чтение = Новый ЧтениеXML;

	Чтение.ОткрытьФайл("C:\Остатки_Север_Авто.xml");
	ИмяТекУзла = "";
	ИмяПредУзла = "";
	Пока Чтение.Прочитать() Цикл 
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ИмяПредУзла = ИмяТекУзла;
			ИмяТекУзла = Чтение.Имя;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст и ИмяТекУзла = "NNOMMODIF" Тогда
			КодПоставщика = Чтение.Значение;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст и ИмяТекУзла = "SMODIFNAME" Тогда
			Наименование = Чтение.Значение;
						
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст и ИмяТекУзла = "SMNFCODE" Тогда
			
			Артикул = Чтение.Значение;
			//Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул); 
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст и ИмяТекУзла = "TERRITORY_NAME" Тогда
			Склад = Чтение.Значение;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст и ИмяТекУзла = "NPRICE_PREPAYMENT" Тогда                          
			
			Попытка 
				Цена = Число(Чтение.Значение);
			Исключение
				Цена = 0;
			КонецПопытки;
			
			Если Цена > 0 и Артикул <> "" Тогда
				Нов = ТЗ.Добавить();
				Нов.Номенклатура = Артикул;
				Нов.Цена = Цена;
			КонецЕсли;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			ИмяТекУзла = "";
	 	КонецЕсли;	
	КонецЦикла;	
	
	ТЗ.Свернуть("Номенклатура, Цена");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	Запрос.УстановитьПараметр("шины",Перечисления.ВидыТоваров.Шины);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Номенклатура,
	               |	ТЗ.Цена
	               |ПОМЕСТИТЬ ТЗВрем
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Номенклатура1.Ссылка КАК Номенклатура,
	               |	МИНИМУМ(ТЗВрем.Цена) КАК Цена
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗВрем КАК ТЗВрем
	               |		ПО Номенклатура1.Артикул = ТЗВрем.Номенклатура
	               |ГДЕ
	               |	Номенклатура1.ВидТовара = &Шины
	               |	И ЕСТЬNULL(ТЗВрем.Цена, 0) > 0
	               |//ОтборГР	И Номенклатура1.НоменклатурнаяГруппа В(&НомГр)
	               |//ОтборПр	И Номенклатура1.Производитель В(&Производ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Номенклатура1.Ссылка";
				   
				   
				   если НоменклатурныеГруппы.Количество()>0 тогда
					   Массив = НоменклатурныеГруппы.ВыгрузитьКолонку("НоменклатурнаяГруппа");
					   номГр = Новый СписокЗначений;
					   номГр.ЗагрузитьЗначения(Массив);
					   
					   Запрос.Текст = СтрЗаменить(запрос.Текст,"//ОтборГР","");
					   запрос.УстановитьПараметр("номГр",номГр);
				   КонецЕсли;
				   
				    если Производители.Количество()>0 тогда
					   Массив = Производители.ВыгрузитьКолонку("Производитель");
					   Производ = Новый СписокЗначений;
					   Производ.ЗагрузитьЗначения(Массив);
					   
					   Запрос.Текст = СтрЗаменить(запрос.Текст,"//ОтборПр","");
					   запрос.УстановитьПараметр("Производ",Производ);
				   КонецЕсли;
					   
				   
	 Результат1 = запрос.Выполнить().Выгрузить();
		
	
	//Пауэр++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	
	WinHttp=Новый COMОбъект("Msxml2.SERVERXMLHTTP");
	WinHttp.Open("GET","https://b2b.pwrs.ru/export_data/M13541.xml",0);
	WinHttp.Send();
	
	Ответ = WinHttp.ResponseText();
	ФайлРезультата = "C:\Остатки_Пауэр.xml";
	Текст = новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку(Ответ);
	Текст.Записать(ФайлРезультата,"UTF-8 ");

		
	КЧ = Новый КвалификаторыЧисла(12,2);
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	
	ТЗ2 = Новый ТаблицаЗначений;
	ТЗ2.Колонки.Добавить("Номенклатура",ОписаниеТиповС);
	ТЗ2.Колонки.Добавить("Цена",ОписаниеТиповЧ);
		
	Чтение = Новый ЧтениеXML;

	Чтение.ОткрытьФайл("C:\Остатки_Пауэр.xml");
	ИмяТекУзла = "";
	ИмяПредУзла = "";
	Пока Чтение.Прочитать() Цикл 
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ИмяПредУзла = ИмяТекУзла;
			ИмяТекУзла = Чтение.Имя;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст и ИмяТекУзла = "cae" Тогда
			
			Артикул = Чтение.Значение;
			//Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);
			Цена = 100000;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст и найти(ИмяТекУзла,"price") > 0 Тогда
			
			Если Число(Чтение.Значение) < Цена Тогда
				
				Цена = Число(Чтение.Значение);
				
			КонецЕсли;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст и ИмяТекУзла = "name" Тогда                          
			
			Если Цена <> 100000 и Артикул <> "" Тогда
				Нов = ТЗ2.Добавить();
				Нов.Номенклатура = Артикул;
				Нов.Цена = Цена;
			КонецЕсли;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			ИмяТекУзла = "";
	 	КонецЕсли;	
	КонецЦикла;	
	
	ТЗ2.Свернуть("Номенклатура, Цена");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ",ТЗ2);
	Запрос.УстановитьПараметр("шины",Перечисления.ВидыТоваров.Шины);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Номенклатура,
	               |	ТЗ.Цена
	               |ПОМЕСТИТЬ ТЗВрем
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Номенклатура1.Ссылка КАК Номенклатура,
	               |	МИНИМУМ(ТЗВрем.Цена) КАК Цена
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗВрем КАК ТЗВрем
	               |		ПО Номенклатура1.Артикул = ТЗВрем.Номенклатура
	               |ГДЕ
	               |	Номенклатура1.ВидТовара = &Шины
	               |	И ЕСТЬNULL(ТЗВрем.Цена, 0) > 0
				    |//ОтборГР	И Номенклатура1.НоменклатурнаяГруппа В(&НомГр)
	               |//ОтборПр	И Номенклатура1.Производитель В(&Производ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Номенклатура1.Ссылка";
				   
	если НоменклатурныеГруппы.Количество()>0 тогда
					   Массив = НоменклатурныеГруппы.ВыгрузитьКолонку("НоменклатурнаяГруппа");
					   номГр = Новый СписокЗначений;
					   номГр.ЗагрузитьЗначения(Массив);
					   
					   Запрос.Текст = СтрЗаменить(запрос.Текст,"//ОтборГР","");
					   запрос.УстановитьПараметр("номГр",номГр);
				   КонецЕсли;
				   
				    если Производители.Количество()>0 тогда
					   Массив = Производители.ВыгрузитьКолонку("Производитель");
					   Производ = Новый СписокЗначений;
					   Производ.ЗагрузитьЗначения(Массив);
					   
					   Запрос.Текст = СтрЗаменить(запрос.Текст,"//ОтборПр","");
					   запрос.УстановитьПараметр("Производ",Производ);
				   КонецЕсли;

				   
	 Результат2 = запрос.Выполнить().Выгрузить();
	
	//ЛигаТайерс++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	WinHttp=Новый COMОбъект("Msxml2.SERVERXMLHTTP");
	WinHttp.Open("GET","http://b2b.liga-tyres.ru/online/catalog/store.xml?token=c92562041f5456e326617820a3b5b0f8&tire=true",0);
	WinHttp.Send();
	
	Ответ = WinHttp.ResponseText();
	ФайлРезультата = "C:\Остатки_ЛигаТайерс.xml";
	Текст = новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку(Ответ);
	Текст.Записать(ФайлРезультата,"UTF-8 ");

		
	КЧ = Новый КвалификаторыЧисла(12,2);
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	
	ТЗ3 = Новый ТаблицаЗначений;
	ТЗ3.Колонки.Добавить("Номенклатура",ОписаниеТиповС);
	ТЗ3.Колонки.Добавить("Цена",ОписаниеТиповЧ);
		
	Чтение = Новый ЧтениеXML;

	Чтение.ОткрытьФайл("C:\Остатки_ЛигаТайерс.xml");
	Пока Чтение.Прочитать() Цикл 
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента и Чтение.Имя = "gd" Тогда
			
			Пока Чтение.ПрочитатьАтрибут() Цикл
				Если Чтение.Имя = "cae" Тогда
	 				Артикул = Чтение.Значение;
				КонецЕсли;	
			КонецЦикла;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента и Чтение.Имя = "price" Тогда
			
			Пока Чтение.ПрочитатьАтрибут() Цикл
				Если Чтение.Имя = "p1" Тогда
	 				Цена = Чтение.Значение;
				КонецЕсли;	
			КонецЦикла;
			
			Нов = ТЗ3.Добавить();
			Нов.Номенклатура = Артикул;
			Нов.Цена = Цена;
						
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
	 	КонецЕсли;	
	КонецЦикла;	
	
	ТЗ3.Свернуть("Номенклатура, Цена");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ",ТЗ3);
	Запрос.УстановитьПараметр("шины",Перечисления.ВидыТоваров.Шины);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Номенклатура,
	               |	ТЗ.Цена
	               |ПОМЕСТИТЬ ТЗВрем
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Номенклатура1.Ссылка КАК Номенклатура,
	               |	МИНИМУМ(ТЗВрем.Цена) КАК Цена
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗВрем КАК ТЗВрем
	               |		ПО Номенклатура1.Артикул = ТЗВрем.Номенклатура
	               |ГДЕ
	               |	Номенклатура1.ВидТовара = &Шины
	               |	И ЕСТЬNULL(ТЗВрем.Цена, 0) > 0
				    |//ОтборГР	И Номенклатура1.НоменклатурнаяГруппа В(&НомГр)
	               |//ОтборПр	И Номенклатура1.Производитель В(&Производ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Номенклатура1.Ссылка";
				   
	если НоменклатурныеГруппы.Количество()>0 тогда
					   Массив = НоменклатурныеГруппы.ВыгрузитьКолонку("НоменклатурнаяГруппа");
					   номГр = Новый СписокЗначений;
					   номГр.ЗагрузитьЗначения(Массив);
					   
					   Запрос.Текст = СтрЗаменить(запрос.Текст,"//ОтборГР","");
					   запрос.УстановитьПараметр("номГр",номГр);
				   КонецЕсли;
				   
				    если Производители.Количество()>0 тогда
					   Массив = Производители.ВыгрузитьКолонку("Производитель");
					   Производ = Новый СписокЗначений;
					   Производ.ЗагрузитьЗначения(Массив);
					   
					   Запрос.Текст = СтрЗаменить(запрос.Текст,"//ОтборПр","");
					   запрос.УстановитьПараметр("Производ",Производ);
				   КонецЕсли;

				   
	 Результат3 = запрос.Выполнить().Выгрузить();
	 
	//ШинСервис++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	
	WinHttp=Новый COMОбъект("Msxml2.SERVERXMLHTTP");
	WinHttp.Open("GET","http://www.shinservice.ru/xml/shinservice-b2b-19.xml?id=8519521",0);
	WinHttp.Send();
	
	Ответ = WinHttp.ResponseText();
	ФайлРезультата = "C:\Остатки_ШинСервис.xml";
	Текст = новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку(Ответ);
	Текст.Записать(ФайлРезультата,"UTF-8 ");

		
	КЧ = Новый КвалификаторыЧисла(12,2);
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	
	ТЗ4 = Новый ТаблицаЗначений;
	ТЗ4.Колонки.Добавить("Номенклатура",ОписаниеТиповС);
	ТЗ4.Колонки.Добавить("Цена",ОписаниеТиповЧ);
		
	Чтение = Новый ЧтениеXML;

	Чтение.ОткрытьФайл("C:\Остатки_ШинСервис.xml");
	Пока Чтение.Прочитать() Цикл 
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента и Чтение.Имя = "tire" Тогда
			
			Пока Чтение.ПрочитатьАтрибут() Цикл
				Если Чтение.Имя = "price" Тогда
     				Цена = Чтение.Значение;
				ИначеЕсли Чтение.Имя = "sku" Тогда
     				Артикул = Чтение.Значение;
				КонецЕсли;	
			КонецЦикла;
			
		//ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента и Чтение.Имя = "price" Тогда
			
			//Пока Чтение.ПрочитатьАтрибут() Цикл
			//	Если Чтение.Имя = "p1" Тогда
			//	Цена = Чтение.Значение;
			//	КонецЕсли;	
			//КонецЦикла;
			
			Нов = ТЗ4.Добавить();
		    Нов.Номенклатура = Артикул;
		    Нов.Цена = Цена;
						
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
	 	КонецЕсли;	
	КонецЦикла;	
	
	ТЗ4.Свернуть("Номенклатура, Цена");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ",ТЗ4);
	Запрос.УстановитьПараметр("шины",Перечисления.ВидыТоваров.Шины);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Номенклатура,
	               |	ТЗ.Цена
	               |ПОМЕСТИТЬ ТЗВрем
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Номенклатура1.Ссылка КАК Номенклатура,
	               |	МИНИМУМ(ТЗВрем.Цена) КАК Цена
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗВрем КАК ТЗВрем
	               |		ПО Номенклатура1.Артикул = ТЗВрем.Номенклатура
	               |ГДЕ
	               |	Номенклатура1.ВидТовара = &Шины
	               |	И ЕСТЬNULL(ТЗВрем.Цена, 0) > 0
				    |//ОтборГР	И Номенклатура1.НоменклатурнаяГруппа В(&НомГр)
	               |//ОтборПр	И Номенклатура1.Производитель В(&Производ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Номенклатура1.Ссылка";
				   
	если НоменклатурныеГруппы.Количество()>0 тогда
					   Массив = НоменклатурныеГруппы.ВыгрузитьКолонку("НоменклатурнаяГруппа");
					   номГр = Новый СписокЗначений;
					   номГр.ЗагрузитьЗначения(Массив);
					   
					   Запрос.Текст = СтрЗаменить(запрос.Текст,"//ОтборГР","");
					   запрос.УстановитьПараметр("номГр",номГр);
				   КонецЕсли;
				   
				    если Производители.Количество()>0 тогда
					   Массив = Производители.ВыгрузитьКолонку("Производитель");
					   Производ = Новый СписокЗначений;
					   Производ.ЗагрузитьЗначения(Массив);
					   
					   Запрос.Текст = СтрЗаменить(запрос.Текст,"//ОтборПр","");
					   запрос.УстановитьПараметр("Производ",Производ);
				   КонецЕсли;

				   
	 Результат4 = запрос.Выполнить().Выгрузить();
	
	//Обработка +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("ТЗ1",Результат1);
	Запрос.УстановитьПараметр("ТЗ2",Результат2);
	Запрос.УстановитьПараметр("ТЗ3",Результат3);
	Запрос.УстановитьПараметр("ТЗ4",Результат4);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ1.Номенклатура,
	               |	ТЗ1.Цена
	               |ПОМЕСТИТЬ Т1
	               |ИЗ
	               |	&ТЗ1 КАК ТЗ1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ2.Номенклатура,
	               |	ТЗ2.Цена
	               |ПОМЕСТИТЬ Т2
	               |ИЗ
	               |	&ТЗ2 КАК ТЗ2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ3.Номенклатура,
	               |	ТЗ3.Цена
	               |ПОМЕСТИТЬ Т3
	               |ИЗ
	               |	&ТЗ3 КАК ТЗ3
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ4.Номенклатура,
	               |	ТЗ4.Цена
	               |ПОМЕСТИТЬ Т4
	               |ИЗ
	               |	&ТЗ4 КАК ТЗ4
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.Цена
	               |ПОМЕСТИТЬ Базовые
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(Т1.Номенклатура, ЕСТЬNULL(Т2.Номенклатура, ЕСТЬNULL(Т3.Номенклатура, Т4.Номенклатура))) КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(Т1.Цена, 0) = 0
	               |			ТОГДА 100000
	               |		ИНАЧЕ Т1.Цена
	               |	КОНЕЦ КАК Цена1,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(Т2.Цена, 0) = 0
	               |			ТОГДА 100000
	               |		ИНАЧЕ Т2.Цена
	               |	КОНЕЦ КАК Цена2,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(Т3.Цена, 0) = 0
	               |			ТОГДА 100000
	               |		ИНАЧЕ Т3.Цена
	               |	КОНЕЦ КАК Цена3,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(Т4.Цена, 0) = 0
	               |			ТОГДА 100000
	               |		ИНАЧЕ Т4.Цена
	               |	КОНЕЦ КАК Цена4
	               |ПОМЕСТИТЬ ВРЕМ
	               |ИЗ
	               |	Т1 КАК Т1
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Т2 КАК Т2
	               |		ПО Т1.Номенклатура = Т2.Номенклатура
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Т3 КАК Т3
	               |		ПО Т1.Номенклатура = Т3.Номенклатура
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Т4 КАК Т4
	               |		ПО Т1.Номенклатура = Т4.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВРЕМ.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВРЕМ.Цена1, 0) = 0
	               |			ТОГДА Базовые.Цена
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВРЕМ.Цена1 < Базовые.Цена
	               |					ТОГДА ВЫБОР
	               |							КОГДА (Базовые.Цена - ВРЕМ.Цена1) / ((Базовые.Цена + ВРЕМ.Цена1) / 2) * 100 > 2
	               |								ТОГДА Базовые.Цена
	               |							ИНАЧЕ ВРЕМ.Цена1
	               |						КОНЕЦ
	               |				ИНАЧЕ ВРЕМ.Цена1
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Цена1,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВРЕМ.Цена2, 0) = 0
	               |			ТОГДА Базовые.Цена
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВРЕМ.Цена2 < Базовые.Цена
	               |					ТОГДА ВЫБОР
	               |							КОГДА (Базовые.Цена - ВРЕМ.Цена2) / ((Базовые.Цена + ВРЕМ.Цена2) / 2) * 100 > 2
	               |								ТОГДА Базовые.Цена
	               |							ИНАЧЕ ВРЕМ.Цена2
	               |						КОНЕЦ
	               |				ИНАЧЕ ВРЕМ.Цена2
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Цена2,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВРЕМ.Цена3, 0) = 0
	               |			ТОГДА Базовые.Цена
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВРЕМ.Цена3 < Базовые.Цена
	               |					ТОГДА ВЫБОР
	               |							КОГДА (Базовые.Цена - ВРЕМ.Цена3) / ((Базовые.Цена + ВРЕМ.Цена3) / 2) * 100 > 2
	               |								ТОГДА Базовые.Цена
	               |							ИНАЧЕ ВРЕМ.Цена3
	               |						КОНЕЦ
	               |				ИНАЧЕ ВРЕМ.Цена3
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Цена3,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВРЕМ.Цена4, 0) = 0
	               |			ТОГДА Базовые.Цена
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВРЕМ.Цена4 < Базовые.Цена
	               |					ТОГДА ВЫБОР
	               |							КОГДА (Базовые.Цена - ВРЕМ.Цена4) / ((Базовые.Цена + ВРЕМ.Цена4) / 2) * 100 > 2
	               |								ТОГДА Базовые.Цена
	               |							ИНАЧЕ ВРЕМ.Цена4
	               |						КОНЕЦ
	               |				ИНАЧЕ ВРЕМ.Цена4
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Цена4,
	               |	Базовые.Цена КАК ЦенаБаз
	               |ПОМЕСТИТЬ Врем2
	               |ИЗ
	               |	Базовые КАК Базовые
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВРЕМ КАК ВРЕМ
	               |		ПО Базовые.Номенклатура = ВРЕМ.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Врем2.Номенклатура,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА Врем2.Цена1 <= Врем2.Цена2
	               |					И Врем2.Цена1 <= Врем2.Цена3
	               |					И Врем2.Цена1 <= Врем2.Цена4
	               |					И Врем2.Цена1 <= Врем2.ЦенаБаз
	               |				ТОГДА Врем2.Цена1
	               |			КОГДА Врем2.Цена2 <= Врем2.Цена1
	               |					И Врем2.Цена2 <= Врем2.Цена3
	               |					И Врем2.Цена2 <= Врем2.Цена4
	               |					И Врем2.Цена2 <= Врем2.ЦенаБаз
	               |				ТОГДА Врем2.Цена2
	               |			КОГДА Врем2.Цена3 <= Врем2.Цена1
	               |					И Врем2.Цена3 <= Врем2.Цена2
	               |					И Врем2.Цена3 <= Врем2.Цена4
	               |					И Врем2.Цена3 <= Врем2.ЦенаБаз
	               |				ТОГДА Врем2.Цена3
	               |			КОГДА Врем2.Цена4 <= Врем2.Цена1
	               |					И Врем2.Цена4 <= Врем2.Цена2
	               |					И Врем2.Цена4 <= Врем2.Цена3
	               |					И Врем2.Цена4 <= Врем2.ЦенаБаз
	               |				ТОГДА Врем2.Цена4
	               |			ИНАЧЕ Врем2.ЦенаБаз
	               |		КОНЕЦ) КАК МинЦена
	               |ИЗ
	               |	Врем2 КАК Врем2
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Врем2.Номенклатура";
				   
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество()>0 Тогда
		
		Док = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
		Док.Ответственный = Справочники.Пользователи.НайтиПоКоду("Плотников");
		НовЦена = док.ТипыЦен.Добавить();
		НовЦена.ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00031");
		док.Дата = ТекущаяДата();
		
		для каждого стр из результат Цикл
			
			Нов = Док.Товары.Добавить();
			Нов.ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00031");
			нов.Валюта = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00031").ВалютаЦены;
			Нов.ИндексСтрокиТаблицыЦен = 0;
			Нов.Номенклатура = стр.Номенклатура;
			нов.ЕдиницаИзмерения = стр.Номенклатура.ЕдиницаХраненияОстатков;
			Если икс1 > 0 Тогда
				Нов.Цена = стр.МинЦена - икс1;
			ИначеЕсли икс2 > 0 Тогда
				Нов.Цена = стр.МинЦена - (стр.МинЦена/100*икс2);
			иначе
				Нов.Цена = стр.МинЦена;
			КонецЕсли;
		КонецЦикла;
		
		док.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОсновныеДействияФормыЗагрузитьЦеныB2B(Кнопка)
	
	WinHttp=Новый COMОбъект("Msxml2.SERVERXMLHTTP");
	WinHttp.Open("GET","http://www.shinservice.ru/xml/shinservice-b2b-19.xml?id=8519521",0);
	WinHttp.Send();
	
	Ответ = WinHttp.ResponseText();
	ФайлРезультата = "C:\Остатки_ШинСервис.xml";
	Текст = новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку(Ответ);
	Текст.Записать(ФайлРезультата,"UTF-8 ");

		
	КЧ = Новый КвалификаторыЧисла(12,2);
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	
	ТЗ4 = Новый ТаблицаЗначений;
	ТЗ4.Колонки.Добавить("Номенклатура",ОписаниеТиповС);
	ТЗ4.Колонки.Добавить("Цена",ОписаниеТиповЧ);
		
	Чтение = Новый ЧтениеXML;

	Чтение.ОткрытьФайл("C:\Остатки_ШинСервис.xml");
	Пока Чтение.Прочитать() Цикл 
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента и Чтение.Имя = "tire" Тогда
			
			Пока Чтение.ПрочитатьАтрибут() Цикл
				Если Чтение.Имя = "price" Тогда
     				Цена = Чтение.Значение;
				ИначеЕсли Чтение.Имя = "sku" Тогда
     				Артикул = Чтение.Значение;
				КонецЕсли;	
			КонецЦикла;
			
		//ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента и Чтение.Имя = "price" Тогда
			
			//Пока Чтение.ПрочитатьАтрибут() Цикл
			//	Если Чтение.Имя = "p1" Тогда
			//	Цена = Чтение.Значение;
			//	КонецЕсли;	
			//КонецЦикла;
			
			Нов = ТЗ4.Добавить();
		    Нов.Номенклатура = Артикул;
		    Нов.Цена = Цена;
						
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
	 	КонецЕсли;	
	КонецЦикла;	
	
	ТЗ4.Свернуть("Номенклатура, Цена");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ",ТЗ4);
	Запрос.УстановитьПараметр("шины",Перечисления.ВидыТоваров.Шины);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Номенклатура,
	               |	ТЗ.Цена
	               |ПОМЕСТИТЬ ТЗВрем
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Номенклатура1.Ссылка КАК Номенклатура,
	               |	МИНИМУМ(ТЗВрем.Цена) КАК Цена
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗВрем КАК ТЗВрем
	               |		ПО Номенклатура1.Артикул = ТЗВрем.Номенклатура
	               |ГДЕ
	               |	Номенклатура1.ВидТовара = &Шины
	               |	И ЕСТЬNULL(ТЗВрем.Цена, 0) > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Номенклатура1.Ссылка";
				   
	 Результат = запрос.Выполнить().Выгрузить();
	 
	 Если Результат.Количество()>0 Тогда
		
		Док = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
		Док.Ответственный = Справочники.Пользователи.НайтиПоКоду("Плотников");
		НовЦена = док.ТипыЦен.Добавить();
		НовЦена.ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00032");
		док.Дата = ТекущаяДата();
		
		для каждого стр из результат Цикл
			
			Нов = Док.Товары.Добавить();
			Нов.ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00032");
			нов.Валюта = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00032").ВалютаЦены;
			Нов.ИндексСтрокиТаблицыЦен = 0;
			Нов.Номенклатура = стр.Номенклатура;
			нов.ЕдиницаИзмерения = стр.Номенклатура.ЕдиницаХраненияОстатков;
			Нов.Цена = стр.Цена;
				
		КонецЦикла;
		
		док.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;

КонецПроцедуры

Процедура ОсновныеДействияФормыЗагрузитьРРЦ(Кнопка)
	WinHttp=Новый COMОбъект("Msxml2.SERVERXMLHTTP");
	WinHttp.Open("GET","http://www.shinservice.ru/xml/shinservice-b2b-19.xml?id=8519521",0);
	WinHttp.Send();
	
	Ответ = WinHttp.ResponseText();
	ФайлРезультата = "C:\Остатки_ШинСервис.xml";
	Текст = новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку(Ответ);
	Текст.Записать(ФайлРезультата,"UTF-8 ");

		
	КЧ = Новый КвалификаторыЧисла(12,2);
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	
	ТЗ4 = Новый ТаблицаЗначений;
	ТЗ4.Колонки.Добавить("Номенклатура",ОписаниеТиповС);
	ТЗ4.Колонки.Добавить("Цена",ОписаниеТиповЧ);
		
	Чтение = Новый ЧтениеXML;

	Чтение.ОткрытьФайл("C:\Остатки_ШинСервис.xml");
	Пока Чтение.Прочитать() Цикл 
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента и Чтение.Имя = "tire" Тогда
			
			Пока Чтение.ПрочитатьАтрибут() Цикл
				Если Чтение.Имя = "sticker_price" Тогда
     				Цена = Чтение.Значение;
				ИначеЕсли Чтение.Имя = "sku" Тогда
     				Артикул = Чтение.Значение;
				КонецЕсли;	
			КонецЦикла;
			
		//ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента и Чтение.Имя = "price" Тогда
			
			//Пока Чтение.ПрочитатьАтрибут() Цикл
			//	Если Чтение.Имя = "p1" Тогда
			//	Цена = Чтение.Значение;
			//	КонецЕсли;	
			//КонецЦикла;
			
			Нов = ТЗ4.Добавить();
		    Нов.Номенклатура = Артикул;
		    Нов.Цена = Цена;
						
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
	 	КонецЕсли;	
	КонецЦикла;	
	
	ТЗ4.Свернуть("Номенклатура, Цена");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ",ТЗ4);
	Запрос.УстановитьПараметр("шины",Перечисления.ВидыТоваров.Шины);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Номенклатура,
	               |	ТЗ.Цена
	               |ПОМЕСТИТЬ ТЗВрем
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Номенклатура1.Ссылка КАК Номенклатура,
	               |	МИНИМУМ(ТЗВрем.Цена) КАК Цена
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗВрем КАК ТЗВрем
	               |		ПО Номенклатура1.Артикул = ТЗВрем.Номенклатура
	               |ГДЕ
	               |	Номенклатура1.ВидТовара = &Шины
	               |	И ЕСТЬNULL(ТЗВрем.Цена, 0) > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Номенклатура1.Ссылка";
				   
	 Результат = запрос.Выполнить().Выгрузить();
	 
	 Если Результат.Количество()>0 Тогда
		
		Док = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
		Док.Ответственный = Справочники.Пользователи.НайтиПоКоду("Плотников");
		НовЦена = док.ТипыЦен.Добавить();
		НовЦена.ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00011");
		док.Дата = ТекущаяДата();
		
		для каждого стр из результат Цикл
			
			Нов = Док.Товары.Добавить();
			Нов.ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00011");
			нов.Валюта = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00011").ВалютаЦены;
			Нов.ИндексСтрокиТаблицыЦен = 0;
			Нов.Номенклатура = стр.Номенклатура;
			нов.ЕдиницаИзмерения = стр.Номенклатура.ЕдиницаХраненияОстатков;
			Нов.Цена = стр.Цена;
				
		КонецЦикла;
		
		док.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;

КонецПроцедуры

Процедура ОсновныеДействияФормыПоказатьОтличияОтВ2B(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ОсновныеДействияФормыПоказатьРазличия(Кнопка)
	//Северавто+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	
	СеверАвто = Справочники.Контрагенты.НайтиПоКоду("00282");
	
	WinHttp=Новый COMОбъект("Msxml2.SERVERXMLHTTP");
	WinHttp.Open("GET","http://webmim.svrauto.ru/api/v1/catalog/unload?access-token=kPIiDC75XLvXrhIXR-GeQGRuUSMnsrJY&format=xml&types=1",0);
	WinHttp.Send();
	
	Ответ = WinHttp.ResponseText();
	ФайлРезультата = "C:\Остатки_Север_Авто.xml";
	Текст = новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку(Ответ);
	Текст.Записать(ФайлРезультата,"UTF-8 ");

		
	КЧ = Новый КвалификаторыЧисла(12,2);
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура",ОписаниеТиповС);
	ТЗ.Колонки.Добавить("Цена",ОписаниеТиповЧ);
		
	Чтение = Новый ЧтениеXML;

	Чтение.ОткрытьФайл("C:\Остатки_Север_Авто.xml");
	ИмяТекУзла = "";
	ИмяПредУзла = "";
	Пока Чтение.Прочитать() Цикл 
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ИмяПредУзла = ИмяТекУзла;
			ИмяТекУзла = Чтение.Имя;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст и ИмяТекУзла = "NNOMMODIF" Тогда
			КодПоставщика = Чтение.Значение;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст и ИмяТекУзла = "SMODIFNAME" Тогда
			Наименование = Чтение.Значение;
						
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст и ИмяТекУзла = "SMNFCODE" Тогда
			
			Артикул = Чтение.Значение;
			//Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул); 
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст и ИмяТекУзла = "TERRITORY_NAME" Тогда
			Склад = Чтение.Значение;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст и ИмяТекУзла = "NPRICE_PREPAYMENT" Тогда                          
			
			Попытка 
				Цена = Число(Чтение.Значение);
			Исключение
				Цена = 0;
			КонецПопытки;
			
			Если Цена > 0 и Артикул <> "" Тогда
				Нов = ТЗ.Добавить();
				Нов.Номенклатура = Артикул;
				Нов.Цена = Цена;
			КонецЕсли;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			ИмяТекУзла = "";
	 	КонецЕсли;	
	КонецЦикла;	
	
	ТЗ.Свернуть("Номенклатура, Цена");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	Запрос.УстановитьПараметр("шины",Перечисления.ВидыТоваров.Шины);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Номенклатура,
	               |	ТЗ.Цена
	               |ПОМЕСТИТЬ ТЗВрем
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Номенклатура1.Ссылка КАК Номенклатура,
	               |	МИНИМУМ(ТЗВрем.Цена) КАК Цена
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗВрем КАК ТЗВрем
	               |		ПО Номенклатура1.Артикул = ТЗВрем.Номенклатура
	               |ГДЕ
	               |	Номенклатура1.ВидТовара = &Шины
	               |	И ЕСТЬNULL(ТЗВрем.Цена, 0) > 0
				     |//ОтборГР	И Номенклатура1.НоменклатурнаяГруппа В(&НомГр)
	               |//ОтборПр	И Номенклатура1.Производитель В(&Производ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Номенклатура1.Ссылка";
				   
	если НоменклатурныеГруппы.Количество()>0 тогда
					   Массив = НоменклатурныеГруппы.ВыгрузитьКолонку("НоменклатурнаяГруппа");
					   номГр = Новый СписокЗначений;
					   номГр.ЗагрузитьЗначения(Массив);
					   
					   Запрос.Текст = СтрЗаменить(запрос.Текст,"//ОтборГР","");
					   запрос.УстановитьПараметр("номГр",номГр);
				   КонецЕсли;
				   
				    если Производители.Количество()>0 тогда
					   Массив = Производители.ВыгрузитьКолонку("Производитель");
					   Производ = Новый СписокЗначений;
					   Производ.ЗагрузитьЗначения(Массив);
					   
					   Запрос.Текст = СтрЗаменить(запрос.Текст,"//ОтборПр","");
					   запрос.УстановитьПараметр("Производ",Производ);
				   КонецЕсли;

				   
	 Результат1 = запрос.Выполнить().Выгрузить();
		
	
	//Пауэр++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	
	WinHttp=Новый COMОбъект("Msxml2.SERVERXMLHTTP");
	WinHttp.Open("GET","https://b2b.pwrs.ru/export_data/M13541.xml",0);
	WinHttp.Send();
	
	Ответ = WinHttp.ResponseText();
	ФайлРезультата = "C:\Остатки_Пауэр.xml";
	Текст = новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку(Ответ);
	Текст.Записать(ФайлРезультата,"UTF-8 ");

		
	КЧ = Новый КвалификаторыЧисла(12,2);
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	
	ТЗ2 = Новый ТаблицаЗначений;
	ТЗ2.Колонки.Добавить("Номенклатура",ОписаниеТиповС);
	ТЗ2.Колонки.Добавить("Цена",ОписаниеТиповЧ);
		
	Чтение = Новый ЧтениеXML;

	Чтение.ОткрытьФайл("C:\Остатки_Пауэр.xml");
	ИмяТекУзла = "";
	ИмяПредУзла = "";
	Пока Чтение.Прочитать() Цикл 
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ИмяПредУзла = ИмяТекУзла;
			ИмяТекУзла = Чтение.Имя;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст и ИмяТекУзла = "cae" Тогда
			
			Артикул = Чтение.Значение;
			//Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);
			Цена = 100000;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст и найти(ИмяТекУзла,"price") > 0 Тогда
			
			Если Число(Чтение.Значение) < Цена Тогда
				
				Цена = Число(Чтение.Значение);
				
			КонецЕсли;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст и ИмяТекУзла = "name" Тогда                          
			
			Если Цена <> 100000 и Артикул <> "" Тогда
				Нов = ТЗ2.Добавить();
				Нов.Номенклатура = Артикул;
				Нов.Цена = Цена;
			КонецЕсли;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			ИмяТекУзла = "";
	 	КонецЕсли;	
	КонецЦикла;	
	
	ТЗ2.Свернуть("Номенклатура, Цена");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ",ТЗ2);
	Запрос.УстановитьПараметр("шины",Перечисления.ВидыТоваров.Шины);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Номенклатура,
	               |	ТЗ.Цена
	               |ПОМЕСТИТЬ ТЗВрем
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Номенклатура1.Ссылка КАК Номенклатура,
	               |	МИНИМУМ(ТЗВрем.Цена) КАК Цена
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗВрем КАК ТЗВрем
	               |		ПО Номенклатура1.Артикул = ТЗВрем.Номенклатура
	               |ГДЕ
	               |	Номенклатура1.ВидТовара = &Шины
	               |	И ЕСТЬNULL(ТЗВрем.Цена, 0) > 0
				      |//ОтборГР	И Номенклатура1.НоменклатурнаяГруппа В(&НомГр)
	               |//ОтборПр	И Номенклатура1.Производитель В(&Производ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Номенклатура1.Ссылка";
				   
	если НоменклатурныеГруппы.Количество()>0 тогда
					   Массив = НоменклатурныеГруппы.ВыгрузитьКолонку("НоменклатурнаяГруппа");
					   номГр = Новый СписокЗначений;
					   номГр.ЗагрузитьЗначения(Массив);
					   
					   Запрос.Текст = СтрЗаменить(запрос.Текст,"//ОтборГР","");
					   запрос.УстановитьПараметр("номГр",номГр);
				   КонецЕсли;
				   
				    если Производители.Количество()>0 тогда
					   Массив = Производители.ВыгрузитьКолонку("Производитель");
					   Производ = Новый СписокЗначений;
					   Производ.ЗагрузитьЗначения(Массив);
					   
					   Запрос.Текст = СтрЗаменить(запрос.Текст,"//ОтборПр","");
					   запрос.УстановитьПараметр("Производ",Производ);
				   КонецЕсли;

				   
	 Результат2 = запрос.Выполнить().Выгрузить();
	
	//ЛигаТайерс++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	WinHttp=Новый COMОбъект("Msxml2.SERVERXMLHTTP");
	WinHttp.Open("GET","http://b2b.liga-tyres.ru/online/catalog/store.xml?token=c92562041f5456e326617820a3b5b0f8&tire=true",0);
	WinHttp.Send();
	
	Ответ = WinHttp.ResponseText();
	ФайлРезультата = "C:\Остатки_ЛигаТайерс.xml";
	Текст = новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку(Ответ);
	Текст.Записать(ФайлРезультата,"UTF-8 ");

		
	КЧ = Новый КвалификаторыЧисла(12,2);
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	
	ТЗ3 = Новый ТаблицаЗначений;
	ТЗ3.Колонки.Добавить("Номенклатура",ОписаниеТиповС);
	ТЗ3.Колонки.Добавить("Цена",ОписаниеТиповЧ);
		
	Чтение = Новый ЧтениеXML;

	Чтение.ОткрытьФайл("C:\Остатки_ЛигаТайерс.xml");
	Пока Чтение.Прочитать() Цикл 
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента и Чтение.Имя = "gd" Тогда
			
			Пока Чтение.ПрочитатьАтрибут() Цикл
				Если Чтение.Имя = "cae" Тогда
	 				Артикул = Чтение.Значение;
				КонецЕсли;	
			КонецЦикла;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента и Чтение.Имя = "price" Тогда
			
			Пока Чтение.ПрочитатьАтрибут() Цикл
				Если Чтение.Имя = "p1" Тогда
	 				Цена = Чтение.Значение;
				КонецЕсли;	
			КонецЦикла;
			
			Нов = ТЗ3.Добавить();
			Нов.Номенклатура = Артикул;
			Нов.Цена = Цена;
						
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
	 	КонецЕсли;	
	КонецЦикла;	
	
	ТЗ3.Свернуть("Номенклатура, Цена");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ",ТЗ3);
	Запрос.УстановитьПараметр("шины",Перечисления.ВидыТоваров.Шины);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Номенклатура,
	               |	ТЗ.Цена
	               |ПОМЕСТИТЬ ТЗВрем
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Номенклатура1.Ссылка КАК Номенклатура,
	               |	МИНИМУМ(ТЗВрем.Цена) КАК Цена
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗВрем КАК ТЗВрем
	               |		ПО Номенклатура1.Артикул = ТЗВрем.Номенклатура
	               |ГДЕ
	               |	Номенклатура1.ВидТовара = &Шины
	               |	И ЕСТЬNULL(ТЗВрем.Цена, 0) > 0
				      |//ОтборГР	И Номенклатура1.НоменклатурнаяГруппа В(&НомГр)
	               |//ОтборПр	И Номенклатура1.Производитель В(&Производ)

	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Номенклатура1.Ссылка";
				   
	если НоменклатурныеГруппы.Количество()>0 тогда
					   Массив = НоменклатурныеГруппы.ВыгрузитьКолонку("НоменклатурнаяГруппа");
					   номГр = Новый СписокЗначений;
					   номГр.ЗагрузитьЗначения(Массив);
					   
					   Запрос.Текст = СтрЗаменить(запрос.Текст,"//ОтборГР","");
					   запрос.УстановитьПараметр("номГр",номГр);
				   КонецЕсли;
				   
				    если Производители.Количество()>0 тогда
					   Массив = Производители.ВыгрузитьКолонку("Производитель");
					   Производ = Новый СписокЗначений;
					   Производ.ЗагрузитьЗначения(Массив);
					   
					   Запрос.Текст = СтрЗаменить(запрос.Текст,"//ОтборПр","");
					   запрос.УстановитьПараметр("Производ",Производ);
				   КонецЕсли;

				   
	 Результат3 = запрос.Выполнить().Выгрузить();
	 
	//ШинСервис++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	
	WinHttp=Новый COMОбъект("Msxml2.SERVERXMLHTTP");
	WinHttp.Open("GET","http://www.shinservice.ru/xml/shinservice-b2b-19.xml?id=8519521",0);
	WinHttp.Send();
	
	Ответ = WinHttp.ResponseText();
	ФайлРезультата = "C:\Остатки_ШинСервис.xml";
	Текст = новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку(Ответ);
	Текст.Записать(ФайлРезультата,"UTF-8 ");

		
	КЧ = Новый КвалификаторыЧисла(12,2);
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	
	ТЗ4 = Новый ТаблицаЗначений;
	ТЗ4.Колонки.Добавить("Номенклатура",ОписаниеТиповС);
	ТЗ4.Колонки.Добавить("Цена",ОписаниеТиповЧ);
		
	Чтение = Новый ЧтениеXML;

	Чтение.ОткрытьФайл("C:\Остатки_ШинСервис.xml");
	Пока Чтение.Прочитать() Цикл 
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента и Чтение.Имя = "tire" Тогда
			
			Пока Чтение.ПрочитатьАтрибут() Цикл
				Если Чтение.Имя = "price" Тогда
     				Цена = Чтение.Значение;
				ИначеЕсли Чтение.Имя = "sku" Тогда
     				Артикул = Чтение.Значение;
				КонецЕсли;	
			КонецЦикла;
			
		//ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента и Чтение.Имя = "price" Тогда
			
			//Пока Чтение.ПрочитатьАтрибут() Цикл
			//	Если Чтение.Имя = "p1" Тогда
			//	Цена = Чтение.Значение;
			//	КонецЕсли;	
			//КонецЦикла;
			
			Нов = ТЗ4.Добавить();
		    Нов.Номенклатура = Артикул;
		    Нов.Цена = Цена;
						
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
	 	КонецЕсли;	
	КонецЦикла;	
	
	ТЗ4.Свернуть("Номенклатура, Цена");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ",ТЗ4);
	Запрос.УстановитьПараметр("шины",Перечисления.ВидыТоваров.Шины);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Номенклатура,
	               |	ТЗ.Цена
	               |ПОМЕСТИТЬ ТЗВрем
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Номенклатура1.Ссылка КАК Номенклатура,
	               |	МИНИМУМ(ТЗВрем.Цена) КАК Цена
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗВрем КАК ТЗВрем
	               |		ПО Номенклатура1.Артикул = ТЗВрем.Номенклатура
	               |ГДЕ
	               |	Номенклатура1.ВидТовара = &Шины
	               |	И ЕСТЬNULL(ТЗВрем.Цена, 0) > 0
				      |//ОтборГР	И Номенклатура1.НоменклатурнаяГруппа В(&НомГр)
	               |//ОтборПр	И Номенклатура1.Производитель В(&Производ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Номенклатура1.Ссылка";
				   
	если НоменклатурныеГруппы.Количество()>0 тогда
					   Массив = НоменклатурныеГруппы.ВыгрузитьКолонку("НоменклатурнаяГруппа");
					   номГр = Новый СписокЗначений;
					   номГр.ЗагрузитьЗначения(Массив);
					   
					   Запрос.Текст = СтрЗаменить(запрос.Текст,"//ОтборГР","");
					   запрос.УстановитьПараметр("номГр",номГр);
				   КонецЕсли;
				   
				    если Производители.Количество()>0 тогда
					   Массив = Производители.ВыгрузитьКолонку("Производитель");
					   Производ = Новый СписокЗначений;
					   Производ.ЗагрузитьЗначения(Массив);
					   
					   Запрос.Текст = СтрЗаменить(запрос.Текст,"//ОтборПр","");
					   запрос.УстановитьПараметр("Производ",Производ);
				   КонецЕсли;

				   
	 Результат4 = запрос.Выполнить().Выгрузить();
	
	//_____________________Отличия
	
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("ТЗ1",Результат1);
	Запрос.УстановитьПараметр("ТЗ2",Результат2);
	Запрос.УстановитьПараметр("ТЗ3",Результат3);
	Запрос.УстановитьПараметр("ТЗ4",Результат4);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ1.Номенклатура,
	               |	ТЗ1.Цена
	               |ПОМЕСТИТЬ Т1
	               |ИЗ
	               |	&ТЗ1 КАК ТЗ1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ2.Номенклатура,
	               |	ТЗ2.Цена
	               |ПОМЕСТИТЬ Т2
	               |ИЗ
	               |	&ТЗ2 КАК ТЗ2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ3.Номенклатура,
	               |	ТЗ3.Цена
	               |ПОМЕСТИТЬ Т3
	               |ИЗ
	               |	&ТЗ3 КАК ТЗ3
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ4.Номенклатура,
	               |	ТЗ4.Цена
	               |ПОМЕСТИТЬ Т4
	               |ИЗ
	               |	&ТЗ4 КАК ТЗ4
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(Т1.Номенклатура, ЕСТЬNULL(Т2.Номенклатура, ЕСТЬNULL(Т3.Номенклатура, Т4.Номенклатура))) КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(Т1.Цена, 0) = 0
	               |			ТОГДА 100000
	               |		ИНАЧЕ Т1.Цена
	               |	КОНЕЦ КАК Цена1,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(Т2.Цена, 0) = 0
	               |			ТОГДА 100000
	               |		ИНАЧЕ Т2.Цена
	               |	КОНЕЦ КАК Цена2,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(Т3.Цена, 0) = 0
	               |			ТОГДА 100000
	               |		ИНАЧЕ Т3.Цена
	               |	КОНЕЦ КАК Цена3,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(Т4.Цена, 0) = 0
	               |			ТОГДА 100000
	               |		ИНАЧЕ Т4.Цена
	               |	КОНЕЦ КАК Цена4
	               |ПОМЕСТИТЬ ВРЕМ
	               |ИЗ
	               |	Т1 КАК Т1
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Т2 КАК Т2
	               |		ПО Т1.Номенклатура = Т2.Номенклатура
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Т3 КАК Т3
	               |		ПО Т1.Номенклатура = Т3.Номенклатура
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Т4 КАК Т4
	               |		ПО Т1.Номенклатура = Т4.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВРЕМ.Номенклатура,
	               |	ВРЕМ.Цена1 КАК Цена1,
	               |	ВЫБОР
	               |		КОГДА ВРЕМ.Цена1 < ВРЕМ.Цена4
	               |			ТОГДА (ВРЕМ.Цена4 - ВРЕМ.Цена1) / ((ВРЕМ.Цена4 + ВРЕМ.Цена1) / 2) * 100
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Цена1Процент,
	               |	ВРЕМ.Цена2 КАК Цена2,
	               |	ВЫБОР
	               |		КОГДА ВРЕМ.Цена2 < ВРЕМ.Цена4
	               |			ТОГДА (ВРЕМ.Цена4 - ВРЕМ.Цена2) / ((ВРЕМ.Цена4 + ВРЕМ.Цена2) / 2) * 100
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Цена2процент,
	               |	ВРЕМ.Цена3 КАК Цена3,
	               |	ВЫБОР
	               |		КОГДА ВРЕМ.Цена3 < ВРЕМ.Цена4
	               |			ТОГДА (ВРЕМ.Цена4 - ВРЕМ.Цена3) / ((ВРЕМ.Цена4 + ВРЕМ.Цена3) / 2) * 100
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Цена3Процент,
	               |	ВРЕМ.Цена4
	               |ПОМЕСТИТЬ Врем2
	               |ИЗ
	               |	ВРЕМ КАК ВРЕМ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Врем2.Номенклатура,
	               |	Врем2.Цена1,
	               |	Врем2.Цена1Процент,
	               |	Врем2.Цена2,
	               |	Врем2.Цена2процент,
	               |	Врем2.Цена3,
	               |	Врем2.Цена3Процент,
	               |	Врем2.Цена4
	               |ИЗ
	               |	Врем2 КАК Врем2
	               |ГДЕ
	               |	(Врем2.Цена1Процент > 0
	               |			ИЛИ Врем2.Цена2процент > 0
	               |			ИЛИ Врем2.Цена3Процент > 0)
	               |	И Врем2.Цена4 <> 100000";
				   
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТабДок = Новый ТабличныйДокумент;
	макет = ПолучитьМакет("Макет");
	шапка = макет.ПолучитьОбласть("шапка");
	ТабДок.Вывести(шапка);
	
	для каждого стр из Результат Цикл
		Нов = макет.ПолучитьОбласть("Строка");
		Нов.Параметры.Заполнить(стр);
		Нов.Параметры.Код = стр.номенклатура.Код;
		Нов.Параметры.артикул = стр.номенклатура.Артикул;
	    ТабДок.Вывести(Нов);
	КонецЦикла;
	
	ТабДок.Показать();

КонецПроцедуры
