 Процедура ПриОткрытии()
		НачДата = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение.Дата;
	КонДата = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1].Значение.Дата;
	Подразделение = справочники.Подразделения.НайтиПоКоду("00005");
	
	нашли=ложь;
	для i=0 по КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество()-1 цикл
	НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Получить(i);
	Если НовыйЭлементОтбора.ЛевоеЗначение =  Новый ПолеКомпоновкиДанных("ЗаданиеНаОтгрузку.Подразделение")  тогда
		нашли=истина;
		прервать;
	КонецЕсли;
	КонецЦикла;

	Если не нашли тогда
	НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение = КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ЗаданиеНаОтгрузку.Подразделение")).Поле;
    КонецЕсли;
	//НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы[0];
	НовыйЭлементОтбора.ПравоеЗначение = Подразделение;

КонецПроцедуры


Процедура НачДатаПриИзменении(Элемент)
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение.Дата = НачДата;
КонецПроцедуры

Процедура КонДатаПриИзменении(Элемент)
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1].Значение.Дата = КонДата;
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачДата, ?(КонДата='0001-01-01', КонДата, КонецДня(КонДата)));
	Если НастройкаПериода.Редактировать() Тогда
		НачДата = НастройкаПериода.ПолучитьДатуНачала();
		КонДата = НастройкаПериода.ПолучитьДатуОкончания();
		
		НачДатаПриИзменении(неопределено);
		КонДатаПриИзменении(неопределено);

	КонецЕсли;
КонецПроцедуры


Процедура ПодразделениеПриИзменении(Элемент)
	
	нашли=ложь;
	для i=0 по КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество()-1 цикл
	НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Получить(i);
	Если НовыйЭлементОтбора.ЛевоеЗначение =  Новый ПолеКомпоновкиДанных("ЗаданиеНаОтгрузку.Подразделение")  тогда
		нашли=истина;
		прервать;
	КонецЕсли;
	КонецЦикла;

	Если не нашли тогда
	НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение = КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ЗаданиеНаОтгрузку.Подразделение")).Поле;
	КонецЕсли;

    НовыйЭлементОтбора.Использование = не Подразделение.Пустая();
	НовыйЭлементОтбора.ПравоеЗначение = Подразделение;
	
КонецПроцедуры

 
