
Процедура ВыполнитьАнализ() Экспорт
	ТабВрФото =  Новый таблицаЗначений;
	ТабВрФото.Колонки.Добавить("Производитель");
	ТабВрФото.Колонки.Добавить("Моедль");
	ТабВрФото.Колонки.Добавить("Цвет");
	ТабВрФото.Колонки.Добавить("ПустьКФото");
	ТабВрФото.Колонки.Добавить("ДатаПрихода");
	ТабВрФото.Колонки.Добавить("ИмявременногоФото");
	ТабВрФото.Колонки.Добавить("Наличие");

	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВременныеФото.ИмяФото
	|ИЗ
	|	РегистрСведений.ВременныеФото КАК ВременныеФото";
	
	РезультатВр = Запрос.Выполнить().Выгрузить();
	
	
	
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	ОбластьЗаголовок				 			   = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы					           = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока							 	   = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Очистить();
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ОбластьЗаголовок.Параметры.Заголовок = "Анализ наличия фото к моделям дисков на " + Строка(Лев(ТекущаяДата(),10));
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	КовЛитые = новый СписокЗначений;
	КовЛитые.Добавить(Справочники.НоменклатурныеГруппы.НайтиПоКоду("00026")); //литые
	КовЛитые.Добавить(Справочники.НоменклатурныеГруппы.НайтиПоКоду("00022"));  //кованые
	
	//НТТР = Новый HTTPСоединение("photo.yst.ru");
	
	Запрос = Новый Запрос;
	ДатаКон = НачалоДня(ТекущаяДата())- 10*24*60*60 ;
	//Запрос.УстановитьПараметр("USD", Справочники.Валюты.НайтиПоКоду("840"));
	Запрос.УстановитьПараметр("ДатаНач", НачалоГода(ДатаКон));
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон  );
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90166")); //Цвет
	Запрос.УстановитьПараметр("КовЛитые", КовЛитые);
	//Запрос.УстановитьПараметр("Производитель", Производитель); //Цвет
	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(ЗакупкиОбороты.Номенклатура) как Номенклатура,
	|	ЗакупкиОбороты.Номенклатура.Производитель КАК Производитель,
	|	ЗакупкиОбороты.Номенклатура.Модель.Наименование КАК Модель,
	|	ЗначенияСвойствОбъектов.Значение КАК Цвет,
	|	МАКСИМУМ(ЗакупкиОбороты.ПериодДень) КАК ДокументОприходованияДата,
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)) КАК Наличие
	|ИЗ
	|	РегистрНакопления.Закупки.Обороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			Авто,
	|			Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)
	|				И ДокументЗакупки ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|				И Номенклатура.НоменклатурнаяГруппа В (&КовЛитые)) КАК ЗакупкиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ЗакупкиОбороты.Номенклатура = ЗначенияСвойствОбъектов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, НЕ Склад.Транзитный) КАК ТоварыНаСкладахОстатки
	|		ПО ЗакупкиОбороты.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Свойство 
	|
	|СГРУППИРОВАТЬ ПО
//	|	ЗакупкиОбороты.Номенклатура,
	|	ЗакупкиОбороты.Номенклатура.Производитель,
	|	ЗакупкиОбороты.Номенклатура.Модель.Наименование,
	|	ЗначенияСвойствОбъектов.Значение	
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументОприходованияДата";
	
	
	
	Результат = Запрос.Выполнить();
	
	ЕстьДанные = Ложь;
	СтрокаJSONРезультат = "";
	
	Если не  Результат.Пустой() тогда    // получаем файл с именами фоток
		ЕстьДанные = истина;
		
		СтрокаПодключения = "terminal.yst.ru"; 
		порт = 80; 
		ресурс = "/api/productsforautocomplete/GetAllProductsWherePictureExists?producttype=disk&displayAll=true";
		
		//Соединение = Новый HTTPСоединение(СтрокаПодключения+":"+формат(порт,"ЧГ=0"),,"admin","cegthvfhbj" );   //"http://localhost"  50876
		Соединение = Новый HTTPСоединение(СтрокаПодключения,,,);   //"http://localhost"  50876
		Если Соединение = Неопределено Тогда
			сообщить("ОШИБКА при соединении с сервером "+СтрокаПодключения, СтатусСообщения.Внимание);
			Возврат;
		КонецЕсли;
		
		Заголовки = Новый Соответствие();
		АдресРесурса = СтрокаПодключения+ресурс;
		
		ИмяФайлаРезультата = ПолучитьИмяВременногоФайла();
		ЗаголовокHTTP = Новый Соответствие();
		ЗаголовокHTTP.Вставить("Accept","application/txt");
		
		HTTPЗапрос = Новый HTTPЗапрос(ресурс, ЗаголовокHTTP);
		
		HTTPОтвет = Соединение.Получить(HTTPЗапрос,ИмяФайлаРезультата); 		
		
		ТекстовыйФайлОтвет = Новый ТекстовыйДокумент;
		ТекстовыйФайлОтвет.Прочитать(ИмяФайлаРезультата, КодировкаТекста.UTF8);
		СтрокаJSONРезультат = ТекстовыйФайлОтвет.ПолучитьТекст();
		ТекстовыйФайлОтвет = неопределено; // отключается от файла    	
		
		выборка = Результат.Выбрать();
		
		Пока выборка.Следующий() Цикл 				
			
			
			Если HTTPОтвет.КодСостояния = 200 Тогда  		//если коннект удачный
				
				
				Если выборка.Производитель = Справочники.Производители.НайтиПоКоду("65")  //реплика
					ИЛИ выборка.Производитель = Справочники.Производители.НайтиПоКоду("3333") //реплика тд
					ИЛИ выборка.Производитель = Справочники.Производители.НайтиПоКоду("3072") Тогда //реплика уст
					ПутьКФото = "/wheels/legeartis/" + НРег(СокрЛП(выборка.Модель)) + "_" + НРег(СокрЛП(выборка.Цвет)) + ".png";
				Иначе
					ПутьКФото = "/wheels/" + НРег(выборка.Производитель.Наименование) + "/" + НРег(СокрЛП(выборка.Модель)) + "_" + НРег(СокрЛП(выборка.Цвет)) + ".png";
				КонецЕсли;   	
				
				
				//ищем временные фото
				ИмяФото = НРег(СокрЛП(выборка.Модель)) + "_" + НРег(СокрЛП(выборка.Цвет));
				ПутьКФото = "/allwheels/" + ИмяФото + ".png";
				
				ЕстьФото = Найти (СтрокаJSONРезультат,"""" +  выборка.Номенклатура.Код + """") > 0;
				
				СтрокиВР = РезультатВр.НайтиСтроки(Новый Структура("ИмяФото",ИмяФото));
				
				
				ЕСли не ЕстьФото тогда
					
					Если СтрокиВР.Количество()>0 Тогда       //ЕСТЬ временное фото 		
						
						ВрСтрока = ТабВрФото.Добавить();
						ВрСтрока.Производитель = выборка.Производитель;
						ВрСтрока.Моедль = СокрЛП(выборка.Модель);
						ВрСтрока.Цвет = СокрЛП(выборка.Цвет);
						//		ВрСтрока.Номенклатура = ВыборкаЦвет.Номенклатура;
						
						ВрСтрока.Наличие =  ?(выборка.Наличие>0 , "в наличии", "нет");
						
						ВрСтрока.ПустьКФото = "photo.yst.ru" + ПутьКФото;
						//	ВрСтрока.ДатаПрихода = Лев(Выборка.ДокументОприходованияДата,10);
						ВрСтрока.ИмяВременногоФото = ИмяФото;
						
						//нет временного фото
					Иначе 
						ВывестиСтрокуНедостающейФото(ОбластьСтрока,ТабДок,выборка,ПутьКФото);
						
					Конецесли;
					
				иначеЕсли ЕстьФото и СтрокиВР.Количество()>0 тогда ///сервис говорит, что есть фото и во временных есть надо вывести во временные						
					
					ВрСтрока = ТабВрФото.Добавить();
					ВрСтрока.Производитель = выборка.Производитель;
					ВрСтрока.Моедль = СокрЛП(выборка.Модель);
					ВрСтрока.Цвет = СокрЛП(выборка.Цвет);
					//		ВрСтрока.Номенклатура = ВыборкаЦвет.Номенклатура;
					
					ВрСтрока.Наличие =  ?(выборка.Наличие>0 , "в наличии", "нет");
					
					ВрСтрока.ПустьКФото = "photo.yst.ru" + ПутьКФото;
					//	ВрСтрока.ДатаПрихода = Лев(Выборка.ДокументОприходованияДата,10);
					ВрСтрока.ИмяВременногоФото = ИмяФото;								
					
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	
	Если ТабВрФото.Количество()> 0 Тогда
		ОбластьЗаголовокВр = Макет.ПолучитьОбласть("ЗаголовокВр");
		ОбластьЗаголовокВр.Параметры.заголовок = "Диски с временными фото";
		ТабДок.Вывести(ОбластьЗаголовокВр);
		ОбластьШапкаТаблицыВр = Макет.ПолучитьОбласть("ШапкаТаблицыВр");
		ТабДок.Вывести(ОбластьШапкаТаблицыВр);
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаВр");
		Для каждого стр из ТабВрФото Цикл
			ОбластьСтрока.Параметры.Заполнить(Стр);	
			ТабДок.Вывести(ОбластьСтрока);
		конецЦикла;
	конецЕсли;         	
	
	
	Если ЕстьДанные Тогда
		
		Вложение1 = ПолучитьИмяВременногоФайла("xls");
		ТабДок.Записать(Вложение1, ТипФайлаТабличногоДокумента.XLS);
		
		Профиль = Новый ИнтернетПочтовыйПрофиль;
		Профиль.АдресСервераSMTP   = "mail.yst76.ru";
		Профиль.ПортSMTP		   = 25;
		Профиль.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
		Профиль.ПарольSMTP         = "";
		Профиль.ПользовательSMTP   = "";
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Письмо.Отправитель = "no-reply@yst76.ru";
		Письмо.Получатели.Добавить("alekseeva_ae@yst.ru");
		Письмо.Получатели.Добавить("malyshev@yst-group.com");
		Письмо.Получатели.Добавить("content@yst.ru");
//		Письмо.Получатели.Добавить("sharafutdinov@yst.ru");
		
		Письмо.Тема = "Анализ наличия фото на диски";
		Письмо.Вложения.Добавить(Вложение1,"Вложение 1");
		
		Почта = Новый ИнтернетПочта;
		
		Попытка
			Почта.Подключиться(Профиль);
			Почта.Послать(Письмо);
			Почта.Отключиться();
		Исключение
			Пауза(20);
			Почта.Подключиться(Профиль);
			Почта.Послать(Письмо);
			Почта.Отключиться();
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ВывестиСтрокуНедостающейФото(ОбластьСтрока,ТабДок,Выборка,ПутьКФото)
	// Выборка = Выборка.Выбрать();
	//ДатаПриходаНаСклад = Дата(1,1,1);
	//Если Выборка.Следующий() Тогда
	ДатаПриходаНаСклад = Выборка.ДокументОприходованияДата;
	//КонецЕсли;
	Если ДатаПриходаНаСклад = Null Тогда
		ДатаПриходаНаСклад = Дата(1,1,1);
	конецЕсли;	
	ОбластьСтрока.Параметры.Производитель = Выборка.Производитель;
	ОбластьСтрока.Параметры.Моедль = СокрЛП(Выборка.Модель);
	ОбластьСтрока.Параметры.Цвет = СокрЛП(Выборка.Цвет);
	ОбластьСтрока.Параметры.Наличие = ?(Выборка.Наличие>0 , "в наличии", "нет");
	//		ОбластьСтрока.Параметры.Номенклатура = ВыборкаЦвет.Номенклатура;
	//	Расшифровка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Таб = Новый ТаблицаЗначений;
	//Таб.Колонки.Добавить("Код");
	//Таб.Колонки.Добавить("Номенклатура");
	//Таб.Колонки.Добавить("Склад");
	//Таб.Колонки.Добавить("Количество");
	//Пока Расшифровка.Следующий() Цикл
	//	Если Расшифровка.Наличие <> 0 тогда
	//		Ст = Таб.Добавить();
	//		Ст.код      	= Расшифровка.Номенклатура.Код;
	//		Ст.Номенклатура	= Расшифровка.Номенклатура;
	//		Ст.склад 		= Расшифровка.Склад;
	//		Ст.Количество 	= Расшифровка.Наличие;
	//	КонецЕсли;
	//КонецЦикла;
	//ОбластьСтрока.Параметры.Склад = Таб;
	
	ОбластьСтрока.Параметры.ПустьКФото = "photo.yst.ru" + ПутьКФото;
	ОбластьСтрока.Параметры.ДатаПрихода = ?(ДатаПриходаНаСклад =  Дата(1,1,1) , "", Лев(ДатаПриходаНаСклад,10));
	//Если ДатаПриходаНаСклад <> Дата(1,1,1) И ((ТекущаяДата() - ДатаПриходаНаСклад) > 14*86400) Тогда						
	//	
	//	ОбластьСтрока.Области.Строка.ЦветТекста = Новый Цвет(255, 0, 0);
	//Иначе
	//	ОбластьСтрока.Области.Строка.ЦветТекста = Новый Цвет();
	//КонецЕсли;
	ТабДок.Вывести(ОбластьСтрока);
	
	
КонецПроцедуры	


Процедура Пауза(Сек)
	Попытка
		scr = Новый COMОбъект("WScript.Shell");
		scr.Run("sleep "+СокрЛП(Число(Сек)),0,1);
	Исключение
	КонецПопытки;
КонецПроцедуры
