// функции для совместимости кода 
&НаКлиенте
Функция сбисПолучитьФорму(ИмяФормы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Попытка
			ЭтотОбъект="";
		Исключение
		КонецПопытки;
		Возврат ПолучитьФорму("ВнешняяОбработка.СБИС.Форма."+ИмяФормы);
	КонецЕсли;
	Возврат ЭтотОбъект.ПолучитьФорму(ИмяФормы);
КонецФункции
&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы[ИмяЭлемента];
	КонецЕсли;
	Возврат Форма.ЭлементыФормы[ИмяЭлемента];
КонецФункции
&НаКлиенте
Функция сбисПолучитьСтраницу(Элемент, ИмяСтраницы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Элемент.ПодчиненныеЭлементы[ИмяСтраницы];
	КонецЕсли;
	Возврат Элемент.Страницы[ИмяСтраницы];
КонецФункции
//------------------------------------------------------
&НаКлиенте
Функция ОбновитьКонтент(Кэш) Экспорт
// функция обновляет контент для подразделов раздела Продажа	
	//СтруктураДляОбновленияФормы = Кэш.ОбщиеФункции.сбисОбновитьРеестрДокументов1С(Ини, Кэш);
	ИмяРеестра="";	Ини="";
	Если Кэш.Разделы.Справочники.Свойство(Кэш.Текущий.Имя,ИмяРеестра)=Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Кэш.ини.Свойство(ИмяРеестра,Ини)=Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	Кэш.Текущий.ТипДок = ИмяРеестра;
	ГлавноеОкно = Кэш.ГлавноеОкно;
	Контент = сбисЭлементФормы(ГлавноеОкно, "Контент");
	Контент.ТекущаяСтраница = сбисПолучитьСтраницу(Контент, "РеестрСправочников");	
	Кэш.ТаблДок = сбисЭлементФормы(сбисПолучитьФорму("ФормаГлавноеОкно"),"Таблица_РеестрСправочников");
	ПанельМассовыхОпераций = сбисЭлементФормы(ГлавноеОкно,"ПанельМассовыхОпераций");
	Попытка
		ПанельМассовыхОпераций.ТекущаяСтраница = сбисПолучитьСтраницу(ПанельМассовыхОпераций,"Справочники"+Кэш.Текущий.ТипДок);
	Исключение
		сбисЭлементФормы(ГлавноеОкно,"ПанельТулбар").Видимость = Ложь;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(ГлавноеОкно.ТипЦен) Тогда
		Если Кэш.Ини[ИмяРеестра].Свойство("ТипЦенНоменклатуры") Тогда
			ИмяСправочника = СокрЛП(Сред(Кэш.Ини[ИмяРеестра].ТипЦенНоменклатуры.Значение, Найти(Кэш.Ини[ИмяРеестра].ТипЦенНоменклатуры.Значение, ".")+1));
			ТипСправочника = "СправочникСсылка."+ИмяСправочника;
		Иначе
			ТипСправочника = "СправочникСсылка.ТипыЦенНоменклатуры";
		КонецЕсли;
		ОписаниеТипа = Новый ОписаниеТипов(ТипСправочника);
		сбисЭлементФормы(ГлавноеОкно,"ТипЦен").ОграничениеТипа = ОписаниеТипа;
		сбисЭлементФормы(ГлавноеОкно,"ТипЦен").Значение = ОписаниеТипа.ПривестиЗначение();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ГлавноеОкно.ДатаЦен) Тогда
		ГлавноеОкно.ДатаЦен = ТекущаяДата();	
	КонецЕсли;
	
	Если Кэш.Ини.Конфигурация.Свойство("Организации") Тогда
		ИмяСправочника = СокрЛП(Сред(Кэш.Ини.Конфигурация.Организации.Значение, Найти(Кэш.Ини.Конфигурация.Организации.Значение, ".")+1));
		ТипСправочника = "СправочникСсылка."+ИмяСправочника;
	Иначе
		ТипСправочника = "СправочникСсылка.Организации";
	КонецЕсли;
	ОписаниеТипа = Новый ОписаниеТипов(ТипСправочника);
	сбисЭлементФормы(ГлавноеОкно,"ВладелецКаталога").ОграничениеТипа = ОписаниеТипа;
	сбисЭлементФормы(ГлавноеОкно,"ВладелецКаталога").Значение = ОписаниеТипа.ПривестиЗначение();

	ГлавноеОкно.сбисЗаполнитьСписокСправочника(Кэш.Ини[ИмяРеестра]);
	//Возврат СтруктураДляОбновленияФормы;
КонецФункции
&НаКлиенте
Процедура НавигацияУстановитьПанель() Экспорт
// Процедура устанавливает панель навигации на 1ую страницу и скрывает панель	
	ГлавноеОкно = сбисПолучитьФорму("ФормаГлавноеОкно");
	ГлавноеОкно.ФильтрСтраница=1;
	сбисЭлементФормы(ГлавноеОкно,"ПанельНавигации").Видимость=Ложь;
	сбисЭлементФормы(ГлавноеОкно,"ЗаписейНаСтранице1С").Видимость=Ложь;
	сбисЭлементФормы(ГлавноеОкно,"ЗаписейНаСтранице").Видимость=Ложь;
КонецПроцедуры
&НаКлиенте
Процедура НаСменуРаздела(Кэш) Экспорт
КонецПроцедуры
