
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Для каждого стр из Отчет Цикл
		Нов = РегистрыСведений.ВыплатыПеревозчикам.СоздатьМенеджерЗаписи();
		нов.период = Дата1;
		нов.Контрагент = стр.Контрагент;
		нов.Активность = Истина;
		нов.Сумма = стр.Выплатить;
		Нов.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура КоманднаяПанель1Сформировать(Кнопка)
	
	Если ЗначениеНеЗаполнено(Дата1) Тогда
		Сообщить("Заполните дату!!!");
		Возврат;
	КонецЕсли;
	список = Новый СписокЗначений;
	список.Добавить(Справочники.ТипыДоговоров.ФормулаАвтоПлюс);
	список.Добавить(Справочники.ТипыДоговоров.НайтиПоКоду("Я0004"));
	список.Добавить(Справочники.ТипыДоговоров.ШинтрейдЯрославль);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Перевозчик (Для отчета)"));
	Запрос.УстановитьПараметр("СПокупателем",Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	Запрос.УстановитьПараметр("СПоставщиком",Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	Запрос.УстановитьПараметр("Список",список);
	Запрос.УстановитьПараметр("Дата1",Дата1);
	запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияСвойствОбъектов.Объект
	               |ПОМЕСТИТЬ Перевозчики
	               |ИЗ
	               |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |ГДЕ
	               |	ЗначенияСвойствОбъектов.Свойство = &свойство
	               |	И ЗначенияСвойствОбъектов.Значение = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Владелец КАК Контрагент,
	               |	СУММА(-ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток) КАК Сумма
	               |ПОМЕСТИТЬ КакПоставщик
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	               |			,
	               |			ДоговорКонтрагента.ВидДоговора = &СПоставщиком
	               |				И НЕ ДоговорКонтрагента.Наименование ПОДОБНО ""%(НП)%""
	               |				И НЕ ДоговорКонтрагента.Наименование ПОДОБНО ""%*%""
	               |				И НЕ ДоговорКонтрагента.ТипДоговора В (&список)) КАК ВзаиморасчетыСКонтрагентамиОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Владелец
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Владелец КАК Контрагент,
	               |	СУММА(-ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток) КАК Сумма
	               |ПОМЕСТИТЬ КакПоставщикНП
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	               |			,
	               |			ДоговорКонтрагента.ВидДоговора = &СПоставщиком
	               |				И ДоговорКонтрагента.Наименование ПОДОБНО ""%(НП)%""
	               |				И НЕ (ДоговорКонтрагента.Наименование ПОДОБНО ""%*%""
	               |				Или ДоговорКонтрагента.Наименование ПОДОБНО ""%ФА%""
	               |				Или ДоговорКонтрагента.Наименование ПОДОБНО ""%fa%""
	               |				Или ДоговорКонтрагента.ТипДоговора В (&список))) КАК ВзаиморасчетыСКонтрагентамиОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Владелец
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Владелец КАК Контрагент,
	               |	СУММА(ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток) КАК Сумма
	               |ПОМЕСТИТЬ КакПокупатель
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	               |			,
	               |			ДоговорКонтрагента.ВидДоговора = &СПокупателем
	               |				И НЕ (ДоговорКонтрагента.Наименование ПОДОБНО ""%(НП)%""
	               |				Или ДоговорКонтрагента.Наименование ПОДОБНО ""%*%""
	               |				Или ДоговорКонтрагента.ТипДоговора В (&список))) КАК ВзаиморасчетыСКонтрагентамиОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Владелец
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВыплатыПеревозчикам.Контрагент,
	               |	СУММА(ВыплатыПеревозчикам.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ Выплаты
	               |ИЗ
	               |	РегистрСведений.ВыплатыПеревозчикам КАК ВыплатыПеревозчикам
	               |ГДЕ
	               |	ВыплатыПеревозчикам.Период = &дата1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВыплатыПеревозчикам.Контрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Перевозчики.Объект КАК Перевозчик,
	               |	КакПоставщик.Сумма КАК СуммаДолгаЗаПеревозки,
	               |	КакПокупатель.Сумма КАК СуммаДолгаЗаТовар,
	               |	ЕСТЬNULL(КакПоставщик.Сумма, 0) - ЕСТЬNULL(КакПокупатель.Сумма, 0) КАК Дельта,
	               |	Выплаты.Сумма КАК Выплатить,
	               |	КакПоставщикНП.Сумма КАК СуммаДолгаЗаПеревозкиНП
	               |ИЗ
	               |	Перевозчики КАК Перевозчики
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КакПоставщик КАК КакПоставщик
	               |		ПО Перевозчики.Объект = КакПоставщик.Контрагент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КакПокупатель КАК КакПокупатель
	               |		ПО Перевозчики.Объект = КакПокупатель.Контрагент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Выплаты КАК Выплаты
	               |		ПО Перевозчики.Объект = Выплаты.Контрагент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КакПоставщикНП КАК КакПоставщикНП
	               |		ПО Перевозчики.Объект = КакПоставщикНП.Контрагент";
				   
	Рез = Запрос.Выполнить().Выгрузить();
	
	Отчет.Очистить();
	
	Для каждого стр из Рез Цикл
		Нов = Отчет.Добавить();
		Нов.Контрагент = стр.Перевозчик;
		Нов.ЗадолженностьПеревозчикам = стр.СуммаДолгаЗаПеревозки;
		Нов.ЗадолженностьНП = стр.СуммаДолгаЗаПеревозкиНП;
		Нов.ЗадолженностьЗаТовар = стр.СуммаДолгаЗаТовар;
		Нов.Дельта = стр.Дельта;
		Нов.Выплатить = стр.Выплатить;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриОткрытии()
	Дата1 = ТекущаяДата();
КонецПроцедуры


Процедура ОтчетЗадолженностьПеревозчикамОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	отчетП = Отчеты.ВедомостьВзаиморасчетыСКонтрагентами.Создать();
	отчетП.ЗаполнитьНачальныеНастройки();
	отчетП.ОбщийОтчет.ДатаНач  = НачалоМесяца(ТекущаяДата());
	отчетП.ОбщийОтчет.ДатаКон  = ТекущаяДата();
	отчетП.ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке  = Истина;
	построитель = отчетП.ПолучитьПостроительОтчета();
	//ИзмеренияПостроителяОтчета
	
	Построитель.ИзмеренияСтроки.очистить();
	
	Построитель.ИзмеренияСтроки.Добавить("Контрагент");
	//Построитель.ИзмеренияСтроки.Добавить("Сделка");
	
	Построитель.ВыбранныеПоля.Очистить();
	
	Построитель.ВыбранныеПоля.Добавить("Регистратор");
	
	//Построитель.ИзмеренияСтроки.Добавить("Регистратор");
	
	
	построитель.Отбор.Контрагент.ВидСравнения = ВидСравнения.Равно;
	построитель.Отбор.Контрагент.Значение = ЭлементыФормы.Отчет.ТекущиеДанные.Контрагент;
	построитель.Отбор.Контрагент.Использование = Истина;
	
	построитель.Отбор.Добавить("ДоговорКонтрагента.Наименование");
	построитель.Отбор.ДоговорКонтрагентаНаименование.ВидСравнения = ВидСравнения.НеСодержит;
	построитель.Отбор.ДоговорКонтрагентаНаименование.Значение = "НП";
	построитель.Отбор.ДоговорКонтрагентаНаименование.Использование = Истина;
	
	построитель.Отбор.Добавить("ДоговорКонтрагента.Наименование");
	построитель.Отбор[3].ВидСравнения = ВидСравнения.НеСодержит;
	построитель.Отбор[3].Значение = "*";
	построитель.Отбор[3].Использование = Истина;
	
	построитель.Отбор.Добавить("ДоговорКонтрагента.ВидДоговора");
	построитель.Отбор.ДоговорКонтрагентаВидДоговора.ВидСравнения = ВидСравнения.Равно;
	построитель.Отбор.ДоговорКонтрагентаВидДоговора.Значение = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	построитель.Отбор.ДоговорКонтрагентаВидДоговора.Использование = Истина;
	
	список = Новый СписокЗначений;
	список.Добавить(Справочники.ТипыДоговоров.ФормулаАвтоПлюс);
	список.Добавить(Справочники.ТипыДоговоров.НайтиПоКоду("Я0004"));
	список.Добавить(Справочники.ТипыДоговоров.ШинтрейдЯрославль);
	
	построитель.Отбор.Добавить("ДоговорКонтрагента.ТипДоговора");
	построитель.Отбор.ДоговорКонтрагентаТипДоговора.ВидСравнения = ВидСравнения.НеВСписке;
	построитель.Отбор.ДоговорКонтрагентаТипДоговора.Значение = список;
	построитель.Отбор.ДоговорКонтрагентаТипДоговора.Использование = Истина;
	
	ф = отчетП.ПолучитьОсновнуюФорму();
	ф.ОбновитьОтчет();
	ф.открыть();
	
КонецПроцедуры


Процедура ОтчетЗадолженностьЗаТоварОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	отчетП = Отчеты.ВедомостьВзаиморасчетыСКонтрагентами.Создать();
	отчетП.ЗаполнитьНачальныеНастройки();
	отчетП.ОбщийОтчет.ДатаНач  = НачалоМесяца(ТекущаяДата());
	отчетП.ОбщийОтчет.ДатаКон  = ТекущаяДата();
	отчетП.ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке  = Истина;
	построитель = отчетП.ПолучитьПостроительОтчета();
	//ИзмеренияПостроителяОтчета
	
	Построитель.ИзмеренияСтроки.очистить();
	
	Построитель.ИзмеренияСтроки.Добавить("Контрагент");
	//Построитель.ИзмеренияСтроки.Добавить("Сделка");
	
	Построитель.ВыбранныеПоля.Очистить();
	
	Построитель.ВыбранныеПоля.Добавить("Регистратор");
	
	//Построитель.ИзмеренияСтроки.Добавить("Регистратор");
	
	
	построитель.Отбор.Контрагент.ВидСравнения = ВидСравнения.Равно;
	построитель.Отбор.Контрагент.Значение = ЭлементыФормы.Отчет.ТекущиеДанные.Контрагент;
	построитель.Отбор.Контрагент.Использование = Истина;
	
	построитель.Отбор.Добавить("ДоговорКонтрагента.Наименование");
	построитель.Отбор.ДоговорКонтрагентаНаименование.ВидСравнения = ВидСравнения.НеСодержит;
	построитель.Отбор.ДоговорКонтрагентаНаименование.Значение = "НП";
	построитель.Отбор.ДоговорКонтрагентаНаименование.Использование = Истина;
	
	построитель.Отбор.Добавить("ДоговорКонтрагента.Наименование");
	построитель.Отбор[3].ВидСравнения = ВидСравнения.НеСодержит;
	построитель.Отбор[3].Значение = "*";
	построитель.Отбор[3].Использование = Истина;
	
	построитель.Отбор.Добавить("ДоговорКонтрагента.ВидДоговора");
	построитель.Отбор.ДоговорКонтрагентаВидДоговора.ВидСравнения = ВидСравнения.Равно;
	построитель.Отбор.ДоговорКонтрагентаВидДоговора.Значение = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	построитель.Отбор.ДоговорКонтрагентаВидДоговора.Использование = Истина;
	
	список = Новый СписокЗначений;
	список.Добавить(Справочники.ТипыДоговоров.ФормулаАвтоПлюс);
	список.Добавить(Справочники.ТипыДоговоров.НайтиПоКоду("Я0004"));
	список.Добавить(Справочники.ТипыДоговоров.ШинтрейдЯрославль);
	
	построитель.Отбор.Добавить("ДоговорКонтрагента.ТипДоговора");
	построитель.Отбор.ДоговорКонтрагентаТипДоговора.ВидСравнения = ВидСравнения.НеВСписке;
	построитель.Отбор.ДоговорКонтрагентаТипДоговора.Значение = список;
	построитель.Отбор.ДоговорКонтрагентаТипДоговора.Использование = Истина;
	
	ф = отчетП.ПолучитьОсновнуюФорму();
	ф.ОбновитьОтчет();
	ф.открыть();

КонецПроцедуры


Процедура ОтчетЗадолженностьНПОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	отчетП = Отчеты.ВедомостьВзаиморасчетыСКонтрагентами.Создать();
	отчетП.ЗаполнитьНачальныеНастройки();
	отчетП.ОбщийОтчет.ДатаНач  = НачалоМесяца(ТекущаяДата());
	отчетП.ОбщийОтчет.ДатаКон  = ТекущаяДата();
	отчетП.ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке  = Истина;
	построитель = отчетП.ПолучитьПостроительОтчета();
	//ИзмеренияПостроителяОтчета
	
	Построитель.ИзмеренияСтроки.очистить();
	
	Построитель.ИзмеренияСтроки.Добавить("Контрагент");
	//Построитель.ИзмеренияСтроки.Добавить("Сделка");
	
	Построитель.ВыбранныеПоля.Очистить();
	
	Построитель.ВыбранныеПоля.Добавить("Регистратор");
	
	//Построитель.ИзмеренияСтроки.Добавить("Регистратор");
	
	
	построитель.Отбор.Контрагент.ВидСравнения = ВидСравнения.Равно;
	построитель.Отбор.Контрагент.Значение = ЭлементыФормы.Отчет.ТекущиеДанные.Контрагент;
	построитель.Отбор.Контрагент.Использование = Истина;
	
	построитель.Отбор.Добавить("ДоговорКонтрагента.Наименование");
	построитель.Отбор.ДоговорКонтрагентаНаименование.ВидСравнения = ВидСравнения.Содержит;
	построитель.Отбор.ДоговорКонтрагентаНаименование.Значение = "НП";
	построитель.Отбор.ДоговорКонтрагентаНаименование.Использование = Истина;
	
	построитель.Отбор.Добавить("ДоговорКонтрагента.Наименование");
	построитель.Отбор[3].ВидСравнения = ВидСравнения.НеСодержит;
	построитель.Отбор[3].Значение = "*";
	построитель.Отбор[3].Использование = Истина;
	
	построитель.Отбор.Добавить("ДоговорКонтрагента.Наименование");
	построитель.Отбор[4].ВидСравнения = ВидСравнения.НеСодержит;
	построитель.Отбор[4].Значение = "ФА";
	построитель.Отбор[4].Использование = Истина;
	
	построитель.Отбор.Добавить("ДоговорКонтрагента.Наименование");
	построитель.Отбор[5].ВидСравнения = ВидСравнения.НеСодержит;
	построитель.Отбор[5].Значение = "fa";
	построитель.Отбор[5].Использование = Истина;
	
	построитель.Отбор.Добавить("ДоговорКонтрагента.ВидДоговора");
	построитель.Отбор.ДоговорКонтрагентаВидДоговора.ВидСравнения = ВидСравнения.Равно;
	построитель.Отбор.ДоговорКонтрагентаВидДоговора.Значение = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	построитель.Отбор.ДоговорКонтрагентаВидДоговора.Использование = Истина;
	
	список = Новый СписокЗначений;
	список.Добавить(Справочники.ТипыДоговоров.ФормулаАвтоПлюс);
	список.Добавить(Справочники.ТипыДоговоров.НайтиПоКоду("Я0004"));
	список.Добавить(Справочники.ТипыДоговоров.ШинтрейдЯрославль);
	
	построитель.Отбор.Добавить("ДоговорКонтрагента.ТипДоговора");
	построитель.Отбор.ДоговорКонтрагентаТипДоговора.ВидСравнения = ВидСравнения.НеВСписке;
	построитель.Отбор.ДоговорКонтрагентаТипДоговора.Значение = список;
	построитель.Отбор.ДоговорКонтрагентаТипДоговора.Использование = Истина;
	
	ф = отчетП.ПолучитьОсновнуюФорму();
	ф.ОбновитьОтчет();
	ф.открыть();

КонецПроцедуры

