Функция Печать() Экспорт
	
	Если Не Метаданные.Имя = "УправлениеТорговлей" Тогда
		Сообщить("Печатная форма предназначена для использования в конфигурации ""Управление торговлей""", СтатусСообщения.Внимание);
	КонецЕсли;
	
	
		Возврат ПечатьПоступления(СсылкаНаОбъект);
	
	
КонецФункции // Печать


Функция ПечатьПоступления (СсылкаНаОбъект) Экспорт
	ТабДок=Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ОтчетПоступление");
	Запрос = Новый Запрос;
	
Тип = СсылкаНаОбъект.Метаданные().Имя;
СписокПроизводителей = новый СписокЗначений;
СписокПроизводителей.Добавить(Справочники.Производители.НайтиПоКоду("65"));
СписокПроизводителей.Добавить(Справочники.Производители.НайтиПоКоду("3333"));


	Запрос.Текст = 
	"ВЫБРАТЬ
	|	А.НомерСтроки,
	|	А.Код,
	|	А.Номенклатура,
	|	А.Количество,
	|	А.КодСБИС,
	|	А.КодКрышки,
	|	А.Комплектующая,
	|	ТоварыНаСкладах.КоличествоОстаток КАК ОстатокКрышек,
	|	ЕстьNULL(ПроверенныеКрышки.Значение,Ложь) КАК Проверена
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступлениеТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	|		ПоступлениеТоваровУслугТовары.Номенклатура.Код КАК Код,
	|		ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|		ПоступлениеТоваровУслугТовары.Количество КАК Количество,
	|		Комплектующие.Комплектующая.КодСБИС КАК КодСБИС,
	|		Комплектующие.Комплектующая.Код КАК КодКрышки,
	|		Комплектующие.Комплектующая КАК Комплектующая
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ЗаказПоставщикуСезонныйТовары.НомерСтроки КАК НомерСтроки,
	|			ЗаказПоставщикуСезонныйТовары.Номенклатура КАК Номенклатура,
	|			ЗаказПоставщикуСезонныйТовары.Количество КАК Количество
	|		ИЗ
	|			Документ.ЗаказПоставщикуСезонный.Товары КАК ЗаказПоставщикуСезонныйТовары
	|		ГДЕ
	|			ЗаказПоставщикуСезонныйТовары.Ссылка = &Ссылка
	|			И ЗаказПоставщикуСезонныйТовары.Номенклатура.Производитель В(&СписокПроизводителей)
	|			И ЗаказПоставщикуСезонныйТовары.Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)) КАК ПоступлениеТоваровУслугТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				КомплектующиеНоменклатуры.Номенклатура КАК Номенклатура,
	|				КомплектующиеНоменклатуры.Комплектующая КАК Комплектующая
	|			ИЗ
	|				РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	|			ГДЕ
	|				КомплектующиеНоменклатуры.Номенклатура В
	|						(ВЫБРАТЬ
	|							Документ."+Тип+".Товары.Номенклатура
	|						ИЗ
	|							Документ."+Тип+".Товары
	|						ГДЕ
	|							Документ."+Тип+".Товары.Ссылка = &Ссылка
	|							И Документ."+Тип+".Товары.Номенклатура.Производитель В (&СписокПроизводителей)
	|							И Документ."+Тип+".Товары.Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски))
	|				И КомплектующиеНоменклатуры.Комплектующая В ИЕРАРХИИ(&Крышки)) КАК Комплектующие
	|			ПО ПоступлениеТоваровУслугТовары.Номенклатура = Комплектующие.Номенклатура) КАК А
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура В ИЕРАРХИИ (&Крышки)) КАК ТоварыНаСкладах
	|		ПО А.Комплектующая = ТоварыНаСкладах.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияСвойствОбъектов.Объект КАК Объект,
	|			ЗначенияСвойствОбъектов.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ГДЕ
	|			ЗначенияСвойствОбъектов.Свойство = &Свойство
	|			И ЗначенияСвойствОбъектов.Значение = ИСТИНА) КАК ПроверенныеКрышки
	|		ПО А.Номенклатура = ПроверенныеКрышки.Объект
	|	УПОРЯДОЧИТЬ ПО
	|Значение Возр,
	|Комплектующая";

	Запрос.УстановитьПараметр("СписокПроизводителей", СписокПроизводителей);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90170"));//Крышки проверены
	Запрос.УстановитьПараметр("Крышки", Справочники.Номенклатура.НайтиПоКоду("0080004"));

	Результат = Запрос.Выполнить();

	
	ОбластьЗаголовок= Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ЗаголовокДокумента="Заказ поставщику №" +  СсылкаНаОбъект.Номер +" от "+Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy") +". Покупатель: "+СсылкаНаОбъект.Контрагент.Наименование;
	ОбластьЗаголовок.Параметры.НомерКонтейнера=СсылкаНаОбъект.Комментарий;
	ОбластьШапка= Макет.ПолучитьОбласть("Шапка");
	
	
	ТабДок.Очистить();

	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапка);
	
	ВыборкаДетали = Результат.Выбрать();

	
	Пока ВыборкаДетали.Следующий() Цикл
		ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
		ОбластьДетальныхЗаписей.Параметры.Проверена=?(не ВыборкаДетали.Проверена,"*","");
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла;
	
	
    Возврат ТабДок;
	КонецФункции