
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр БонусыКонтрагентов Приход
	//Движения.БонусыКонтрагентов.Записывать = Истина;
	//Движения.БонусыКонтрагентов.Очистить();
	//Для Каждого ТекСтрокаБонусы Из Бонусы Цикл
	//	Движение = Движения.БонусыКонтрагентов.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.Контрагент = Контрагент;
	//	Движение.Номенклатура = ТекСтрокаБонусы.Номенклатура;
	//	Движение.Сделка = ТекСтрокаБонусы.Сделка;
	//	Движение.Количество = ТекСтрокаБонусы.Количество;
	//	Движение.Сумма = ТекСтрокаБонусы.Сумма;
	//	Движение.СуммаБонуса = ТекСтрокаБонусы.СуммаБонуса;
	//КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
 