
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
ПараметрСКД.Использование = истина ;
ПараметрСКД.Значение  =КонецДня(Период);

ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ГруппаАксы"));
ПараметрСКД.Использование = истина ;
ПараметрСКД.Значение  =Справочники.номенклатурныеГруппы.НайтиПоКоду("Ф0070");

ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Аксы"));
ПараметрСКД.Использование = истина ;
ПараметрСКД.Значение  =Справочники.номенклатурныеГруппы.НайтиПоКоду("00073");

КонецПроцедуры

процедура Заполнить(НачПериода,КонПериода) экспорт
	нд = КонецДня(НачПериода);
	пока НД <= КонецДня(КонПериода) цикл
		
		
		ТабНомН= Новый ТаблицаЗначений;
		текСхема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		текСхема.Параметры.Период.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		текСхема.Параметры.Период.Значение = нд;
		текСхема.Параметры.ГруппаАксы.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		текСхема.Параметры.ГруппаАксы.Значение = Справочники.номенклатурныеГруппы.НайтиПоКоду("Ф0070");
		текСхема.Параметры.Аксы.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		текСхема.Параметры.Аксы.Значение = Справочники.номенклатурныеГруппы.НайтиПоКоду("00073");
		
		//ПараметрСКД = текСхема.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
		//ПараметрСКД.Использование = истина ;
		//ПараметрСКД.Значение  =КонецДня(Период);
		
		
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(текСхема,текСхема.НастройкиПоУмолчанию, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(ТабНомН);// выгружать в таблицу значений
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Ложь);
		
		//очистим все данные за это число
		
		наборЗаписей = РегистрыСведений.ДеньгиВТоварныхГруппах.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(НачалоДня(НД));
		наборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		наборЗаписей.Записать();	
		//НаборЗаписей.Отбор.
		
		
		Для каждого стр из ТабНомН цикл
			Запись = РегистрыСведений.ДеньгиВТоварныхГруппах.СоздатьМенеджерЗаписи();
			Запись.Период = НД;
			Запись.НоменклатурнаяГруппа = стр.НоменклатурнаяГруппа;
			Запись.Сумма = стр.сумма;
			Запись.Записать(Истина);
		конецЦикла;	
		Сообщить(НД);
		нд = нд+24*60*60;
		
	конецЦикла;	
конецпроцедуры	