функция СтрокаВСписок(строка1) Экспорт
	списЗнач = новый СписокЗначений;
	строка0 = строка1;
	Если строка0="" тогда
		возврат списЗнач;
	КонецЕсли;
	Кол = стрЧислоВхождений(строка0, ";") + 1;
	i = Найти(строка0,";"); L = стрДлина(строка0);
	пока i>0 цикл
		списЗнач.Добавить( Лев(строка0, i-1) ); 
		строка0 = прав(строка0, L-i);
		i = Найти(строка0,";"); L = стрДлина(строка0);
	КонецЦикла;	
	списЗнач.Добавить(строка0); // Единственная или последняя

	возврат списЗнач;
	
КонецФункции	


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ВидОперации=Перечисления.ВидыОперацийПолитикаЦенообразования.АвтоматическийРасчетЦен Тогда
		Движение = Движения.ПолитикаЦенообразованияКонтрагентов.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.ПолитикаЦенообразования = Ссылка;
	КонецЕсли;

КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Проверка: ТипЦЕн должен быть обязательно указан
	Для каждого Правило ИЗ Правила Цикл
		Если Найти(ВРЕГ(Правило.Правило),"ТИПЦЕН")=0 Тогда
			СообщитьОбОшибке ("В строке №"+ Строка(Правило.НомерСтроки) +" не указано условие ТипЦен",Отказ);
		КонецЕсли;	
	КонецЦикла;	
	
	Для каждого Параметр ИЗ Параметры Цикл
		Если ЗначениеНеЗаполнено(Параметр.ИмяПараметра)  Тогда
			СообщитьОбОшибке ("В строке №"+ Строка(Параметр.НомерСтроки) +" не указано имя параметра",Отказ);
		КонецЕсли;
		
		Если ЗначениеНеЗаполнено(Параметр.ЗначениеПараметра)  Тогда
			СообщитьОбОшибке ("В строке №"+ Строка(Параметр.НомерСтроки) +" не указано значение параметра",Отказ);
		КонецЕсли;
	КонецЦикла;	
	
	Если Не Отказ Тогда
		ТекстЗапросаДляВставкиЦена="ВЫБОР ";
		Для сч=0 по Правила.Количество()-1 Цикл
			ТекстЗапросаДляВставкиЦена=ТекстЗапросаДляВставкиЦена+ " КОГДА " + Правила[сч].Правило + " ТОГДА " + Правила[сч].ОтпускнаяЦена;
		КонецЦикла;
		ТекстЗапросаДляВставкиЦена=ТекстЗапросаДляВставкиЦена+" ИНАЧЕ 0 КОНЕЦ МинимальнаяЦена " ;
		
		ТекстЗапросаДляВставкиПриоритет="ВЫБОР ";
		Для сч=0 по Правила.Количество()-1 Цикл
			ТекстЗапросаДляВставкиПриоритет=ТекстЗапросаДляВставкиПриоритет+ " КОГДА " + Правила[сч].Правило + " ТОГДА " + Правила[сч].НомерСтроки;
		КонецЦикла;
		ТекстЗапросаДляВставкиПриоритет=ТекстЗапросаДляВставкиПриоритет+" ИНАЧЕ 1000 КОНЕЦ Приоритет " ;
		
		ПолныйТекстЗапроса = ТекстЗапросаДляВставкиЦена+ ", "+ТекстЗапросаДляВставкиПриоритет;
	КонецЕсли;


	
КонецПроцедуры

