ФУНКЦИЯ Печать() ЭКСПОРТ
	
		#Если Клиент тогда
		ОчиститьСообщения();
		#КонецЕсли	
	
	Если СсылкаНаОбъект.Товары.Количество()=0 Тогда
		#Если Клиент тогда
		Сообщить(нстр("ru=""Нет товаров для печати!"";
					  |en=""No goods for printing!""") );
		#КонецЕсли	
		Возврат неопределено;
	КонецЕсли;	
	
	Если СсылкаНаОбъект.Ссылка.Пустая() Тогда
		#Если Клиент тогда
		Сообщить(нстр("ru=""Для печати необходимо предварительно записать Документ!"";
					  |en=""For the printing it is necessary to write down the Document previously!""") );
		#КонецЕсли	
		Возврат неопределено;
	КонецЕсли;		
	
	ТабДок = ПечатьPACKING();
	//Если не ТабДок=Неопределено Тогда
	//	ТабДок.Защита = Истина;
	//	ТабДок.ТолькоПросмотр = Истина;
	// 	ТабДок.Показать();
	//КонецЕсли;
   возврат ТабДок;
   
КонецФункции


Функция ПечатьPACKING(ИмяМакета="PACKING")
		
	ТабДок=Новый ТабличныйДокумент;
	Макет =ЭтотОбъект.ПолучитьМакет(ИмяМакета); 
	
	ОбластьШапка= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.КонтрагентНаименование = ?(СокрЛП(СсылкаНаОбъект.Контрагент.Код)="91535", "JIANGSU SAINTY MACHINERY IMP. & EXP. CORP., LTD",
						СокрЛП(СсылкаНаОбъект.Контрагент.НаименованиеПолное) );
	                                                                       //Freeman = 91735
	ОбластьШапка.Параметры.ФактАдресПродавца = ?(СокрЛП(СсылкаНаОбъект.Контрагент.Код)="91735","Rm1502 Zhongning Bld No.255 Lingqiao Rd Ningbo China
	|1502 Жонгнинг, строение 255, Лингквиао Рд, Нингбо, Китай"	, 
	      ?(СокрЛП(СсылкаНаОбъект.Контрагент.Код)="91535","BUILDING C, 21TH RUANJIAN AVE, NANJING, CHINA
	|строение 21, Руанджиан Аве, Нанджинг, Китай", 
	     ?(СокрЛП(СсылкаНаОбъект.Контрагент.Код) = "93694","China, Fujian Province, Zhangzhou Jingcheng High-tech industrial Zone, Nanjihg Couty"
	   ,"") )  									);
	
//ОбластьШапка.Параметры.Договор =СокрЛП(СсылкаНаОбъект.ДополнительныеПоля[13].ЗначениеПоля);
	ОбластьШапка.Параметры.Договор = СсылкаНаОбъект.ДоговорКонтрагента.Номер+" "+Формат(СсылкаНаОбъект.ДоговорКонтрагента.Дата,"ДЛФ=D"); 
	
	Если Найти(врег(СсылкаНаОбъект.Товары[0].Номенклатура.Производитель.Наименование), "TREBL") > 0 
		ИЛИ Найти(врег(СсылкаНаОбъект.Товары[0].Номенклатура.Производитель.Наименование), "ARRIVO") > 0 
		ИЛИ Найти(врег(СсылкаНаОбъект.Товары[0].Номенклатура.Производитель.Наименование), "SDT") > 0 
		ИЛИ Найти(врег(СсылкаНаОбъект.Товары[0].Номенклатура.Производитель.Наименование), "STEGER") > 0 
		Тогда
		ОбластьШапка.Параметры.TYPE = "STEEL";
		ОбластьШапка.Параметры.тип = "стальные";
	Иначе
		ОбластьШапка.Параметры.TYPE = "ALLOY";
		ОбластьШапка.Параметры.тип = "алюминиевые";
	КонецЕсли;

//	ОбластьШапка.Параметры.ДатаДокумента  = Формат(СсылкаНаОбъект.Дата,"ДЛФ=D");
	ОбластьШапка.Параметры.ДатаДокумента2 = Формат( ДобавитьМесяц(СсылкаНаОбъект.Дата, -2) ,"ДЛФ=D");  //спецификация на 2 месяца раньше!
	ОбластьШапка.Параметры.Номер = формат( число( Прав(СсылкаНаОбъект.Номер, стрДлина(СсылкаНаОбъект.Номер)-2) ), "ЧГ=0"); // без префикса
	
	//+++ 18.03.2014
	ОбластьШапка.Параметры.НомерКонтейнера = СокрЛП(СсылкаНаОбъект.НомерКонтейнера); 
	ОбластьШапка.Параметры.НомерДок = СокрЛП(СсылкаНаОбъект.Номер); 
	
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьШапкаТабл = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДок.Вывести(ОбластьШапкаТабл);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
//-------------------Цикл по товарам---------------------------------------	
ВесИтого=0; ВесНеттоИтого=0; ОбъемИтого=0;КомплКоличествоИтого=0;
	ФиксВесУпаковкиОдинКг = ( СокрЛП(СсылкаНаОбъект.Контрагент.Код)="91535" )  //Jiangsu
						или ( СокрЛП(СсылкаНаОбъект.Контрагент.Код)="91735" )  //Freeman 
						или ( СокрЛП(СсылкаНаОбъект.Контрагент.Код)="93695" ); //Ningbo
	
для каждого стр1 из СсылкаНаОбъект.Товары цикл
	 
	 ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, стр1);
	 
	 ОбластьСтрока.Параметры.Код 		  = стр1.Номенклатура.Код;
	 ОбластьСтрока.Параметры.Номенклатура = стр1.Номенклатура.НаименованиеПолное;
	 Если СсылкаНаОбъект.Контрагент.ИНН = "2465072918"   // СКАД ЛМЗ
		 или СсылкаНаОбъект.Контрагент.ИНН = "2465051731"// 24.10.2018 - КиК
		 тогда
		 ОбластьСтрока.Параметры.Артикул = стр1.Номенклатура.Артикул;
	 КонецЕсли;
	 
	 Если ИмяМакета="PACKING" тогда
		 парам1   = стр1.Номенклатура.Типоразмер;
		 
		 Вес      = стр1.ЕдиницаИзмерения.Вес * стр1.Количество;
		     ДваВОдном = стр1.КоличествоМест/стр1.Количество;
		 ВесНетто = Вес - ВесУпаковки(парам1, ФиксВесУпаковкиОдинКг) * стр1.Количество * ?(ДваВОдном=0,1,ДваВОдном); 
		// Объем    = ВычислитьОбъемНоменклатуры(стр1.Номенклатура) * стр1.Количество;
		
		//болты и гайки только для Replica
		 КомплКоличество = ?(Найти(врег(стр1.Номенклатура.Производитель.Наименование),"REPLICA")=0, 0,
		 							число(стр1.Номенклатура.Типоразмер.КоличествоОтверстий) );
		 
	 	ОбластьСтрока.Параметры.Вес		   = Вес; // Брутто
		ОбластьСтрока.Параметры.ВесНетто   = ?(ВесНетто<0, 0 , ВесНетто);  
	 	//ОбластьСтрока.Параметры.Объем      = Объем;
		
		ОбластьСтрока.Параметры.ШтрихКод   =  ПолучитьШтрихКодЯШТ(стр1.Номенклатура.Код);
		
		//ОбластьСтрока.Параметры.КомплКоличество = КомплКоличество;
		//
		
		
		ВесИтого = ВесИтого + Вес;  
		ВесНеттоИтого=ВесНеттоИтого+ВесНетто;
		//ОбъемИтого=ОбъемИтого+Объем;
		
		КомплКоличествоИтого = КомплКоличествоИтого + КомплКоличество;
	 КонецЕсли;
	 
	 ТабДок.Вывести(ОбластьСтрока);
 КонецЦикла;
 
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	 ОбластьИтого.Параметры.Количество 		= СсылкаНаОбъект.Товары.Итог("Количество");
	 
	Если ИмяМакета="INVOICE" тогда
	 ОбластьИтого.Параметры.Сумма			= СсылкаНаОбъект.Товары.Итог("Сумма");
 	ИначеЕсли ИмяМакета="PACKING" тогда
	  ОбластьИтого.Параметры.КоличествоМест  = СсылкаНаОбъект.Товары.Итог("КоличествоМест");
	  ОбластьИтого.Параметры.Вес 	   = ВесИтого;
	  ОбластьИтого.Параметры.ВесНетто  = ВесНеттоИтого; 
	//  ОбластьИтого.Параметры.Объем     = ОбъемИтого;
	 ОбластьИтого.Параметры.КомплКоличество = КомплКоличествоИтого;
   	КонецЕсли;
 	ТабДок.Вывести(ОбластьИтого);
	
	
	//-------------------Цикл по Доп.Полям-------------------------------------	
	ОбластьСтрокаДоп = Макет.ПолучитьОбласть("СтрокаДоп");
    ОбластьСтрокаДоп.Параметры.ДопПоля = СокрЛП(СсылкаНаОбъект.ДопПоля);
	ТабДок.Вывести(ОбластьСтрокаДоп);

//-------------------печати и подписи---------------------------------------
	//ОбластьСтрока = Макет.ПолучитьОбласть("ПодвалШапка");
	//ТабДок.Вывести(ОбластьСтрока);

	Если СокрЛП(СсылкаНаОбъект.Контрагент.Код)="91735" тогда
		ОбластьСтрока = Макет.ПолучитьОбласть("ПодвалFREEMAN");
	ИначеЕсли СокрЛП(СсылкаНаОбъект.Контрагент.Код)="91535" тогда
		ОбластьСтрока = Макет.ПолучитьОбласть("ПодвалJIANGSU");
	ИначеЕсли СокрЛП(СсылкаНаОбъект.Контрагент.Код) = "92540" Тогда
		ОбластьСтрока = Макет.ПолучитьОбласть("ПодвалJIANGSU");
	ИначеЕсли СокрЛП(СсылкаНаОбъект.Контрагент.Код) = "93694" Тогда
		ОбластьСтрока = Макет.ПолучитьОбласть("ПодвалZHEANGZHOU");
	Иначе
		ОбластьСтрока = Макет.ПолучитьОбласть("Подвал1");
	КонецЕсли;	
	ТабДок.Вывести(ОбластьСтрока);

	возврат ТабДок;
	
КонецФункции	



Функция ВесУпаковки(типоразмер, ФиксВес=ложь)
	
	индексД = ?(типоразмер.Диаметр="",0, число(типоразмер.Диаметр)-13);  
	
	Если индексД>=0 тогда
		масса = новый Массив;
		масса.Добавить(0.75); масса.Добавить(0.81); масса.Добавить(0.96); //13,14,15
		масса.Добавить(1.04); масса.Добавить(1.24); масса.Добавить(1.40); масса.Добавить(1.58); //16,17,18,(19)
		масса.Добавить(1.75); масса.Добавить(1.85); масса.Добавить(1.95); //20,21,22 
		m = масса[индексД];
	Иначе // это болты или гайки
		m = 0;
	КонецЕсли;
	
	Если m>0 и ФиксВес тогда
		m=1; // 1 кг.
	КонецЕсли;	
	возврат Окр(m,3);
КонецФункции	


//+++ 16.03.2012 наш штрихКод
функция ПолучитьШтрихКодЯШТ(Код)

Если стрДлина(Код)<7 тогда
	код1 = Формат(число(Код), "ЧЦ=7; ЧВН=");
иначе 
	код1 = код;
КонецЕсли;	
	
ШтрихКод = "05000"+ Код;
ШтрихКод = ШтрихКод + КонтрольныйСимволEAN(ШтрихКод, 13);

возврат ШтрихКод;

КонецФункции


