Функция ПолучитьПуть(ОбработкаСсылка)

	ТекСсылка = ОбработкаСсылка;
	ПутьВозврата = "";
	
	Пока ТекСсылка.Родитель <> Справочники.ВнешниеОбработки.ПустаяСсылка() Цикл
	
		ПутьВозврата = Строка(ТекСсылка.Родитель) + "\" + ПутьВозврата;
		ТекСсылка = ТекСсылка.Родитель;
	
	КонецЦикла; 
	
	Возврат ПутьВозврата;

КонецФункции
 
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустойПароль", "");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВнешниеОбработки.Ссылка,
	|	ВнешниеОбработки.ПарольДляОткрытия
	|ИЗ
	|	Справочник.ВнешниеОбработки КАК ВнешниеОбработки
	|ГДЕ
	|	ВнешниеОбработки.ПарольДляОткрытия <> &ПустойПароль";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЭлементыФормы.ПолеПаролей.Очистить();
	
	Пока Выборка.Следующий() Цикл
	
		ЭлементыФормы.ПолеПаролей.ДобавитьСтроку(ПолучитьПуть(Выборка.Ссылка) + Строка(Выборка.Ссылка) + ", Установлен пароль: " + Выборка.ПарольДляОткрытия);
	
	КонецЦикла; 
	
	
КонецПроцедуры
