
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Для каждого СтрокаТЧ ИЗ СвойстваИЗначения Цикл
		
		НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей(); 
		
		НаборЗаписей.Отбор.Объект.Установить(СтрокаТЧ.Номенклатура); 
		НаборЗаписей.Отбор.Свойство.Установить(СтрокаТЧ.Свойство); 
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Объект	 = СтрокаТЧ.Номенклатура; 
		НоваяЗапись.Свойство = СтрокаТЧ.Свойство; 
		НоваяЗапись.Значение = СтрокаТЧ.Значение; 
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	СвойстваИЗначения.Очистить();
	
КонецПроцедуры

Процедура СвойстваИЗначенияПриАктивизацииСтроки(Элемент)
	
	Если НЕ ЭлементыФормы.СвойстваИЗначения.ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = ЭлементыФормы.СвойстваИЗначения.ТекущиеДанные;
		Если ТекущиеДанные.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка() Тогда
			ТекущиеДанные.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00135");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
