Процедура Отчет()

		
 Док = Печать();
 Док.Показать();
 Для каждого стр из СсылкаНаОбъект.Обратки Цикл
	Если ТипЗнч(стр.ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваров") и стр.ДокументОснование<>Документы.ЗаявкаНаВозвратТоваров.ПустаяСсылка() Тогда 
		Стр.ДокументОснование.ПолучитьОбъект().печать();
	конецЕсли;	
конецЦикла;

КонецПроцедуры
 


Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
	

	ПриОткрытии();
	
КонецПроцедуры

Процедура ПриОткрытии()
	// Вставить содержимое обработчика.
	
	Если ЗначениеНеЗаполнено(СсылкаНаОбъект) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если НЕ СсылкаНаОбъект = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка() Тогда
	
		Отчет();
	
	КонецЕсли; 
	
КонецПроцедуры
