&НаКлиенте
Перем МестныйКэш Экспорт;
// функции для совместимости кода 
&НаКлиенте
Функция сбисПолучитьФорму(ИмяФормы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Попытка
			ЭтотОбъект="";
		Исключение
		КонецПопытки;
		Возврат ПолучитьФорму("ВнешняяОбработка.СБИС.Форма."+ИмяФормы);
	КонецЕсли;
	Возврат ЭтотОбъект.ПолучитьФорму(ИмяФормы);
КонецФункции
&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы[ИмяЭлемента];
	КонецЕсли;
	Возврат Форма.ЭлементыФормы[ИмяЭлемента];
КонецФункции
&НаКлиенте
Функция сбисПолучитьСтраницу(Элемент, ИмяСтраницы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Элемент.ПодчиненныеЭлементы[ИмяСтраницы];
	КонецЕсли;
	Возврат Элемент.Страницы[ИмяСтраницы];
КонецФункции
//------------------------------------------------------

&НаКлиенте
Функция Показать(Кэш,оДокумент,СохранитьРезультат=Истина) Экспорт
// Функция открывает форму сопоставления одного документа и заполняет все данные на ней	
	МестныйКэш = Кэш;
	Сохранить = СохранитьРезультат;
	МассивТипов = Новый Массив;
	УстановитьОграничениеТипа(сбисЭлементФормы(ЭтаФорма,"Документ1С"), оДокумент.Типы1С);	
	Если оДокумент.Документ1С<> Неопределено Тогда
		Документ1С   = оДокумент.Документ1С;
	ИначеЕсли Кэш.СБИС.ини.Свойство(оДокумент.ТипСБИС) и Кэш.СБИС.ини[оДокумент.ТипСБИС].Количество()=1 Тогда
		Документ1С = Кэш.СБИС.ини[оДокумент.ТипСБИС][0].ПустаяСсылка;
	КонецЕсли;

	//ДокументСБИС = оДокумент;
 	ДокументНазвание = оДокумент.ДокументСБИСНазвание;
	Для Каждого Док из оДокумент.СписокПодходящихДокументов Цикл
		НоваяСтрока = ПодходящиеДокументы.Добавить();
		НоваяСтрока.Документ1С = Док.Значение;
	КонецЦикла;	
	
	Если оДокумент.СписокПодходящихДокументов.Количество()=1 И (Документ1С=Неопределено или Документ1С.Пустая()) Тогда
		Документ1С = оДокумент.СписокПодходящихДокументов[0].Значение;
	КонецЕсли;
	ЭтаФорма.ОткрытьМодально();
	Если СохранитьРезультат Тогда
		Если ОбновитьГлавноеОкно Тогда
			Возврат Истина;
		Иначе
			Возврат ложь;
		КонецЕсли;
	иначеЕсли Сохранить Тогда
		Возврат Документ1С;
	КонецЕсли;
	Возврат Ложь;
КонецФункции
//&НаКлиенте
//Процедура ПоискНажатие(Документ)
//	Если Документ<>Неопределено Тогда
//		СписокДокументов   = МестныйКэш.ОбщиеФункции.НайтиПодходящиеДокументы(МестныйКэш.Ини,МестныйКэш.Парам,Документ);
//		Для Каждого Док из СписокДокументов Цикл
//				НоваяСтрока = ПодходящиеДокументы.Добавить();
//				НоваяСтрока.Документ1С = Док;
//		КонецЦикла;	
//		
//		Если СписокДокументов.Количество()=1 И (Документ1С=Неопределено или Документ1С.Пустая()) Тогда
//			Документ1С = СписокДокументов[0];
//		КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры
&НаКлиенте
Процедура ПодходящиеДокументыВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
// Процедура сопоставляет выбранный документ 1С документу сбис	
	Документ1С = Элемент.ТекущиеДанные.Документ1С;
	СохранитьНажатие("");
КонецПроцедуры
&НаКлиенте
Процедура СохранитьНажатие(Элемент)
// Закрывает форму и возвращает выбранное сопоставление	
	// Закомментировано, т.к. теперь эта форма открывается только из окна сопоставления документов
	//Если Сохранить Тогда
	//	Если ЗначениеЗаполнено(Документ1С) Тогда
	//		МестныйКэш.ОбщиеФункции.ДобавитьСвойствоОбъекта("ДокументСБИС_Ид", ДокументСБИС[0].Значение.СоставПакета[0].Значение.Идентификатор,Документ1С);
	//		МестныйКэш.ОбщиеФункции.ДобавитьСвойствоОбъекта("ДокументСБИС_ИдВложения", ДокументСБИС[0].Значение.СоставПакета[0].Значение.Идентификатор,Документ1С);
	//		МестныйКэш.ОбщиеФункции.ДобавитьСвойствоОбъекта("ДокументСБИС_Статус", ДокументСБИС[0].Значение.СоставПакета[0].Значение.Состояние.Название,Документ1С);
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(ДокументСБИС[0].Значение.Документ1С) и ДокументСБИС[0].Значение.Документ1С<>Документ1С Тогда // если раньше было сопоставление с другим документом, удаляем его
	//		МестныйКэш.ОбщиеФункции.УдалитьСвойствоОбъекта("ДокументСБИС_Ид",ДокументСБИС[0].Значение.Документ1С);			
	//		МестныйКэш.ОбщиеФункции.УдалитьСвойствоОбъекта("ДокументСБИС_ИдВложения",ДокументСБИС[0].Значение.Документ1С);			
	//		МестныйКэш.ОбщиеФункции.УдалитьСвойствоОбъекта("ДокументСБИС_Статус",ДокументСБИС[0].Значение.Документ1С);			
	//	КонецЕсли;
	//	ДокументСБИС[0].Значение.Документ1С = Документ1С;	
	//	ОбновитьГлавноеОкно = Истина;
	//КонецЕсли;
	Сохранить = Истина;
	ЭтаФорма.Закрыть();
КонецПроцедуры
&НаКлиенте
Процедура КоманднаяПанельПодходящиеДокументыВыбрать(Кнопка)
// Процедура сопоставляет выбранный документ 1С документу сбис	
	Если сбисЭлементФормы(ЭтаФорма, "ПодходящиеДокументы").ТекущиеДанные<>Неопределено Тогда
		Документ1С = сбисЭлементФормы(ЭтаФорма, "ПодходящиеДокументы").ТекущиеДанные.Документ1С;
	КонецЕсли
КонецПроцедуры
&НаКлиенте
Процедура УстановитьОграничениеТипа(Элемент, Типы1С)
// Процедура устанавливает ограничения типов документов 1С, которые можно выбрать для сопоставления	
	МассивТипов = Новый Массив;
	Для Каждого Тип1С Из Типы1С Цикл
		МассивТипов.Добавить(Тип("ДокументСсылка."+Тип1С.Значение));
	КонецЦикла;
	Элемент.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
КонецПроцедуры
//////////////////////////////////////////////////////////////////////////////////

////////////////////// Обычное приложение/////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////
Процедура КоманднаяПанельПодходящиеДокументыПросмотр(Кнопка)
// Процедура открывает карточку документа 1С из списка подходящих документов	
	Если ЭлементыФормы.ПодходящиеДокументы.ТекущиеДанные<>Неопределено Тогда
		ЭлементыФормы.ПодходящиеДокументы.ТекущиеДанные.Документ1С.ПолучитьФорму().ОткрытьМодально();
	КонецЕсли
КонецПроцедуры

Процедура ПодходящиеДокументыПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
// Оформление таблицы подходящих документов	
	ОформлениеСтроки.Ячейки.Документ1С.Текст = МестныйКэш.ОбщиеФункции.СформироватьНазваниеВходящегоДокумента1С(ДанныеСтроки.Документ1С);
КонецПроцедуры


     