
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Для каждого стр из РаботаСКонтрагентами цикл
	Запись = Регистрысведений.РаботаССезоннымиЗаказами.СоздатьМенеджерЗаписи();
	Запись.ПериодПланирования = ПериодПланирования;
	Запись.Менеджер = Менеджер;
	Запись.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
	Запись.Бренд = стр.бренд;
	Запись.Контрагент = стр.Контрагент;
	Запись.СхемаРаботы = стр.СхемаРаботы;
	Запись.ПланПродаж = стр.ПланПродаж;
	Запись.КорректировкаПлана = стр.КорректировкаПлана;
	Запись.Причина = стр.Причина;
	Запись.УсловияРаботыВСезон = стр.условияРаботы;
	Запись.ДатаЗаказа =  стр.ДатаЗаказа;
	Запись.ДатаОтгрузки = стр.ДатаОтгрузки; 
	//Запись.Объем = стр.ПримерныйОбъем;
	Запись.Комментарий = стр.комментарий;
	Запись.Записать();	
	конецЦикла;	
КонецПроцедуры

Процедура ЗаполнитьНажатие(Элемент)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Справочник.Контрагенты) КАК Контрагент,
		|	ЗначенияСвойствОбъектов.Значение КАК Важность
		|ПОМЕСТИТЬ Важности
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &Важность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Бренды.бренд
		|ПОМЕСТИТЬ Бренды
		|ИЗ
		|	&Бренды КАК Бренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Справочник.Контрагенты) КАК Контрагент
		|ПОМЕСТИТЬ Контрагенты
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Значение = &Значение
		|	И ЗначенияСвойствОбъектов.Свойство = &Свойство
		|	И ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Справочник.Контрагенты).ОсновнойМенеджерКонтрагента = &Менеджер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РаботаССезоннымиЗаказами.Контрагент,
		|	РаботаССезоннымиЗаказами.СхемаРаботы,
		|	РаботаССезоннымиЗаказами.НоменклатурнаяГруппа,
		|	РаботаССезоннымиЗаказами.ФактСезонники,
		|	РаботаССезоннымиЗаказами.ФактТекучка,
		|	РаботаССезоннымиЗаказами.ПланПродаж,
		|	РаботаССезоннымиЗаказами.КорректировкаПлана,
		|	РаботаССезоннымиЗаказами.Причина,
		|	РаботаССезоннымиЗаказами.УсловияРаботыВСезон,
		|	РаботаССезоннымиЗаказами.ДатаЗаказа,
		|	РаботаССезоннымиЗаказами.ДатаОтгрузки,
		|	РаботаССезоннымиЗаказами.Объем,
		|	РаботаССезоннымиЗаказами.Комментарий
		|ПОМЕСТИТЬ Регистр
		|ИЗ
		|	РегистрСведений.РаботаССезоннымиЗаказами КАК РаботаССезоннымиЗаказами
		|ГДЕ
		|	РаботаССезоннымиЗаказами.Менеджер = &Менеджер
		|	И РаботаССезоннымиЗаказами.ПериодПланирования = &ПериодПланирования
		|	И РаботаССезоннымиЗаказами.НоменклатурнаяГруппа = &НоменклатурнаяГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Регистр.Контрагент, Контрагенты.Контрагент) КАК Контрагент,
		|	Регистр.СхемаРаботы,
		|	Регистр.ПланПродаж,
		|	Регистр.КорректировкаПлана,
		|	Регистр.ФактСезонники,
		|	Регистр.ФактТекучка,
		|	Регистр.Причина,
		|	Регистр.УсловияРаботыВСезон КАК УсловияРаботы,
		|	Регистр.ДатаЗаказа,
		|	Регистр.ДатаОтгрузки,
		|	Регистр.Объем КАК ПримерныйОбъем,
		|	Регистр.Комментарий,
		|	ЕСТЬNULL(Регистр.Контрагент.Регион, Контрагенты.Контрагент.Регион) КАК Регион,
		|	ЕСТЬNULL(Регистр.Контрагент.КатегорияПокупателя, Контрагенты.Контрагент.КатегорияПокупателя) КАК НаправлениеПродаж,
		|	Бренды.бренд КАК Бренд,
		|	ЕСТЬNULL(Регистр.НоменклатурнаяГруппа, &НоменклатурнаяГруппа) КАК НоменклатурнаяГруппа,
		|	Важности.Важность
		|ПОМЕСТИТЬ Шаблон
		|ИЗ
		|	Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Регистр КАК Регистр
		|		ПО Контрагенты.Контрагент = Регистр.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Важности КАК Важности
		|		ПО Контрагенты.Контрагент = Важности.Контрагент,
		|	Бренды КАК Бренды
		|ГДЕ
		|	Важности.Важность < 3
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &поГруппе
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Производители.ПустаяСсылка)
		|		ИНАЧЕ ПродажиОбороты.Номенклатура.Производитель
		|	КОНЕЦ КАК Производитель,
		|	ПродажиОбороты.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	СУММА(ПродажиОбороты.КоличествоОборот) КАК ФактИтого,
		|	ПродажиОбороты.ДоговорКонтрагента.Владелец КАК Контрагент,
		|	СУММА(ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0) - ЕСТЬNULL(ВложенныйЗапрос.КоличествоОборот, 0)) КАК ФактТекучка,
		|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.КоличествоОборот, 0)) КАК ФактСезонники
		|ПОМЕСТИТЬ Продажи
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&Нач,
		|			&Кон,
		|			,
		|			ДоговорКонтрагента.Владелец В
		|				(ВЫБРАТЬ
		|					Контрагенты.Контрагент
		|				ИЗ
		|					Контрагенты КАК Контрагенты)) КАК ПродажиОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗаказыПокупателейСезонныеОбороты.Номенклатура КАК Номенклатура,
		|			СУММА(ЗаказыПокупателейСезонныеОбороты.КоличествоРасход) КАК КоличествоОборот,
		|			ЗаказыПокупателейСезонныеОбороты.Контрагент КАК Контрагент
		|		ИЗ
		|			РегистрНакопления.ЗаказыПокупателейСезонные.Обороты(&Нач, &Кон, Регистратор, ) КАК ЗаказыПокупателейСезонныеОбороты
		|		ГДЕ
		|			ЗаказыПокупателейСезонныеОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЗаказыПокупателейСезонныеОбороты.Номенклатура,
		|			ЗаказыПокупателейСезонныеОбороты.Контрагент) КАК ВложенныйЗапрос
		|		ПО ПродажиОбороты.Номенклатура = ВложенныйЗапрос.Номенклатура
		|			И ПродажиОбороты.ДоговорКонтрагента.Владелец = ВложенныйЗапрос.Контрагент
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА &поГруппе
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Производители.ПустаяСсылка)
		|		ИНАЧЕ ПродажиОбороты.Номенклатура.Производитель
		|	КОНЕЦ,
		|	ПродажиОбороты.Номенклатура.НоменклатурнаяГруппа,
		|	ПродажиОбороты.ДоговорКонтрагента.Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Шаблон.Контрагент,
		|	Шаблон.СхемаРаботы,
		|	Шаблон.ПланПродаж,
		|	Шаблон.КорректировкаПлана,
		|	Шаблон.Причина,
		|	Шаблон.УсловияРаботы,
		|	Шаблон.ДатаЗаказа,
		|	Шаблон.ДатаОтгрузки,
		|	Шаблон.ПримерныйОбъем,
		|	Шаблон.Комментарий,
		|	Шаблон.Регион,
		|	Шаблон.НаправлениеПродаж,
		|	Шаблон.Бренд,
		|	Продажи.ФактИтого,
		|	Шаблон.Важность,
		|	Продажи.ФактТекучка,
		|	Продажи.ФактСезонники
		|ИЗ
		|	Шаблон КАК Шаблон
		|		ЛЕВОЕ СОЕДИНЕНИЕ Продажи КАК Продажи
		|		ПО Шаблон.Контрагент = Продажи.Контрагент
		|			И Шаблон.Бренд = Продажи.Производитель
		|			И Шаблон.НоменклатурнаяГруппа = Продажи.НоменклатурнаяГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	Шаблон.Контрагент.Наименование";

	Запрос.УстановитьПараметр("Значение", Перечисления.КатегорииКонтрагентов.Работающие);
	Запрос.УстановитьПараметр("НоменклатурнаяГруппа", НоменклатурнаяГруппа);
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	Запрос.УстановитьПараметр("ПериодПланирования", ПериодПланирования);
	Запрос.УстановитьПараметр("Свойство", планыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90218"));
	Запрос.УстановитьПараметр("Важность", планыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90184"));

    Запрос.УстановитьПараметр("поГруппе", ВцеломПоГруппе);
	Запрос.УстановитьПараметр("Нач",ДобавитьМесяц(ПериодПланирования.ДатаНачала,-12));
    Запрос.УстановитьПараметр("Кон", конецДня(ДобавитьМесяц(ПериодПланирования.ДатаКонца,-12)));

	
	
	Если ВцеломПоГруппе тогда
	Бренды.Очистить();
	ст = Бренды.Добавить();
	ст.бренд = Справочники.Производители.ПустаяСсылка();
   КонецЕсли;		
    Запрос.УстановитьПараметр("Бренды", Бренды);
	Результат = Запрос.Выполнить().Выгрузить();

	РаботаСКонтрагентами.Загрузить(Результат);
конецпроцедуры

Процедура РаботаСКонтрагентамиСхемаРаботыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Если Элемент.списокВыбора.Количество()>0 Тогда
	Элемент.списокВыбора.Очистить();
    конецЕсли;
    Элемент.СписокВыбора.Добавить("По сезонным заказам");
    Элемент.СписокВыбора.Добавить("В текущем режиме");
    Элемент.СписокВыбора.Добавить("По сезонным + текущий режим");

КонецПроцедуры

Процедура РаботаСКонтрагентамиПричинаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
		Если Элемент.списокВыбора.Количество()>0 Тогда
	Элемент.списокВыбора.Очистить();
    конецЕсли;
    Элемент.СписокВыбора.Добавить("Цена");
    Элемент.СписокВыбора.Добавить("Условия");
    Элемент.СписокВыбора.Добавить("Дебитор");

	
	
	
КонецПроцедуры


Процедура РаботаСКонтрагентамиУсловияРаботыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Если Элемент.списокВыбора.Количество()>0 Тогда
	Элемент.списокВыбора.Очистить();
конецЕсли;
     Элемент.СписокВыбора.Добавить("Отсрочка");
    Элемент.СписокВыбора.Добавить("% возврата");
    Элемент.СписокВыбора.Добавить("Перенос отсрочки");
    Элемент.СписокВыбора.Добавить("Обмен");
    Элемент.СписокВыбора.Добавить("Предоплата");
КонецПроцедуры
