
Процедура КнопкаВыполнитьНажатие(Кнопка)
   Ex = Новый COMObject("Excel.Application");
   Если ЗначениеЗаполнено(ПутьКФайлу) Тогда
	   Ex.Workbooks.Open(ПутьКФайлу);
   Иначе
       Ex.Workbooks.Open("");
   КонецЕсли;
   Ex.Visible = 0;    
   ТекЛист=Ex.WorkSheets(1);
   КолС=ТекЛист.UsedRange.SpecialCells(11).Row;
   
   КЧ = Новый КвалификаторыЧисла(12,2);
   КС = Новый КвалификаторыСтроки(20);
   КД = Новый КвалификаторыДаты();
   Массив = Новый Массив;
   Массив.Добавить(Тип("Дата"));
   ОписаниеТиповД = Новый ОписаниеТипов(Массив, , КД);
   Массив = Новый Массив;
   Массив.Добавить(Тип("Строка"));
   ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
   Массив.Очистить();
   Массив.Добавить(Тип("Число"));
   ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);

   ТЗ = Новый ТаблицаЗначений;
   ТЗ.Колонки.Добавить("Дата",ОписаниеТиповД);
   Тз.Колонки.Добавить("НомерСотрудника",ОписаниеТиповС);
   Тз.Колонки.Добавить("НомерАбонента",ОписаниеТиповС);
   Тз.Колонки.Добавить("ДлительностьЗвонка",ОписаниеТиповЧ);
   Тз.Колонки.Добавить("Исход_Вход",ОписаниеТиповС);
   
   Для Ячейка = 1 по КолС цикл
       Если Найти(ТекЛист.Cells(Ячейка,1).Value,"Детализация")>0 тогда
		    МенеджерТелефон = прав(ТекЛист.Cells(Ячейка,1).Value,12);
	   иначеЕсли ТипЗнч(ТекЛист.Cells(Ячейка,1).Value) = Тип("Дата") и ПроверитьНаличиеАнглийскихБукв(ТекЛист.Cells(Ячейка,6).Value) = ложь и СтрДлина(ТекЛист.Cells(Ячейка,6).Value) > 3  и (найти(ТекЛист.Cells(Ячейка,8).Value,"Секунда")>0 или найти(ТекЛист.Cells(Ячейка,8).Value,"Минута")>0) тогда
		    запись = Тз.Добавить();
			запись.Дата = Дата(ТекЛист.Cells(Ячейка,1).Value)+ТекЛист.Cells(Ячейка,4).Value*86400;
		    запись.НомерСотрудника = СтрЗаменить(Прав(МенеджерТелефон,10),"+7","8");
			запись.НомерАбонента = СтрЗаменить(Прав(СтрЗаменить(ТекЛист.Cells(Ячейка,6).Value,Символы.НПП,""),10),"+7","8");
			Если ТипЗнч(ТекЛист.Cells(Ячейка,7).Value) = Тип("Дата") Тогда
			Если Формат(ТекЛист.Cells(Ячейка,7).Value,"ДФ=yyyy") = Формат(ТекущаяДата(),"ДФ=yyyy") Тогда
				 Длит = Число(Формат(ТекЛист.Cells(Ячейка,7).Value,"ДФ=dd.MM"));
			Иначе
				 Длит = Число(Формат(ТекЛист.Cells(Ячейка,7).Value,"ДФ=MM.yy"));
			КонецЕсли;
		    Иначе
			     Длит = Число(ТекЛист.Cells(Ячейка,7).Value);
			КонецЕсли;
			запись.ДлительностьЗвонка = ?(найти(ТекЛист.Cells(Ячейка,8).Value,"Минута")>0,Число(Длит)*60,Число(Длит));
			запись.Исход_Вход = ?(Найти(ТекЛист.Cells(Ячейка,9).Value,"Исход")>0,"Исходящий","Входящий");
	   конецесли;
   конеццикла;
   Для каждого стр из ТЗ Цикл
		//Если ЗначениеЗаполнено(стр.Контрагент) Тогда
		    запись = РегистрыСведений.ЖурналЗвонков.СоздатьМенеджерЗаписи();
		    запись.Дата = стр.Дата;
		    запись.НомерСотрудника = СтрЗаменить(стр.НомерСотрудника,"%","");
		    запись.НомерАбонента = СтрЗаменить(стр.НомерАбонента,"%","");
		    запись.ДлительностьЗвонка = стр.ДлительностьЗвонка;
			запись.ПоискСотрудник = Прав(запись.НомерСотрудника,6);
			запись.ПоискАбонент = Прав(запись.НомерАбонента,6);
		    запись.Исход_Вход = стр.Исход_Вход;
		    запись.Записать();
		//КонецЕсли;
	КонецЦикла;
    Ex.Application.Quit();
КонецПроцедуры

Процедура ПутьКФайлуНачалоВыбора(Элемент, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие; 
    ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим); 
    ДиалогОткрытияФайла.ПолноеИмяФайла = ""; 
	//Фильтр = "Текст(*,txt)|*.txt"; 
	//ДиалогОткрытияФайла.Фильтр = Фильтр; 
    ДиалогОткрытияФайла.МножественныйВыбор = Ложь; 
    ДиалогОткрытияФайла.Заголовок = "Выберите файл"; 

    Если ДиалогОткрытияФайла.Выбрать() Тогда 
        ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла; 
    КонецЕсли;
КонецПроцедуры

функция ПроверитьНаличиеАнглийскихБукв(Строка) Экспорт
            ДлинаНаименования = СтрДлина(Строка);
			ц=0;
			пока Ц < ДлинаНаименования Цикл
				ц = ц+1;
				Если Найти("zxcvbnmasdfghjklqwertyuiopZXCVBNMLKJHGFDSAQWERTYUIOP",Сред(Строка,ц,1)) > 0 Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЦикла;
			Возврат Ложь;	
КонецФункции
