
Процедура ПриОткрытии()
	
	КартинкаЗаголовка= ЭДО_БиблиотекаКартинок().КартинкаЗаголовка;
	ЭтаФорма.Заголовок = "Укажите нужный документ";
	
КонецПроцедуры

Процедура ТаблицаДокументовДляВыбораПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
  
Процедура ТаблицаДокументовДляВыбораПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


Процедура КоманднаяПанель1ОткрытьДокумент(Кнопка)
	
	Если ЭлементыФормы.ТаблицаДокументовДляВыбора.ТекущиеДанные=Неопределено Тогда
		Предупреждение("Необходимо выделить документ в таблице",,КраткоеНаименованиеСистемы);
	Иначе
		ЭлементыФормы.ТаблицаДокументовДляВыбора.ТекущиеДанные.Документ.ПолучитьФорму().Открыть();
	КонецЕсли;
	
КонецПроцедуры

Процедура ТаблицаДокументовДляВыбораВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	ВернутьВыбранныйДокумент(ВыбраннаяСтрока.Документ);
КонецПроцедуры

Процедура КоманднаяПанель1ВыбратьДокумент(Кнопка)
	ВернутьВыбранныйДокумент(ЭлементыФормы.ТаблицаДокументовДляВыбора.ТекущаяСтрока.Документ);
КонецПроцедуры

Процедура ВернутьВыбранныйДокумент(СсылкаНаВыбранныйДокумент)
	ЭтаФорма.Закрыть(СсылкаНаВыбранныйДокумент);
КонецПроцедуры






