
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если не Согласованно  тогда
		отказ = истина;
		Сообщить("Перед проведением согласуйте с Егором Малышевым");
	конецесли;	
	
	Для каждого стр  Из товары Цикл
		если не ЗначениеЗаполнено(стр.Заготовка)  тогда
			сообщить("не заполнена заготовка в строке №"+стр.НомерСтроки);
			отказ = истина;
		конецесли;
	конецЦикла;
	Если не отказ тогда
		Движения.РезервЗаготовокПодЗаказы.Записывать = Истина;
		Движения.РезервЗаготовокПодЗаказы.Очистить();
		Для Каждого ТекСтрока Из товары Цикл
			Движение = Движения.РезервЗаготовокПодЗаказы.Добавить();
			Движение.Задание = ссылка;
			Движение.Диск = ТекСтрока.номенклатура;
			Движение.Заготовка = ТекСтрока.Заготовка;
			Движение.Количество = ТекСтрока.Количество;
		КонецЦикла;
	конецЕсли;
КонецПроцедуры
	Функция ПолучитьСписокПечатныхФорм() Экспорт
		
		СписокМакетов = Новый СписокЗначений;
		
		//СписокМакетов.Добавить("Заказ", "Заказ покупателя");
		//СписокМакетов.Добавить("ЗаказКорректировка", "Заказ покупателя (с учетом корректировок)");
		//СписокМакетов.Добавить("Счет", "Счет на оплату (с учетом корректировок)");
		//СписокМакетов.Добавить("СчетАртикул", "Счет на оплату (Артикул)");
		
		ДобавитьВСписокДополнительныеФормы(СписокМакетов, Метаданные());
		
		
		Возврат СписокМакетов;
		
	КонецФункции // ПолучитьСписокПечатныхФорм()
