
Процедура КнопкаВыполнитьНажатие(Кнопка)
	ТабДок =  Новый ТабличныйДокумент;
	
	ТабДок.ПолеСлева=0;
	ТабДок.ПолеСправа=0;
	ТабДок.ПолеСверху=0;
	ТабДок.ПолеСнизу=0;
	ТабДок.АвтоМасштаб = Истина;
	
	Макет = ПолучитьМакет("Макет");
	Если ПринтерЭтикеток Тогда
	Макет = ПолучитьМакет("МакетЭтикетка");
    КонецЕсли;	
	ОбластьСтрока=Макет.ПолучитьОбласть("Строка|Столбец");
	
	Если ЗначениеЗаполнено(НоменклатураСписок) Тогда
	если ТипЗнч(НоменклатураСписок)=Тип("СправочникСсылка.Номенклатура") тогда
			Номенклатура = НоменклатураСписок;
		Для сч=1 по КоличествоШтрихКодов Цикл
			ОбработкаПрерыванияПользователя();
			Наименование = Номенклатура.Наименование + Символы.ПС + "Арт: " + Номенклатура.Артикул;
			ШтрихКод1 = ПолучитьКодШтрихКода(Номенклатура);
			если ШтрихКод1 ="" тогда
				ШтрихКод=ПолучитьНовыйКодДляШтрихКодаЯШТ(Номенклатура.Код);
			иначе
				ШтрихКод= ШтрихКод1;
			КонецЕсли;	
			//ШтрихКод        = "1234567890128";
			//ОбластьСтрока.Параметры.ШК = ШтрихКод;
			ОбластьСтрока.Параметры.Наименование = СтрЗаменить(Наименование,"LegeArtis","TopDriver");
			
			ОбШтрихКод=ОбластьСтрока.Рисунки.ШК.Объект;
			ОбШтрихКод.ТипКода = 1; 
			ОбШтрихКод.Сообщение = ШтрихКод; 
			ОбШтрихКод.ОтображатьТекст = Истина;
			ОбШтрихКод.ТекстКода = ШтрихКод; 
			
			ОбШтрихКод=ОбластьСтрока.Рисунки.ШК1.Объект;
			ОбШтрихКод.ТипКода = 1; 
			ОбШтрихКод.Сообщение = ШтрихКод; 
			ОбШтрихКод.ОтображатьТекст = Истина;
			ОбШтрихКод.ТекстКода = ШтрихКод; 

			ОбШтрихКод=ОбластьСтрока.Рисунки.ШК2.Объект;
			ОбШтрихКод.ТипКода = 1; 
			ОбШтрихКод.Сообщение = ШтрихКод; 
			ОбШтрихКод.ОтображатьТекст = Истина;
			ОбШтрихКод.ТекстКода = ШтрихКод; 

			ОбШтрихКод=ОбластьСтрока.Рисунки.ШК3.Объект;
			ОбШтрихКод.ТипКода = 1; 
			ОбШтрихКод.Сообщение = ШтрихКод; 
			ОбШтрихКод.ОтображатьТекст = Истина;
			ОбШтрихКод.ТекстКода = ШтрихКод; 

			
			Если ПринтерЭтикеток Тогда
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();			
				ТабДок.Вывести(ОбластьСтрока);
			иначе	
			Если сч%2=1 Тогда
				Если Не ТабДок.ПроверитьВывод(ОбластьСтрока) Тогда
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();			
				КонецЕсли;
				ТабДок.Вывести(ОбластьСтрока);
			Иначе
				ТабДок.Присоединить(ОбластьСтрока);
			КонецЕсли;
			конецЕсли;
		КонецЦикла;
	Иначе //------------------------------------------ список
		для ii=0 по НоменклатураСписок.Количество()-1 цикл
			ОбработкаПрерыванияПользователя();
		    Номенклатура = НоменклатураСписок[ii].Значение;
			сч=ii+1;
				Наименование = Номенклатура.Наименование + Символы.ПС + "Арт: " + Номенклатура.Артикул;
			ШтрихКод1 = ПолучитьКодШтрихКода(Номенклатура);
			если ШтрихКод1 ="" тогда
				ШтрихКод=ПолучитьНовыйКодДляШтрихКодаЯШТ(Номенклатура.Код);
			иначе
				ШтрихКод= ШтрихКод1;
			КонецЕсли;	
			//ШтрихКод        = "1234567890128";
			//ОбластьСтрока.Параметры.ШК = ШтрихКод;
			ОбластьСтрока.Параметры.Наименование = СтрЗаменить(Наименование,"LegeArtis","TopDriver");
			
			ОбШтрихКод=ОбластьСтрока.Рисунки.ШК.Объект;
			ОбШтрихКод.ТипКода = 1; 
			ОбШтрихКод.Сообщение = ШтрихКод; 
			ОбШтрихКод.ОтображатьТекст = Истина;
			ОбШтрихКод.ТекстКода = ШтрихКод; 
			
			ОбШтрихКод=ОбластьСтрока.Рисунки.ШК1.Объект;
			ОбШтрихКод.ТипКода = 1; 
			ОбШтрихКод.Сообщение = ШтрихКод; 
			ОбШтрихКод.ОтображатьТекст = Истина;
			ОбШтрихКод.ТекстКода = ШтрихКод; 

			ОбШтрихКод=ОбластьСтрока.Рисунки.ШК2.Объект;
			ОбШтрихКод.ТипКода = 1; 
			ОбШтрихКод.Сообщение = ШтрихКод; 
			ОбШтрихКод.ОтображатьТекст = Истина;
			ОбШтрихКод.ТекстКода = ШтрихКод; 

			ОбШтрихКод=ОбластьСтрока.Рисунки.ШК3.Объект;
			ОбШтрихКод.ТипКода = 1; 
			ОбШтрихКод.Сообщение = ШтрихКод; 
			ОбШтрихКод.ОтображатьТекст = Истина;
			ОбШтрихКод.ТекстКода = ШтрихКод; 
			
			Если ПринтерЭтикеток Тогда
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();			
				ТабДок.Вывести(ОбластьСтрока);
			иначе	
			Если сч%2=1 Тогда
				Если Не ТабДок.ПроверитьВывод(ОбластьСтрока) Тогда
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();			
				КонецЕсли;
				ТабДок.Вывести(ОбластьСтрока);
			Иначе
				ТабДок.Присоединить(ОбластьСтрока);
			КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	ТабДок.ТолькоПросмотр = Истина;	
	ТабДок.Показать(); 
	
	КонецЕсли;	
	
	
КонецПроцедуры

//+++13.05.2015
функция ПолучитьКодШтрихКода( Номенклатура ) 
	
 запрос = новый Запрос;
 запрос.Текст = "ВЫБРАТЬ
                |	ШК.Код,
                |	ШК.ТипШтрихкода,
                |	ШК.Штрихкод,
                |	ШК.Владелец
	            |ИЗ
                |	РегистрСведений.Штрихкоды КАК ШК
                |ГДЕ
                |	ШК.Владелец = &Номенклатура";
 запрос.Параметры.Вставить("Номенклатура", Номенклатура);
 рез = запрос.Выполнить().Выбрать();
 
 если рез.Следующий() тогда
	 ШК = строка(рез.Штрихкод);
 иначе 
	 ШК = ""; //ПолучитьНовыйКодДляШтрихКодаЯШТ(КодТов);
 КонецЕсли;
 
 возврат ШК;
	 
конецФункции

функция ПолучитьНовыйКодДляШтрихКодаЯШТ(Код)

Если стрДлина(Код)<7 тогда
	попытка	
	код1 = Формат(число(Код), "ЧЦ=7; ЧВН=; ЧГ=0");
	исключение
		код1 = "55"+Формат(число(прав(Код,5)), "ЧЦ=5; ЧВН=; ЧГ=0");
 		сообщить("Код: "+Код+" - содержит буквы, поэтому штрихКод будет сформирован по коду: "+код1+"!");
	КонецПопытки;
иначе 
	попытка	
	код1 = Формат(число(Код), "ЧЦ=7; ЧВН=; ЧГ=0");
	исключение
		код1 = "55"+Формат(число(прав(Код,5)), "ЧЦ=5; ЧВН=; ЧГ=0");
 		сообщить("Код: "+Код+" - содержит буквы, поэтому штрихКод будет сформирован по коду: "+код1+"!");
	КонецПопытки;
КонецЕсли;	
	
ШтрихКод = "05000"+ Код1;
ШтрихКод = ШтрихКод + КонтрольныйСимволEAN(ШтрихКод, 13);

возврат ШтрихКод;

КонецФункции

Процедура ПолеВвода1ПриИзменении(Элемент)
	Если ПолеВвода1.Пустая() тогда
	НоменклатураСписок = неопределено;
	возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Ссылка В ИЕРАРХИИ(&Родитель)
	               |	И НЕ Номенклатура.ЭтоГруппа
	               |	И НЕ Номенклатура.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Родитель", ПолеВвода1);
	
	Результат = Запрос.Выполнить();
	табл = Результат.Выгрузить();
	Если табл.Количество()>2048 тогда
	Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("В группе: "+строка(ПолеВвода1)+" содержится "+строка(табл.Количество())+" товаров!
		|Слишком большое количество для распечатки!
		|Вы действительно хотите напечатать все штрих-коды?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		КонецЕсли;
	КонецЕсли;
	
	НоменклатураСписок = новый СписокЗначений;
	НоменклатураСписок.ЗагрузитьЗначения( табл.ВыгрузитьКолонку("ссылка") );
	Предупреждение("Выбрано "+строка(НоменклатураСписок.Количество())+" товаров",10);
	
КонецПроцедуры

Процедура НоменклатураСписокПриИзменении(Элемент)
	Если НоменклатураСписок = неопределено тогда
		ЭлементыФормы.ПолеВвода1.Доступность = Истина;
		ЭлементыФормы.КоличествоШтрихКодов.Доступность = истина;
	ИначеЕсли ТипЗнч(НоменклатураСписок) = 	тип("СправочникСсылка.Номенклатура") тогда
		ЭлементыФормы.ПолеВвода1.Доступность = ложь;
		ЭлементыФормы.КоличествоШтрихКодов.Доступность = истина;
	Иначе	
		ЭлементыФормы.ПолеВвода1.Доступность = истина;
		ЭлементыФормы.КоличествоШтрихКодов.Доступность = ложь;
		КоличествоШтрихКодов = 1;
	КонецЕсли;	
КонецПроцедуры

Процедура ПриОткрытии()
	НоменклатураСписок = Справочники.Номенклатура.ПустаяСсылка();
КонецПроцедуры
