
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	СписокПолей.Очистить(); //обратно в список!
	для каждого стр1 из ТабличноеПоле1 цикл
		СписокПолей.Добавить(стр1.Значение, стр1.Представление, стр1.Пометка);
	КонецЦикла;	

	Закрыть("ОК");
	
	
КонецПроцедуры

Процедура ПриОткрытии()
	ЗаполнитьТабл();
КонецПроцедуры

процедура ЗаполнитьТабл()
	ТабличноеПоле1.Очистить();
	для i=0 по СписокПолей.Количество()-1 цикл
		стр1 = ТабличноеПоле1.Добавить();
		ЗаполнитьЗначенияСвойств(стр1, СписокПолей[i]);
	КонецЦикла;	
КонецПроцедуры

Процедура ВыводитьДанныеПоКоличествуПриИзменении(Элемент)
	для каждого стр1 из ТабличноеПоле1 цикл
		
		Если Найти(стр1["Значение"], "Количество")>0 тогда
			стр1.пометка  = ВыводитьДанныеПоКоличеству;
		ИначеЕсли Найти(стр1["Значение"], "Стоимость")>0 тогда
			стр1.пометка  = ВыводитьДанныеПоСуммам;
		КонецЕсли;
		
		Если Найти(стр1["Значение"], "ПроцентВыполнения")>0 тогда
			стр1.пометка  = ВыводитьПроцентВыполнения;	
		ИначеЕсли Найти(стр1["Значение"], "Отстование")>0 тогда
			стр1.пометка  = ВыводитьПроцентОтставания;	
		КонецЕсли;
		
	КонецЦикла;	
КонецПроцедуры


Процедура ТабличноеПоле1ПередНачаломДобавления(Элемент, Отказ, Копирование)
	Предупреждение("Список полей - фиксированный. Новых полей добавлять нельзя!",30);
	Отказ = Истина;
КонецПроцедуры

