Перем СписокАктивныхКонтрагентов; 

Функция УправлениеФормой() Экспорт
	
	ЭлементыФормы.НадписьИНН.Заголовок=	"ИНН организации " + ИНН;
	Заголовок=	"Выбор организации для сопоставления в "+ОбработкаОбъект.НаименованиеСистемы;
	
КонецФункции

Процедура СправочникСписокПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущаяСтрока <> Неопределено Тогда
		Если Элемент.ОформлениеСтроки(Элемент.ТекущаяСтрока).ЦветТекста = WEBЦвета.СветлоСерый
			ИЛИ Элемент.ТекущаяСтрока.ЭтоГруппа Тогда
			ЭлементыФормы.ДействияФормы.Кнопки.Выбрать.Доступность = Ложь;
		Иначе
			ЭлементыФормы.ДействияФормы.Кнопки.Выбрать.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДействияФормыВыбрать(Кнопка)
	
	ТекДанные = ЭлементыФормы.СправочникСписок.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Предупреждение("Выберите организацию",,);
		Возврат;
	КонецЕсли;
	
	Если НЕ СокрЛП(ТекДанные.ИНН) = ИНН Тогда
		Предупреждение("ИНН выбранной организации не верный, необходимо выбрать организацию с ИНН " + ИНН,, );
		Возврат;
	КонецЕсли;
	
	Закрыть(ЭлементыФормы.СправочникСписок.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

Процедура СправочникСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	ТекДанные = ЭлементыФормы.СправочникСписок.ТекущиеДанные;

	СтандартнаяОбработка = Ложь;
	
	ДействияФормыВыбрать("");
	
КонецПроцедуры

Процедура ПриОткрытии()
	КартинкаЗаголовка= ОбработкаОбъект.ЭДО_БиблиотекаКартинок().КартинкаЗаголовка;
	УправлениеФормой();
КонецПроцедуры

Процедура СправочникСписокПриПолученииДанных(Элемент, ОформленияСтрок)
	
	Для каждого ОформлениеСтроки Из ОформленияСтрок Цикл
		Если НЕ ПустаяСтрока(ИНН) И НЕ СокрЛП(ИНН) = СокрЛП(ОформлениеСтроки.ДанныеСтроки.Ссылка.ИНН)
			ИЛИ НЕ ПустаяСтрока(КПП) И НЕ СокрЛП(КПП) = СокрЛП(ОформлениеСтроки.ДанныеСтроки.Ссылка.КПП) Тогда
			ОформлениеСтроки.ЦветТекста=	WebЦвета.Серый;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
