
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Если НомерКолонкиКодНоменклатуры <= 0 и НомерКолонкиНаименованиеНоменклатуры <= 0 Тогда
		Предупреждение("Необходимо заполнить номер колонки кода или наименования номенклатуры");
		Возврат;
	КонецЕсли;
	
	Если НомерКолонкиКоличестваНоменклатуры <= 0 Тогда
		Предупреждение("Необходимо заполнить номер колонки количество номенклатуры");
		Возврат;
	КонецЕсли;
	
	Если СокрЛП(ВыбрратьФайлExcel) = "" Тогда
		Предупреждение("Выберите файл!!!");
		Возврат;
	КонецЕсли;
	
	xlLastCell = 11;
	НомерЛистаExcel = 1;
	Если ФормаДокумента <> неопределено Тогда
		Расшифровка = ФормаДокумента.Расшифровка;
	Иначе
		Расшифровка = Новый ТаблицаЗначений;
		Расшифровка.Колонки.Добавить("Номенклатура");
		Расшифровка.Колонки.Добавить("Количество");
	КонецЕсли;
	
	Если ОчищатьТабличнуюЧасть Тогда
		Расшифровка.Очистить();
	КонецЕсли;
	
	ВыбФайл = Новый Файл(ВыбрратьФайлExcel);
	Если НЕ ВыбФайл.Существует() Тогда
		Сообщить("Файл не существует!");
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ВыбрратьФайлExcel);
		Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист = Excel.Sheets(НомерЛистаExcel);
	Исключение
		Сообщить("Ошибка. Возможно неверно указан номер листа книги Excel.");
	КонецПопытки;
	
	ActiveCell = Excel.ActiveCell.SpecialCells(xlLastCell);
	RowCount = ActiveCell.Row;
	ColumnCount = ActiveCell.Column;
	
	Для Row = 1 По RowCount Цикл
		Если ПропускатьПервуюСтроку Тогда
			Если Row = 1 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = Расшифровка.Добавить();
		Если НомерКолонкиКодНоменклатуры > 0 Тогда
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоКоду(СокрЛП(ExcelЛист.Cells(Row,НомерКолонкиКодНоменклатуры).Text));
		Иначе
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(ExcelЛист.Cells(Row,НомерКолонкиКодНоменклатуры).Text);
		КонецЕсли;
		
		НоваяСтрока.Количество = ExcelЛист.Cells(Row,НомерКолонкиКоличестваНоменклатуры).Text;
	КонецЦикла;
	
	Excel.WorkBooks.Close();
	Excel = 0;
	
КонецПроцедуры

Процедура ВыбрратьФайлExcelНачалоВыбора(Элемент, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок = "Прочитать табличный документ из файла";
	ДиалогВыбораФайла.Фильтр    = "Лист Excel (*.xls)|*.xls|Лист Excel 2007 (*.xlsx)|*.xlsx";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ВыбрратьФайлExcel = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

Процедура ПриОткрытии()
	ОчищатьТабличнуюЧасть = Истина;
	ПропускатьПервуюСтроку = Истина;
КонецПроцедуры
